{
  "venueId": "ChIJA0hhoqF7_ogRy1ajXpuzuIE",
  "venueName": "The Palmetto Lobby Bar",
  "venueArea": "Downtown Charleston",
  "website": "https://www.palmettohotelcharleston.com/bar",
  "scrapedAt": "2026-01-19T15:41:55.435Z",
  "trimmedAt": "2026-01-19T15:42:45.343Z",
  "pages": [
    {
      "url": "https://www.palmettohotelcharleston.com/offers",
      "text": "[Page Title: Offerings]\n\nReserve\n\noffers\n\nLocals Only\n\nHey Neighbors! Are you in need of a relaxing escape without going too far from home? Look no further. Whether you’re a proud South Carolinian, a peach loving Georgian, or a NC Tar Heel at heart, we invite you to come for a visit. Our prime location in the heart of downtown makes it effortless- just steps away from the city’s best shopping, dining and entertainment. Our locals offer includes:\n\n‍\n\nUp to 15% off the best available rates\n\n‍\n\nWe hope to see you soon.Blackout dates apply. Proof of residency required upon check in.\n\nReserve now\n\nHoly City Haunts\n\nCharleston is beloved for its enchanting charms, yet some legends suggest these charms extend beyond what is visible.\n\n‍\n\nThis experience is crafted for our guests who want to delve a bit deeper into the allure and mystery surrounding the Holy City’s storied past. Included are two tickets to Charleston’s famous Ghost City Tours, a copy of the book, , and an exclusive custom map highlighting some of the city’s hallowed supernatural hot spots.\nHaunted Charleston \nReserve now\n\nFind Your Bliss\n\nTreat yourself or someone special to a soothing wellness escape! This offer includes accommodations in our upgraded Superior King guestroom, a one hour in-room massage, one of our cozy embroidered robes to keep, and our custom signature scent candle. Everything you need to pamper yourself or a loved one!\n\n‍\nExclusions/restrictions on availability may apply. Offer only valid with Superior King Room Type. Please be sure to select Superior King Room Type when booking this offer. \n‍\n\n‍\n\nReserve now\n\nRomantic Rendezvous\n\nReconnect this spring during a romantic getaway with us. Relax and unwind as you wander down the enchanting cobblestone alleyways and admire the inviting doorways and colorful window boxes that surround you, all while enjoying the notable features of our Romantic Rendezvous offer:\n\n‍\n\nBottle of bubbly and assorted French chocolates upon arrival\n\nComplimentary late check out\n\n$100 gift certificate to High Cotton (advance reservations suggested)\n\nReserve your stay today to create lasting memories in one of the most romantic cities in the country.\n\nReserve now\n\nIn Good Company: Fall into Savings with our Group Discounts\n\nWhether it’s a social gathering or corporate retreat, take advantage of our contracted group room blocks.  For larger groups, consider reserving all 45 of our exquisitely designed guest rooms for an exclusive home away from home experience. Our Penthouse Suite is perfect for events hosting up to 25 guests.  If you prefer traditional meeting spaces, we’ve got you covered! We partner with some of our esteemed neighbors for your group to meet and gather in style.\n\nReserve now\n\nAAA Exclusive\n\nAAA members enjoy a special discount up to 15% when staying with us. Book your next stay with us for a truly unforgettable Charleston experience and daily continental breakfast in our lobby is always included! Proof of membership required upon check in.\n\nReserve now\n\nAARP Exclusive\n\nAs an AARP member, you will enjoy a special discount up to 15% when staying with us. Now is the time to plan your next getaway to Charleston. Book with us today. Proof of membership required upon check in.\n\nReserve now\n\nSip and Savor Charleston: Culinary Tour & Complimentary Cocktails\n\nImmerse yourself in the creative, culinary charms of Charleston with two (2) tickets for a culinary tour showcasing some of downtown’s most notable local cuisine and two (2) complimentary signature cocktails at the Lobby Bar, a perfect way to savor the flavors of the Lowcountry.\n\n‍\nNot valid with other offers. Exclusions could apply. \nReserve now\n\nMilestone Celebration in The Penthouse\nCelebrate under The Stars \n‍\n\nLooking for the perfect way to commemorate those once in a lifetime moments? Let us help! Our Milestone Celebration Package is the ideal opportunity to celebrate engagements, anniversaries, baby moons, or other special occasions you share. The package includes a minimum one-night stay in The Penthouse, an intimate 3-course dinner for two on the private balcony prepared and serviced by the renowned team at Hall’s, a dozen roses, and a bottle of bubbly.\n\n‍\n\nOur Concierge Team can support with additional enhancements such as including a photographer or music. Contact us today to start curating your once in a lifetime event at The Palmetto by emailing or calling 843-823-3604.\ninfo@palmettohotelcharleston.com \nReserve now\n\nPamper Your Pooch\n\nAt The Palmetto, we believe in pampering both our guests and their beloved pets.  With our Pamper Your Pooch Pet Package, your four-legged friend will feel right at home.   With every purchase, we will also make a $20 donation to the Charleston Animal Society—a winning combination to help all dogs in Charleston rest a little easier.\n\n‍\n\nPackage includes:\n\nGourmet “Barkuterie “Board—a treasure trove of delectable snacks and healthy goodies specially prepared for your pup by the culinary team at Hall’s.\n\nPet bowls and mat\n\nCozy bed\n\nPlush dog toy\n\n$20 donation to Charleston Animal Society\n\n$150 Pet Fee (Dogs up to 40 lb. Max 2 dogs per room)\n\nReserve now\n+1 (843) 823-3604 Neighborhood Accommodations Gatherings Bar Gallery Offers Contact FAQs Press BLOG Accessibility Privacy Email signup \nThe Palmetto © 2024. All Rights Reserved\nReserve \nCookie Consent\n\nWe use cookies and similar technologies to enhance site navigation, analyze usage, assist our marketing efforts and allow you to share our content on your social networks. By continuing to use this website, you agree to these conditions of use. For more information about these technologies and their use on this site, please consult our .\nPrivacy Policy \nNo Thanks\n\nOK",
      "hash": "6dffcfee0893",
      "downloadedAt": "2026-01-19T15:30:08.714Z",
      "trimmedAt": "2026-01-19T15:42:45.338Z",
      "sizeReduction": "86.3%"
    },
    {
      "url": "https://www.palmettohotelcharleston.com/bar",
      "text": "[Page Title: Charleston Bar in the Lobby of The Palmetto Hotel]\n\nReserve\n\nLobby Bar\n\nThe lobby bar offers a truly, one-of-a kind Charleston experience. The tastefully designed atmosphere is a feast for the eyes with elegant finishings and custom design features which complement the timeless charm and aesthetic that The Palmetto brings to the Charleston experience. The custom craft cocktail menu is a highlight, featuring unique and delicious libations thoughtfully made with fresh ingredients.\n\nYou can also enjoy offerings from our Southern-inspired menu which provides a modern take on classics and regional favorites featuring locally sourced and seasonal menu items whenever possible. The knowledgeable and lively team is always on hand to offer recommendations, answer questions and ensure each guest has an unforgettable experience. Whether you are in the mood for a quick bite, a leisurely afternoon of cocktails and snacks, or a nightcap after a day of adventure, the lobby bar is the perfect spot to unwind and make memories.\n\nhours\n\nmonday – THURSDAY : 4pm-11PM\n\nFRIDAY – saturday: 12Pm-12am\n\nSunday: 12pm-11pm\n+1 (843) 823-3604 Neighborhood Accommodations Gatherings Bar Gallery Offers Contact FAQs Press BLOG Accessibility Privacy Email signup \nThe Palmetto © 2024. All Rights Reserved\nReserve \nCookie Consent\n\nWe use cookies and similar technologies to enhance site navigation, analyze usage, assist our marketing efforts and allow you to share our content on your social networks. By continuing to use this website, you agree to these conditions of use. For more information about these technologies and their use on this site, please consult our .\nPrivacy Policy \nNo Thanks\n\nOK",
      "hash": "c339c28e4763",
      "downloadedAt": "2026-01-19T15:30:08.652Z",
      "trimmedAt": "2026-01-19T15:42:45.343Z",
      "sizeReduction": "93.5%"
    }
  ],
  "sizeReduction": "89.1%"
}