{
  "venueId": "ChIJ14gaAaZz_ogRy0nQKfs-bZs",
  "venueName": "The Windjammer",
  "venueArea": "Isle of Palms",
  "website": "http://www.the-windjammer.com/",
  "scrapedAt": "2026-01-19T15:41:54.114Z",
  "trimmedAt": "2026-01-19T15:42:22.864Z",
  "pages": [
    {
      "url": "http://www.the-windjammer.com/",
      "text": "[Page Title: The Windjammer]\n\nSkip to content \nUpcoming Events\n\nAll 6PM Shows are 21Up Unless with their Parent...All shows 9PM and later are 21UP!\n23 January ENTRYWAY of SC Party and Awards with High Society on the inside stage \nFriday, 9:00 pm\n31 January Dos Gringos + Keith Hille and The Brickyard Saints sponsored by Winglore Spirits Co. to benefit the veteran nonprofit, Operation Encore: A Veteran Music Project \nSaturday, 7:00 pm\n07 February Nirvani - A Nirvana Tribute Experience W/Sick Man - tribute to Alice in Chains \nSaturday, 9:00 pm\n13 February Baby Fat on the inside stage \nFriday, 9:00 pm\n21 February THE YACHT CLUB on the inside stage \nSaturday, 9:00 pm\n28 February The Piedmont Boys - on the inside stage \nSaturday, 8:00 pm\n01 March Billy & the Goats on the inside \nSunday, 11:30 am\n28 March Stop Light Observations on the NÜTRL Beach Stage \nSaturday, 6:00 pm\n29 March Braxton Keith - on the NÜTRL Beach Stage \nSunday, 6:00 pm\nALL EVENTS \nNeed A Place To Stay?\n\nAbout The Windjammer\n\nAlways a Jam Good Time!\n\nLocated at Front Beach on the Isle of Palms, The Windjammer is Charleston's premier live music beach venue for over the last 50 years. From local bands to big name artists, guests can enjoy the best in live music. The Windjammer also offers delicious beach eats with menu items including buffalo chicken wings, cheeseburgers, fish & chips, and more. Relax and sip on a cold beer or refreshing cocktail while taking in the unbeatable beach views. The Windjammer where, it's always a JAM good time!\n\nOur Menu\nAPPETIZERS SANDWICHES AND BURGERS FROM THE OCEAN SIDE ORDERS BEVERAGES \nOur Store\n\nNow you can shop T-shirts. Sweat Shirts, \nHoodies, Hats, and lot of other things...\nSHOP NOW \nDownload Our \nMobile App For \nAndroid and IOS.\n\nDon't miss updates from us!\n\nSubscribe to our newsletter & stay updated!",
      "hash": "a243a4882e26",
      "downloadedAt": "2026-01-19T15:30:31.471Z",
      "trimmedAt": "2026-01-19T15:42:22.864Z",
      "sizeReduction": "98.2%"
    }
  ],
  "sizeReduction": "98.2%"
}