{
  "venueId": "ChIJzUn6Qi17_ogRX1VX24enKTE",
  "venueName": "Wild Common",
  "venueArea": "Mount Pleasant",
  "website": "https://www.wildcommoncharleston.com/",
  "scrapedAt": "2026-01-19T15:42:07.072Z",
  "trimmedAt": "2026-01-19T15:50:53.556Z",
  "pages": [
    {
      "url": "https://www.wildcommoncharleston.com/",
      "text": "[Page Title: Wild Common | Charleston Food | Fine DiningVimeo]\n\nBook your Wild Common reservation on Resy Vimeo Skip to content \nThis website uses cookies. If that's okay with you, keep on browsing, or learn more about our .\nPrivacy Policy Close Cookie Disclosure Notice Pause Background Video \nAnything but common, Wild Common is Charleston’s wildly unique and unforgettable dining experience.\n\nSet within one of Charleston’s most inspiring settings, Wild Common invites guests to experience a refined multi-course tasting menu by Executive Chef Orlando Pagán, a James Beard Award Semi-Finalist whose culinary artistry has earned the restaurant its first Michelin Star.\n\nFor diners seeking exceptional food and spirits, Wild Common celebrates  “all that is right, all that is good”, a nod to D.H. Lawrence’s poem of the same name. Come taste the uncommon.\n\na dining experience for the discerning epicurean\n\nDining Room, Interactive Chef’s Counter, and The Overlook Private Dining\n\nWild Common is ideal for intimate dining and memorable celebrations. The Overlook is an opportunity to savor elevated fare, interact with the chef and be wowed by a curated multi-course culinary experience. Dining in the restaurant, you’ll find a similar exceptional multi- course tasting menu and engaging conviviality. Around the table or at the interactive Chef’s Counter, Executive Chef Orlando Pagán and team deliver Charleston’s premier dining adventure.\nBook your Wild Common reservation on Resy \nAnything but common fare, wildly welcoming hospitality\n\nYou’ve got a lot on your plate day-to-day, that’s why our plates come to you full of extraordinary flavors, without you having to do anything but show up. No deciding, no stress, just sit back and be wildly indulged by unparalleled food and personal service. Add wine pairings with both our culinary experiences to take your uncommon meal to an unreal level.\nView Menu Sample \nGift Cards\n\nGive the gift of culinary excellence! If you haven’t experienced our wildly intimate dinners, we encourage you to join us this season.\nPurchase a gift card Opens in a new window. \nPrivate Dining\n\nTreat yourself and up to 12 guests to a private dining experience on our Mezzanine overlooking the courtyard and main dining room.\nLearn more Opens in a new window. \nChef's Counter\n\nThe Chef’s Counter is your front row seat into the Wild Common culinary journey. Join us for an interactive and upfront seat to all the action.\nBook Your Reservation Opens in a new window. \n2024 Series\n\nCharleston Artist Collective Partnership\n\nTo complement our kitchen’s innovative spirit, Wild Common’s dining room and ambiance have always been art-infused. In partnership with Charleston Artist Collective, we are proud to feature local Lowcountry artists on our menus and we’re thrilled to launch the latest series. Allow us to introduce you to these talented artists below and be sure to book your reservation to experience their incredible work in person.\nMeet the Artists Opens in a new window. \nCondé Nast Traveler\n\n40 Best Restaurants in Charleston\n\nWild Common has been named one of Charleston’s 40 Best Restaurants by Condé Nast Traveler. Experience our chef driven tasting journey, from local seafood to luxurious touches like caviar, black truffle and foie gras, all prepared in our open kitchen for a truly unforgettable culinary adventure.\nRead the article Opens in a new window. \nMichelin Guide\n\nWild Common has earned One MICHELIN Star\n\nChef Orlando Pagán’s tasting menu is far from common, and while upgrades like caviar eggs Benedict and wagyu are indeed available, there’s nothing standard here.\nRead the article Opens in a new window. \nEater Carolinas\n\n7 Top Tasting Menu Restaurants in Charleston\n\nSpring Street’s Wild Common is a tasting menu restaurant for people who don’t normally like tasting menus. It’s not stuffy or pretentious, but rather a chill atmosphere full of light installations, art, and vegetation.\nRead the article Opens in a new window. Follow us on Instagram. @wildcommonchs - Link opens in a new tab \nLet's get social.\nBook Reservation",
      "hash": "0c9d879610b7",
      "downloadedAt": "2026-01-19T15:33:14.428Z",
      "trimmedAt": "2026-01-19T15:50:53.426Z",
      "sizeReduction": "99.5%"
    },
    {
      "url": "https://www.wildcommoncharleston.com/private-events/",
      "text": "[Page Title: Wild Common | Charleston Food | Private EventsVimeo]\n\nBook your Wild Common reservation on Resy Vimeo Skip to content \nThis website uses cookies. If that's okay with you, keep on browsing, or learn more about our .\nPrivacy Policy Close Cookie Disclosure Notice \nPrivate Events\n\nWild Common and Cannon Green have gained a reputation as the premier destination for hosting the most unique events in downtown Charleston.\n\nArtisan Catering included with every event\n\nWild Common offers private dining for small groups and individuals in a space intimately tucked within the broader environs of Cannon Green, one of Charleston’s most celebrated and versatile event venues. To us, hospitality means welcoming and accommodating a variety of needs and desires–that’s why we’ve got options for groups of all sizes. And not just options. Wildly feasible solutions and dreamy scenarios.\nInquire Now First name (Required) Last name (Required) Email (Required) Phone (Required) I would like information regarding (Required) Wild Common Full Buyout Chef's Table (up to 12 guests) Private Event in Garden Room Approximately how many guests are you expecting at the event? (Required) What type of event are you hosting? (Required) Social Special Occasion Corporate Charitable Please provide any additional details about your event such as type of celebration, event format, or special requests. What is your preferred date? (Required) DD slash MM slash YYYY Is your date flexible? (Required) Yes No What is the best time of day for our restaurant manager to contact you? (Required) Have you visited the property before? (Required) Yes, I've dined at Wild Common Yes, I've attended an event at Cannon Green No Thanks you so much for inquiring about Wild Common. Is there anything else you'd like to share or specific questions you have for our team? Wild Common Newsletter Yes, I would like to sign up for for occasional updates about special events + restaurant news Submit",
      "hash": "4c7a09044c97",
      "downloadedAt": "2026-01-19T15:33:15.786Z",
      "trimmedAt": "2026-01-19T15:50:53.473Z",
      "sizeReduction": "99.8%"
    },
    {
      "url": "https://www.wildcommoncharleston.com/menus/",
      "text": "[Page Title: Wild Common Menu | Charleston FoodVimeo]\n\nBook your Wild Common reservation on Resy Vimeo Skip to content \nThis website uses cookies. If that's okay with you, keep on browsing, or learn more about our .\nPrivacy Policy Close Cookie Disclosure Notice \nMenu\nTasting Menu No. 715 Sample Menu \nIn an effort to honor Chef Orlando Pagán’s vision, Wild Common strives to make as few changes to the menu as possible and is unable to accommodate certain dietary restrictions (gluten, vegan, dairy, soy, fin fish allergies).\n\nSteamboat Creek Oyster\n\nChicken Wing\n\nPho\n\nDogpatch Farm Harvest\n\nCarrot Caramelle, Pine Nuts, Vadouvan\n\nOptional - \"Eggs Benedict\"\n\nRegiis Ova Osetra Caviar, English Muffin, Hollandaise\n\nSeared Hokkaido Scallop\n\nChanterelle Mushroom, Seafood Tartlet, Lobster Nage\n\nCharleston Gold Rice Sourdough\n\nNutritional Yeast Butter\n\nDry-Aged New York Strip\n\nPomme Puree, Bok Choi, Bourbon-Truffle Jus\n\nOptional - Margaret River Gold Medal Australian Wagyu\n\nDark Chocolate Torte\n\nHoney, Peanut, Black Truffle Ice Cream\n\nTasting Menu $95\n\nWe permit a maximum of two bottles per table, with each bottle limited to 750ml. Magnums are considered equivalent to two bottles. Our corkage fee is $45 per bottle. We kindly request that the selected bottle is not currently listed on our wine list.",
      "hash": "77fb560a7c64",
      "downloadedAt": "2026-01-19T15:33:15.223Z",
      "trimmedAt": "2026-01-19T15:50:53.518Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "https://www.wildcommoncharleston.com/charleston-restaurant-tasting-menu/",
      "text": "[Page Title: Tasting Menu - Wild CommonVimeo]\n\nBook your Wild Common reservation on Resy Vimeo Skip to content \nThis website uses cookies. If that's okay with you, keep on browsing, or learn more about our .\nPrivacy Policy Close Cookie Disclosure Notice \nRestaurant\n\nThe Experience\n\nEach reservation offers an innovative, chef-driven tasting menu with unique and uncommon flavors and presentations. While the menu changes regularly to reflect seasonality and the freshest ingredients, Wild Common pulls inspiration from cuisines across the globe and features dishes with regionally sourced ingredients. Savor our wildly exciting multi-course Tasting Menu. Wine pairings are available, as is wine by the bottle and a full cocktail menu.\n\nParties of 6-12 can join us at Wild Common’s private dining experience,  .\nThe Overlook Book Your Table Opens in a new window. View the Sample Menu Opens in a new window.",
      "hash": "95129f7a6131",
      "downloadedAt": "2026-01-19T15:33:14.664Z",
      "trimmedAt": "2026-01-19T15:50:53.556Z",
      "sizeReduction": "99.9%"
    }
  ],
  "sizeReduction": "99.8%"
}