{
  "venueId": "ChIJ9Wqm-bB7_ogRuK4W8j95Jjs",
  "venueName": "Hutson Alley",
  "venueArea": "Downtown Charleston",
  "website": "http://www.holycityhospitality.com/",
  "scrapedAt": "2026-01-19T15:41:55.325Z",
  "trimmedAt": "2026-01-19T15:42:44.007Z",
  "pages": [
    {
      "url": "http://www.holycityhospitality.com/virginias-on-king/#private-events",
      "text": "[Page Title: Virginia's On King - Holy City Hospitality]\n\nMake a Reservation View Menus Join Our Loyalty Program \nCharleston Southern Hospitality\n\nVirginia’s on King is a sophisticated Southern restaurant blending traditional kitchen comforts with familiar regional dishes. Prepared with the utmost care for quality and flavor, the menu incorporates local ingredients and family recipes to bring you Southern cooking Lowcountry style. Classic Charleston style and homecooked aromas inspire the ambiance of this local favorite. At the heart of Virginia’s, you will find gracious Southern hospitality and comfort foods that make you feel right at home.\n\nContact us at 843-725-5959 ext 1 or through the link below\n\nFollow Us\n\nPrivate Events\n\nThe Upstairs at Virginia’s dining room is completely separated from the downstairs dining room. Purposely designed to host small receptions, corporate events, rehearsal dinners and bridal luncheons, Upstairs at Virginia’s is your ideal local for your special occasion!\n\nClassic Charleston influenced interior and the aromas of home cooking inspire all of the comforts of a traditional Southern kitchen, the perfect setting for hosting any of your events. At the heart of Virginia’s you will find gracious southern hospitality along with all of the flavors of the Lowcountry.\nDownload Info Packet Inquire Now \nGive the gift of delicious cuisine.\nPurchase Gift Cards \nContact Us\n\nHours of Operation:\nBrunch Served Daily! 8am-3pm Supper Served Thursday through Sunday 3pm-8pm Join us Thursdays for Fried Chicken Night! \n412 King Street Charleston, SC 29403\n\nPhone: (843) 735-5800\nEmail Us \nSee our news, reviews, and happenings.\nPress & Reviews View the Blog",
      "hash": "06cfcfc1c391",
      "downloadedAt": "2026-01-19T15:29:23.565Z",
      "trimmedAt": "2026-01-19T15:42:43.928Z",
      "sizeReduction": "96.7%"
    },
    {
      "url": "https://www.holycityhospitality.com/coast-bar-and-grill/",
      "text": "[Page Title: Coast Bar And Grill - Holy City Hospitality]\n\nMake a Reservation View Menus Join Our Loyalty Program \nCharleston’s Freshest Seafood\n\nLocated in a historic warehouse, Coast Bar and Grill features 40-foot ceilings, rustic tin roofs and art from around the world, creating an atmosphere reminiscent of an eclectic beach bar.\n\nOur chefs are dedicated to procuring the freshest seafood from the Charleston shores and around the Lowcountry. Served nightly, our menu offers seafood classics along with the chefs’ nightly unique creations. At the heart of Coast Bar and Grill is the hickory and oak custom wood-burning grill, a feature you will only find at Coast.\n\nGuests’ favorites include our daily selection of oysters and wood-grilled fish paired with our freshly made in-house sauces; there’s an option for everyone’s palate. Here at Coast Bar and Grill, we are dedicated to making every effort to create an unique experience with only the highest quality of ingredients.\n\nFollow Us\n\nPrivate Events\n\nCoast is available for daytime events such as conferences or luncheons and semi-private evening gatherings.\n\nThe patio at Coast seats 25 comfortably, ideal for semi-private celebrations.\nThe dining room is an ideal space for meetings and luncheons.\nPrivate evening gatherings of varying sizes can be hosted Upstairs at 39 Rue de Jean.\n\nAll event spaces provide menus designed to your specific needs. Let our professionals tailor your special event and make the most of it.\nInquire Now \nGive the gift of delicious cuisine.\nPurchase Gift Cards \nContact Us\n\nOPEN FOR PICKUP, INDOOR AND OUTDOOR DINING\n\n39-D John Street Charleston, SC 29403\n\nOperating Hours:\nDinner\nMon-Thu, Sun 4:30 pm-9:30 pm\nFri, Sat 4:30 pm-10:00 pm\n\nPhone: (843) 722-8838\nEmail Us \nSee our news, reviews, and happenings.\nPress & Reviews View the Blog",
      "hash": "1f5b0494ca86",
      "downloadedAt": "2026-01-19T15:29:21.243Z",
      "trimmedAt": "2026-01-19T15:42:43.936Z",
      "sizeReduction": "96.5%"
    },
    {
      "url": "http://www.holycityhospitality.com/",
      "text": "[Page Title: Home - Holy City Hospitality]\n\nInventive Cooking, Gracious Service, Lowcountry Sensibility\n\nHoly City Hospitality brings inventive combinations of the freshest seasonal ingredients together with accommodating, thoughtful service to inspire memorable experiences.\nJoin our Loyalty Program 1 # # # # \nPrivate Events\n\nWith unique locations throughout Charleston, Holy City Hospitality has a venue for any occasion, no matter the size or style. We specialize in memorable dining experiences, restaurant quality catering, corporate events & meetings, weddings, engagement parties & rehearsal dinners, private dining and more!\nView Venues \nGive the gift of delicious cuisine.\nPurchase Gift Cards \nCatering Experts\n\nWhether planning an elegant wedding reception or casual office party, Good Food Catering has the perfect food and beverage options to enhance your event experience and make it the best it can truly be.\nLearn More",
      "hash": "348fb787180a",
      "downloadedAt": "2026-01-19T15:29:20.618Z",
      "trimmedAt": "2026-01-19T15:42:43.947Z",
      "sizeReduction": "98.2%"
    },
    {
      "url": "http://www.holycityhospitality.com/39-rue-de-jean/#private-events",
      "text": "[Page Title: 39 Rue de Jean - Holy City Hospitality]\n\nMake a Reservation View Menus Join Our Loyalty Program \nOffering the Best Brasserie Cuisine in Charleston\n\n39 Rue de Jean is a refined French Cafe and Bar reminiscent of a late 1800’s Brasserie. Our menu features Parisian-inspired classics, custom cocktails, and a tailored selection of wines. You will feel as though you are in a traditional French Brasserie when you dine at Rue de Jean, with a neighborhood feel that will transport you to Paris! 39 Rue de Jean offers robust selections, with hearty classics and lighter fare, as well as elegant craft cocktails, an extensive wine and beer list, and jubilant socializing.\n\nContact us at 843-725-5959 ext 1 or through the link below\n\nFollow Us\n\nPrivate Events\n\nThe Upstairs at Rue event space offers a private dining room that can be transformed to host professional gatherings or celebratory affairs, accommodating up to 200 guests. This unique space, overlooking Upper King street, features vaulted ceilings, exposed brick and a private entrance.\nDownload Info Packet Inquire Now \nGive the gift of delicious cuisine.\nPurchase Gift Cards \nContact Us\n\nOPEN FOR PICKUP, INDOOR AND OUTDOOR DINING\n\n39 John Street Charleston, SC 29403\nOperating Hours:\n\nDinner\nMonday-Thursday 4:00 pm-10:00pm\n\nFriday & Saturday 4:00pm-11:00pm\n\nSunday 4:00pm-9:00pm\n\nBrunch & Lunch\nMonday-Sunday 11:30 am-3:00 pm\n\nPhone:\n(843) 722-8881 Email Us \nSee our news, reviews, and happenings.\nPress & Reviews View the Blog",
      "hash": "51cbca31fbab",
      "downloadedAt": "2026-01-19T15:29:22.385Z",
      "trimmedAt": "2026-01-19T15:42:43.962Z",
      "sizeReduction": "97.1%"
    },
    {
      "url": "http://www.holycityhospitality.com/vincent-chiccos/#private-events",
      "text": "[Page Title: Vincent Chiccos - Holy City Hospitality]\n\nMake a Reservation View Menus Join Our Loyalty Program \nClassic Italian with a Modern Touch\n\nVincent Chicco’s, like its namesake, history and tradition is what shapes this modern take on classic Italian-American fare. Tucked along Hutson Alley, Chicco’s is a serene hideaway offering refined Italian cuisine with fresh ingredients, handmade pastas and house made sauces.\n\nDuring the prohibition era, Vinent Chicco who emigrated to Charleston from Italy, ran a number of saloons and led the fight locally against prohibition. Chicco’s arrest was the first after a dispensary law was passed by Governor Tillman. Chicco’s arrest became infamous as many Charlestonians opposed this law. Today, Vincent Chicco’s is proud to serve elevated old-world classic Italian cuisine beholden to one of Charleston’s heroes from a lost time.\n\nContact us at 843-725-5959 ext 1 or through the link below\n\nFollow Us\n\nPrivate Events\n\nVincent Chicco’s private dining room can be transformed to host up to 100 guests for a professional gathering or celebratory affair. This unique space above our Italian restaurant in the heart of upper King Street in downtown Charleston features vaulted ceilings, exposed brick and sophisticated elegance.\nDownload Info Packet Inquire Now \nGive the gift of delicious cuisine.\nPurchase Gift Cards \nContact Us\n\nHutson Alley, 39-G John Street Charleston, SC 29403\n\nOperating Hours:\n\nClosed Monday\nTues-Sun 4:30 pm-9:30 pm\nFri-Sat 4:30 pm-10:00 pm\n\nPhone: (843) 203-3002\nEmail Us \nSee our news, reviews, and happenings.\nPress & Reviews View the Blog",
      "hash": "527770424e7c",
      "downloadedAt": "2026-01-19T15:29:22.975Z",
      "trimmedAt": "2026-01-19T15:42:43.970Z",
      "sizeReduction": "96.9%"
    },
    {
      "url": "https://www.holycityhospitality.com/charlestons-smallest-bar/",
      "text": "[Page Title: Charleston’s Smallest Bar - Holy City Hospitality]\n\nView Menu Join Our Loyalty Program \nCharleston’s Smallest Bar\n\nCharleston’s Smallest Bar is nestled between 39 Rue de Jean and Coast Bar & Grill on beautiful Hutson Alley. With only 4 barstools inside, but plenty of additional seating outside on the alley, it’s the perfect spot to grab a drink before dinner or before a show next door at Charleston Music Hall. Small bites are available from Coast, including fried shrimp, crab dip, and oysters on the 1/2 shell.\n\nThe bar features a variety of canned cocktails, beer and wine. There are 2 frozen drinks available: BCheerwine Slushie and our very own creation, Hutson Alley Hooch.\nourbon \nFollow Us\n\nFind Us\n\nHours of Operation:\n\nMonday-Sunday: 4:oopm-8:oopm\n\nPhone: 843.722.8838\nEmail Us \nGive a gift!\nPurchase Gift Cards",
      "hash": "68f1e57090cd",
      "downloadedAt": "2026-01-19T15:29:21.792Z",
      "trimmedAt": "2026-01-19T15:42:43.975Z",
      "sizeReduction": "98.4%"
    },
    {
      "url": "http://www.holycityhospitality.com/coast-bar-and-grill/",
      "text": "[Page Title: Coast Bar And Grill - Holy City Hospitality]\n\nMake a Reservation View Menus Join Our Loyalty Program \nCharleston’s Freshest Seafood\n\nLocated in a historic warehouse, Coast Bar and Grill features 40-foot ceilings, rustic tin roofs and art from around the world, creating an atmosphere reminiscent of an eclectic beach bar.\n\nOur chefs are dedicated to procuring the freshest seafood from the Charleston shores and around the Lowcountry. Served nightly, our menu offers seafood classics along with the chefs’ nightly unique creations. At the heart of Coast Bar and Grill is the hickory and oak custom wood-burning grill, a feature you will only find at Coast.\n\nGuests’ favorites include our daily selection of oysters and wood-grilled fish paired with our freshly made in-house sauces; there’s an option for everyone’s palate. Here at Coast Bar and Grill, we are dedicated to making every effort to create an unique experience with only the highest quality of ingredients.\n\nFollow Us\n\nPrivate Events\n\nCoast is available for daytime events such as conferences or luncheons and semi-private evening gatherings.\n\nThe patio at Coast seats 25 comfortably, ideal for semi-private celebrations.\nThe dining room is an ideal space for meetings and luncheons.\nPrivate evening gatherings of varying sizes can be hosted Upstairs at 39 Rue de Jean.\n\nAll event spaces provide menus designed to your specific needs. Let our professionals tailor your special event and make the most of it.\nInquire Now \nGive the gift of delicious cuisine.\nPurchase Gift Cards \nContact Us\n\nOPEN FOR PICKUP, INDOOR AND OUTDOOR DINING\n\n39-D John Street Charleston, SC 29403\n\nOperating Hours:\nDinner\nMon-Thu, Sun 4:30 pm-9:30 pm\nFri, Sat 4:30 pm-10:00 pm\n\nPhone: (843) 722-8838\nEmail Us \nSee our news, reviews, and happenings.\nPress & Reviews View the Blog",
      "hash": "6ae1911f9a73",
      "downloadedAt": "2026-01-19T15:29:25.495Z",
      "trimmedAt": "2026-01-19T15:42:43.981Z",
      "sizeReduction": "96.5%"
    },
    {
      "url": "http://www.holycityhospitality.com/michaels-on-the-alley/private-events",
      "text": "[Page Title: Upstairs at Victor's - Private Events - Holy City Hospitality]\n\nUpstairs at Victor's\n\nContact us at 843-725-5959 ext 1 or through the link below\nView Information Packet Inquire Now \nInquiry Form\n\nVictor’s would be honored to help you host your perfect event with us. Please fill out the attached contact form and one of our associates will respond to your request within 48 business hours. Thank you for your consideration, and we look forward to working to execute your special event.\nPrivate Event Software powered by Tripleseat \nSee our news, reviews, and happenings.\nReviews & Press Read the Blog",
      "hash": "952a810760c6",
      "downloadedAt": "2026-01-19T15:29:24.666Z",
      "trimmedAt": "2026-01-19T15:42:43.985Z",
      "sizeReduction": "98.7%"
    },
    {
      "url": "https://www.holycityhospitality.com/events/",
      "text": "[Page Title: Events - Holy City Hospitality]\n\nEvents\n\n39 Rue de Jean Celebrates 25 Years of French-Inspired Dining in Charleston\n\nA year-long celebration featuring wine dinners, guest nostalgia, special events, and the return of daily lunch service\n39 Rue de Jean, the beloved French brasserie that helped define Charleston’s culinary identity, is celebrating 25 years in 2026 — and inviting the community to join in a year-long fête filled with flavor, nostalgia, and joie de vivre. Since opening its doors in 2001, 39 Rue de Jean has become a cornerstone of Charleston dining culture. From its classic French fare to its lively bar scene and timeless brasserie charm, “Rue” has welcomed generations of locals, visitors, families, and industry friends. Now, in honor of a remarkable 25 years, the restaurant is rolling out a full calendar of celebrations designed to toast the past — and raise a glass to the next chapter. \nThroughout 2026, guests can expect:\n✨ Monthly Wine Dinners – Each month will feature a themed wine dinner spotlighting French regions, Rue de Jean favorites, and guest chef collaborations. Reservations will be limited for an intimate, elevated experience. 📸 “Rue Memories” Social Media Campaign – Guests are invited to share their favorite photos, stories, and memories from visits over the last 25 years. Submissions will be featured on Rue’s social channels — with giveaways and the chance to be highlighted in a commemorative end-of-year project. 🥂 A Bubbles Bell – Installed in the dining room, the Bubbles Bell will be rung at surprise moments throughout the year. When it rings, the entire restaurant will celebrate with a complimentary glass of bubbles — including non-alcoholic options — as a toast to 25 years of Rue de Jean and 25 more to come. 🎉 Fête de la Rue — April 2026 – This ticketed patio celebration will take over the restaurant’s patio and surrounding spaces for an afternoon of French street-festival magic: food and wine stations, live entertainment, specialty cocktails, and celebratory surprises. Mark your calendars for April 25th, tickets will go on sale in early March. 🍽 The Return of Lunch – In honor of the anniversary, lunch service returns seven days a week beginning January 12th , complete with a refreshed menu featuring guest-requested throwback dishes, modern French plates, and new seasonal offerings. Charleston is invited to celebrate the past, savor the present, and toast to the future — one glass of bubbles at a time. Merci, Charleston! \nHolidays on Hutson\nDecember 4th - 22nd \nStarting December 4th, Hutson Alley transforms into Charleston’s must-see holiday destination! Step into a winter wonderland in the heart of downtown and enjoy festive experiences for all ages.\n\n✨ at 5pm & 7pm☕ from Charleston’s Smallest Bar🛍️ every Thursday–Saturday from 5pm–8pm🔥 available from Charleston’s Smallest Bar🎅 on December 16, 18, and 20 from 5pm–7pm📸 for picture-perfect memories🍸 available at all HCH restaurants👧🧒 all December at Vincent Chicco’s and Victor’s Seafood & Steak\nDaily Snowfall Complimentary Hot Chocolate Holiday Market Vendors S’mores Kits Santa & Mrs. Claus Appearances Multiple Holiday Photo Ops Seasonal Cocktails Kids Eat Free \nCome celebrate the magic of the season in the coziest corner of Charleston.\n\nTaste of Hutson Alley\nWednesday, November 19th Your favorite event from Charleston’s Best Hospitality Group is back — and this year, it’s bigger, brighter, and more meaningful than ever. Join Holy City Hospitality on Wednesday, November 19th, for an unforgettable evening under the lanterns and string lights of beautiful Hutson Alley. Guests will enter through the John Street gate and be welcomed with a seasonal signature cocktail featuring Angels Envy from Charleston’s Smallest Bar, setting the tone for an evening of local flavor and festive cheer. Throughout the alley, enjoy chef-attended tasting stations from all six Holy City Hospitality restaurants, along with decadent desserts from Good Food Catering. Sip and savor your way through the night with a Don Gato Tequila signature drink, bourbon tastings to inspire your holiday entertaining, craft beer from Southern Crown, fine wines, and live music by Ronnie Johnson. This year’s event is also about giving back. A portion of all ticket sales will benefit the Lowcountry Food Bank, and guests are encouraged to bring non-perishable food donations to help support local families in need this holiday season. Celebrate community, cuisine, and the spirit of Charleston — all in one magical night. Tickets are limited, so early purchase is encouraged to reserve your spot. Purchase tickets here Get Tickets Here \nHutson Alley Halloween\nOctober 30th, 5:30pm-8:30pm Coast Bar & Grill to Host An Evening of Oysters, Cocktails, Carving & Costumes! \nSpooky season is here, and Hutson Alley is transforming into the ultimate Halloween destination! Join us  for an evening of festive fun, delicious bites, and spirited sips at .\nThursday, October 30th, from 5:30 PM to 8:30 PM Hutson Alley Halloween \nYour ticket includes:\nAll-you-can-eat oyster roast \nfor a seasonal draft beer or spooky-inspired\nThree drink tickets Bacardi cocktails \nA\npumpkin prepped and ready for carving \nAll carving supplies will be provided, so bring your creativity! We will have prizes for great designs!.\n\nwill also be open, serving additional drinks and food for purchase.  will be on-site offering their stunning ! Whether you’re looking to treat yourself to a chic bracelet, anklet, or necklace, they’ll be there to customize the perfect piece just for you. The ultimate spooky-season accessory!\nCharleston’s Smallest Bar Holy City Links permanent jewelry \nKids are welcome and get  with the purchase of an adult ticket, making this the perfect family-friendly Halloween celebration. Don’t forget to wear your best costume — we’ll be hosting a  with prizes for the standout looks of the night!\nfree admission costume contest \nWhether you’re here for the oysters, the cocktails, the pumpkins, or the party, promises an unforgettable evening filled with fall flavors, festive fun, and plenty of spooky surprises.\nHutson Alley Halloween For questions, please reach out to [email protected] Get Tickets Here \nOak & Smoke\nOctober 16th, 6pm-10pm Victor’s Seafood & Steak Presents Oak & Smoke: An Evening of Bourbon, Cigars, and Culinary Indulgence on Hutson Alley Charleston, SC — August 27, 2025 — Victor’s Seafood & Steak is teaming up with The Dropping Pin and Smokin’ Rose Speakeasy to bring Charleston an unforgettable evening of refined flavors, premium, hand-rolled cigars, and live entertainment. Oak & Smoke will take place at Victor’s Seafood & Steak on October 16th from 6pm-10pm, and promises an unforgettable blend of flavor, craftsmanship, and camaraderie. Guests will experience the warm glow of soft lighting, the aroma of premium cigars, and the refined notes of small-batch bourbons, all complemented by chef-driven coastal cuisine. Guiding the culinary experience is Executive Chef Dean Szablewski , who will present an array of elevated bites throughout the evening, including a fresh oyster on the half shell station , an abundant grazing table , and an assortment of passed appetizers designed to complement the evening’s bourbon and cigar pairings. Victor’s Seafood & Steak’s full dinner menu will also be available for purchase. Live entertainment will set the tone with the smooth, sultry sounds of saxophonist Cosmo followed by the vibrant beats of Deejay Sam-Well , creating the perfect soundtrack for an evening of sophistication and connection. Ticket options will be available in three tiers, for those who love the social aspect to those who want a more all inclusive experience. Early bird pricing for all 3 tiers is available now through September 10th. For questions, please reach out to [email protected] Get Tickets Here \nHutson Alley Derby Affair\nMay 3rd, 4:30pm-7:30pm Hutson Alley Hosts Derby Party with Mint Juleps, Hors d’Oeuvres & Racing Fun Charleston, SC – Get ready to don your finest hats and bow ties as Hutson Alley transforms into the ultimate Derby Day celebration! On Saturday, May 3rd, from 4:30 to 7:30 PM , guests are invited to experience an unforgettable Kentucky Derby Party featuring live race action, festive cocktails highlighting local spirits from Firefly Distillery, and Southern-inspired bites from Coast Bar & Grill . This exclusive $30 ticketed event includes: One welcome Mint Julep featuring Live Straight Bourbon Whiskey from Firefly Distillery to kick off the festivities, heavy passed “Horse” d’Oeuvres crafted by Coast Bar & Grill, One Raffle Ticket for a chance to win exciting prizes, plus Best Hat, Best Dressed Duo & Best Bow Tie Contests Guests can sip on mint juleps and other Derby-inspired cocktails while enjoying the live race broadcast on the Coast patio . Whether you’re a seasoned racing fan or just here for the fashion and fun, this event is your perfect way to celebrate the “Run for the Roses” in true Southern style. Coast Bar and Grill and Charleston’s Smallest Bar will be open for additional food and drink purchases. Tickets are limited— don’t miss your chance to join Charleston’s most stylish Derby celebration! For questions, please reach out to [email protected] Get Tickets Here \nHutson Alley's Big Fat Tuesday\nMarch 4th, 5:30pm-8:30pm Get ready to let the good times roll! Coast Bar & Grill is bringing the vibrant energy of New Orleans to Hutson Alley in downtown Charleston with an unforgettable Big Fat Tuesday Crawfish Boil & Mardi Gras Party on Tuesday, March 4th . Join us as we celebrate Mardi Gras in true Louisiana style with a traditional crawfish boil, festive cocktails, and laissez les bon temps rouler. Whether you’re a seasoned crawfish connoisseur or just looking for a taste of authentic Cajun flavors, this is one party you won’t want to miss. Tickets include our AYCE crawfish boil and 3 drink tickets. Bacardi will be on-site with Mardi Gras inspired cocktails and souvenir swag to keep the good times rolling! Doors open at 5:30, and the party lasts until 8:30. Charleston’s Smallest Bar and Coast Bar & Grill will be open for additional food and beverage purchases. For questions, please reach out to [email protected] Get Tickets Here \nTaste of Hutson Alley\nYour favorite event from Charleston’s Best Hospitality Group is BACK! Mark your calendars for Wednesday, November 20th! Guests will be greeted at the John St. entrance to Hutson Alley with a seasonal welcome beverage from Charleston’s Smallest Bar.  The evening’s celebration will take place among the lanterns and under the lights of our beautiful alleyway with chef-attended stations from all six Holy City Hospitality restaurants and dessert samplings from Good Food Catering. Attendees are welcome to enjoy a specialty cocktail offering, craft beer, wines from Republic National Distributing Company (RNDC), and live music from Ronnie Johnson. Tickets are limited, so early purchase is encouraged to reserve your spot. Get Tickets Here \nGFC New Venue\n\nThis new property has been experiencing a minor identity crisis, prompting us to host a naming party last week. We appreciate everyone who came out and for your valuable input. We are so excited about this new location, for the future, and for the endless possibilities this venue holds!\n\nStay tuned as we unveil the chosen name and provide further details. Your continued support and interest are highly appreciated.\nLearn More \nBouquets & Rosé\nJune 10th, 3-5pm \nSpring is in the air and we are planning how to celebrate our favorite holiday–National Rosé Day on Saturday June 10th! Come join us at Victor’s Seafood & Steak for Bouquets & Rosé! This event promises to be an unforgettable experience, offering the perfect combination of delectable wine and beautiful customizable floral arrangements.\n\nBouquets & Rosé is the perfect opportunity to savor a variety of rosés and learn the art of bouquet making from the experts at Boone’s Blooms. With their expert guidance, you’ll create a stunning bouquet of flowers to take home and enjoy long after the event is over.\n\nTickets include small bites, rosé flights and your bouquet to take home and enjoy! On sale at — $80 for early purchase and $90 for regular sale.\n\nWhether you’re a rosé lover or just looking for a fun and unique afternoon, this event is the perfect opportunity. The beautiful ambiance of Hutson Alley and Victor’s, along with the floral expertise of our friends with Boone’s Blooms makes this an event not to miss this spring!\nBuy Tickets \nPup Party on the Alley\nMay 7th, 12-3pm \nCharleston’s Smallest Bar and Pet Helpers have teamed up throw “Pup Party on the Alley”. Join us for a pawsome event centered around dog adoption and a pet supplies drive! This event is designed to bring together animal lovers and enthusiasts to help local dogs in need.\n\nThis event will be held on Sunday May 7th from 12-3pm outside of Charleston’s Smallest bar on Hutson Alley (39 John St.). All are welcome, especially your fur babies!\n\nWe will have specials on food and drinks available–for you and your pup. We will also be handing out prizes for the best boys and girls for things like, “best trick” and “best puppy dog eyes”\n\nDon’t miss out on this chance to make a difference in the lives of dogs in need. Mark your calendar and come out to support this wonderful cause!\nEventbrite link \nCharleston's Smallest Bar Cornhole Tournament\nMarch 15th, 2023 \nCornament?? Courney?? You can call it whatever you want because we’re hosting our 1st ever Cornhole Tournament at Charleston’s Smallest Bar! Bring your friends and get ready to show off your skills! Join us Wednesday March 15th at 6pm at the Small Bar for the can’t miss competition. Coast Bar and Grill will have steamed oyster buckets available!\nParticipants must enter in pairs, the buy-in is $10 paid to bar before the competition starts. \n1st prize is a $100 gift card to any HCH restaurant\n\n2nd prize is two small bar t-shirts\n\n3rd is your entry fee returned\nMore Info \nThe Historic Rice Mill best venue 2023\nFebruary 17th, 2023 \nWe are proud to announce that the Historic Rice Mill won best venue for 2023! The WeddingWire Couples’ Choice Awards recognize local wedding professionals who demonstrate excellence in quality, service, responsiveness, and professionalism. Winners are determined by the reviews from more than one million WeddingWire couples. Thank to everyone who voted, we appreciate all the support we’ve received.\n® More Info \nThe Historic Rice Mill wins best venue!\nJanuary 20223 \nWe are proud to announce that the Historic Rice Mill won best venue for 2023!\n\nPup Party on the Alley\nMay 7th, 12-3pm \nCharleston’s Smallest Bar & Pet Helpers are hosting a pet adoption & supplies drive!\nRead More \n39 Rue De Jean Chef Marcus Shell Sewe Cooking Demo\nFebruary 17th, 2023 \nCertified SC returns to Marion Square with a tent featuring the Palmetto State’s finest specialty food vendors and the Fresh on the Menu cooking stage, where South Carolina’s most talented chefs team up with their favorite farmers for a weekend of demonstrations and tastings showing why South Carolina is one of the best states in the nation for food-lovers.\nMore Info \nDry January Dinner with Spiritless Cocktails\nJan 19 & 24th, 2023 39 Rue de Jean is excited to host a 4-course dinner on January 19th, partnering with Spiritless Cocktails. January is the perfect month for a reset for those who choose to cut back on alcohol consumption after holiday indulgences. This dinner will feature 4 courses, paired with 5 alcohol-free cocktails from Spiritless. \nRepresentatives from Spiritless will be hosting this dinner alongside the Rue de Jean team, and will be there to answer any questions, and offer suggestions to those hoping to maintain or experiment with a “dry” or “damp” lifestyle.\n\nMidnight at the Rice Mill\nDec 31, 2022 \nHistoric Rice Mill is excited to once again host Midnight at The Rice Mill. The event will be complete with music from DJ Moo Moo, delicious cuisine from Good Food Catering, an all inclusive bar, a 360° photo booth, and a midnight champagne toast. Dance the night away and ring in the New Year at the Historic Rice Mill overlooking the Ashley River and enjoy an upscale, celebratory affair.\n\nRestaurant Week\nJan 12 - 22, 2023 \nAll Holy City Hospitality locations participate in restaurant week. The Chefs get the opportunity to create a unique coursed menu which allows guests to get a taste of what each restaurant has to offer!\nMore Info \nTaste of Hutson Alley Recap 2022\n\nIt had been too long since our event on the Alley! Our November event was centered on giving our chef’s from each restaurant the opportunity to show off their creations. The celebration took place among the lanterns and under the lights of our beautiful alleyway with chef-attended stations from all six Holy City Hospitality restaurants and dessert samplings from Good Food Catering.Guests were greeted at the John St. entrance to Hutson Alley and offered samples of Charleston’s Smallest Bar’s Hutson Alley Hooch. Attendees were welcome to enjoy a specialty cocktail featuring Tasmanian Pure Vodka, craft beer from Commonhouse Aleworks, wine from Republic National Distributing Company (RNDC), and live music from Ronnie Johnson. Despite the chill, guests danced under the lights to classics performed by Johnson. As well, many were huddled inside on the plush couches in Victor’s.",
      "hash": "e880323e15dd",
      "downloadedAt": "2026-01-19T15:29:20.671Z",
      "trimmedAt": "2026-01-19T15:42:44.007Z",
      "sizeReduction": "81.5%"
    }
  ],
  "sizeReduction": "94.4%"
}