{
  "venueId": "ChIJlb-kF-9__ogRcmNJB2ScqhI",
  "venueName": "Lost Isle",
  "venueArea": "West Ashley",
  "website": "https://www.lostislechs.com/",
  "scrapedAt": "2026-01-19T15:42:03.162Z",
  "trimmedAt": "2026-01-19T15:49:17.495Z",
  "pages": [
    {
      "url": "https://www.lostislechs.com/visit",
      "text": "[Page Title: Reservations — Lost Isle]\n\n0 Welcome to Lost Isle. \nNestled on Johns Island, we’re the island’s first fire-to-table restaurant and bar, located at 3338 Maybank Highway beside The Tattooed Moose!\n\nOur entire dining experience unfolds outdoors, tucked behind the building beneath a sprawling pecan tree and an open sky.\n\nSettle in by the glow of the fire, cozy up under the heaters, or wrap yourself in a warm blanket as the night settles in.\n\nSlow down, linger a little longer, and let the evening do the rest.\n\nWe hope you find your vibe at Lost Isle!\nFAQ’s \n| We do have Handicap Accessible Parking & Seating\n\n| Rainy Day Policy - We Open Rain or Shine, but will announce on social media if weather hinders our operations\n\n| We do not take reservations - Come during the week to avoid wait times!\n\n| Dog Policy - We allow happy, healthy, well-behaved dogs who are on a leash and go potty before arrival\n\n| We do not have High Chairs or a Children’s Menu, but we cater to guests of all ages",
      "hash": "4e366c8441c1",
      "downloadedAt": "2026-01-19T15:37:11.797Z",
      "trimmedAt": "2026-01-19T15:49:17.486Z",
      "sizeReduction": "99.4%"
    },
    {
      "url": "https://www.lostislechs.com/",
      "text": "[Page Title: Lost Isle | Discover, Dine, and Enjoy Now]\n\n0 \nCharleston’s First Fire To Table Restaurant & Bar\nEat Drink Visit Located on beautiful Johns Island, just minutes from downtown Charleston & Kiawah Island. \nLost Isle is a fire-to-table restaurant inspired by the natural beauty and easygoing spirit of Johns Island. Inspired by Lowcountry flavors and thoughtful hospitality, we’re a place to gather, unwind, and enjoy great food in good company. Consider it a little escape—without ever leaving the island.\nPlease note we are a walk-in only restaurant and we do not accept reservations.",
      "hash": "7079b79f1bcf",
      "downloadedAt": "2026-01-19T15:37:11.744Z",
      "trimmedAt": "2026-01-19T15:49:17.495Z",
      "sizeReduction": "99.5%"
    }
  ],
  "sizeReduction": "99.5%"
}