{
  "venueId": "ChIJo9lZlHJ6_ogR0q7juwXhj_4",
  "venueName": "The Restaurant at Zero George",
  "venueArea": "Downtown Charleston",
  "website": "http://zerorestaurantcharleston.com/",
  "scrapedAt": "2026-01-19T15:42:03.836Z",
  "trimmedAt": "2026-01-19T15:49:30.401Z",
  "pages": [
    {
      "url": "https://zerorestaurantcharleston.com/the-caviar-bar/",
      "text": "[Page Title: The Caviar Bar - The Restaurant at Zero GeorgeVimeo]\n\nVimeo Skip to content \nThis website uses cookies. If that's okay with you, keep on browsing, or learn more about our .\nPrivacy Policy Close Cookie Disclosure Notice Pause Background Video \nThe Caviar Bar\n\nA carefully crafted menu pays homage to Chef Vinson’s admiration & experience with caviar.\n\nAn Immersive Experience\n\nA destination to see and be seen, the intimate 8-seat Caviar Bar at Zero George offers an experience all its own. Featuring Regiis Ova Caviar service, classic in presentation yet effortlessly modern, it can be paired with a selection of inventive à la carte dishes for a truly memorable indulgence.\nBook Your Reservation Opens in a new window. 01 02 03 04 05 06 07 08",
      "hash": "1309f630a2c0",
      "downloadedAt": "2026-01-19T15:30:10.237Z",
      "trimmedAt": "2026-01-19T15:49:30.349Z",
      "sizeReduction": "99.8%"
    },
    {
      "url": "https://zerorestaurantcharleston.com/blog/food-wine-6-essential-culinary-experiences-in-charleston/",
      "text": "[Page Title: Food & Wine: 6 Essential Culinary Experiences in Charleston - The Restaurant at Zero GeorgeVimeo]\n\nVimeo Skip to content \nThis website uses cookies. If that's okay with you, keep on browsing, or learn more about our .\nPrivacy Policy Close Cookie Disclosure Notice November 7, 2025Press | \nFood & Wine: 6 Essential Culinary Experiences in Charleston\n\nZero George Cooking School Featured in Food & Wine\n\n“Head to one of the city’s most charming boutique hotels, Zero George, for what feels like a wine-soaked dinner party disguised as an education. On weekends during the day or on Monday nights, guests gather around “the pass,” an open-kitchen counter where the chef prepares a three-course seasonal menu in front of the group. Past dishes have included heirloom tomato caprese with burrata balloons, steamed bass with ramp butter and truffles, and chocolate pot de crème with caramel honeycomb. Each course comes paired with wine and served as it’s completed.\n\nAt $235 per person, the experience is capped at eight guests and booked through Resy, offering equal parts instruction and chef’s-table theater.”\nRead the feature on Food & Wine Share this post - Opens in new tab. - Opens in new tab. - Opens in new tab. Related Articles \nNovember 21, 2025Press\n| \nForbes: One Of Charleston’s Best Dishes Features A Savory Marshmallow\n\nCharleston’s The Restaurant at Zero George is home to one of the year’s most flavorful dishes, a playful combination of red shrimp with a savory muscadine marshmallow, curry and peanut. “The Restaurant at Zero George, located in Charleston, was recently recognized in the debut edition of the American…\nLearn More \nNovember 6, 2025Accolade\n| \nMICHELIN Guide: Inaugural American South Selection\n\nA Taste of Excellence: MICHELIN Guide Announces Inaugural American South Selection We are delighted to announce that The Restaurant at Zero George has been selected in the inaugural MICHELIN Guide American South. This recognition honors the skill, creativity, and dedication of our culinary team and the unforgettable…\nLearn More \nOctober 15, 2025Press\n| \nPost & Courier: Fine Dining Restaurants Start to offer Zero-Proof Drink Pairings\n\nCharleston Fine Dining Restaurants Start to offer High-End Zero-Proof Drink Pairings “The Restaurant at Zero George is perhaps the first in Charleston to do so, thanks to forward-thinking lead bartender Casie Fennell. “People think they’ll be missing out by not being able to drink, but we are saying,…\nLearn More",
      "hash": "7d50b5812d57",
      "downloadedAt": "2026-01-19T15:30:11.367Z",
      "trimmedAt": "2026-01-19T15:49:30.380Z",
      "sizeReduction": "99.4%"
    },
    {
      "url": "http://zerorestaurantcharleston.com/",
      "text": "[Page Title: Home - The Restaurant at Zero GeorgeVimeo]\n\nVimeo Skip to content \nThis website uses cookies. If that's okay with you, keep on browsing, or learn more about our .\nPrivacy Policy Close Cookie Disclosure Notice Pause Background Video \nAn inspired and immersive tasting menu experience\nStart Exploring \nA tucked-away gem among Charleston restaurants, The Restaurant at Zero George offers the city’s most celebrated cuisine in an atmosphere of timeless charm.\nBook Restaurant Book Caviar Bar \nA Dynamic Tasting Menu for the Discerning Epicurean\n\nThe Restaurant\n\nat Zero George\n\nThe Restaurant at Zero George delivers some of Charleston’s boldest flavors and most dazzling dishes from one of the city’s tiniest professional kitchens. Recognized in the 2025 inaugural MICHELIN Guide American South, dining here is both refined and adventurous, celebrating local ingredients through elevated, artfully crafted cuisine. Experience for yourself why The Restaurant has earned Zero George a place among Condé Nast’s Top 5 Foodie Hotels in the World.\nLearn More \nAn Elevated Caviar Experience\n\nThe Caviar Bar\n\nat Zero George\n\nThe Caviar Bar at Zero George invites you to savor Regiis Ova caviar and inventive caviar-inspired à la carte offerings in a warm, inviting setting. From classic favorites to creative twists, every bite is designed to delight, making it an unforgettable experience for both seasoned gourmands and curious palates alike.\nLearn more Opens in a new window. \nStep Behind the Scenes of Fine Dining\n\nThe Classes\n\nat Zero George\n\nGather at Zero George for an unforgettable Culinary Experience. Join a Cooking Class to watch our Chef bring inspired dishes to life, a Wine Class to explore exceptional vintages with our sommeliers, or indulge in Bourbon & Burgers, featuring rare whiskeys paired with our Royale with Cheese Wagyu Truffle Burger. Each class offers expert guidance and a deeper appreciation for extraordinary cuisine, wine, and spirits.\nLearn More Opens in a new window. \nFrom the street\n\nDig in to some delicious articles.\n\nNovember 21, 2025Press\n| \nForbes: One Of Charleston’s Best Dishes Features A Savory Marshmallow\n\nCharleston’s The Restaurant at Zero George is home to one of the year’s most flavorful dishes, a playful combination of red shrimp with a savory muscadine marshmallow, curry and peanut. “The Restaurant at Zero George, located in Charleston, was recently recognized in the debut edition of the American…\nLearn More \nNovember 6, 2025Accolade\n| \nMICHELIN Guide: Inaugural American South Selection\n\nA Taste of Excellence: MICHELIN Guide Announces Inaugural American South Selection We are delighted to announce that The Restaurant at Zero George has been selected in the inaugural MICHELIN Guide American South. This recognition honors the skill, creativity, and dedication of our culinary team and the unforgettable…\nLearn More \nNovember 7, 2025Press\n| \nFood & Wine: 6 Essential Culinary Experiences in Charleston\n\nZero George Cooking School Featured in Food & Wine “Head to one of the city’s most charming boutique hotels, Zero George, for what feels like a wine-soaked dinner party disguised as an education. On weekends during the day or on Monday nights, guests gather around “the pass,” an…\nLearn More \nGive the Gift of Zero\n\nAn extraordinary treat for the discerning traveler or epicurean soul. Delight them with a gift card from Zero George. Whether it is a weekend getaway, a meal at The Restaurant at Zero George, or cocktails and caviar at The Caviar Bar, our gift cards can be used for all hotel, dining, and bar experiences.\nPurchase Your Gift Opens in a new window. Check Your Gift Card Balance Follow us on Instagram @zerorestaurant - Link opens in a new tab \nLet's get social.",
      "hash": "864b3d77b4a2",
      "downloadedAt": "2026-01-19T15:30:09.546Z",
      "trimmedAt": "2026-01-19T15:49:30.401Z",
      "sizeReduction": "99.2%"
    }
  ],
  "sizeReduction": "99.5%"
}