{
  "venueId": "ChIJOXZ-Gr19_ogR7YWN0aIWeCo",
  "venueName": "Metro Diner",
  "venueArea": "West Ashley",
  "website": "https://metrodiner.com/locations/south-carolina/west-ashley/?utm_source=gmb-listing-map&utm_medium=organic&utm_campaign=google-my-business",
  "scrapedAt": "2026-01-19T15:41:58.056Z",
  "trimmedAt": "2026-01-19T15:44:58.997Z",
  "pages": [
    {
      "url": "https://metrodiner.com/offers/",
      "text": "[Page Title: Metro Diner Offers | Breakfast, Lunch and Dinner RestaurantFacebookInstagram]\n\nSkip to main content \nOffers\n\nFISH FRY FRIDAYS: Better than ever\n\nOur Fish Fry Fridays are now an even ! Every Friday, when you order our Fish & Chips, we’ll throw in a soup or salad – all for just $12.99*\nbetter deal free Learn More \nMetro Merch: The Gift That Keeps On Giving\n\nGive Metro Diner merch and the recipient gets 10% off their meal every time they wear it in-diner!\nShop Now \nA WELCOME OFFER FROM METRO E-CLUB\n\nWhen you join our E-Club, not only will you be the first to know about specials and promotions, you’ll also get exclusive access to offers and events—starting with\n50% off your next entrée!* SIGN UP NOW",
      "hash": "24ff14abe976",
      "downloadedAt": "2026-01-19T15:37:25.251Z",
      "trimmedAt": "2026-01-19T15:44:58.664Z",
      "sizeReduction": "99.4%"
    },
    {
      "url": "https://metrodiner.com/locations/georgia/augusta/",
      "text": "[Page Title: Metro Diner Augusta, GA | Breakfast all day, Lunch & Dinner RestaurantFacebookInstagramFacebookInstagram]\n\nSkip to main content \nAugusta\nMake My Location We're open\n\n Menus\n \n Menus \n\n All Menus\n Download Menu\n Gluten-Free Menu\n Catering Menu\n\n Order\n \n Order \n\n Takeout / Delivery\n Catering We're currently closed\n\n Get on the list\n Waitlist\n \n Menus\n Order \nAugusta, Georgia, home to golf, culture, true Southern hospitality and the best breakfast served all day at Metro Diner, the award-winning comfort food restaurant.\n\nFollow Us\nFacebook Instagram {{ location.address }}\n \n {{ location.locality }}, {{ location.region }} {{ location.postcode }} {{ location.address_2 }} Directions +1 706-750-0520 {{ getLongDay(days.name) }} {{ getHoliday(days.holiday) }} {{ locationFormatHours(days.hours) }} \nAt this location\nOnline Ordering Delivery Catering \nCurbside Pickup\n\nAlcohol Sold Here\n\nBreakfast All Day\n\nOutdoor Dining\n\nFree Wifi\n\nClarissa Torres\n\nManaging Partner\nMetro Diner Augusta, GA Where Classic Southern Charm Meets Classic Southern Diner Food \nIf you’re hungry for savory, home-style comfort food in the Augusta, GA, area, look no further than Metro Diner! Wondering what to expect from this award-winning restaurant in downtown Augusta? This much is guaranteed:  a warm welcome; a hearty plate of some of the you’ve ever tasted. Our Augusta location stays true to our humble roots with must-try signature items like Fried Chicken & Waffles and our famous Iron City Meatloaf (as featured on Guy Fieri’s ).\nbest comfort food Diners, Drive-ins and Dives \nLocated on Washington Road, near I-20 (Carl Sanders Highway), Metro Diner Augusta is less than a mile from Augusta National Golf Club and minutes from Augusta University – Summerville Campus, Augusta Mall and the Medical District.  It’s the perfect place to grab a bite to eat on your way into beautiful downtown Augusta to for a show at James Brown Arena or after exploring the Augusta Riverwalk.\n\nAnd about that Southern hospitality? You’ll find an extra helping here at Metro Diner, where regulars and newcomers alike are welcomed like special guests in our home. Know that a warm smile comes along with every glass of sweet tea, cup of strong coffee and delicious .\nbreakfast, lunch and dinner \nFavorites, offers & more!\n\nSign Up & Enjoy 50% Off\n\nWhen you join our E-Club, not only will you be the first to know about specials and promotions, you’ll also get exclusive access to offers and events—starting with 50% off your next entrée!*\n\nSign Up Today\n\nDin(n)er Deals – starting at $10.99\n\nPick from seven craveable entrée combos — each comes with a choice of salad or soup and a drink. The only way to snag these deals is to dine with us after 3pm, so hurry in!\n\nLearn More\n\nThis place is so awesome! Serves big portions and everyone who works there seems to luv their job❤\n\nFelicia D.\n\nAugusta, GA\n\nThe chicken and waffles are to die for! Not literally, of course! Lol but it's always a little peace of heaven when eating the fresh waffles, fresh juicy fried chicken AND that strawberry butter goodness! 😍🤤\n\nG. Gemini\n\nAugusta, GA\n\nFirst time at Metro and wait staff was extremely friendly and attentive. Restaurant was very clean and food was very good and quickly prepared.\n\nNels B.\n\nAugusta, GA\n\nAwesome food! Love the ambiance! Great service! Reasonable prices for such big portions! Very nice dining experience!\n\nJames J.\n\nAugusta, GA\n\nJoin Our Team!\n\nWe are more than just a Team of people working together, we are a Family – and our Family is growing! Team Members enjoy access to insurance, paid vacations, meal benefits, and career growth.\nApply Today \nOther Locations\n\nAiken\n\n1944 Whiskey RoadSuite 101Aiken, SC 29803\n+1 803-792-7808 View Details \nSavannah - Pooler\n\n200 Tanger Outlets BoulevardSuite 200Pooler, GA 31322\n+1 912-228-5628 View Details \nCharleston - West Ashley\n\n1808 Sam Rittenberg BoulevardSuite 1Charleston, SC 29407\n+1 843-894-0202 View Details View All Locations Out and About in Augusta And the Best Brunch in Town \nHere on the banks of the Savannah River, Georgia’s second-oldest city is home to beautiful parks as well as unique shops, attractions and museums including the Augusta Museum of History – check out popular exhibits featuring two Augusta originals, singer James Brown and the\nMasters Golf Tournament. \nAnd if you’re here in April, you can experience the energy and excitement of the Masters Tournament for yourself, when golf fans from all over come to see the top golfers in the world!\n\nJust a few of the great places to visit in Augusta:\n\nAugusta National Golf Club\n\nAugusta Mall – Riverwalk\n\nAugusta – Morris Museum of Art\n\nSacred Heart Cultural Center\n\nMeadow Garden\n\nJames Brown Arena\n\nSRP Stadium\n\nRiverwatch Luxury Cinema\n\nBefore or after you explore Augusta, may we suggest ? Come on by Washington Road for Fried Chicken & Waffles, Biscuits & Sausage Gravy, Avocado Toast, Classic Egg Benedict and more. Don’t forget the mimosas and Bloody Mary’s. Now we’re talking about a great day.\nMetro Diner Brunch Discover Atlanta’s Kid-Friendly Adventures And Metro Diner Family Meals to Go \nFor the little ones, don’t miss a trip to one or more of Augusta’s great parks! Try Phinizy Swamp Nature Park, Living History Park, Pendleton King Park, Brick Bond Park or many more green spaces rich with history and the great outdoors.\n\nA picnic always makes a day more fun, and you can order ! We offer home and office delivery or try our contactless pick up – either way, its family-friendly dining made easy.\nMetro Diner for breakfast, lunch and dinner to-go \nfeatures Chicken Tenders, a lil’ short stack of Pancakes, Belgian Waffles dusted with powdered sugar or a mini portion of Chicken & Waffles. Scratch-made, kid approved. Or try our Metro Diner Family Dinners like the Bissell Platter for 4 with scrambled eggs, bacon, toast, hashbrowns or grits and pancakes, a Boneless Wing Pack with dipping sauce or even our Iron City Meatloaf for 4 with creamy mashed potatoes and green beans.\nThe Metro Diner Kids’ Menu \nWhile we’re talking food to go, don’t forget ! Corporate event catering, graduation catering, business lunches, family reunions, you name it, we’ll bring over tasty homestyle cooking for everyone. Your team or guests won’t be disappointed by crispy Fish & Chips, triple layer Club Sandwiches or Charleston Shrimp & Grits for a crowd.\nMetro Diner caters About Metro Diner Serving the Best Breakfast, Brunch, Lunch and Dinner since 1992 \nOfficially opened in 1992, our original Metro Diner location in Jacksonville, Florida, quickly became  go-to local restaurant for comforting classics and reimagined favorites.\nthe \nOver the years, we’ve continued to share our southern hospitality, big, bold flavors and passion for integrity, familiarity, comfort and community by bringing in new partners across the country.\n\nToday, Metro Diner has  in 12 states and has earned a number of  for our mouthwatering, home-style comfort food cooking including: Best Breakfast, Best Diner and Best Burger.\nover 60 locations awards \nWe welcome you to visit us and try our for yourself!\naward-winning food Learn more about Metro Diner Read More Open Modal First Name * Last Name * Your Home Location * Choose home location... Aiken Altamonte Springs Anderson Athens Augusta Bensalem Birmingham - Inverness Bradenton Brandon Brunswick Cape Coral Casselberry Charleston - West Ashley Charlotte - Pineville Chesapeake Columbia Columbus Concord Pike Daytona Beach Dothan Evansville Fayetteville Fredericksburg Gainesville Huntersville Huntsville (Airport Rd.) Indian Land Indianapolis - Clearwater Crossing (E 82nd St) Indianapolis - Greenwood Jacksonville (NC) Jacksonville - Mandarin Jacksonville - Orange Park Jacksonville - Ortega Jacksonville - Ponte Vedra Beach Jacksonville - San Marco Jacksonville - Southside Jacksonville Beach Knoxville Kissimmee - Hunters Creek Lakeland Langhorne - Oxford Valley Louisville - Jefferson Madison Matthews Mechanicsburg Melbourne Middletown Mishawaka Murfreesboro Newark Oklahoma City Oviedo Palm Coast Palm Harbor Plainfield Port Charlotte Raleigh Sarasota - Lockwood Savannah - Pooler St. Augustine St. Johns St. Petersburg Suffolk Tampa - South Tampa Terre Haute The Villages Trussville Tuscaloosa Venice Email * Phone * Date of Birth * Month Day Year \nIn signing up, I acknowledge that I am 18 years of age or older, want to receive email offers from Metro Diner and agree to the . *Offer sent via email to new e-club members and valid for 30 days from sign up. Offer not valid with any other offers, promotions or discounts.\nterms and conditions Submit \nIn signing up, I acknowledge that I am 18 years of age or older, want to receive email offers from Metro Diner and agree to the\n. *Offer sent via email to new e-club members and valid for 30 days from sign up.\nterms and conditions Don't ask me this again Menu Order Menu Order Menu Order Menu Waitlist Order",
      "hash": "35a1d5c4e360",
      "downloadedAt": "2026-01-19T15:37:31.332Z",
      "trimmedAt": "2026-01-19T15:44:58.687Z",
      "sizeReduction": "93.2%"
    },
    {
      "url": "https://metrodiner.com/newsletter-signup/",
      "text": "[Page Title: Metro E-Club newsletter | Sign Up For Restaurant Offers | Metro DinerFacebookInstagram]\n\nSkip to main content First Name * Last Name * Your Home Location * Choose home location... Aiken Altamonte Springs Anderson Athens Augusta Bensalem Birmingham - Inverness Bradenton Brandon Brunswick Cape Coral Casselberry Charleston - West Ashley Charlotte - Pineville Chesapeake Columbia Columbus Concord Pike Daytona Beach Dothan Evansville Fayetteville Fredericksburg Gainesville Huntersville Huntsville (Airport Rd.) Indian Land Indianapolis - Clearwater Crossing (E 82nd St) Indianapolis - Greenwood Jacksonville (NC) Jacksonville - Mandarin Jacksonville - Orange Park Jacksonville - Ortega Jacksonville - Ponte Vedra Beach Jacksonville - San Marco Jacksonville - Southside Jacksonville Beach Knoxville Kissimmee - Hunters Creek Lakeland Langhorne - Oxford Valley Louisville - Jefferson Madison Matthews Mechanicsburg Melbourne Middletown Mishawaka Murfreesboro Newark Oklahoma City Oviedo Palm Coast Palm Harbor Plainfield Port Charlotte Raleigh Sarasota - Lockwood Savannah - Pooler St. Augustine St. Johns St. Petersburg Suffolk Tampa - South Tampa Terre Haute The Villages Trussville Tuscaloosa Venice Email * Phone * Date of Birth * Month Day Year \nIn signing up, I acknowledge that I am 18 years of age or older, want to receive email offers from Metro Diner and agree to the . *Offer sent via email to new e-club members and valid for 30 days from sign up. Offer not valid with any other offers, promotions or discounts.\nterms and conditions Submit About Metro Diner \nMetro Diner’s story began in 1938 when the building that would become  opened in Jacksonville, Florida. Officially branded in 1992, Metro Diner quickly became  go-to local restaurant for comforting classics and reimagined favorites.\nthe first location the \nWith the help of Master Chef Mark Davoli and his family, Metro Diner continued to grow and even earned a spot on Guy Fieri’s .\nDiners, Drive-Ins, and Dives \nToday, Metro Diner has  in 12 states and has earned a number of  for its savory, home-style comfort food cooking including: and\nover 60 locations awards Best Breakfast, Best Diner, Best Burger Learn More About Metro Diner \nE-Club FAQs\nWhat is the Metro Diner E-Club? \nThe Metro Diner E-Club is a free program where Members receive email communications about Metro Diner specials and promotions, get exclusive access to offers and events, and enjoy benefits like 50% off your first dine-in entrée and a birthday surprise!\nWhat is Metro Diner's Privacy Policy? \nMetro Diner will not sell or rent your personally identifiable information to anyone.\nView the full Metro Diner Privacy Policy What do I get for signing up for the E-Club? \nWhen you sign up for the E-Club, you will receive a code redeemable at any Metro Diner for 50% off your first entrée. This one-time-use offer can be redeemed in the Diner by showing the code to your server or used to .\norder to go online How long after I sign up should I receive my offer? \n. If you do not receive it after 2 hours, please check your spam/junk folders.\nYour offer will send to the email you used to sign up in about 2 hours Contact us if you have any issues and we’d be happy to resend! How do I update my E-Club info? \nIf you would like to update your information, please\ncontact us. Help! I did not get my E-Club sign up offer. \nYour 50% off entrée code is sent approximately 2 hours after sign up. If you still do not receive your email, please search “Metro Diner” in your inbox and check your spam/junk email folder.  if you do not find it.\nContact us View All FAQs Menu Order Menu Waitlist Order Menu Order Menu Waitlist Order",
      "hash": "399a1fd4b85a",
      "downloadedAt": "2026-01-19T15:37:25.805Z",
      "trimmedAt": "2026-01-19T15:44:58.704Z",
      "sizeReduction": "96.6%"
    },
    {
      "url": "https://metrodiner.com/locations/",
      "text": "[Page Title: Locations | Find A Metro Diner Restaurant Near YouFacebookInstagram]\n\nSkip to main content \nLocations\nView All Locations \nSign Up & Enjoy\n50% Off Your Next Entrée!* \nBe the first to know about specials and promotions, and get exclusive access to members-only offers and events.\nSIGN UP → \nAll Locations\n\nAlabama\nBirmingham - Inverness Dothan Huntsville - Airport Rd Madison Trussville Tuscaloosa \nDelaware\nConcord Pike Middletown Newark \nFlorida\nAltamonte Springs Bradenton Brandon Cape Coral Casselberry Daytona Beach Gainesville Jacksonville - Mandarin Jacksonville - Orange Park Jacksonville - Ortega Jacksonville - Ponte Vedra Beach Jacksonville - San Marco Jacksonville - Southside Jacksonville Beach Kissimmee - Hunters Creek Lakeland Melbourne Oviedo Palm Coast Palm Harbor Port Charlotte Sarasota - Lockwood St. Augustine St. Johns St. Petersburg Tampa - South Tampa The Villages Venice \nGeorgia\nAthens Augusta Brunswick Columbus Savannah - Pooler \nIndiana\nEvansville Indianapolis - Clearwater Crossing (E 82nd St) Indianapolis - Greenwood Mishawaka Plainfield Terre Haute \nKentucky\nLouisville - Jefferson \nNorth Carolina\nCharlotte - Pineville Fayetteville Huntersville Jacksonville (NC) Matthews Raleigh \nOklahoma\nOklahoma City \nPennsylvania\nBensalem Langhorne - Oxford Valley Mechanicsburg \nSouth Carolina\nAiken Anderson Charleston - West Ashley Columbia Indian Land \nTennessee\nKnoxville Murfreesboro \nVirginia\nChesapeake Fredericksburg Suffolk Open Modal First Name * Last Name * Your Home Location * Choose home location... Aiken Altamonte Springs Anderson Athens Augusta Bensalem Birmingham - Inverness Bradenton Brandon Brunswick Cape Coral Casselberry Charleston - West Ashley Charlotte - Pineville Chesapeake Columbia Columbus Concord Pike Daytona Beach Dothan Evansville Fayetteville Fredericksburg Gainesville Huntersville Huntsville (Airport Rd.) Indian Land Indianapolis - Clearwater Crossing (E 82nd St) Indianapolis - Greenwood Jacksonville (NC) Jacksonville - Mandarin Jacksonville - Orange Park Jacksonville - Ortega Jacksonville - Ponte Vedra Beach Jacksonville - San Marco Jacksonville - Southside Jacksonville Beach Knoxville Kissimmee - Hunters Creek Lakeland Langhorne - Oxford Valley Louisville - Jefferson Madison Matthews Mechanicsburg Melbourne Middletown Mishawaka Murfreesboro Newark Oklahoma City Oviedo Palm Coast Palm Harbor Plainfield Port Charlotte Raleigh Sarasota - Lockwood Savannah - Pooler St. Augustine St. Johns St. Petersburg Suffolk Tampa - South Tampa Terre Haute The Villages Trussville Tuscaloosa Venice Email * Phone * Date of Birth * Month Day Year \nIn signing up, I acknowledge that I am 18 years of age or older, want to receive email offers from Metro Diner and agree to the . *Offer sent via email to new e-club members and valid for 30 days from sign up. Offer not valid with any other offers, promotions or discounts.\nterms and conditions Submit \nIn signing up, I acknowledge that I am 18 years of age or older, want to receive email offers from Metro Diner and agree to the\n. *Offer sent via email to new e-club members and valid for 30 days from sign up.\nterms and conditions Don't ask me this again",
      "hash": "3fa1d3058c0f",
      "downloadedAt": "2026-01-19T15:37:24.163Z",
      "trimmedAt": "2026-01-19T15:44:58.719Z",
      "sizeReduction": "97.1%"
    },
    {
      "url": "https://metrodiner.com/locations/south-carolina/west-ashley/?utm_source=gmb-listing-map&utm_medium=organic&utm_campaign=google-my-business#",
      "text": "[Page Title: Metro Diner Charleston | Breakfast all day, Lunch & Dinner RestaurantFacebookInstagramFacebookInstagram]\n\nSkip to main content \nCharleston - West Ashley\nMake My Location We're open\n\n Menus\n \n Menus \n\n All Menus\n Download Menu\n Gluten-Free Menu\n Catering Menu\n\n Order\n \n Order \n\n Takeout / Delivery\n Catering We're currently closed\n\n Get on the list\n Waitlist\n \n Menus\n Order \nCharleston is famous for its hospitality and incredible Southern dining. Join us here at Metro Diner in West Ashley, for a warm welcome, the best breakfast, and award-winning Southern comfort food sure to please.\n\nFollow Us\nFacebook Instagram {{ location.address }}\n \n {{ location.locality }}, {{ location.region }} {{ location.postcode }} {{ location.address_2 }} Directions +1 843-894-0202 {{ getLongDay(days.name) }} {{ getHoliday(days.holiday) }} {{ locationFormatHours(days.hours) }} \nAt this location\nOnline Ordering Delivery Catering \nCurbside Pickup\n\nAlcohol Sold Here\n\nBreakfast All Day\n\nOutdoor Dining\n\nFree Wifi\n\nDoug Zink\n\nManaging Partner\nMetro Diner West Ashley-Charleston Breakfast All Day, Lunch to Go, Family Friendly Dinners & More! \nWhat to order at Metro Diner? When in Charleston, go with the Charleston Shrimp & Grits, of course! First, we make our grits good and cheesy then infuse ‘em with roasted red peppers and andouille sausage. Next, we fry them to a golden crisp, top with tender shrimp simmered in a peppery sauce, and finish with crisp bacon crumbles. Mmmm.\n\nLocated at the corner of Sam Rittenberg Blvd and Ashely River Road in the Westwood Plaza Shopping Center, Metro Diner West Ashley- Charleston is just a mile from the Cultural Arts Center of Charleston and near the College of Charleston and The Citadel. It’s also the perfect place for delicious before or after shopping at the Tanger Outlets, catching a Charleston RiverDogs or Battery’s game, or after visiting the Fort Sumter National Monument.\nbreakfast, lunch or dinner \nOur regulars also go crazy for the Fried Chicken & Waffles with strawberry butter, made even more amazing with a drizzle of our house-made Spicy Syrup. There’s also Guy Fieri’s favorite from his visit: the griddle-seared, Iron City Meatloaf.\nDiners, Drive-Ins and Dives \nFavorites, offers & more!\n\nSign Up & Enjoy 50% Off\n\nWhen you join our E-Club, not only will you be the first to know about specials and promotions, you’ll also get exclusive access to offers and events—starting with 50% off your next entrée!*\n\nSign Up Today\n\nWhat Our Guests Are Saying\n\nBest restaurant in West Ashley!\n\nMitch S.\n\nCharleston, SC\n\nGreat food and lots of options! Chicken salad sandwich was huge and so delicious. Kids got chicken and waffles and those portions were impressive! Of course had to try it myself and was one of the best chicken breading I’ve ever had!\n\nGisela G.\n\nCharleston, SC\n\nThe best biscuits and gravy. Great portions. Love the Metro Diner. Everyone is so nice and helpful and prices are great.\n\nJane\n\nCharleston, SC\nJoin Our Team! \nWe are more than just a Team of people working together, we are a Family – and our Family is growing! Team Members enjoy access to insurance, paid vacations, meal benefits, and career growth.\nApply Today \nOther Locations\n\nSavannah - Pooler\n\n200 Tanger Outlets BoulevardSuite 200Pooler, GA 31322\n+1 912-228-5628 View Details \nAiken\n\n1944 Whiskey RoadSuite 101Aiken, SC 29803\n+1 803-792-7808 View Details \nAugusta\n\n2820 Washington RoadAugusta, GA 30909\n+1 706-750-0520 View Details \nFayetteville\n\n2132 Skibo RoadFayetteville, NC 28314\n+1 910-493-3560 View Details View All Locations Things to do in Charleston, SC Holy City Highlights with a Helping of Metro Diner’s Award-Winning Food \nWhether you’re in Charleston for business or pleasure, or you’re a native Charlestonian, showing visitors around, there’s much to see in a city that’s been voted “Best in the World” by .\nTravel + Leisure \nCharleston receives high marks for historic preservation and hospitality, so start by heading to historic downtown, or “Downtown Chuck,” where you can take it all in at your own pace. There’s no wrong way to see Charleston, but the Old South Historic Horse & Carriage Tour is a great option to see the city and snap some incredible photos.\n\nIf you’re around in the spring, head to the stunning to catch the magnolias in bloom. Bring your family, or maybe a sweetheart, after all, andcall Charleston the most romantic city in the U.S.\nMiddleton Place Gardens Travel + Leisure CNN \nA few more essential Charleston highlights:\n\nArthur Ravenel Jr. Bridge\n\nFort Sumter National Monument\n\nMcLeod Plantation Historic Site\n\nBattery & White Point Gardens\n\nNathaniel Russell House\n\nOld Exchange & Provost Dungeon\n\nMagnolia Plantation & Gardens\n\nCharleston City Market\n\nCharleston Harbor History Daytime\n\nSunset Boat Cruise\n\nTo keep your energy up and see all that Charleston has to offer, stop by Metro Diner in West Ashley to fill up on like Fish & Chips, Biscuits & Sausage Gravy, Belgian Waffles, a Classic Burger, or Bissel Breakfast – any time of day!\nguest favorites Excursions for Kids and Kids-at-Heart And Family Meals to Go \nFamily-friendly Charleston is also home to the and interactive Children’s Museum of the Lowcountry, great outlets for curious kids. Folly Beach County Park is gorgeous year ‘round and the perfect spot to collect seashells and dip your toes in the Atlantic.\nSouth Carolina Aquarium \nWhy not enjoy all this with a Metro Diner picnic? Our has kid-sized portions of our Fried Chicken & Waffles, as well as Chicken Tenders, Belgian Waffles, and plenty more to please even your pickiest l’il eaters. You can also order Metro Diner including Iron City Meat Loaf or Fried Chicken for Four, Boneless Wing Packs and more!\nMetro Diner Kids’ Menu Family Meals to go \nIn fact, we offer all our breakfast, lunch or dinner classics to go via , so order or pick up your grub at Metro Diner then head to the Joe Riley Waterfront Park for a picnic under a shady oak tree and a family photo by the famous Pineapple Fountain. So easy!\npick-up or delivery \nIf a party is more your style, for all kinds of events: business meetings, baby showers, graduation, corporate events, holiday parties, and even weddings! Here comes the bride… and the Chicken & Waffles!\nMetro Diner offers catering About Metro Diner Serving the Best Breakfast, Brunch, Lunch and Dinner since 1992 \nOfficially opened in 1992, our original Metro Diner location in Jacksonville, Florida, quickly became  go-to local restaurant for comforting classics and reimagined favorites.\nthe \nOver the years, we’ve continued to share our southern hospitality, big, bold flavors and passion for integrity, familiarity, comfort and community by bringing in new partners across the country.\n\nToday, Metro Diner has  in 12 states and has earned a number of  for our mouthwatering, home-style comfort food cooking including: Best Breakfast, Best Diner and Best Burger.\nover 60 locations awards \nWe welcome you to visit us and try our for yourself!\naward-winning food Learn more about Metro Diner Read More Menu Order Menu Order Menu Order Menu Waitlist Order",
      "hash": "520c59854c46",
      "downloadedAt": "2026-01-19T15:37:26.332Z",
      "trimmedAt": "2026-01-19T15:44:58.740Z",
      "sizeReduction": "93.1%"
    },
    {
      "url": "https://metrodiner.com/locations/south-carolina/west-ashley/?utm_source=gmb-listing-map&utm_medium=organic&utm_campaign=google-my-business",
      "text": "[Page Title: Metro Diner Charleston | Breakfast all day, Lunch & Dinner RestaurantFacebookInstagramFacebookInstagram]\n\nSkip to main content \nCharleston - West Ashley\nMake My Location We're open\n\n Menus\n \n Menus \n\n All Menus\n Download Menu\n Gluten-Free Menu\n Catering Menu\n\n Order\n \n Order \n\n Takeout / Delivery\n Catering We're currently closed\n\n Get on the list\n Waitlist\n \n Menus\n Order \nCharleston is famous for its hospitality and incredible Southern dining. Join us here at Metro Diner in West Ashley, for a warm welcome, the best breakfast, and award-winning Southern comfort food sure to please.\n\nFollow Us\nFacebook Instagram {{ location.address }}\n \n {{ location.locality }}, {{ location.region }} {{ location.postcode }} {{ location.address_2 }} Directions +1 843-894-0202 {{ getLongDay(days.name) }} {{ getHoliday(days.holiday) }} {{ locationFormatHours(days.hours) }} \nAt this location\nOnline Ordering Delivery Catering \nCurbside Pickup\n\nAlcohol Sold Here\n\nBreakfast All Day\n\nOutdoor Dining\n\nFree Wifi\n\nDoug Zink\n\nManaging Partner\nMetro Diner West Ashley-Charleston Breakfast All Day, Lunch to Go, Family Friendly Dinners & More! \nWhat to order at Metro Diner? When in Charleston, go with the Charleston Shrimp & Grits, of course! First, we make our grits good and cheesy then infuse ‘em with roasted red peppers and andouille sausage. Next, we fry them to a golden crisp, top with tender shrimp simmered in a peppery sauce, and finish with crisp bacon crumbles. Mmmm.\n\nLocated at the corner of Sam Rittenberg Blvd and Ashely River Road in the Westwood Plaza Shopping Center, Metro Diner West Ashley- Charleston is just a mile from the Cultural Arts Center of Charleston and near the College of Charleston and The Citadel. It’s also the perfect place for delicious before or after shopping at the Tanger Outlets, catching a Charleston RiverDogs or Battery’s game, or after visiting the Fort Sumter National Monument.\nbreakfast, lunch or dinner \nOur regulars also go crazy for the Fried Chicken & Waffles with strawberry butter, made even more amazing with a drizzle of our house-made Spicy Syrup. There’s also Guy Fieri’s favorite from his visit: the griddle-seared, Iron City Meatloaf.\nDiners, Drive-Ins and Dives \nFavorites, offers & more!\n\nSign Up & Enjoy 50% Off\n\nWhen you join our E-Club, not only will you be the first to know about specials and promotions, you’ll also get exclusive access to offers and events—starting with 50% off your next entrée!*\n\nSign Up Today\n\nWhat Our Guests Are Saying\n\nBest restaurant in West Ashley!\n\nMitch S.\n\nCharleston, SC\n\nGreat food and lots of options! Chicken salad sandwich was huge and so delicious. Kids got chicken and waffles and those portions were impressive! Of course had to try it myself and was one of the best chicken breading I’ve ever had!\n\nGisela G.\n\nCharleston, SC\n\nThe best biscuits and gravy. Great portions. Love the Metro Diner. Everyone is so nice and helpful and prices are great.\n\nJane\n\nCharleston, SC\nJoin Our Team! \nWe are more than just a Team of people working together, we are a Family – and our Family is growing! Team Members enjoy access to insurance, paid vacations, meal benefits, and career growth.\nApply Today \nOther Locations\n\nSavannah - Pooler\n\n200 Tanger Outlets BoulevardSuite 200Pooler, GA 31322\n+1 912-228-5628 View Details \nAiken\n\n1944 Whiskey RoadSuite 101Aiken, SC 29803\n+1 803-792-7808 View Details \nAugusta\n\n2820 Washington RoadAugusta, GA 30909\n+1 706-750-0520 View Details \nFayetteville\n\n2132 Skibo RoadFayetteville, NC 28314\n+1 910-493-3560 View Details View All Locations Things to do in Charleston, SC Holy City Highlights with a Helping of Metro Diner’s Award-Winning Food \nWhether you’re in Charleston for business or pleasure, or you’re a native Charlestonian, showing visitors around, there’s much to see in a city that’s been voted “Best in the World” by .\nTravel + Leisure \nCharleston receives high marks for historic preservation and hospitality, so start by heading to historic downtown, or “Downtown Chuck,” where you can take it all in at your own pace. There’s no wrong way to see Charleston, but the Old South Historic Horse & Carriage Tour is a great option to see the city and snap some incredible photos.\n\nIf you’re around in the spring, head to the stunning to catch the magnolias in bloom. Bring your family, or maybe a sweetheart, after all, andcall Charleston the most romantic city in the U.S.\nMiddleton Place Gardens Travel + Leisure CNN \nA few more essential Charleston highlights:\n\nArthur Ravenel Jr. Bridge\n\nFort Sumter National Monument\n\nMcLeod Plantation Historic Site\n\nBattery & White Point Gardens\n\nNathaniel Russell House\n\nOld Exchange & Provost Dungeon\n\nMagnolia Plantation & Gardens\n\nCharleston City Market\n\nCharleston Harbor History Daytime\n\nSunset Boat Cruise\n\nTo keep your energy up and see all that Charleston has to offer, stop by Metro Diner in West Ashley to fill up on like Fish & Chips, Biscuits & Sausage Gravy, Belgian Waffles, a Classic Burger, or Bissel Breakfast – any time of day!\nguest favorites Excursions for Kids and Kids-at-Heart And Family Meals to Go \nFamily-friendly Charleston is also home to the and interactive Children’s Museum of the Lowcountry, great outlets for curious kids. Folly Beach County Park is gorgeous year ‘round and the perfect spot to collect seashells and dip your toes in the Atlantic.\nSouth Carolina Aquarium \nWhy not enjoy all this with a Metro Diner picnic? Our has kid-sized portions of our Fried Chicken & Waffles, as well as Chicken Tenders, Belgian Waffles, and plenty more to please even your pickiest l’il eaters. You can also order Metro Diner including Iron City Meat Loaf or Fried Chicken for Four, Boneless Wing Packs and more!\nMetro Diner Kids’ Menu Family Meals to go \nIn fact, we offer all our breakfast, lunch or dinner classics to go via , so order or pick up your grub at Metro Diner then head to the Joe Riley Waterfront Park for a picnic under a shady oak tree and a family photo by the famous Pineapple Fountain. So easy!\npick-up or delivery \nIf a party is more your style, for all kinds of events: business meetings, baby showers, graduation, corporate events, holiday parties, and even weddings! Here comes the bride… and the Chicken & Waffles!\nMetro Diner offers catering About Metro Diner Serving the Best Breakfast, Brunch, Lunch and Dinner since 1992 \nOfficially opened in 1992, our original Metro Diner location in Jacksonville, Florida, quickly became  go-to local restaurant for comforting classics and reimagined favorites.\nthe \nOver the years, we’ve continued to share our southern hospitality, big, bold flavors and passion for integrity, familiarity, comfort and community by bringing in new partners across the country.\n\nToday, Metro Diner has  in 12 states and has earned a number of  for our mouthwatering, home-style comfort food cooking including: Best Breakfast, Best Diner and Best Burger.\nover 60 locations awards \nWe welcome you to visit us and try our for yourself!\naward-winning food Learn more about Metro Diner Read More Menu Order Menu Order Menu Order Menu Waitlist Order",
      "hash": "6115ac896d60",
      "downloadedAt": "2026-01-19T15:37:24.124Z",
      "trimmedAt": "2026-01-19T15:44:58.755Z",
      "sizeReduction": "93.1%"
    },
    {
      "url": "https://metrodiner.com/menu/",
      "text": "[Page Title: Menu | Metro DinerFacebookInstagram]\n\nSkip to main content \nMenu\nDownload Menus Download Menu Gluten-Free Menu Catering Menu Pancakes & Waffles Breakfast Favorites Eggs & Omelets Burgers & Sandwiches Starters Entrée Salads & Soups Lunch & Dinner Favorites Family Meals Desserts Sides Kid's Menu Beverages \nPancakes & Waffles\n\nYou'll love sinking your teeth into these fluffy griddle greats featuring all your favorite toppings.\n\nCinnamon Roll Pancakes\n\nDetails\nOrder \nBelgian Waffle\n\nDetails\nOrder \nFruity Waffle\n\nDetails\nOrder \nMetro Pancakes\n\nDetails\nOrder \nCroissant French Toast\n\nDetails\nOrder \nBreakfast Favorites\n\nStart your day with comfort food favorites, new twists on breakfast classics, or lighter go-to options.\n\nFried Chicken & Waffles\n\nDetails\nOrder \nBowl Stk&scra\n\nDetails\nOrder \nBissell Breakfast\n\nDetails\nOrder \nBisc & Gravy\n\nDetails\nOrder \nAvocado Toast\n\nDetails\nOrder \nOatmeal Breakfast\n\nDetails\nOrder \nBacon Avocado Scramble Bowl\n\nDetails\nOrder \nSouthwest Scramble Bowl\n\nDetails\nOrder \nMeat Lover’s Scramble Bowl\n\nDetails\nOrder \nHuevos Rancheros\n\nDetails\nOrder \nEggs & Omelets\n\nScrambled, fried, oozy, or omelet... we'll cook your eggs however you want them.\n\nThree Egg Breakfast\n\nDetails\nOrder \nTwo Egg Breakfast\n\nDetails\nOrder \nProtein Brkfst\n\nDetails\nOrder \nWestern Omelet\n\nDetails\nOrder \nVeggie Omelet\n\nDetails\nOrder \nMeat Lovers Omelet\n\nDetails\nOrder \nFrench Toast Breakfast\n\nDetails\nOrder \nCroissant French Toast Breakfast\n\nDetails\nOrder \nBurgers & Sandwiches\n\nOur fresh, never frozen burgers & overflowing sandwiches are the best thing since sliced bread.\n\nBreakfast Burger\n\nDetails\nOrder \nAvocado Breakfast Sandwich\n\nDetails\nOrder \nClassic Burger\n\nDetails\nOrder \nPhilly Cheesesteak\n\nDetails\nOrder \nBacon, Egg & Cheese Croissant\n\nDetails\nOrder \nSpicy Honey Chicken Biscuit\n\nDetails\nOrder \nFried Chicken Sandwich\n\nDetails\nOrder \nDouble Decker Blt\n\nDetails\nOrder \nSpicy Honey Chicken Sandwich\n\nDetails\nOrder \nMetro Club\n\nDetails\nOrder \nChicken Salad Croissant\n\nDetails\nOrder \nGrilled 3 Cheese\n\nDetails\nOrder \nBbq Bacon Burger\n\nDetails\nOrder \nStarters\n\nKick your meal off with these savory, shareable appetizers.\n\nBoneless Wings\n\nDetails\nOrder \nCheese Fries\n\nDetails\nOrder \nHuevos Rancheros\n\nDetails\nOrder \nFried Cheese Curds\n\nDetails\nOrder \nPoutine\n\nDetails\nOrder \nEntrée Salads & Soups\n\nKeep it fresh with a salad loaded with nutritious toppings or cozy up with a cup or bowl of savory soup.\n\nChicken Tender Salad\n\nDetails\nOrder \nChicken Caesar Salad\n\nDetails\nOrder \nCaesar Large\n\nDetails\nOrder \nCaesar Small\n\nDetails\nOrder \nSalad Large\n\nDetails\nOrder \nSalad Small\n\nDetails\nOrder \nBowl Chicken Noodle\n\nDetails\nOrder \nCup Chicken Noodle\n\nDetails\nOrder \nLunch & Dinner Favorites\n\nThese menu items are what we're known for. Bold flavors and big portions - we know you'll find something you'll love.\n\nFried Chicken & Waffles\n\nDetails\nOrder \nRibs 1/2 Rack\n\nDetails\nOrder \nRibs Full Rack\n\nDetails\nOrder \nRibs & Chicken Combo\n\nDetails\nOrder \nFried Chicken Plate\n\nDetails\nOrder \nIron City Meatloaf\n\nDetails\nOrder \nChicken Tender Plate\n\nDetails\nOrder \nFish & Chips\n\nDetails\nOrder \nChicken Pot Pie\n\nDetails\nOrder \nRoasted Turkey Plate\n\nDetails\nOrder \nSteak Tips\n\nDetails\nOrder \nShepherd's Pie\n\nDetails\nOrder \nTeriyaki Salmon Bowl\n\nDetails\nOrder \nTangy Chicken Bowl\n\nDetails\nOrder \nLoaded Burger Bowl\n\nDetails\nOrder \nTeriyaki Steak Bowl\n\nDetails\nOrder \nTeriaki Salmon Platter\n\nDetails\nOrder \nFamily Meals\n\nFamily Meals.\n\nFried Chicken & Waffles For 4\n\nDetails\nOrder \nFried Chicken For 4\n\nDetails\nOrder \nIron City Meatloaf For 4\n\nDetails\nOrder \nChicken Tenders For 4\n\nDetails\nOrder \nRoasted Turkey For 4\n\nDetails\nOrder \nBoneless Wing Pack\n\nDetails\nOrder \nThe Bissell Platter For 4\n\nDetails\nOrder \nChicken Biscuits For 4\n\nDetails\nOrder \nHouse Salad For 4\n\nDetails\nOrder \nCaesar Salad For 4\n\nDetails\nOrder \nFreshly Brewed Coffee\n\nDetails\nOrder \nFreshly Brewed Iced Tea\n\nDetails\nOrder \nLemonade\n\nDetails\nOrder \nApple Juice\n\nDetails\nOrder \nDesserts\n\nSave room for dessert!\n\nChocolate Cake\n\nDetails\nOrder \nSides\n\nSavory, sweet, fresh, or fried... sometimes your entrée needs a little something on the side.\n\nMash Potatoes & Gravy\n\nDetails\nOrder \nMash Potatoes Dry\n\nDetails\nOrder \nMacaroni And Cheese\n\nDetails\nOrder \nGreen Beans\n\nDetails\nOrder \nFruit\n\nDetails\nOrder \nFrench Fries\n\nDetails\nOrder \nColeslaw\n\nDetails\nOrder \nBroccoli\n\nDetails\nOrder \nTurkey Links\n\nDetails\nOrder \nToast\n\nDetails\nOrder \nSausage Gravy Small\n\nDetails\nOrder \nBiscuit & Gravy\n\nDetails\nOrder \nSausage Gravy Lg\n\nDetails\nOrder \nSausage Patties\n\nDetails\nOrder \nSausage Links\n\nDetails\nOrder \nHome Fries\n\nDetails\nOrder \nHashbrowns\n\nDetails\nOrder \nHam Steak\n\nDetails\nOrder \nGrits\n\nDetails\nOrder \nFruit Bowl\n\nDetails\nOrder \nCheese Grits\n\nDetails\nOrder \nCanadan Bacon\n\nDetails\nOrder \nBowl Of Grits\n\nDetails\nOrder \nBowl Of Cheese Grits\n\nDetails\nOrder \nCrispy Bacon\n\nDetails\nOrder \nBacon\n\nDetails\nOrder \n3 Egg's\n\nDetails\nOrder \n2 Egg's\n\nDetails\nOrder \n2 Biscuits\n\nDetails\nOrder \n1 Egg\n\nDetails\nOrder \n1 Biscuit\n\nDetails\nOrder \nCornbread Stuffing\n\nDetails\nOrder \nKid's Menu\n\nKid-sized portions of Metro Diner breakfast, lunch, and dinner favorites.\n\nKid's Bissell\n\nDetails\nOrder \nKid's Grilled Cheese\n\nDetails\nOrder \nKid's Chicken & Waffles\n\nDetails\nOrder \nKid's Mac & Cheese\n\nDetails\nOrder \nKid's Pancakes\n\nDetails\nOrder \nKid's Platter\n\nDetails\nOrder \nKid's Tenders\n\nDetails\nOrder \nKid's Waffle\n\nDetails\nOrder \nBeverages\n\nPair your meal with the drink of your choice.\n\nCoffee\n\nDetails\nOrder \nDiet Coke\n\nDetails\nOrder \nCoke\n\nDetails\nOrder \nCoke Zero\n\nDetails\nOrder \nSprite\n\nDetails\nOrder \nLemonade\n\nDetails\nOrder \nSweet Tea\n\nDetails\nOrder \nUnsweet Tea\n\nDetails\nOrder \nMilk\n\nDetails\nOrder \nChocolate Milk\n\nDetails\nOrder \nApple Juice\n\nDetails\nOrder \nCaranbery Juice\n\nDetails\nOrder \nOrange Juice\n\nDetails\nOrder \nGrapefruit Juice\n\nDetails\nOrder \nPinapple Juice\n\nDetails\nOrder First Name * Last Name * Your Home Location * Choose home location... Aiken Altamonte Springs Anderson Athens Augusta Bensalem Birmingham - Inverness Bradenton Brandon Brunswick Cape Coral Casselberry Charleston - West Ashley Charlotte - Pineville Chesapeake Columbia Columbus Concord Pike Daytona Beach Dothan Evansville Fayetteville Fredericksburg Gainesville Huntersville Huntsville (Airport Rd.) Indian Land Indianapolis - Clearwater Crossing (E 82nd St) Indianapolis - Greenwood Jacksonville (NC) Jacksonville - Mandarin Jacksonville - Orange Park Jacksonville - Ortega Jacksonville - Ponte Vedra Beach Jacksonville - San Marco Jacksonville - Southside Jacksonville Beach Kissimmee - Hunters Creek Knoxville Lakeland Langhorne - Oxford Valley Louisville - Jefferson Madison Matthews Mechanicsburg Melbourne Middletown Mishawaka Murfreesboro Newark Oklahoma City Oviedo Palm Coast Palm Harbor Plainfield Port Charlotte Raleigh Sarasota - Lockwood Savannah - Pooler St. Augustine St. Johns St. Petersburg Suffolk Tampa - South Tampa Terre Haute The Villages Trussville Tuscaloosa Venice Email * Phone * Date of Birth * Month Day Year \nIn signing up, I acknowledge that I am 18 years of age or older, want to receive email offers from Metro Diner and agree to the . *Offer sent via email to new e-club members and valid for 30 days from sign up. Offer not valid with any other offers, promotions or discounts.\nterms and conditions Submit Open Modal First Name * Last Name * Your Home Location * Choose home location... Aiken Altamonte Springs Anderson Athens Augusta Bensalem Birmingham - Inverness Bradenton Brandon Brunswick Cape Coral Casselberry Charleston - West Ashley Charlotte - Pineville Chesapeake Columbia Columbus Concord Pike Daytona Beach Dothan Evansville Fayetteville Fredericksburg Gainesville Huntersville Huntsville (Airport Rd.) Indian Land Indianapolis - Clearwater Crossing (E 82nd St) Indianapolis - Greenwood Jacksonville (NC) Jacksonville - Mandarin Jacksonville - Orange Park Jacksonville - Ortega Jacksonville - Ponte Vedra Beach Jacksonville - San Marco Jacksonville - Southside Jacksonville Beach Knoxville Kissimmee - Hunters Creek Lakeland Langhorne - Oxford Valley Louisville - Jefferson Madison Matthews Mechanicsburg Melbourne Middletown Mishawaka Murfreesboro Newark Oklahoma City Oviedo Palm Coast Palm Harbor Plainfield Port Charlotte Raleigh Sarasota - Lockwood Savannah - Pooler St. Augustine St. Johns St. Petersburg Suffolk Tampa - South Tampa Terre Haute The Villages Trussville Tuscaloosa Venice Email * Phone * Date of Birth * Month Day Year \nIn signing up, I acknowledge that I am 18 years of age or older, want to receive email offers from Metro Diner and agree to the . *Offer sent via email to new e-club members and valid for 30 days from sign up. Offer not valid with any other offers, promotions or discounts.\nterms and conditions Submit \nIn signing up, I acknowledge that I am 18 years of age or older, want to receive email offers from Metro Diner and agree to the\n. *Offer sent via email to new e-club members and valid for 30 days from sign up.\nterms and conditions Don't ask me this again Menu Order Menu Waitlist Order Menu Order Menu Waitlist Order",
      "hash": "70aa3ab646c4",
      "downloadedAt": "2026-01-19T15:37:24.696Z",
      "trimmedAt": "2026-01-19T15:44:58.909Z",
      "sizeReduction": "97.1%"
    },
    {
      "url": "https://metrodiner.com/locations/south-carolina/",
      "text": "[Page Title: Restaurant Locations in South Carolina | Metro DinerFacebookInstagram]\n\nSkip to main content South Carolina \nWelcome to Metro Diner, your destination for heartwarming comfort food cooking in South Carolina. Our mission is to serve delicious, cozy meals and diner classics that make you feel right at home. Whether you’re in the mood for breakfast all day, a mouthwatering burger, or a classic meatloaf dinner,\nour menu has it all. \nFind our welcoming, family-friendly Indiana restaurants locations in Aiken, Anderson, Charleston (West Ashley), and Indian Land and experience the joy of homestyle cooking at Metro Diner. We look forward to serving you!\nView Full Menu \nSouth Carolina Diner Locations\n\nAiken\n\n1944 Whiskey RoadSuite 101Aiken, SC 29803\n+1 803-792-7808 View Details \nAnderson\n\n3401 Clemson BoulevardAnderson, SC 29621\n+1 864-428-7802 View Details \nCharleston - West Ashley\n\n1808 Sam Rittenberg BoulevardSuite 1Charleston, SC 29407\n+1 843-894-0202 View Details \nColumbia\n\n106 Percival Road Suite 400Columbia, SC 29206\n+1 803-632-0488 View Details \nIndian Land\n\n2077 Parkway DriveSte 101Indian Land, SC 29707\n+1 803-402-3173 View Details View All Locations \nMetro Diner South Carolina FAQs\nDoes Metro Diner in Indiana serve breakfast all day \nYes! Searching “Breakfast near me” or “Best Breakfast in South Carolina”? We offer Breakfast for Lunch? Breakfast for Dinner? We’ve got you covered.\nBreakfast all day! \ninclude our Bissell Breakfast, Biscuits & Sausage Gravy, Steak & Scramble Bowl, Belgian Waffle, Omelets, and more!\nLocal breakfast menu favorites View All-Day Menu What should I order at Metro Diner in SC? \nMetro Diner is known for reimagining old diner breakfast, brunch, lunch, and dinner classics, and turning them into new diner favorites.\n\nSignature dishes like our served with sweet and spicy syrup and house-made strawberry butter, and our , , are popular items available on  — making it place for breakfast, brunch, lunch dinner.\nFried Chicken and Waffles Iron City Meatloaf featured on Diners Drive-Ins and Dives Metro Diners’ bold and innovative menu the AND What did Guy Fieri eat at Metro Diner? \nWhen celebrity chef Guy Fieri visited our  in Jacksonville, FL, for an episode of “Diners, Drive-Ins, and Dives,” he ate number of hearty, over-the-top dishes including Yo Holla and Pittsburgh Steak Salad.\noriginal location \nOne of his favorites dishes? In fact, he exclaimed after trying it!\nThe Iron City Meatloaf. “Diners across the world have to take a lesson from this one” View Episode Is Metro Diner open on holidays? \nDiners in South Carolina are open for most holidays including Easter, Thanksgiving, Christmas Eve, New Year’s Eve, and New Year’s Day. We are closed Christmas Day. Even if we are open on a holiday (like 4th of July or Halloween), we may close early.\n\nPlease be sure to r\nconfirm holiday hours with your local Dine Does Metro Diner offer catering? \nYes! When we cater your breakfast, brunch, lunch or dinner event, there’s a flavor for everyone.  for your next corporate event, birthday party, client meeting, wedding or baby shower, tailgate, and more!\nOrder Metro Diner catering View our Catering Menu Open Modal First Name * Last Name * Your Home Location * Choose home location... Aiken Altamonte Springs Anderson Athens Augusta Bensalem Birmingham - Inverness Bradenton Brandon Brunswick Cape Coral Casselberry Charleston - West Ashley Charlotte - Pineville Chesapeake Columbia Columbus Concord Pike Daytona Beach Dothan Evansville Fayetteville Fredericksburg Gainesville Huntersville Huntsville (Airport Rd.) Indian Land Indianapolis - Clearwater Crossing (E 82nd St) Indianapolis - Greenwood Jacksonville (NC) Jacksonville - Mandarin Jacksonville - Orange Park Jacksonville - Ortega Jacksonville - Ponte Vedra Beach Jacksonville - San Marco Jacksonville - Southside Jacksonville Beach Knoxville Kissimmee - Hunters Creek Lakeland Langhorne - Oxford Valley Louisville - Jefferson Madison Matthews Mechanicsburg Melbourne Middletown Mishawaka Murfreesboro Newark Oklahoma City Oviedo Palm Coast Palm Harbor Plainfield Port Charlotte Raleigh Sarasota - Lockwood Savannah - Pooler St. Augustine St. Johns St. Petersburg Suffolk Tampa - South Tampa Terre Haute The Villages Trussville Tuscaloosa Venice Email * Phone * Date of Birth * Month Day Year \nIn signing up, I acknowledge that I am 18 years of age or older, want to receive email offers from Metro Diner and agree to the . *Offer sent via email to new e-club members and valid for 30 days from sign up. Offer not valid with any other offers, promotions or discounts.\nterms and conditions Submit \nIn signing up, I acknowledge that I am 18 years of age or older, want to receive email offers from Metro Diner and agree to the\n. *Offer sent via email to new e-club members and valid for 30 days from sign up.\nterms and conditions Don't ask me this again Menu Order Menu Waitlist Order Menu Order Menu Waitlist Order",
      "hash": "8fe08a7fdf90",
      "downloadedAt": "2026-01-19T15:37:28.528Z",
      "trimmedAt": "2026-01-19T15:44:58.925Z",
      "sizeReduction": "95.6%"
    },
    {
      "url": "https://metrodiner.com/locations/north-carolina/fayetteville/",
      "text": "[Page Title: Metro Diner Fayetteville, NC | Breakfast, Lunch & Dinner RestaurantFacebookInstagramFacebookInstagram]\n\nSkip to main content \nFayetteville\nMake My Location We're open\n\n Menus\n \n Menus \n\n All Menus\n Download Menu\n Gluten-Free Menu\n Catering Menu\n\n Order\n \n Order \n\n Takeout / Delivery\n Catering We're currently closed\n\n Get on the list\n Waitlist\n \n Menus\n Order \nMetro Diner is proud to offer a diverse menu that will please Fayetteville locals and visitors alike. Enjoy award-winning comfort food and diner classics, breakfast all day, and friendly service sure to make you feel right at home.\n\nFollow Us\nFacebook Instagram {{ location.address }}\n \n {{ location.locality }}, {{ location.region }} {{ location.postcode }} {{ location.address_2 }} Directions +1 910-493-3560 {{ getLongDay(days.name) }} {{ getHoliday(days.holiday) }} {{ locationFormatHours(days.hours) }} \nAt this location\nOnline Ordering Delivery Catering \nCurbside Pickup\n\nAlcohol Sold Here\n\nBreakfast All Day\n\nFree Wifi\n\nAntoinette Lomuscio\n\nManaging Partner\nMetro Diner Fayetteville, NC Restaurant Serving Comfort Food Classics for Breakfast, Brunch, Lunch & Dinner! \nIf you’ve got a hankering for Southern hospitality and comfort food done just right, Metro Diner Fayetteville has just what you’re looking for. You can’t go wrong with our or or our For instance, don’t miss our Fried Chicken & Waffles, Charleston Shrimp & Grits or Iron City Meatloaf (made famous by Guy Fieri on )! Our regulars swear by the Bissell Breakfast. This dish features two eggs cooked your way, mouthwatering bacon, golden toast, crisp hash browns or creamy grits, plus a short stack of fluffy pancakes and our house-made, strawberry butter!\naward-winning breakfast bold takes on American diner classics! Diners, Drive-Ins and Dives \nLocated down the street from Cross Creek Mall, Metro Diner Fayetteville is just 15 minutes from Fort Bragg and Fayetteville State University. It’s the perfect place to grab breakfast to-go before work or sit down for dinner after class. Stop in and fuel up for a Woodpeckers baseball game or a visit to the U.S. Army Airborne & Special Operations Museum.\n\nFayetteville is a city that prides itself on making everybody feel at home, no matter where they’re from. It’s a philosophy we share here at Metro Diner. Our Team is family, the table is a gathering place, and every is cooked with care.\nmouthwatering dish \nFavorites, offers & more!\n\nSign Up & Enjoy 50% Off\n\nWhen you join our E-Club, not only will you be the first to know about specials and promotions, you’ll also get exclusive access to offers and events—starting with 50% off your next entrée!*\n\nSign Up Today\n\nWhat Our Guests Are Saying\n\nAwesome food, great atmosphere, friendly staff, prices right. Will return again. Metro club and Philly cheesesteak were yummy!\n\nMelissa R.\n\nFayetteville, NC\n\nGreat little diner. Food was delicious as was the coffee. Hubby loved his \"fruity waffle\" and the hash browns were tasty!\n\nDanielle H.\n\nFayetteville, NC\n\nExcellent!! Great Chicken and Waffles. Spot on Sausage Gravy. Loved seeing military couples and families eating together. The staff was quick, friendly, informative, helpful and diverse.... 💙❤💚💜💛\n\nMaria D.\n\nFayetteville, NC\n\nChicken & waffles are to die for\n\nEsther R.\n\nFayetteville, NC\nJoin Our Team! \nWe are more than just a Team of people working together, we are a Family – and our Family is growing! Team Members enjoy access to insurance, paid vacations, meal benefits, and career growth.\nApply Today \nOther Locations\n\nRaleigh\n\n6325 Falls of Neuse Road#73Raleigh, NC 27615\n+1 919-578-9053 View Details \nHuntersville\n\n14211 Reese BoulevardHuntersville, NC 28078\n+1 704-912-1566 View Details \nMatthews\n\n10412 E. Independence BoulevardSuite 400Matthews, NC 28105\n+1 704-802-7871 View Details \nCharlotte - Pineville\n\n8334 Pineville-Matthews RoadSuite 110Charlotte, NC 28226\n+1 980-215-9961 View Details View All Locations Take in Fayetteville’s Gorgeous Natural and Historic Sights And the Best Comfort Food in Town! \nLovingly described as a “little big town” by its residents, Fayetteville is a bustling city with a small-town personality and deep historical roots. There’s something for everyone in the . And for a blast from the past, there’s the Poe House or the sight where Babe Ruth scored his first professional home run.\nCool Spring Downtown District \nOf course, if you’ve just had one of our generous portions of Fried Chicken & Waffles or Biscuits & Gravy, a stroll down the gorgeous Cape Fear River trail is probably in order. Or a nap. 😉\n\nHere’s a list of more local Fayetteville gems:\n\nZipQuest Waterfall and Treetop Park\nCape Fear Botanical Gardens \nGillis Hill Farm\n\nDavid McCune International Art Gallery\n\nThe Cape Fear Regional Theater\n\nVeterans Park\n\nThe Shops at 123 Hay Street\n\nMuseum of Cape Fear\n\nLake Rim Park\n\nNo matter what time of year you stop by, there’s always something to do! And no matter what time of day you visit Metro Diner, we’ve got something for everyone: mimosas and Bloody Mary’s, Omelets, Fish & Chips, , Chicken Pot Pie and more! Dinner for lunch? Lunch for breakfast? Breakfast for dinner? Why the heck not?!\nBurgers Best for Family Dining Mouthwatering Menu for the Whole Family \nThe little ones will love a trip to the , and they’ll for sure work up an appetite. Check out the sure to win over even the pickiest eaters. Kids can choose from Chicken Tenders, a short stack of Pancakes, Belgian Waffles, or a kid-sized portion of Chicken & Waffles. Plus, with all the picnic-worthy spots in Fayetteville, order a Metro Diner and enjoy our mouthwatering comfort food wherever you choose!\nFascinate-U Children’s Museum Metro Diner Kid’s Menu Family Meal to go Metro Diner Catering & Delivery Home Cooking Delivered Straight to Business Meetings & Catered Events \nIt’s just a fact, food makes gatherings better. But if you really want to impress your team, let us cook up a meal they won’t forget. Order Metro favorites for groups of 8 or more and wow them with our signature offerings! Choose from popular options like Fried Chicken, Breakfast Platter, Guy Fieri-approved Meatloaf and more!  Add a fresh salad and a few sides and you’ve got a – no matter what the occasion. Simply for easy pickup or delivery.\nparty order catering onlin e \nHave a smaller gathering in mind? Order online for easy pickup or get your meal delivered right to your door through our delivery partners: UberEats, DoorDash, and GrubHub.\nAll American Community Opening Doors and Giving Back \nThere’s a reason Fayetteville has won the National Civic League’s “All American City” award three times. This is a community where nobody is a stranger and people look after one another. Metro Diner fits right in and is proud to serve many different charities, including the Kids Peace Organization. On Tuesdays, we open our doors an hour early to host a Breakfast Club, where locals pop in and enjoy Metro Diner hospitality over coffee and breakfast. We welcome you to join us!\nAbout Metro Diner Serving the Best Breakfast, Brunch, Lunch and Dinner since 1992 \nOfficially opened in 1992, our original Metro Diner location in Jacksonville, Florida, quickly became go-to local restaurant for comforting classics and reimagined favorites.\nthe \nOver the years, we’ve continued to share our southern hospitality, big, bold flavors and passion for integrity, familiarity, comfort and community by bringing in new partners across the country.\n\nToday, Metro Diner has in 12 states. Our diners have earned a number of for our mouthwatering, home-style comfort food cooking including: Best Breakfast, Best Diner and Best Burger.\nover 60 locations awards \nWe welcome you to visit us and try our for yourself!\naward-winning food Learn more about Metro Diner Read More Open Modal First Name * Last Name * Your Home Location * Choose home location... Aiken Altamonte Springs Anderson Athens Augusta Bensalem Birmingham - Inverness Bradenton Brandon Brunswick Cape Coral Casselberry Charleston - West Ashley Charlotte - Pineville Chesapeake Columbia Columbus Concord Pike Daytona Beach Dothan Evansville Fayetteville Fredericksburg Gainesville Huntersville Huntsville (Airport Rd.) Indian Land Indianapolis - Clearwater Crossing (E 82nd St) Indianapolis - Greenwood Jacksonville (NC) Jacksonville - Mandarin Jacksonville - Orange Park Jacksonville - Ortega Jacksonville - Ponte Vedra Beach Jacksonville - San Marco Jacksonville - Southside Jacksonville Beach Knoxville Kissimmee - Hunters Creek Lakeland Langhorne - Oxford Valley Louisville - Jefferson Madison Matthews Mechanicsburg Melbourne Middletown Mishawaka Murfreesboro Newark Oklahoma City Oviedo Palm Coast Palm Harbor Plainfield Port Charlotte Raleigh Sarasota - Lockwood Savannah - Pooler St. Augustine St. Johns St. Petersburg Suffolk Tampa - South Tampa Terre Haute The Villages Trussville Tuscaloosa Venice Email * Phone * Date of Birth * Month Day Year \nIn signing up, I acknowledge that I am 18 years of age or older, want to receive email offers from Metro Diner and agree to the . *Offer sent via email to new e-club members and valid for 30 days from sign up. Offer not valid with any other offers, promotions or discounts.\nterms and conditions Submit \nIn signing up, I acknowledge that I am 18 years of age or older, want to receive email offers from Metro Diner and agree to the\n. *Offer sent via email to new e-club members and valid for 30 days from sign up.\nterms and conditions Don't ask me this again Menu Order Menu Order Menu Order Menu Waitlist Order",
      "hash": "bf2b8fd121c1",
      "downloadedAt": "2026-01-19T15:37:32.405Z",
      "trimmedAt": "2026-01-19T15:44:58.948Z",
      "sizeReduction": "92.8%"
    },
    {
      "url": "https://metrodiner.com/locations/georgia/savannah/",
      "text": "[Page Title: Metro Diner Savannah - Pooler, GA | Breakfast, Brunch, Lunch, DinnerFacebookInstagramFacebookInstagram]\n\nSkip to main content \nSavannah - Pooler\nMake My Location We're open\n\n Get on the list\n Waitlist\n \n Menus\n \n Menus \n\n All Menus\n Download Menu\n Gluten-Free Menu\n Catering Menu\n\n Order\n \n Order \n\n Takeout / Delivery\n Catering We're currently closed\n\n Get on the list\n Waitlist\n \n Menus\n Order \nMetro Diner Pooler – Savannah is a restaurant serving a menu filled with bold takes on American comfort food classics like Chicken & Waffles, Charleston Shrimp & Grits, and Biscuits & Sausage Gravy.\n\nFollow Us\nFacebook Instagram {{ location.address }}\n \n {{ location.locality }}, {{ location.region }} {{ location.postcode }} {{ location.address_2 }} Directions +1 912-228-5628 {{ getLongDay(days.name) }} {{ getHoliday(days.holiday) }} {{ locationFormatHours(days.hours) }} \nAt this location\nOnline Ordering Delivery Catering \nCurbside Pickup\n\nAlcohol Sold Here\n\nBreakfast All Day\n\nOutdoor Dining\n\nFree Wifi\n\nJimmy Powell\n\nManaging Partner\nMetro Diner Pooler – Savannah, GA Breakfast All Day, Lunch To Go, Homestyle Dinners and More! \nSavannah earns its nickname as the “hostess city” by working hard to make its residents and visitors feel right at home. Same goes for Metro Diner, where you can expect a friendly hello and generous helpings of homestyle, Dishes like our Fried Chicken & Waffle and famous Iron City Meatloaf (as featured on Guy Fieri’s ) –– the best comfort food cooking you can find outside of a Georgia grandma’s kitchen!\nmust-try signature items. Diner, Drive-ins and Dives \nLocated just off I95 and Pooler Parkway, next to the Tanger Outlets Savannah, Metro Diner Pooler is minutes from Savannah/Hilton Head International Airport, Crosswinds Golf Club, and Mighty Eight Air Force Museum. It’s also the perfect place to grab a bite to eat after a movie at Pooler Cinemas or before a trip to Savannah’s beautiful, historic district or the Savannah College of Art and Design (SCAD).\n\nIt’s not only our big, bold comfort food that’ll bring you to Metro Diner here in Pooler, it’s also the warm welcome you’ll receive. Whether you’re visiting for the first time or coming back for seconds, you are part of the Metro Diner family as soon as you join us for our !\naward-winning food \nFavorites, offers & more!\n\nSign Up & Enjoy 50% Off\n\nWhen you join our E-Club, not only will you be the first to know about specials and promotions, you’ll also get exclusive access to offers and events—starting with 50% off your next entrée!*\n\nSign Up Today\n\nDin(n)er Deals – starting at $10.99\n\nPick from seven craveable entrée combos — each comes with a choice of salad or soup and a drink. The only way to snag these deals is to dine with us after 3pm, so hurry in!\n\nLearn More\n\nWhat our guests are saying\n\nDo yourself a favor and stop here to eat. Best southern food I've ever had at a restaurant, which is saying a lot for living in the south my entire life. Phenomenal food, great environment, friendly servers.\n\nKayla B.\n\nPooler, GA\n\nAlways delicious! Get the chicken and waffles for sure\n\nDaniel A.\n\nPooler, GA\n\nI enjoyed the sausage gravy and biscuits with 2 biscuits, gravy, 2 eggs cooked to order, and hash browns, along with some good coffee. The wait staff was friendly. Plenty for this hungry person.\n\nDaniel F.\n\nPooler, GA\nJoin Our Team! \nWe are more than just a Team of people working together, we are a Family – and our Family is growing! Team Members enjoy access to insurance, paid vacations, meal benefits, and career growth.\nApply Now \nOther Locations\n\nCharleston - West Ashley\n\n1808 Sam Rittenberg BoulevardSuite 1Charleston, SC 29407\n+1 843-894-0202 View Details \nAugusta\n\n2820 Washington RoadAugusta, GA 30909\n+1 706-750-0520 View Details \nAiken\n\n1944 Whiskey RoadSuite 101Aiken, SC 29803\n+1 803-792-7808 View Details View All Locations Things to do in Savannah, the Hostess City With a Helping of Metro Diner’s Award-Winning Fare \nSavannah is exactly what you see when you imagine the South: prewar architecture painted in bright pastels and cobblestone streets lined with towering oak trees veiled in ghostly tendrils of Spanish Moss… so, whatever you do, have the camera ready.\n\nAll this beauty is best seen on foot, and with one of the largest National Historic Landmark Districts in the US, you’ll want to take your time here. Start with a stroll through , or you can cruise around on the 60-Minute Guided Segway History Tour of Savannah. As the oldest city in Georgia, Savannah loves its history and its ghosts. For a little of both, take the 90-Minute Savannah History & Haunts Candlelit Walking Ghost Tour.\nThe Savannah Historic District \nOnce you’ve gotten your bearings and seen a ghost or two, you’ll be ready for more. Here are some of our favorites:\n\nBonaventure Cemetery\n\nCathedral of St. John the Baptist\n\nHistoric River Street\n\nCongregation Mickve Israel\n\nAmerican Prohibition Museum\nWormsloe Historic Site \nOlde Pink House\n\nHistoric Savannah Theatre\n\nWith an itinerary like that, start or end your day by loading up on our delectable Chicken Pot Pie, Burgers, Chicken Tenders, Fish and Chips, or a crisp Chicken Tender Salad. Pro tip: it tends to get warm around here, so wash all that deliciousness down with ice-cold sweet tea or $3.39 mimosas. Cheers!\n\nFun fact: Savannah is the first “planned” city in the United States, and it was specifically designed to provide citizens with gorgeous natural spaces to gather. So, why not make it a Metro Picnic? Simply any time of day. Then, head to the lovely Forsythe Park, find one of those shady oak trees we mentioned earlier, and dig into a picnic-perfect delights like our double decker Metro Club sandwich and Belgian Waffles.\norder breakfast, lunch, or dinner to go Fun Trips for Kids and Kids-at-Heart And a Family Restaurant for the Whole Crew \nPooler is a quick car ride away from downtown Savannah with more incredible places to take the whole family. When you’re this close to the Atlantic Coast, a trip to the beach is in order and makes for the perfect day trip. Start at the Tybee Island Light Station & Museum and climb the 178 steps to the top of the lighthouse for some amazing views of the area. Then, if you’re not totally spent, rent some bikes and enjoy a ride on the beach and a dip in the Atlantic.\nTybee Island \nWhew – time to eat after all that! Three words: ! If your small fry doesn’t go for fish fry, they’ll surely love something on our – like the kid-sized Fried Chicken & Waffles topped with sweet strawberry butter and powdered sugar or ever-popular Macaroni & Cheese!\nFish Fry Friday Metro Diner Kids’ Menu \nDid you know you can also order ? Choose from a number of Metro Favorites in family size portions: Fried Chicken & Waffles, Iron City Meatloaf, Fried Chicken, Chicken Tenders, our traditional breakfast platter, and more! In fact, you can order any of our breakfast, lunch or dinner classics to go via or delivery.\nfamily-style meals to go pick-up \nHave something bigger in mind? ! We can help with business catering, graduation catering, corporate event catering and even wedding catering! Chicken & Waffles for a large group? We can help with that.\nMetro Diner offers Catering About Metro Diner Serving the Best Breakfast, Brunch, Lunch and Dinner since 1992 \nOfficially opened in 1992, our original Metro Diner location in Jacksonville, Florida, quickly became  go-to local restaurant for comforting classics and reimagined favorites.\nthe \nOver the years, we’ve continued to share our southern hospitality, big, bold flavors and passion for integrity, familiarity, comfort and community by bringing in new partners across the country.\n\nToday, Metro Diner has  in 12 states and has earned a number of  for our mouthwatering, home-style comfort food cooking including: Best Breakfast, Best Diner and Best Burger.\nover 60 locations awards \nWe welcome you to visit us and try our for yourself!\naward-winning food Learn more about Metro Diner Read More Open Modal First Name * Last Name * Your Home Location * Choose home location... Aiken Altamonte Springs Anderson Athens Augusta Bensalem Birmingham - Inverness Bradenton Brandon Brunswick Cape Coral Casselberry Charleston - West Ashley Charlotte - Pineville Chesapeake Columbia Columbus Concord Pike Daytona Beach Dothan Evansville Fayetteville Fredericksburg Gainesville Huntersville Huntsville (Airport Rd.) Indian Land Indianapolis - Clearwater Crossing (E 82nd St) Indianapolis - Greenwood Jacksonville (NC) Jacksonville - Mandarin Jacksonville - Orange Park Jacksonville - Ortega Jacksonville - Ponte Vedra Beach Jacksonville - San Marco Jacksonville - Southside Jacksonville Beach Knoxville Kissimmee - Hunters Creek Lakeland Langhorne - Oxford Valley Louisville - Jefferson Madison Matthews Mechanicsburg Melbourne Middletown Mishawaka Murfreesboro Newark Oklahoma City Oviedo Palm Coast Palm Harbor Plainfield Port Charlotte Raleigh Sarasota - Lockwood Savannah - Pooler St. Augustine St. Johns St. Petersburg Suffolk Tampa - South Tampa Terre Haute The Villages Trussville Tuscaloosa Venice Email * Phone * Date of Birth * Month Day Year \nIn signing up, I acknowledge that I am 18 years of age or older, want to receive email offers from Metro Diner and agree to the . *Offer sent via email to new e-club members and valid for 30 days from sign up. Offer not valid with any other offers, promotions or discounts.\nterms and conditions Submit \nIn signing up, I acknowledge that I am 18 years of age or older, want to receive email offers from Metro Diner and agree to the\n. *Offer sent via email to new e-club members and valid for 30 days from sign up.\nterms and conditions Don't ask me this again Menu Order Menu Waitlist Order Menu Order Menu Waitlist Order",
      "hash": "cc59bef79131",
      "downloadedAt": "2026-01-19T15:37:29.541Z",
      "trimmedAt": "2026-01-19T15:44:58.973Z",
      "sizeReduction": "92.6%"
    },
    {
      "url": "https://metrodiner.com/locations/south-carolina/aiken/",
      "text": "[Page Title: Metro Diner Aiken, SC 29803 | Breakfast, Lunch & Dinner RestaurantFacebookInstagramFacebookInstagram]\n\nSkip to main content \nAiken\nMake My Location We're open\n\n Menus\n \n Menus \n\n All Menus\n Download Menu\n Gluten-Free Menu\n Catering Menu\n\n Order\n \n Order \n\n Takeout / Delivery\n Catering We're currently closed\n\n Get on the list\n Waitlist\n \n Menus\n Order \nIf you’re in search of a restaurant known for the best breakfast in town and craveable comfort food, look no further than Metro Diner! Serving breakfast all day, lunch, and dinner.\n\nFollow Us\nFacebook Instagram {{ location.address }}\n \n {{ location.locality }}, {{ location.region }} {{ location.postcode }} {{ location.address_2 }} Directions +1 803-792-7808 {{ getLongDay(days.name) }} {{ getHoliday(days.holiday) }} {{ locationFormatHours(days.hours) }} \nAt this location\nOnline Ordering Delivery Catering \nCurbside Pickup\n\nAlcohol Sold Here\n\nBreakfast All Day\n\nFree Wifi\n\nBrandon Coker\n\nManaging Partner\n\nMetro Diner Aiken, SC\nAward-Winning Southern Comfort Food and Diner Classics \nIf you’re hungry for savory, home-style comfort food in the Aiken area, look no further than Metro Diner. Awarded the “Aiken’s Choice Award” by the our diner stays true to our humble roots with like Fried Chicken & Waffles and our famous Iron City Meatloaf (as featured on ).\nAiken Standard must-try signature items Guy Fieri’s Diner, Drive-ins and Dives \nLocated minutes from Eastgate Shopping Center and the Regal Aiken Mall, Metro Diner Aiken is the perfect place for breakfast, lunch or dinner. Fuel up before a sporting event at nearby University of South Carolina Aiken or after a picturesque stroll through the Hopelands Gardens.\n\nIt’s not only our that’ll bring you to Metro Diner here in the charming city of Aiken; it’s the warm, Metro Diner welcome guests receive the moment they walk through the door.  So, whether it’s your first time in or you’re a loyal regular, you’re part of the Metro Diner family the moment you have a seat at our table.\nbig, bold comfort food \nFavorites, offers & more!\n\nSign Up & Enjoy 50% Off\n\nWhen you join our E-Club, not only will you be the first to know about specials and promotions, you’ll also get exclusive access to offers and events—starting with 50% off your next entrée!*\n\nSign Up Today\n\nWhat Our Guests Are Saying\n\nOne of the best restaurants in Aiken! Never had a bad meal here. Food is always fresh and there’s a super friendly management and wait staff at this location, we always ask for Mark!! We love coming here!\n\nLori M.\n\nAiken, SC\n\nGood food and good service. Also has a pretty extensive gluten free menu if you need it.\n\nCarol B\n\nAiken, SC\n\nGreat atmosphere combined with great home style cooking is a win win! Don't pass this place up. If you haven't been, then go!\n\nSteve S.\n\nAiken, SC\n\nQuickly becoming one of my favorite placed to grab lunch. The service is almost always great and the food is wonderful. It's not even that pricey.\n\nShavonne P\n\nAiken, SC\n\nJoin Our Team! Apply Today\n\nWe are more than just a Team of people working together, we are a Family. We know when we take care of our Family, they will take care of Metro Diner.\nApply Now \nOther Locations\n\nAugusta\n\n2820 Washington RoadAugusta, GA 30909\n+1 706-750-0520 View Details \nSavannah - Pooler\n\n200 Tanger Outlets BoulevardSuite 200Pooler, GA 31322\n+1 912-228-5628 View Details \nCharleston - West Ashley\n\n1808 Sam Rittenberg BoulevardSuite 1Charleston, SC 29407\n+1 843-894-0202 View Details \nCharlotte - Pineville\n\n8334 Pineville-Matthews RoadSuite 110Charlotte, NC 28226\n+1 980-215-9961 View Details View All Locations Explore the Best Small Town in the South Fueled by the Best Southern Comfort Food in Town \nVoted “The Best Small Town in the South” by Aiken is the epitome of southern charm and hospitality. Known for its lush green spaces and fast horses, Aiken offers the perfect balance of history, outdoor fun, and sports. First things first, pay a visit to the Thoroughbred Racing Hall of Fame and Museum, where you’ll learn about the sport and Aiken’s important place in it. History buffs will have plenty of things to scratch off their bucket lists and the Battle of Aiken Reenactment should be at the top. Of course, you can’t go wrong by renting some bikes or hiking through any of our gorgeous local parks.\nSouthern Living, \nA few more stops to include on your Aiken adventures:\n\nHitchcock Woods\n\nAiken State Park\n\nAiken Center for the Arts\n\nAiken Steeplechase\n\nBoyd Pond Park\nDupont Planetarium- Aiken South Carolina \nCarolina Bay Nature Preserve\n\nBattle of Aiken Reenactment\n\nPalmetto Golf Club\n\nAiken 2 Escape\n\nStop by our diner on Whiskey Road before or after your adventures to fill up on like Biscuits & Sausage Gravy, Fried Chicken & Waffles with sweet strawberry butter, , Fish & Chips, a double decker Metro Club, biscuit-topped Chicken Pot Pie, and !\nmenu classics Classic Burgers so much more Family-Friendly Aiken And a Menu with Something for Everyone \nLooking for family-friendly activities while you’re in horse country? Spend the day on a horse, of course! Area horse tours let you explore gorgeous local trails with an experienced guide while your noble steed does all the walking. Win-win!\n\nThere are also plenty of museums and parks that your whole crew will love. Boyd Pond Park is lovely, and the has great walking trails and a splash pad— perfect for cooling off on a South Carolina summer day.\nCitizens Park Sprayground \nOnce the fam has worked up an appetite, you’ll find that the has something for everyone – including breakfast all day! For kids under 12, check out the Metro Diner Kids’ Menu with smaller portions of our guest favorites like Fried Chicken & Waffles, Chicken Tenders, Macaroni & Cheese, and plenty more staples to please even your pickiest eaters!\nMetro Diner Menu \nOrder Metro Diner breakfast, lunch or dinner favorites or contactless . Just order online, grab your grub, and make it a Metro Diner family picnic! Simply delicious!\nto go via pick-up delivery \nPlanning an event or business meeting? ! We offer provides business catering, graduation catering, corporate event catering and even wedding catering! Guests will cheer. Bosses will be proud. Bellies will be happy. Such is the magic of Metro Diner’s Southern comfort food with flair.\nMetro Diner caters About Metro Diner Serving the Best Breakfast, Brunch, Lunch and Dinner since 1992 \nOfficially opened in 1992, our original Metro Diner location in Jacksonville, Florida, quickly became go-to local restaurant for comforting classics and reimagined favorites.\nthe \nOver the years, we’ve continued to share our southern hospitality, big, bold flavors and passion for integrity, familiarity, comfort and community by bringing in new partners across the country.  Today, Metro Diner has in 12 states and has earned a number of for our mouthwatering, home-style comfort food cooking including: Best Breakfast, Best Diner and Best Burger.\nover 60 locations awards \nWe welcome you to visit us and try our award-winning food for yourself!\nLearn more about Metro Diner. Read More Open Modal First Name * Last Name * Your Home Location * Choose home location... Aiken Altamonte Springs Anderson Athens Augusta Bensalem Birmingham - Inverness Bradenton Brandon Brunswick Cape Coral Casselberry Charleston - West Ashley Charlotte - Pineville Chesapeake Columbia Columbus Concord Pike Daytona Beach Dothan Evansville Fayetteville Fredericksburg Gainesville Huntersville Huntsville (Airport Rd.) Indian Land Indianapolis - Clearwater Crossing (E 82nd St) Indianapolis - Greenwood Jacksonville (NC) Jacksonville - Mandarin Jacksonville - Orange Park Jacksonville - Ortega Jacksonville - Ponte Vedra Beach Jacksonville - San Marco Jacksonville - Southside Jacksonville Beach Knoxville Kissimmee - Hunters Creek Lakeland Langhorne - Oxford Valley Louisville - Jefferson Madison Matthews Mechanicsburg Melbourne Middletown Mishawaka Murfreesboro Newark Oklahoma City Oviedo Palm Coast Palm Harbor Plainfield Port Charlotte Raleigh Sarasota - Lockwood Savannah - Pooler St. Augustine St. Johns St. Petersburg Suffolk Tampa - South Tampa Terre Haute The Villages Trussville Tuscaloosa Venice Email * Phone * Date of Birth * Month Day Year \nIn signing up, I acknowledge that I am 18 years of age or older, want to receive email offers from Metro Diner and agree to the . *Offer sent via email to new e-club members and valid for 30 days from sign up. Offer not valid with any other offers, promotions or discounts.\nterms and conditions Submit \nIn signing up, I acknowledge that I am 18 years of age or older, want to receive email offers from Metro Diner and agree to the\n. *Offer sent via email to new e-club members and valid for 30 days from sign up.\nterms and conditions Don't ask me this again Menu Order Menu Order Menu Order Menu Waitlist Order",
      "hash": "d9fbcc97f624",
      "downloadedAt": "2026-01-19T15:37:30.800Z",
      "trimmedAt": "2026-01-19T15:44:58.997Z",
      "sizeReduction": "93.3%"
    }
  ],
  "sizeReduction": "95.1%"
}