{
  "venueId": "ChIJpwlg9ptv_ogRh-HXGewL2hg",
  "venueName": "Beech",
  "venueArea": "Daniel Island",
  "website": "https://www.beechrestaurants.com/",
  "scrapedAt": "2026-01-19T15:42:05.197Z",
  "trimmedAt": "2026-01-19T15:49:49.603Z",
  "pages": [
    {
      "url": "https://www.beechrestaurants.com/",
      "text": "[Page Title: Order Now at Beech Restaurants | Best Acai and Poke Bowls in Charleston, SC | Healthy Eating Made Easy]\n\ntop of page Taking the guesswork out of eating healthy™ bottom of page",
      "hash": "3e87d44f72b1",
      "downloadedAt": "2026-01-19T15:26:24.126Z",
      "trimmedAt": "2026-01-19T15:49:49.391Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "https://www.beechrestaurants.com/beechmenu",
      "text": "[Page Title: Beech Restaurants Main Menu | Poke | Acai | Smoothies | Fresh Juice | Toast]\n\ntop of page Our Coffee Menu Our Menu Beech Restaurants Main Menu Acai Our Acai & Granola Is 100% Organic & Gluten Free Beech Bowl Acai, Granola, Banana,\nStrawberry, Blueberry, Pineapple,\nRaw Honey $13.50 B.A.B Bowl Acai, Granola, Banana, Almond Butter, Strawberry, Raspberry, Hemp Seeds,\nRaw Honey $13.50 Delecta Bowl Acai, Granola, Mango, Strawberry,\nPineapple, Chia Seeds, Goji Berry,\nRaw Honey $13.50 Patriot Bowl Acai, Granola, Banana,\nStrawberry, Blueberry, Cacao Nibs,\nRaw Honey $13.50 PBNA Bowl Acai, Granola, Peanut Butter,\nStrawberry, Banana,\nRaw Honey $13.50 Nutella Bowl Acai, Nutella, Granola, Banana, Strawberry, Blueberry, Coconut Flakes, Raw Honey $13.50 Coco- Cashew 100% Organic and Gluten Free Acai and Granola, House Made Cashew Butter, Banana, Blueberry, Cacao Nibs, Coconut Flakes, Raw Honey Drizzle (Not Available At Our Cafe Location) $13.50 Poke Bowls (Now Available Inside Our Cafe On East Bay Street) Hawaiin Syle Bowl Edamame, Furikake, Scallions, Sesame Seeds, Macadamia Nuts, Pineapple, Ginger Dressing $13.50 Sweet Fire Bowl Seaweed Salad, Pineapple, Pickled Red Onion, Pickled Jalapeno, Chili Flakes, Spicy Mayo $13.50 Original O.G. Bowl Avocado, Pickled Cucumber, Scallion, Sesame Seeds, Spicy Mayo $13.50 Chicken Bowl Hot and Sour Chicken, White Rice, Scallions, Sesame Seed $13.50 Smoothies Sperry Berry Strawberry, Raspberry, Blueberry, Acai, Banana, Coconut Water $9.75 Avie Monkey Almond Milk, Peanut Butter, Dates, Ginger, Cinnamon, Banana, Cacao Nib $9.75 Green One Spinach, Apple, Pineapple, Banana, Basil,\nCoconut Water $9.75 Basil Sunshine Pineapple, Mango, Basil, Lemon, Coconut Water, Agave $9.75 Cold Pressed Juice Only available for purchase as prepped and displayed. Beech Juice Carrot, Apple, Ginger, Orange, Celery, Lemon $9.25 Dawn Patrol Pineapple, Apple, Mint $9.25 Dreaming Green Spinach, Apple, Pineapple, Lemon, Orange $9.25 The Goods Spinach, Cucumber, Lemon, Apple, Celery, Ginger $9.25 Toasts & Bagels Toasted Bagels Options Of Cream Cheese Or Vegan Butter $3.75 Nutty Danner PEANUT BUTTER,\n\nBANANA, \nHONEY\nALL PUT TOGETHER ON A TOASTED PLAIN BAGEL $5.50 Nutella Toast NUTELLA,\nSTRAWBERRY,\nHEMP SEEDS\nALL PUT TOGETHER ON A SLICE OF WHITE SOURDOUGH BREAD $5.50 Avocado Toast AVOCADO,\nOLIVE OIL,\nSALT,\nCHILI FLAKES,\nHEMP SEEDS \nON A SLICE OF WHITE SOURDOUGH BREAD,\nLEMON $7.50 Specials bottom of page",
      "hash": "44c78acb251d",
      "downloadedAt": "2026-01-19T15:26:24.275Z",
      "trimmedAt": "2026-01-19T15:49:49.494Z",
      "sizeReduction": "99.8%"
    },
    {
      "url": "https://www.beechrestaurants.com/acaibowls",
      "text": "[Page Title: Acai Menu | Beech Restaurants | Charleston | Mount Pleasant | James Island]\n\ntop of page Açaí fruit, the purple berry... why should you eat some? Açaí is rich in antioxidants like anthocyanins, helping to boost your immune system. Also Contains Vitamin A and Packed Full Of Healthy Omegas. ​​​ Proudly Serving 100% Organic & Gluten Free Acai Acai Bowls Beech Bowl ​Acai, Granola, Banana,\nStrawberry, Blueberry, Pineapple, Raw Honey B.A.B Bowl ​Acai, Granola, Banana, Almond Butter, Strawberry, Raspberry, Hemp Seeds,\nRaw Honey PB&A Bowl ​Acai, Granola, Banana, Strawberry, Peanut Butter, Raw Honey Delecta Bowl ​Acai, Granola, Pineapple, Strawberry, Mango, Goji Berry, Chia, Raw Hone y Nutella Bowl ​Acai, Granola, Banana, Nutella, Strawberry, Bluberry, Coconut Flakes, Raw Honey Patriot Bowl ​Acai, Granola, Banana,  Strawberry, Blueberry, Cacao Nibs ,Raw Honey Coco- Cashew Bowl ​Acai, Granola,\nCashew Butter, Banana, Blueberry, Cacao Nibs, Coconut Flakes,\nRaw Honey Kids Acai Cup ​Acai, Granola, Banana, Strawberry, Raw Honey bottom of page",
      "hash": "c709b58946a4",
      "downloadedAt": "2026-01-19T15:26:24.861Z",
      "trimmedAt": "2026-01-19T15:49:49.560Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "https://www.beechrestaurants.com/beechlocations",
      "text": "[Page Title: Discover Acai and Poke at Beech Restaurants | Charleston, SC]\n\ntop of page King Street Location 315 King Street Charleston , SC 29401 (843) 212-5414 ​ James Island, SC 1739 Maybank Highway Unit M Charleston, SC 29412 (843)-501-7192 Cafe & Marketplace East Bay Street 475 E Bay St Charleston, SC 29403 (843)-974-4048 Beech Shack- Mt. Pleasant, SC 1973 Riviera Drive Suite 2 Mount Pleasant, SC 29464 (843)-352-9393 Daniel Island, SC 864 Island Park Drive Charleston, SC 29492 (843) 800-5755 Coming Soon Coming Soon! Coming Soon! Coming Soon! bottom of page",
      "hash": "dcf648108800",
      "downloadedAt": "2026-01-19T15:26:25.448Z",
      "trimmedAt": "2026-01-19T15:49:49.603Z",
      "sizeReduction": "99.9%"
    }
  ],
  "sizeReduction": "99.9%"
}