{
  "venueId": "ChIJFWporFFj_ogRLyTANosvG2c",
  "venueName": "Big Billy's Burger Joint",
  "venueArea": "North Charleston",
  "website": "https://www.bigbillysburgerjoint.com/",
  "scrapedAt": "2026-01-19T15:41:56.363Z",
  "trimmedAt": "2026-01-19T15:43:05.841Z",
  "pages": [
    {
      "url": "https://www.bigbillysburgerjoint.com/",
      "text": "[Page Title: Big Billy's Burger Joint in North Charleston Tanger]\n\nPREMIUM MEATS AND WILD GAME BURGERS Our Menu SHAKE IT UP WITH OUR DELICIOUS HAND-SPUN MILKSHAKES VIEW OUR DELICIOUS HAND-SPUN MILKSHAKES DRINKS FOR ADULT SURFERS VIEW OUR ALCOHOL-INFUSED DELICIOUSNESS \nA GREAT REASON TO GO WILD EACH DAY OF THE WEEK\n\nWE PROUDLY FEATURE NATURAL, FREE RANGE, GRASS-FED AND WILD GAME BURGERS – 100% ANTIBIOTIC & HORMONE FREE.\nPart of what sets Big Billy’s Burger Joint apart is our versatility. We proudly feature different special burger meat of the day, every day, a phenomenon that we refer to as our “Wild Game” burgers. Each of our daily burger specials shares a few things in common, though- they’re natural, free-range, grass-fed, and wild-game burgers- 100% antibiotic and free of hormones. Check out our menu to see what the special is today! \nWould you like to bring the beach vibe and delectable food of our Big Billy’s dream into your home? Now you can place an order online, using either Doordash or UberEats.\nORDER ONLINE \nOUR CUSTOMERS ARE OUR DREAM\n\nOur founders Greg and Ellen Leonard have always shared a unique dream. That dream was to have a restaurant near the ocean for beachgoers to frequent during their lunch breaks. After all, at some point amidst a long day of soaking up the sun’s rays and splashing around in the pristine water of the Atlantic Ocean, people need to supply themselves with nourishment. Thus, Big Billy’s Burger Joint was founded, and the shared dream of Greg and Ellen Leonard was turned into a reality.\n\nWhen you walk through the front doors of Big Billy’s Burger Joint, you aren’t setting foot inside just another restaurant. You’re setting foot inside a restaurant that our owners have always yearned to own. Our customers aren’t merely customers to us, they are the lifeblood that keeps our dream afloat. When we prepare one of our sensational entrées, it’s prepared with the inherent realization that we are living our dream. Conversely, when you enjoy one of our sensational entrées, you are experiencing a part of something our owners have dreamed about for years.\n\nNowhere else will you sink your teeth into a meal that was prepared by people who have made it their mission in life to see you happily enjoying that meal. Nowhere else will be on the receiving end of customer service from people who are so genuinely thrilled to see your satisfaction. Nowhere else can you get the overall experience that you will get at Big Billy’s Burger Joint.\nOUR MENU \nSEE WHAT’S COOKING AT BIG BILLY’S!\nFollow Follow Follow \nWhat’s on tap at Big Billy’s\n\nWe offer a variety of local and national beers based on the season. Give us a call to find out what’s on tap today.\n\nWe often feature Holy City, Commonhouse Aleworks, Frothy Beard, and Cooper River Brewing.\nCatering \nWe deliver major meals for major occasions! Are you planning a large business conference, event, or seminar? Are you looking for just the right restaurant to cater your wedding, birthday party, or family reunion? Big Billy’s Burger Joint can do that! Check out our catering page to learn more.\nLearn More \nFIND US\n\nWould you like to get in touch with our team at Big Billy’s Burger Joint? Feel free to reach out, and we’ll address your questions and comments as quickly as possible.\n\n5070 International BlvdNorth Charleston, SC 29418\nFIND US",
      "hash": "4850aafc923b",
      "downloadedAt": "2026-01-19T15:33:19.727Z",
      "trimmedAt": "2026-01-19T15:43:05.688Z",
      "sizeReduction": "99.2%"
    },
    {
      "url": "https://www.bigbillysburgerjoint.com/specials/",
      "text": "[Page Title: Specials | Big Billy's Burger Joint]\n\nSpecials\n\nYou’ve probably eaten pig meat before, but we’ll bet you’ve never eaten pig meat like our wild boar!\n\nTaste the meat of the reptiles from the swamps of Florida and Louisiana with our special alligator entrée!\n\nBison are extremely high in protein, and boy does they sure taste delicious! That’s why we couldn’t help but offer bison as our wild-game burger not just once, but twice a week!\n\nThe ultimate exotic meat experience. What might we be cooking up today? Whatever it is, we can assure you it’s delicious! Ask your server about what the owner’s choice specialty is this week!\n\nAs promised, we can’t limit our preparation of this spectacular treat to just once a week, so we offer bison as a daily special on Fridays, too!\n\nOn top of being rich with flavor, venison contains very little saturated fat, which means that it’s one of those meals that will make your heart happy!\n\nTreat yourself to a true taste of the forest with our Sunday special. Our elk-based entrées are so fresh and delectable that you won’t be able to help but feel like you were there when it was captured!\n\nMAIN MENU\nNot feeling like going wild today? Not a problem, maybe some other day- and in the meanwhile, we’re certainly one of our more traditional menu options will hit the spot for you. Check out our main menu page and see what looks good to you today! VIEW MENU \nWhat’s on tap at Big Billy’s\n\nTerrapin ‘Los Bravos’Wicked Weed Pernicious IPAGolden Road Mango CartSweetwater ‘Hazy 710’ Pale AleFrothy Beard ‘Tides of Galinay’ RedSteel Hands Hazy IPABudlightNew Belgium ‘Citrus Rescue’ IPA\n\nWe take care of those who take care of us\n\nPerhaps there’s no better way to thank those who serve our country than by giving them discounts on their delicious meals. Show us your military ID, and 10% of your bill is on the house. It’s our way of saying thank you for defending our country.\nCatering \nWe deliver major meals for major occasions! Are you planning a large business conference, event, or seminar? Are you looking for just the right restaurant to cater your wedding, birthday party, or family reunion? Big Billy’s Burger Joint can do that! Check out our catering page to learn more.\nLearn More",
      "hash": "5f32d425b89e",
      "downloadedAt": "2026-01-19T15:33:20.608Z",
      "trimmedAt": "2026-01-19T15:43:05.711Z",
      "sizeReduction": "99.5%"
    },
    {
      "url": "https://www.bigbillysburgerjoint.com/menu",
      "text": "[Page Title: Big Billy's Menu | Local Charleston Restaurant]\n\nMENU\n\nMENU\n\nMENU\n\nBEACH BUM APPS\nStart your beach experience off right with some of the best appetizers you’ll ever sink your teeth into. \nFried Green Tomatoes and Fried Green beans\n\nFive fresh battered green tomatoes and a basket of Green Beans with a side of Pimento cheese and Chipotle Ranch Dressing for dipping. 10.99\n\nBIG BILLY’S FRIES\n\nDouble order of fries topped with house made queso, cheddar and jack cheese and bacon. Served with Ranch and our Billy’s sauce. 9.95Top it with fried or grilled chicken add $4.00\n\nBuffalo chicken dip\n\nServed hot with garlic bread and chips for dipping. 12.50\n\nBIG BILLY’S LOADED NACHOS\n\nA boatload of tortilla chips overloaded with house-made chili, queso, cheddar and Jack cheese, jalapeños, fresh pico and sour cream 11.99Add Guacamole 1.99 | Add Beef or Chicken 4.99\n\nFamous fried pickles\n\nHouse-made pickles, lightly breaded and served with honey horseradish sauce! 9.99\n\nJALAPENO POPPERS\n\nJalapeno poppers filled with cream cheese served with sweet chili sauce and ranch dressing. 10.99\n\nBilly’s Best-Ever Onion Rings\n\nA crazy big portion of hand-cut, hand-breaded, sweet onion rings served like you’ve never seen before and accompanied by our Big Billy’s sauce. 10.99\n\nWings your way\n\nEight jumbo chicken wings in your choice of: mild, hot, dryranch, island jerk, teriyaki, lemon pepper, sweet chili, garlic parmesan,kicken bourbon, or BBQ. Served with celery sticks and either bleucheese or ranch dressing. (8) 13.99 / (12) 16.99\n{ \nA must stop for burgers and milkshake lovers.\n{ \nSausage/Dogs\n\nDog On the Beach\n\nA jumbo, quarter-pound, all-beef hot dog, served on a fresh baked hoagie bun. Make this dog bark and build your own! 11.99\nBilly suggests adding chili, queso, and red onions for an additional charge. \nBilly’s Burger Favorites\nWe are, after all, a burger joint! And as such, we’ve got plenty of delicious burger options for you to fill up on. From Patty Melts to Mac & Cheese Burgers and everything in between, you can’t go wrong with any of our Big Billy’s signature burgers. SERVED WITH HOUSE PICKLES AND YOUR CHOICE OF FRIES, HOUSE-MADE KETTLE CHIPS, TOTS OR COLESLAW Sweet Potato Fries or Fried Pickles 1.99 UPGRADE TO A PREMIUM SIDE: Onion Rings, Steamed Broccoli, Side Salad 2.99 \nBREAKFAST BURGER\n\nServed with a fried egg, Applewood smoked bacon, grilled black forest ham, hash browns, and American cheese. G’Day! 15.99Did someone say Bloody Mary? Billy did!\n\nCLASSIC CHEESEBURGER\n\nServed with your choice of cheese, green leaf lettuce, tomato, sliced red onion, and dill pickles. Simply wonderful! 14.25\n\nBACON X3 BURGER\n\nServed with bacon on top, bacon below, and topped with our own bacon mayo. Served with choice of cheese, lettuce, and tomato. Dreams do come true! 15.25\n\nNew! Heart Stopper\n\nOur house-ground burger topped with sharp cheddar, provolone and swiss cheese, egg, bacon, and ham! 15.99\n\nMAC & CHEESE BURGER\n\nTopped with American cheese, fried mac & cheese, bacon, and queso. 15.99\n\nChILI BURGER\n\nTopped with chili, American cheese, mustard, and house-fried kettle chips piled high! Get smashing! 15.25\n\nNew! Fiesta Burger\n\nTopped with pepper jack cheese, house-made pico de gallo, nacho strips, and queso cheese 14.99\n\nBILLY’S PATTY MELT\n\nFresh, hand ground beef with sautéed onions, Swiss cheese, and garlic mayo on marble rye 15.25\n\nNew! Western\n\nOur house ground burger topped with a hand breaded onion ring, lettuce tomato, and BBQ sauce 14.99\n\nNew! Southern Fried\n\nTopped with lettuce, a fried green tomato, house-made pimento cheese, and bacon 14.99\n\nNew! Belt Buster\n\nA double burger topped with your choice of cheese with a grilled cheese in the middle with lettuce tomato and onions. 18.99 Ask about our Belt Buster Challenge!\n\nBuild Your Own\nGet creative and build your own burger! We’ve got beef, grilled chicken breasts, turkey burgers, and more! SERVED WITH HOUSE PICKLES AND YOUR CHOICE OF FRIES, HOUSE-MADE KETTLE CHIPS, TOTS OR COLESLAW Sweet Potato Fries or Fried Pickles 1.99 UPGRADE TO A PREMIUM SIDE: Onion Rings, Steamed Broccoli, Side Salad 2.99 FRESH, IN HOUSE GROUND BEEF \n14.99\n\nTODAY’S “BURGERS GONE WILD” SELECTION\nmarket price \nGRILLED, MARINATED CHICKEN BREAST\n\n13.99\n\nTURKEY BURGER\n\n13.25\n\nBLACK BEAN BURGER\n\n13.25\n\nCheese\n1.99 \nAmerican | Sharp Cheddar | Provolone | Swiss | Pepper Jack | Bleu Cheese | Pimento  |  Queso | Smoked Gouda | Brie | Feta\n\nTo bun or not to bun\n\nSweet Artisan Bun | Lettuce Wrap | Gluten-free bun (add 2.99)\n\nTop it off on billy\nComplete your meal with the condiments or toppings that taste best to you! \nGreen Leaf Lettuce | Pickles | Red Onion | Tomato\n\nBig Billy’s Sauce | House-made Ketchup | Honey Horseradish | BBQ Sauce\nGET SAUCY \nHoney Mustard | Dijon Mustard | House-made Mustard\nMUSTARD \nMayo | Bacon Mayo | Chipotle Mayo | Roasted Garlic Mayo\nMAYO \nRanch | Chipotle Ranch\nDRESS IT UP Raise The Stakes Take your burger-eating experience to the next level. \n1.99 EACH\n\nRelish | Caramelized Onions | Coleslaw | Grilled Mushrooms | Grilled Pineapple | Pico de Gallo | Jalepeńos\n\n2.99 EACH\n\nBlack Forest Ham | Applewood Smoked Bacon | Guacamole | Chili | Fried Egg | Sliced Avocado\nCooked Right \nRARE\n\nCold Red Center\n\nMEDIUM RARE\n\nCool Red Center\n\nMEDIUM\n\nWarm Red Center\n\nMEDIUM WELL\n\nWarm Pink Center\n\nWELL\n\nCooked Throughout\n\nAll hands on deck\nNot feeling like a burger today? SERVED WITH HOUSE PICKLES AND YOUR CHOICE OF FRIES, HOUSE-MADE KETTLE CHIPS, TOTS, OR COLESLAW UPGRADE TO A PREMIUM SIDE: Sweet Potato Fries or Fried Pickles 1.99 Onion Rings, Steamed Broccoli, Side Salad 2.99 \nMAHI MAHI BEACH BURRITO\n\nMahi mahi, grilled with fajita spice, rolled with chipotle aioli, shredded cabbage, mango jalapeño salsa, black beans, cheddar and Jack cheese, allon a grilled soft flour tortilla as only Big Billy can do! 14.99\n\nFRIED CHICKEN PIMENTO BLT\n\nFried chicken topped with housemade pimento cheese, lettuce,tomato and crisp bacon 14.99\n\nSAIL AWAY SALMON BLT\n\nFillet of Atlantic salmon grilled and served on toasted sourdough bread with fresh tomatoes, Applewood smoked bacon, green leaf lettuce and roasted garlic mayo 15.99 Try it blackened with an ice-cold Pale Ale!\n\nCHICKEN CLUB WRAP\n\nA grilled chicken breast served in a flour tortilla with garlic mayo, shredded cheddar and jack, black forest ham, Applewood smoked bacon, green leaf lettuce, and tomato 14.50\n\nBILLY’S CORNED BEEF REUBEN\n\nSliced house corned beef, swiss cheese with sauerkraut and house-made dressing on marbled rye. 14.99\n\nBIG BILLY’S GRILLED 3-CHEESE & BACON\n\nSharp cheddar, smoked Gouda and Brie all accompanied by Applewood smoked bacon, sliced tomato and garlic mayo, grilled on fresh baked sourdough 14.99Add fresh, hand ground beef 4.50\n\nNew! Chicken Tender Platter\n\n3 chicken tenders served with a side of coleslaw and choice of side and honey mustard. 14.99\n\nBilly’s GONE GREEN\n\nCOZUMEL SALAD\n\nMixed greens with guacamole, sour cream, roasted corn, shreddedcheddar and Jack cheese, tortilla chips, and pico de gallo with chipotle ranch dressing. 12.75Black Bean 13.99 | Fresh, hand-ground beef 15.99\n\nFARMER’S MARKET SALAD WITH SALMON\n\nBaby spinach topped withstrawberries, sliced apples, mango,toasted coconut, Mandarin oranges,candied pecans and feta cheeseserved with our own raspberrybalsamic vinaigrette 15.50\n\n-Try it blackened with a specialty handmade shake!\n\nGREEK ISLANDS SALAD\n\nChopped romaine lettuce with diced tomatoes, red onions,black olives, cucumbers, pepperoncini peppers, feta cheese and Greek vinaigrette 12.99 • Add Chicken 14.99\n\nMALIBU SALAD\n\nMixed greens with diced tomatoes, red onions, cucumbers, shredded cheese and croutons 12.99Add Salmon 15.99 / Chicken 14.99 / Mahi 13.99\n\nSURFIN’ CAESAR SALAD\n\nChopped romaine lettuce tossed with Caesar dressing, Parmesan cheese and herb croutons 11.99\n\nWith Chicken 13.99 -Try it blackened with a cold IPA!\n\nshake it up\n\nBEGINNERS – 5.75CHOCOLATE | VANILLA | STRAWBERRY\n\nADVANCED – 6.75\n\nOH! OREO!\n\nVanilla ice cream, Oreo cookies, and more Oreo cookies.\n\nSTRAWBERRY SHORTCAKE\n\nVanilla ice cream, fresh strawberries, strawberry syrup, and shortcake.\n\nCHOCOPEANUTBUTTER BROWNIE\n\nVanilla ice cream, peanut butter, chocolate syrup, and brownie chunks.\n\nCAMPFIRE S’MORES\n\nVanilla ice cream, chocolate syrup, toasted marshmallows, and graham crackers.\n\nCOOKIE MONSTER\n\nChip Ahoy cookies, vanilla ice cream, caramel, and chocolate!\n\nSALTED CARMEL TOFFEE\nSalted Caramel, Crushed Toffee Pieces, Vanilla Ice Cream. \nBANANA PUDDING\nBanana Pure, Crumbled vanilla Wafers, Vanilla Ice Cream. \nBUTTER PECAN\nCrushed Pecan Pieces, Butter Pecan Flavor, Vanilla Ice Cream. \nADULT SURFERS ONLY – 8.75\n(alcohol-infused deliciousness!) \nMIND TRICK\n\nBailey’s, Captain Morgan, Kahlua and Amaretto blended with vanilla ice cream.\n\nVANILLA CARAMEL SWIRL\n\nCrown Royal Vanilla blended with vanilla ice cream and caramel.\n\nAPPLE PIE\n\nCrown Royal Regal Apple blended with vanilla ice cream and caramel.\n\nMUDSLIDE BILL\n\nBailey’s, Frangelico, Kahlua blended with vanilla ice cream and chocolate syrup.\n\nCHOCOLATE PB CUP\n\nScrewball whiskey, crème De Cocoa and crushed PB cup pieces.\n\nCHOCOLATE MINT COOKIE MANIA\n\nBailey’s, Crème de Menthe and Crème de Cacao, mint cookies, blended with vanilla ice cream.\n\nBANANA SPLAT\n\nCaptain Morgan Coconut Rum, Banana Liqueur and Crème de Cacao blended with vanilla ice cream. Topped with whipped cream and nutmeg.\n\nLOOPY FRUIT\nThree Olives Loopy Vodka, Fruity Pebble Cereal Pieces, Vanilla Ice Cream \nCocktails\n\nSPECIALTY COCKTAILS\n\nSPIKED TEA\nLocally Distilled Sweet Tea Vodka, Peach Schnapps, Unsweetened Tea, Splash of Lemonade. \nCHARLESTON MARY\nCharleston Bold and Spicy Bloody Mary Mix, Dixie Black Pepper Vodka garnished with pepper, celery, and bacon. \nBIG BILLY’S MAI TAI\nAdmiral Nelson’s Coconut Rum and Admiral Nelson’s Pineapple Rum mixed with fresh fruit juices topped with a Captain Morgan Black Rum Floater. \nPINEAPPLE JALAPENO MARGARITA\nJose Cuervo Tequila, pineapple juice, Jalapeño Infusion, fresh pineapple, fresh lime, and triple sec \nHURRICANE\nAdmiral Nelson’s Rum and Captain Morgan Black Rum mixed with fresh lime, orange juice, peach schnapps, and grenadine. \nPEACH ON THE BEACH\nCrown Royal Peach, Cranberry Juice, Orange Juice. \nTHE CHARLESTON MULE\nVirgil Kaine Ginger Bourbon, lime juice, and ginger beer. \nFROZEN COCKTAILS\n\nFROZEN SCREWDRIVER\nTito’s Handmade Vodka and orange juice with a Grand Marnier Floater. \nMARGARITA\nClassic lime, peach, strawberry, or mango with house tequila served with salt or sugar rim. \nDAIQUIRIS\nClassic lime, peach, strawberry or mango with Admiral Nelson’s Rum topped with whipped cream and fresh fruit. \nPINA COLADA\nAdmiral Nelson’s Coconut Rum blended with pineapple juice and piña colada mix. \nWINES\nTHE SEEKER PINOT GRIGIO THE SEEKER SAUVIGNON BLANC THE SEEKER CHARDONNAY THE SEEKER PINOT NOIR THE SEEKER CABERNET SAUVIGNON \nWhat’s on tap at Big Billy’s\n\nEstuary Mexican Lager- $7.00Wicked Weed Pernicious IPA- $6.50Cooper River Orange Blonde- $6.50Holy City Pilsner- $6.00Estuary Hefeweizen- $6.50LoFi Glitter Pony- $8.50Devils’ Backbone Vienna Lager- $6.50Elysian Space Dust- $6.50Budlight:$5.00New Belgium Citrus Retreat IPA-$6.50\n\nOrder online\nWould you like to bring the beach vibe and delectable food of our Big Billy’s dream into your home? Now you can place an order online, using either Doordash or UberEats. ORDER ONLINE Catering \nWe deliver major meals for major occasions! Are you planning a large business conference, event, or seminar? Are you looking for just the right restaurant to cater your wedding, birthday party, or family reunion? Big Billy’s Burger Joint can do that! Check out our catering page to learn more.\nLearn More",
      "hash": "6f071299b5e6",
      "downloadedAt": "2026-01-19T15:33:23.019Z",
      "trimmedAt": "2026-01-19T15:43:05.764Z",
      "sizeReduction": "97.5%"
    },
    {
      "url": "https://www.bigbillysburgerjoint.com/specials",
      "text": "[Page Title: Specials | Big Billy's Burger Joint]\n\nSpecials\n\nYou’ve probably eaten pig meat before, but we’ll bet you’ve never eaten pig meat like our wild boar!\n\nTaste the meat of the reptiles from the swamps of Florida and Louisiana with our special alligator entrée!\n\nBison are extremely high in protein, and boy does they sure taste delicious! That’s why we couldn’t help but offer bison as our wild-game burger not just once, but twice a week!\n\nThe ultimate exotic meat experience. What might we be cooking up today? Whatever it is, we can assure you it’s delicious! Ask your server about what the owner’s choice specialty is this week!\n\nAs promised, we can’t limit our preparation of this spectacular treat to just once a week, so we offer bison as a daily special on Fridays, too!\n\nOn top of being rich with flavor, venison contains very little saturated fat, which means that it’s one of those meals that will make your heart happy!\n\nTreat yourself to a true taste of the forest with our Sunday special. Our elk-based entrées are so fresh and delectable that you won’t be able to help but feel like you were there when it was captured!\n\nMAIN MENU\nNot feeling like going wild today? Not a problem, maybe some other day- and in the meanwhile, we’re certainly one of our more traditional menu options will hit the spot for you. Check out our main menu page and see what looks good to you today! VIEW MENU \nWhat’s on tap at Big Billy’s\n\nTerrapin ‘Los Bravos’Wicked Weed Pernicious IPAGolden Road Mango CartSweetwater ‘Hazy 710’ Pale AleFrothy Beard ‘Tides of Galinay’ RedSteel Hands Hazy IPABudlightNew Belgium ‘Citrus Rescue’ IPA\n\nWe take care of those who take care of us\n\nPerhaps there’s no better way to thank those who serve our country than by giving them discounts on their delicious meals. Show us your military ID, and 10% of your bill is on the house. It’s our way of saying thank you for defending our country.\nCatering \nWe deliver major meals for major occasions! Are you planning a large business conference, event, or seminar? Are you looking for just the right restaurant to cater your wedding, birthday party, or family reunion? Big Billy’s Burger Joint can do that! Check out our catering page to learn more.\nLearn More",
      "hash": "701aefa52195",
      "downloadedAt": "2026-01-19T15:33:24.789Z",
      "trimmedAt": "2026-01-19T15:43:05.786Z",
      "sizeReduction": "99.5%"
    },
    {
      "url": "https://www.bigbillysburgerjoint.com/menu/",
      "text": "[Page Title: Big Billy's Menu | Local Charleston Restaurant]\n\nMENU\n\nMENU\n\nMENU\n\nBEACH BUM APPS\nStart your beach experience off right with some of the best appetizers you’ll ever sink your teeth into. \nFried Green Tomatoes and Fried Green beans\n\nFive fresh battered green tomatoes and a basket of Green Beans with a side of Pimento cheese and Chipotle Ranch Dressing for dipping. 10.99\n\nBIG BILLY’S FRIES\n\nDouble order of fries topped with house made queso, cheddar and jack cheese and bacon. Served with Ranch and our Billy’s sauce. 9.95Top it with fried or grilled chicken add $4.00\n\nBuffalo chicken dip\n\nServed hot with garlic bread and chips for dipping. 12.50\n\nBIG BILLY’S LOADED NACHOS\n\nA boatload of tortilla chips overloaded with house-made chili, queso, cheddar and Jack cheese, jalapeños, fresh pico and sour cream 11.99Add Guacamole 1.99 | Add Beef or Chicken 4.99\n\nFamous fried pickles\n\nHouse-made pickles, lightly breaded and served with honey horseradish sauce! 9.99\n\nJALAPENO POPPERS\n\nJalapeno poppers filled with cream cheese served with sweet chili sauce and ranch dressing. 10.99\n\nBilly’s Best-Ever Onion Rings\n\nA crazy big portion of hand-cut, hand-breaded, sweet onion rings served like you’ve never seen before and accompanied by our Big Billy’s sauce. 10.99\n\nWings your way\n\nEight jumbo chicken wings in your choice of: mild, hot, dryranch, island jerk, teriyaki, lemon pepper, sweet chili, garlic parmesan,kicken bourbon, or BBQ. Served with celery sticks and either bleucheese or ranch dressing. (8) 13.99 / (12) 16.99\n{ \nA must stop for burgers and milkshake lovers.\n{ \nSausage/Dogs\n\nDog On the Beach\n\nA jumbo, quarter-pound, all-beef hot dog, served on a fresh baked hoagie bun. Make this dog bark and build your own! 11.99\nBilly suggests adding chili, queso, and red onions for an additional charge. \nBilly’s Burger Favorites\nWe are, after all, a burger joint! And as such, we’ve got plenty of delicious burger options for you to fill up on. From Patty Melts to Mac & Cheese Burgers and everything in between, you can’t go wrong with any of our Big Billy’s signature burgers. SERVED WITH HOUSE PICKLES AND YOUR CHOICE OF FRIES, HOUSE-MADE KETTLE CHIPS, TOTS OR COLESLAW Sweet Potato Fries or Fried Pickles 1.99 UPGRADE TO A PREMIUM SIDE: Onion Rings, Steamed Broccoli, Side Salad 2.99 \nBREAKFAST BURGER\n\nServed with a fried egg, Applewood smoked bacon, grilled black forest ham, hash browns, and American cheese. G’Day! 15.99Did someone say Bloody Mary? Billy did!\n\nCLASSIC CHEESEBURGER\n\nServed with your choice of cheese, green leaf lettuce, tomato, sliced red onion, and dill pickles. Simply wonderful! 14.25\n\nBACON X3 BURGER\n\nServed with bacon on top, bacon below, and topped with our own bacon mayo. Served with choice of cheese, lettuce, and tomato. Dreams do come true! 15.25\n\nNew! Heart Stopper\n\nOur house-ground burger topped with sharp cheddar, provolone and swiss cheese, egg, bacon, and ham! 15.99\n\nMAC & CHEESE BURGER\n\nTopped with American cheese, fried mac & cheese, bacon, and queso. 15.99\n\nChILI BURGER\n\nTopped with chili, American cheese, mustard, and house-fried kettle chips piled high! Get smashing! 15.25\n\nNew! Fiesta Burger\n\nTopped with pepper jack cheese, house-made pico de gallo, nacho strips, and queso cheese 14.99\n\nBILLY’S PATTY MELT\n\nFresh, hand ground beef with sautéed onions, Swiss cheese, and garlic mayo on marble rye 15.25\n\nNew! Western\n\nOur house ground burger topped with a hand breaded onion ring, lettuce tomato, and BBQ sauce 14.99\n\nNew! Southern Fried\n\nTopped with lettuce, a fried green tomato, house-made pimento cheese, and bacon 14.99\n\nNew! Belt Buster\n\nA double burger topped with your choice of cheese with a grilled cheese in the middle with lettuce tomato and onions. 18.99 Ask about our Belt Buster Challenge!\n\nBuild Your Own\nGet creative and build your own burger! We’ve got beef, grilled chicken breasts, turkey burgers, and more! SERVED WITH HOUSE PICKLES AND YOUR CHOICE OF FRIES, HOUSE-MADE KETTLE CHIPS, TOTS OR COLESLAW Sweet Potato Fries or Fried Pickles 1.99 UPGRADE TO A PREMIUM SIDE: Onion Rings, Steamed Broccoli, Side Salad 2.99 FRESH, IN HOUSE GROUND BEEF \n14.99\n\nTODAY’S “BURGERS GONE WILD” SELECTION\nmarket price \nGRILLED, MARINATED CHICKEN BREAST\n\n13.99\n\nTURKEY BURGER\n\n13.25\n\nBLACK BEAN BURGER\n\n13.25\n\nCheese\n1.99 \nAmerican | Sharp Cheddar | Provolone | Swiss | Pepper Jack | Bleu Cheese | Pimento  |  Queso | Smoked Gouda | Brie | Feta\n\nTo bun or not to bun\n\nSweet Artisan Bun | Lettuce Wrap | Gluten-free bun (add 2.99)\n\nTop it off on billy\nComplete your meal with the condiments or toppings that taste best to you! \nGreen Leaf Lettuce | Pickles | Red Onion | Tomato\n\nBig Billy’s Sauce | House-made Ketchup | Honey Horseradish | BBQ Sauce\nGET SAUCY \nHoney Mustard | Dijon Mustard | House-made Mustard\nMUSTARD \nMayo | Bacon Mayo | Chipotle Mayo | Roasted Garlic Mayo\nMAYO \nRanch | Chipotle Ranch\nDRESS IT UP Raise The Stakes Take your burger-eating experience to the next level. \n1.99 EACH\n\nRelish | Caramelized Onions | Coleslaw | Grilled Mushrooms | Grilled Pineapple | Pico de Gallo | Jalepeńos\n\n2.99 EACH\n\nBlack Forest Ham | Applewood Smoked Bacon | Guacamole | Chili | Fried Egg | Sliced Avocado\nCooked Right \nRARE\n\nCold Red Center\n\nMEDIUM RARE\n\nCool Red Center\n\nMEDIUM\n\nWarm Red Center\n\nMEDIUM WELL\n\nWarm Pink Center\n\nWELL\n\nCooked Throughout\n\nAll hands on deck\nNot feeling like a burger today? SERVED WITH HOUSE PICKLES AND YOUR CHOICE OF FRIES, HOUSE-MADE KETTLE CHIPS, TOTS, OR COLESLAW UPGRADE TO A PREMIUM SIDE: Sweet Potato Fries or Fried Pickles 1.99 Onion Rings, Steamed Broccoli, Side Salad 2.99 \nMAHI MAHI BEACH BURRITO\n\nMahi mahi, grilled with fajita spice, rolled with chipotle aioli, shredded cabbage, mango jalapeño salsa, black beans, cheddar and Jack cheese, allon a grilled soft flour tortilla as only Big Billy can do! 14.99\n\nFRIED CHICKEN PIMENTO BLT\n\nFried chicken topped with housemade pimento cheese, lettuce,tomato and crisp bacon 14.99\n\nSAIL AWAY SALMON BLT\n\nFillet of Atlantic salmon grilled and served on toasted sourdough bread with fresh tomatoes, Applewood smoked bacon, green leaf lettuce and roasted garlic mayo 15.99 Try it blackened with an ice-cold Pale Ale!\n\nCHICKEN CLUB WRAP\n\nA grilled chicken breast served in a flour tortilla with garlic mayo, shredded cheddar and jack, black forest ham, Applewood smoked bacon, green leaf lettuce, and tomato 14.50\n\nBILLY’S CORNED BEEF REUBEN\n\nSliced house corned beef, swiss cheese with sauerkraut and house-made dressing on marbled rye. 14.99\n\nBIG BILLY’S GRILLED 3-CHEESE & BACON\n\nSharp cheddar, smoked Gouda and Brie all accompanied by Applewood smoked bacon, sliced tomato and garlic mayo, grilled on fresh baked sourdough 14.99Add fresh, hand ground beef 4.50\n\nNew! Chicken Tender Platter\n\n3 chicken tenders served with a side of coleslaw and choice of side and honey mustard. 14.99\n\nBilly’s GONE GREEN\n\nCOZUMEL SALAD\n\nMixed greens with guacamole, sour cream, roasted corn, shreddedcheddar and Jack cheese, tortilla chips, and pico de gallo with chipotle ranch dressing. 12.75Black Bean 13.99 | Fresh, hand-ground beef 15.99\n\nFARMER’S MARKET SALAD WITH SALMON\n\nBaby spinach topped withstrawberries, sliced apples, mango,toasted coconut, Mandarin oranges,candied pecans and feta cheeseserved with our own raspberrybalsamic vinaigrette 15.50\n\n-Try it blackened with a specialty handmade shake!\n\nGREEK ISLANDS SALAD\n\nChopped romaine lettuce with diced tomatoes, red onions,black olives, cucumbers, pepperoncini peppers, feta cheese and Greek vinaigrette 12.99 • Add Chicken 14.99\n\nMALIBU SALAD\n\nMixed greens with diced tomatoes, red onions, cucumbers, shredded cheese and croutons 12.99Add Salmon 15.99 / Chicken 14.99 / Mahi 13.99\n\nSURFIN’ CAESAR SALAD\n\nChopped romaine lettuce tossed with Caesar dressing, Parmesan cheese and herb croutons 11.99\n\nWith Chicken 13.99 -Try it blackened with a cold IPA!\n\nshake it up\n\nBEGINNERS – 5.75CHOCOLATE | VANILLA | STRAWBERRY\n\nADVANCED – 6.75\n\nOH! OREO!\n\nVanilla ice cream, Oreo cookies, and more Oreo cookies.\n\nSTRAWBERRY SHORTCAKE\n\nVanilla ice cream, fresh strawberries, strawberry syrup, and shortcake.\n\nCHOCOPEANUTBUTTER BROWNIE\n\nVanilla ice cream, peanut butter, chocolate syrup, and brownie chunks.\n\nCAMPFIRE S’MORES\n\nVanilla ice cream, chocolate syrup, toasted marshmallows, and graham crackers.\n\nCOOKIE MONSTER\n\nChip Ahoy cookies, vanilla ice cream, caramel, and chocolate!\n\nSALTED CARMEL TOFFEE\nSalted Caramel, Crushed Toffee Pieces, Vanilla Ice Cream. \nBANANA PUDDING\nBanana Pure, Crumbled vanilla Wafers, Vanilla Ice Cream. \nBUTTER PECAN\nCrushed Pecan Pieces, Butter Pecan Flavor, Vanilla Ice Cream. \nADULT SURFERS ONLY – 8.75\n(alcohol-infused deliciousness!) \nMIND TRICK\n\nBailey’s, Captain Morgan, Kahlua and Amaretto blended with vanilla ice cream.\n\nVANILLA CARAMEL SWIRL\n\nCrown Royal Vanilla blended with vanilla ice cream and caramel.\n\nAPPLE PIE\n\nCrown Royal Regal Apple blended with vanilla ice cream and caramel.\n\nMUDSLIDE BILL\n\nBailey’s, Frangelico, Kahlua blended with vanilla ice cream and chocolate syrup.\n\nCHOCOLATE PB CUP\n\nScrewball whiskey, crème De Cocoa and crushed PB cup pieces.\n\nCHOCOLATE MINT COOKIE MANIA\n\nBailey’s, Crème de Menthe and Crème de Cacao, mint cookies, blended with vanilla ice cream.\n\nBANANA SPLAT\n\nCaptain Morgan Coconut Rum, Banana Liqueur and Crème de Cacao blended with vanilla ice cream. Topped with whipped cream and nutmeg.\n\nLOOPY FRUIT\nThree Olives Loopy Vodka, Fruity Pebble Cereal Pieces, Vanilla Ice Cream \nCocktails\n\nSPECIALTY COCKTAILS\n\nSPIKED TEA\nLocally Distilled Sweet Tea Vodka, Peach Schnapps, Unsweetened Tea, Splash of Lemonade. \nCHARLESTON MARY\nCharleston Bold and Spicy Bloody Mary Mix, Dixie Black Pepper Vodka garnished with pepper, celery, and bacon. \nBIG BILLY’S MAI TAI\nAdmiral Nelson’s Coconut Rum and Admiral Nelson’s Pineapple Rum mixed with fresh fruit juices topped with a Captain Morgan Black Rum Floater. \nPINEAPPLE JALAPENO MARGARITA\nJose Cuervo Tequila, pineapple juice, Jalapeño Infusion, fresh pineapple, fresh lime, and triple sec \nHURRICANE\nAdmiral Nelson’s Rum and Captain Morgan Black Rum mixed with fresh lime, orange juice, peach schnapps, and grenadine. \nPEACH ON THE BEACH\nCrown Royal Peach, Cranberry Juice, Orange Juice. \nTHE CHARLESTON MULE\nVirgil Kaine Ginger Bourbon, lime juice, and ginger beer. \nFROZEN COCKTAILS\n\nFROZEN SCREWDRIVER\nTito’s Handmade Vodka and orange juice with a Grand Marnier Floater. \nMARGARITA\nClassic lime, peach, strawberry, or mango with house tequila served with salt or sugar rim. \nDAIQUIRIS\nClassic lime, peach, strawberry or mango with Admiral Nelson’s Rum topped with whipped cream and fresh fruit. \nPINA COLADA\nAdmiral Nelson’s Coconut Rum blended with pineapple juice and piña colada mix. \nWINES\nTHE SEEKER PINOT GRIGIO THE SEEKER SAUVIGNON BLANC THE SEEKER CHARDONNAY THE SEEKER PINOT NOIR THE SEEKER CABERNET SAUVIGNON \nWhat’s on tap at Big Billy’s\n\nEstuary Mexican Lager- $7.00Wicked Weed Pernicious IPA- $6.50Cooper River Orange Blonde- $6.50Holy City Pilsner- $6.00Estuary Hefeweizen- $6.50LoFi Glitter Pony- $8.50Devils’ Backbone Vienna Lager- $6.50Elysian Space Dust- $6.50Budlight:$5.00New Belgium Citrus Retreat IPA-$6.50\n\nOrder online\nWould you like to bring the beach vibe and delectable food of our Big Billy’s dream into your home? Now you can place an order online, using either Doordash or UberEats. ORDER ONLINE Catering \nWe deliver major meals for major occasions! Are you planning a large business conference, event, or seminar? Are you looking for just the right restaurant to cater your wedding, birthday party, or family reunion? Big Billy’s Burger Joint can do that! Check out our catering page to learn more.\nLearn More",
      "hash": "b97647068b30",
      "downloadedAt": "2026-01-19T15:33:19.915Z",
      "trimmedAt": "2026-01-19T15:43:05.841Z",
      "sizeReduction": "97.5%"
    }
  ],
  "sizeReduction": "98.6%"
}