{
  "venueId": "ChIJgYv6RxV8_ogRteZAIcHT2q8",
  "venueName": "Zen Asian Fusion",
  "venueArea": "West Ashley",
  "website": "https://zenasianrestaurant.com/",
  "scrapedAt": "2026-01-19T15:42:02.520Z",
  "trimmedAt": "2026-01-19T15:49:04.751Z",
  "pages": [
    {
      "url": "https://zenasianrestaurant.com/menus/",
      "text": "[Page Title: Menus - Zen Asian Fusion Restaurant]\n\nSkip to content Menus \nOur mission is to create harmony in texture, appearance and taste by using only the finest ingredients to ensure your upmost satisfaction. We have created a clean, modern environment with Zen simplicity to provide an exciting backdrop in which you can dine.\nLunch \nSpecials\n\n$15.95 - Choice of Miso Soup or House Salad, White or Brown Rice (Fried Rice is additional $4.95)\nSet Lunch \nLightly battered white meat Chicken glazed with zesty-spicy General sauce on a bed of String beans, Broccoli & Pineapples\nGeneral Tso's Chicken \nLightly battered white meat Chicken cooked with Tangerine Peels, glazed with zesty-spicy General sauce on a bed of String beans, Broccoli & Pineapples\nOrange Chicken \nLightly battered white meat Chicken glazed with sweet Orange Sauce on a bed of String beans, Broccoli &amp; Pineapples, topped with Sesame Seeds\nSesame Chicken \nSliced Beef stir-fried with Green Peppers, Red Peppers & Onions in Brown Sauce\nPepper Steak Chicken with Black Bean Sauce Sliced white meat Chicken stir-fried with mix Vegetables & aged Black Beans in Brown Sauce \nChoice of Chicken, Beef, or Shrimp with assorted Vegetables steamed or stir-fried in Brown or Garlic Sauce\nGarlic Sauce / Brown Sauce \nLightly battered Shrimp or Chicken with Vegetables served with Orange Miso & Tempura Sauce\nShrimp or Chicken Tempura \nSautéed in traditional Chinese Brown Sauce\nChicken, Beef or Shrimp with Broccoli \nChoice of Chicken, Beef, Shrimp or Tofu, served on a bed of snow peas, carrots, and broccoli\nTeriyaki \nChoice of Chicken, Beef, or Shrimp\nPad Thai , Lo Mein or Udon \nSautéed Chicken or Beef with vegetables mixed in a fresh basil brown sauce\nBasil Chicken or Beef \nChoice of Chicken, Beef or Shrimp stir-fried with veggies in a Spicy Brown Sauce\nSpicy Tasted \nChicken, Beef, or Shrimp with vegetables stir-fried in a balanced sweet and spicy sauce\nAmazing Sauce \nChoice of Chicken, Beef, or Shrimp with mix vegetables in an earthly cashew sauce\nCashew Sauce \nChoice of Chicken or Shrimp in a coconut curry sauce\nSambal Sauce (Choice of Yellow or Green Curry with coconut milk) \nChoice of Chicken, Beef, or Shrimp with fresh jalapeno and mix vegetables in a lemongrass brown sauce\nFlavor of Malaysia Dinner \nSoup\n\n$4.55\nMiso Soup (GF) \n$10.95\nTom Yam Seafood Hot & Sour Soup (GF) Okra, Pineapple, Shrimp & Scallops in a Lemongrass Broth \n$9.95\nH.K. Style Wonton Soup Shrimp, Minced Pork & Scallions in Chicken Broth \nGreens\n\n$9.95\nKani Salad \n$12.95\nSquid Salad \n$11.95\nAvocado Salad \n$11.95\nMango Kani Salad \n$9.95\nJapanese Seaweed Salad \n$7.50Freshly mixed greens, Cucumbers, Carrots, Beets, & Cherry Tomatoes with Apple Ginger Dressing\nHouse Green \n$15.95Fresh Mixed Greens topped with slices of Seared Yellowfin tuna, glazed with Honey Wasabi Cream & Balsamic Dressing.\nSeared Ahi-Tuna Salad \n$16.95Crispy Roast Duck, Mixed Greens, Carrots & Beets served with Balsamic Dressing\nMandarin Duck Salad \n$15.95Grilled Shrimp and Mango, Mixed Greens, Beets, with Olive Balsamic Dressing\nGrilled Mango Shrimp Salad \nKitchen Appetizers\n\n$3.00\nEgg Rolls (1) \n$7.25\nEdamame (GF) \n$9.95\nAsian Wings \n$6.95\nVeggie Dumplings (Steamed or Pan-Fried) \n$8.95\nCrab Rangoon \n$11.95\nShrimp and Veggie Tempura \n$7.95\nGyoza (Pork Dumplings) \n$11.95\nVeggie Lettuce Wraps \n$13.95\nChicken / Shrimp Lettuce Wraps \n$6.25Deep Fried Vegetable Spring Rolls\nHarumaki (3 pcs.) \n$11.95Battered & Fried Calamari Served with Mango Salsa & Sweet Thai Chili Sauce\nThai Calamari \n$11.95Battered & Fried Rock Shrimp Served with Spicy Yuzu Sauce\nRock Shrimp Tempura \n$11.95Deep Fried Chicken Nuggets\nMalaysian Chicken Nuggets (perfect for the little ones) \n$9.95Steamed shrimp, carrot, cilantro, lettuce, cucumber & rice noodle wrapped in soft rice wrap\nSummer Roll (2 pcs.) \nChef's Signatures\n\nCrispy roasted duck filet with seasoned vegetables\nMandarin Duck $29.95 \nBattered jumbo shrimp fried, glazed with creamy coconut sauce. Garnished with steamed broccoli.\nCoconut Shrimp $26.95 \nYour choice of marinated chicken, shrimp, or steak stir fried with vegetables in Chef's Special Sauce\nSpicy Tasted $25.95 \nSeasoned steak stir fried with with mixed vegetables\nSeasonal Steak $27.95 \nFreshly marinated steak, shrimp & scallops\nZen Triple $31.95 sautéed with vegetables in spicy sauce \n*Steamed with Vegetables in a Ginger Scallion Soy Sauce (on the side)*Grilled with steamed vegetables in an orange Yuzu Sauce on top\nSteamed or Grilled Wild Chilean Sea Bass MP \nCelery, Zucchini, Asparagus, Sweet Peas & Cashew Nuts\nCashew Sauce (choice of white or brown rice) *upgrade to Fried Rice for $4.95* \n$18.95 $18.95 $18.95 - Beef, Chicken & Shrimp $24.95\nChicken Beef Shrimp Cashew Triple \nGreen & Red Peppers, Snap Peas, Zucchini, Asparagus, Onions\nBlack Bean Sauce (choice of white or brown rice) *upgrade to Fried Rice for $4.95* \n$18.95 $18.95 $18.95 Beef, Chicken & Shrimp $24.95\nChicken Beef Shrimp Black Bean Triple \nJalapeños, Red Peppers, Zucchini, Onions & Asparagus\nFlavor of Malaysia (choice of white or brown rice) *upgrade to Fried Rice for $4.95* \n$18.95 $18.95 $18.95 - Beef, Chicken & Shrimp $24.95\nChicken Beef Shrimp Malaysian Triple \nGreen & Red Peppers, Onions, Sweet Peas, Asparagus, Mushrooms & Zucchini\nAmazing Sauce (choice of white or brown rice) *upgrade to Fried Rice for $4.95* \n$18.95 $18.95 $18.95 - Beef, Chicken & Shrimp $24.95\nChicken Beef Shrimp Amazing Triple \nTraditional Chinese Cuisine\n(Served with White or Brown Rice) \n$18.95\nChicken or Beef w. Broccoli \n$18.95\nShrimp w. Broccoli \n$18.95\nPepper Steak \n$18.95\nSesame Chicken \n$18.95\nGeneral Tso's Chicken \n$18.95\nOrange Chicken \n$18.95\nMongolian Beef \nNoodles\n\nFettuccine Rice Noodles (made with fish sauce)Wheat Noodles Egg Noodles  Angel Hair Rice Noodles\nPad Thai Udon Lo Mein Mei Fun (GF option available ) (Choice of Hong Kong or Singapore Style) Served with Your Choice of: \n$15.95 $17.95 $17.95 $18.95\nVegetables Chicken or Beef Shrimp House Special (Shrimp, Chicken & Beef) \nZen Style Fried Rice\n(Brown Rice, GF available, please ask server) Served with Your Choice of: \n$15.95 $17.95 $17.95 $18.95\nVegetables Chicken or Beef Pineapple Shrimp House Special (Shrimp, Chicken & Beef) \nTempura\nServed with onions, sweet potato, squash, zucchini & broccoli \n$15.95 $18.95 $18.95\nVegetables Chicken & Vegetables Shrimp & Vegetables \nTeriyaki\nServed with snow peas, carrots & broccoli \n$15.95 $18.95 $25.95 $29.95 $24.95 $17.95$39.95\nTofu or Vegetables Chicken Steak Duck Salmon Shrimp Seafood Combo (Lobster, Shrimp & Scallops) \nSoutheast Asia\n\nSeasoned Mixed Vegetables $15.95Chicken $18.95Beef $18.95Shrimp $18.95\nBrown or Garlic Sauce Served With \nChicken $18.95Beef $18.95Shrimp $18.95Triple $24.95\nThai Basil Sauce Served With \nChicken $18.95Shrimp $17.95Duck $29.95Seafood Combo (Lobster Tail, Shrimp & Scallops) $39.95\nSambal Sauce Served With (GF) (Choice of Yellow or Green Curry) Desserts \nFeatured\n\nVanilla Ice Cream wrapped in pound cake and lightly fried to golden perfection\nIce Cream Tempura \nPlain and simple with raspberry sauce\nCheesecake \nLightly breaded banana, delicately fried and served with a scoop of Vanilla Ice Cream\nBanana Party \nA low-sugar, delectable treat made with real red beans\nRed Bean Ice Cream \nA Delicious, moist chocolate bundt cake with a rich, creamy chocolate ganache filling\nChocolate Bundt Cake \nTraditional Japanese Dessert made with Green Tea Ice Cream wrapped in Rice Dough\nMochie Ice Cream \n** Menu and prices are subject to change without notice.\n\n* With parties of 6 or more, an 20% gratuity will automatically be added\n* Please notify your server if you have any food allergies\n\nThoroughly cooking food of animal origin such as beef, eggs, fish, poultry, or shellfish reduces the risk of food borne illness. Individuals with certain health conditions may be at a higher risk if these foods are consumed raw or undercooked. Consult your physician or public health official for further information",
      "hash": "3888e2bc68a2",
      "downloadedAt": "2026-01-19T15:38:43.186Z",
      "trimmedAt": "2026-01-19T15:49:04.705Z",
      "sizeReduction": "89.9%"
    },
    {
      "url": "https://zenasianrestaurant.com/sushi/",
      "text": "[Page Title: Sushi - Zen Asian Fusion Restaurant]\n\nSkip to content Sushi Menu \nFollowing the traditions of Asian cultures, we have designed our menu and rock music for sharing. We suggest you pass your plates among your friends and family and embrace this custom as well. Our servers are here to guide you, so please call upon them for the smallest of favors.\nLunch \nSignature Rolls\n\n$14.95\nAll Signature Rolls \nTuna, Yellowtail, Salmon, Jalapeno & Tobiko wrapped in a Crispy Spring Sheet\nSpicy Girl \nSalmon Tempura & Avocado Inside topped with fresh Salmon & Spicy Creamy Sauce\nSunny \nShrimp Tempura, Cucumber & Kawari inside topped with Spicy Tuna, Eel & Avocado\nColor Dragon \nEel, Smoked Salmon, & Cream Cheese inside and deep fried\nBagel \nPeppered Tuna & Creamy Wasabi Sauce inside, Salmon, baked Eel, Avocado & Black Tobiko outside, topped with Tempura Flakes\nBlack Angel \nSpicy Crab inside, topped with Salmon, Tuna, White Fish & Avocado\nS.C. Rainbow \nSpicy Crunchy Tuna topped with Avocado & Red Tobiko\nGodzilla \nShrimp Tempura & Spicy Tuna wrapped in a Soybean Sheet topped with fresh Mango\nSam Rittenberg \nLayer of Spicy Tuna, Eel, White Tuna, Avocado & Red Tobiko\nZen Sushi Cake (No Seaweed) \nSpecials\n(Choice of Soup or Salad) \n5pcs of Sushi (Chef’s choice of the day) & California Roll\nSushi Lunch $16.95 \n10pcs of Sashimi (Chef’s choice of the day)\nSashimi Lunch $17.95 \n7pcs Sashimi, 3pcs of Sushi (Chef’s choice of the day) & Spicy Crab Roll\nSushi & Sashimi Combo $22.95 \n$15.95 / $17.95 :\nChoice of 2 or 3 Rolls (Choose from the following) Tuna Roll Salmon Roll Yellowtail Scallion Roll Eel Cucumber Roll Eel Avocado Roll California Roll Boston Roll Peanut Avocado Roll Vegetable Roll Avocado Roll Cucumber Roll Asparagus Roll Tuna Avocado Roll Salmon Avocado Roll Spicy Crunchy Salmon Roll Spicy Crunchy Tuna Roll Sweet Potato Roll Spicy Crunchy Crab Roll Dinner \nSushi Bar Appetizers\n\n$13.95Crispy Dumplings with Spicy Tuna inside, on top of house made Jalapeno infused Guacamole\nTuna Dumplings (6 pcs.) \n$13.95Fresh salmon sashimi wrapped with spicy crab salad, Japanese sprouts & cucumber in wasabi yuzu sauce\nSalmon Wraps (4 pcs.) \n$12.95Spicy tuna & spicy crab on top of seaweed salad in ponzu sauce, surrounded with crunch flakes topped with spicy mayo, eel sauce, honey wasabi sauce\nTuna-Tini \n$14.95Sliced tuna seared with cracked black pepper, fresh mango & green apple salad, mango & honey wasabi sauce\nPepper Tuna Tataki (GF) \n$15.95Seared thinly sliced NY strip in yuzu sauce & hoisin sauce, topped with thin scallions\nSteak Tataki \n$15.95Sliced Yellowtail in Yuzu Sauce, topped with Jalapeños & Red Tobiko\nYellowtail Jalapeño \n$14.95Tuna Topped with Avocado & Orange Yuzu Sauce, served with Brown Rice Potato Chips on side\nTuna Tartar \n$16.95Served with avocado, jalapeños, and sesame seeds\nCrispy Rice with Spicy Tuna \nSignature Rolls\n\n$18.95\nFantastic Tuna Roll Spicy Tuna, Shrimp Tempura & Avocado inside, covered with Fresh Tuna, Peppered Tuna Sashimi & Avocado. Topped with Pickled Jalapeño, with a delicious Kimchi infused Sauce. \n$18.95Spicy Tuna & Avocado wrapped in fresh Tuna, with Honey Wasabi & Wasabi Mayo. Heart Shaped!\nSweetie Roll \n$19.95Spicy Tuna, Tempura Eel, Avocado, wrapped with Pink Soy Paper, Topped with Lobster Salad, Red Caviar, and Eel & Honey Wasabi Sauce\nSex and The City Roll \n$16.95Rock Shrimp Tempura with Orange Miso Sauce wrapped inside. Topped with creamy Crab Salad & Micro-Greens, Thai Chili infused Wild Mango Sauce.\nRock & Roll \n$16.95\nAvatar Roll Goat Cheese, Lobster Salad, No Rice or Seaweed, Topped with a thin slice of Tuna and four different colors of Caviar \n$17.95Shrimp Tempura, Spicy Crunchy Crab, Soy Wrap, White Tuna, Tuna, Salmon, Yellowtail, Avocado, Spicy Mayo Eel Sauce and Garlic Cream Sauce\nWest Ashley Roll \n$24.95\nEmpire Roll Lobster Tail Tempura, White Tuna, Avocado, Lettuce, Fish Eggs, with a Soybean Wrap and Chef's Special Sauce \n$17.95\nTreasure Island Spicy Crunchy Crab & Avocado inside, topped with seared Fatty Tuna & Japanese Light Mayo Served with Wild Mango Sauce & Spinach Infused Edamame Sauce \n$16.95Tuna, King Crab, Avocado and Spring Mix, Deep Fried with a Creamy Sauce\nHoly Moly Roll \n$18.95Shrimp Tempura with Fresh Green Apple inside, topped with Alaskan King Crab Salad & Red Tobiko in Honey Wasabi, Eel & Sweet Mango Sauce\nThe King's Speech \n$16.95Tuna, Yellowtail, Salmon, Jalapeno & Masago wrapped in a Crispy Spring Sheet with Spicy Cream Sauce\nSpicy Girl \n$17.95White Tuna, Salmon, Avocado and Caviar, wrapped in Orange Soy Paper and Topped with Spicy Tuna, Spicy Crab and Crispy Garlic with a Garlic Cream Sauce\nIron Man Roll \n$17.95Sweet Lobster Salad, Shrimp Tempura & Banana Tempura wrapped in Soybean Sheet, with Yuzu Mango Sauce\nParadise Roll \n$18.95Soft Shell Crab, Spicy Tuna, Eel, Avocado, White Tuna Wrapped in Soybean paper with Spicy Mayo & Eel Sauce\nTwo Thumbs \n$17.95\nColor Dragon Roll Shrimp Tempura, Cucumber & Japanese sprouts Topped with Spicy Tuna, Eel & Avocado \n$15.95Eel, Smoked Salmon & Cream Cheese wrapped together and Deep Fried\nBagel Roll \n$17.95Shrimp Tempura & Spicy Tuna wrapped in a Soybean Sheet Topped with fresh Mango\nSam Rittenburg Roll \n$17.95Peppered Tuna & Creamy Wasabi Sauce Inside a Crunchy Eel, Salmon, Avocado & Black Tobiko Outside, Topped with Tempura Flakes\nBlack Angel Roll \n$15.95\nYum Yum Roll (No Rice) Spicy Crunchy Tuna, Avocado, White Tuna, Tobbiko, Soybean Wrap Topped with Tuna, Avocado and White Tuna. Served with Honey Wasabi and Wasabi Mustard. \n$15.95Spicy Crunchy Crab inside, topped with fresh Salmon, Tuna, White Fish & Avocado, with Garlic Cream Sauce\nSC Rainbow Roll \n$15.95Eel, Shrimp Tempura, Crab inside, topped with fresh White Tuna & Avocado with Eel Sauce & Garlic Cream Sauce\nTwister Roll \n$16.95Layer of Spicy Tuna, Eel, White Tuna, Avocado & Red Tobiko\nZen Sushi Cake (No Seaweed) \n$15.95Crunchy Spicy Tuna Topped with Avocado & Red Tobbiko in a Spicy Cream Sauce\nGodzilla Roll \n$15.95Salmon, White Tuna, Tuna, Lettuce, Avocado, Japanese Seaweed Salad, wrapped in Cucumber topped with Caviar. Wasabi Yuzu Sauce on the side.\nFitness Roll (No Rice) \nSushi Entrees\nChef's Choice (no substitutions please) \n$13.95Avocado, Cucumber & Asparagus Roll\nVegetable Roll Combo \n$13.95Tuna, Salmon & Yellowtail Scallion Roll\nMaki A \n$15.95Spicy Crunchy Tuna, Salmon & Spicy Crab Roll\nMaki B \n$29.95Broiled Eel Glazed with Eel Sauce Served Over Sushi Rice with Oshinko & Yama Gobo\nUnagi Don \n$33.9515 pcs. Sashimi On a Bed of Sushi Rice with Yama Gobo, Oshinko & Seaweed Salad\nChirashi \n$29.959 pcs. Sushi & Spicy Crunchy Salmon Roll\nSushi Platter \n$39.9520 pcs. Sashimi (Best of the Day)\nSashimi Platter \n$42.957 pcs. Sushi, 9 pcs. Sashimi & Spicy Crunchy Crab Roll\nSushi & Sashimi Combo (For 1) \n$89.9510 pcs. Sushi, 16 pcs. Sashimi & Godzilla Roll\nSushi & Sashimi Combo (For 2) \nNigiri or Sashimi\n\n:\nNigiri (1 pc.) / Sashimi (3 pcs.) \nMP $3.50 / $8 $3.50 / $8 $3.50 / $8 $3.50 / $8 $3.50 / $8 $3.50 / $8 $3.50 / $8 $3.50 / $8 MP $3.50 / $8 $3.50 / $8 $4 / $8 $4.50 / $8 $3.50 / $8 $3.50 / $8 MP $3.50 / $8 $3.50 / $8 MP MP $3.50 / $8 $3.50 / $8 $3.50 / $1 $3.50 / $8 $4.50 / $8\nTuna Scallop Spicy Tuna -Sashimi (2 Pcs) Tamago Egg Albacore Tuna Super White Tuna Salmon Smoked Salmon Yellowtail Jumbo Sweet Shrimp Shrimp Red Snapper Eel Baby Octopus Octopus Crab Stick Alaskan King Crab Squid Mackerel Salmon Roe - Sashimi (2 Pcs) Sea Urchin Surf Clam Flying Fish Roe - Sashimi (2 Pcs) Quail Egg - Sashimi (1 Pcs) Inari (Sweet Tofu Skin) Honeymoon - Sashimi (2 Pcs) \nRoll or Hand Roll\n\n$6.95 $7.95 $6.75 $7.45 $6.45 $8.95 $6.25 $7.95 $7.25 $6.95 $6.25$7.45 $8.95 $7.45$6.95 $7.45 $6.45 $7.45 $17.95 $7.45 $5.25$7.95 $5.25$9.95 $5.25 $13.95 $5.45 $7.95\nTuna Tuna Avocado Salmon Salmon Avocado California Yellowtail Jalapeno Boston Eel Avocado Philadelphia Sweet Potato Vegetable Spicy Crunchy Scallop Yellowtail Scallion Spicy Crunchy Tuna Eel Cucumber Spicy Crunchy Salmon Shrimp Asparagus Spicy Crunchy Shrimp Spider Roll Spicy Crunchy Crab Avocado Spicy Crunchy Yellowtail Cucumber Shrimp Tempura Asparagus Green Dragon Peanut Avocado Salmon Skin \n** Menu and prices are subject to change without notice.\n\n* With parties of 6 or more, an 20% gratuity will automatically be added\n* Please notify your server if you have any food allergies\n\nThoroughly cooking food of animal origin such as beef, eggs, fish, poultry, or shellfish reduces the risk of food borne illness. Individuals with certain health conditions may be at a higher risk if these foods are consumed raw or undercooked. Consult your physician or public health official for further information",
      "hash": "976d88956e6c",
      "downloadedAt": "2026-01-19T15:38:44.528Z",
      "trimmedAt": "2026-01-19T15:49:04.736Z",
      "sizeReduction": "88.3%"
    },
    {
      "url": "https://zenasianrestaurant.com/",
      "text": "[Page Title: Home - Zen Asian Fusion Restaurant]\n\nSkip to content Your Zen experience awaits. \nZen is not just a meal. It's also art that can be experienced by all five senses. From our décor to our wait staff and cuisine, Zen allows for a totally immersive dining experience. We promise the use of only the highest quality seafood and fresh ingredients, all served to you in a uniquely relaxed environment.\n\nWe have been honored to have hosted guests during some of the most spirited and joyous times in their lives, including graduations, weddings, anniversaries, and many memorable moments in between. We hope to share a few moments with you.\n\nWe look forward to seeing you.\nZen (zɛn) — n \na Japanese school, of 12th-century Chinese origin, teaching that contemplation of one's essential nature to the exclusion of all else is the only way of achieving pure enlightenment\nDinner & Lunch Sushi Drinks",
      "hash": "daee643cb475",
      "downloadedAt": "2026-01-19T15:38:42.153Z",
      "trimmedAt": "2026-01-19T15:49:04.742Z",
      "sizeReduction": "98.5%"
    },
    {
      "url": "https://zenasianrestaurant.com/drinks/",
      "text": "[Page Title: Drink Specials - Zen Asian Fusion Restaurant]\n\nSkip to content Drink and Food Specials (Bar Only) \nZen has no set rules. Be creative, live long, be happy, and follow your own path.\nHappy Hour \n4 PM - 6 PM\nMonday - Friday\n\n$1 off ALL beer, $3 Well Liquors, $5 House Wine, $5 Large Hot Sake\nHappy Hour Specials \nMonday: 4pm - 6pm\n\n$6 - Sake$4 - Well liquor$5 - Wine $6 - Sake sangria $1 off all beer\n\nFood and Bev only - Buy 1 entrée, get 1 half off\n\nTuesday: Ladies Night - 4pm - 6pm\n\n$6 - Sake$4 - Well liquor$5 - Wine $6 - Sake sangria $1 off all beer\n\n$3 - Harumaki$4 - Crab Rangoon$6 - Veggie Lettuce Wraps$3.50 - Edamame$4.50 - Gyoza\n\nWednesday: 4pm - 6pm\n\n$6 - Sake$4 - Well liquor$5 - Wine $6 - Sake sangria $1 off all beer\n\n$3 - Harumaki$4 - Crab Rangoon$6 - Veggie Lettuce Wraps$3.50 - Edamame$4.50 - Gyoza",
      "hash": "e1f03f6a9e9e",
      "downloadedAt": "2026-01-19T15:38:45.679Z",
      "trimmedAt": "2026-01-19T15:49:04.751Z",
      "sizeReduction": "98.6%"
    }
  ],
  "sizeReduction": "93.2%"
}