{
  "venueId": "ChIJUedKYTtj_ogRrr9QFGUsox0",
  "venueName": "Chow Bella Kitchen & Culinary",
  "venueArea": "James Island",
  "website": "http://chowbellacatering.com/",
  "scrapedAt": "2026-01-19T15:41:59.421Z",
  "trimmedAt": "2026-01-19T15:45:56.208Z",
  "pages": [
    {
      "url": "http://chowbellacatering.com/charleston-james-island-johns-island-summerville-daniel-island-kiawah-island-island-of-palms-chow-bella-catering-catering-menu",
      "text": "[Page Title: Chow Bella Catering - Catering Menu]\n\nFeed Your Team, Impress Your Guests\nINQUIRE CHARLESTON, SC about catering INQUIRE Sarasota, FL about catering \nDitch the tired office lunch. Chow Bella’s corporate catering blends convenience with creativity, offering curated menus that work for teams of all sizes. Whether you're planning a casual lunch-and-learn or a formal executive dinner, we make it easy to feed your crew something they’ll actually be excited about.\n\nWith flexible service styles and delivery options, we can scale up or down to meet your needs — all while keeping it fresh, fast, and on budget.\n\nPopular options include:\n\nHot lunch buffets\nIndividual boxed meals\nAppetizer platters\nHappy hour bites\nPasta bars for team-building events\n\nPerfect for:\n\nOffice lunches, corporate parties, conferences, and networking mixers.\nCorporate Catering",
      "hash": "b3c880e2a29a",
      "downloadedAt": "2026-01-19T15:30:38.505Z",
      "trimmedAt": "2026-01-19T15:45:56.195Z",
      "sizeReduction": "99.0%"
    },
    {
      "url": "http://chowbellacatering.com/",
      "text": "[Page Title: Chow Bella Catering - James Island, Johns Island, Summerville, Daniel Island, Kiawah Island, Island of Palms, Charleston, SC]\n\n× \nDid you know we do catering?\n\nWhatever your occasion, however big or small, we have the perfect options to choose from.\n\nCater your birthday party, holiday party, corporate events, wedding festivities and more!\nCatering Inquiries \nChow Bella means “Hello, beautiful” in Italian. We think great food should feel like that.\n\nOur Story\n\nfrom food truck to full-service catering\nRead more about us Catering \nsupplying catering to special events of all types\n\nWhen it comes to your next event, let us take care of the food with our delicious and expertly crafted catering options featuring a wide range of dishes that are sure to please any palate.\nCatering \nGroups & Parties\n\ncustomize your celebration with our private party packages\n\nHost an event like no other with our private party options, customized to fit your every need. With flexible private party spaces and exceptional cuisine, your guests are sure to have a memorable and enjoyable experience.\nParties \nDefining delicious\n\nChow Bella Catering\n\nBruschetta appetizer\n\nGrilled chicken with pesto, closeup\n\nPotato gnocchi, with tomato sauce and basil\n\nBruschetta, closeup\n\nGnocchi, with gorgonzola\n\nSpaghetti with parmesan and pesto\n\nChicken pesto sandwich\n\nReviews\n\nreview by - Facebook\n\nLaura W:\n\nAmazing find-super flavorful, high end quality Italian food you'd expect in an exclusive restaurant. Really, really tasty.\n\nreview by - Facebook\n\nSimone R:\n\nI tried the chicken parm panini and it was out of this world fantastic. So flavorful, with crispy chicken, crispy ciabatta and the sauce was incredible!\n\nreview by - Facebook\n\nBecca K:\n\nThey came out for my rehearsal dinner at Hampton brew pub. They were amazing! Food was excellent and the service was great. Thank you so much.\n\nreview by - Facebook\n\nRita S:\n\nJust tried this truck for the first time tonight. I ordered the gnocchi with the Italian sausage. It was out of this world delicious. Probably the best I've ever had. Absolutely delicious. I will for sure be hunting you down! Try this truck... you don't be disappointed!!\n\nreview by - Facebook\n\nTim N:\n\nI met them today for the first time. great people and incredible food.. the pizza was to die for. I wanted another one right after the one I had. I will definitely get food from them again.\nStop reviews carousel Play reviews carousel \nNewsletter\n\nLocation\n\n874 Orleans Rd.\n\nCharleston, SC\n\n29412\n\nHours\n\nContact Hours:\n\n9am - 5pm Daily\n\nFind us on...\nFacebook page Instagram page \nContact us\n(843)-410-9762 chowbellakitchen@gmail.com × \nNewsletter",
      "hash": "e129aad7dcd4",
      "downloadedAt": "2026-01-19T15:30:38.392Z",
      "trimmedAt": "2026-01-19T15:45:56.208Z",
      "sizeReduction": "98.0%"
    }
  ],
  "sizeReduction": "98.4%"
}