{
  "venueId": "ChIJBRtBvxF6_ogRZ5vT2vtTJzY",
  "venueName": "Poogan's Porch",
  "venueArea": "Downtown Charleston",
  "website": "https://www.poogansporch.com/",
  "scrapedAt": "2026-01-19T15:41:55.680Z",
  "trimmedAt": "2026-01-19T15:42:49.135Z",
  "pages": [
    {
      "url": "https://www.poogansporch.com/",
      "text": "[Page Title: Poogan's Porch | Southern Restaurant in Charleston | South Carolina]\n\ntop of page 72 Queen Street, Charleston, South Carolina 29401  |  Brunch served daily from 9am - 3pm  |  Dinner served nightly from 4:30pm - 9:30pm VIEW MENUS Located in the heart of Charleston’s historic district, Poogan’s Porch has been serving up warm hospitality and authentic Southern cuisine since 1976. Housed in a beautifully restored Victorian home, our restaurant is steeped in Lowcountry tradition — and a few ghostly tales. Named after the neighborhood’s beloved pup, Poogan, we’ve welcomed locals, visitors, and even celebrities to our tables for decades. Whether you’re here for our famous shrimp and grits or hoping to catch a glimpse of our resident spirits, a meal at Poogan’s Porch is always unforgettable. Dinner Monday - Sunday 4:30pm - 9:30pm Brunch Monday - Sunday 9:00am - 3:00pm 843-829-4332 72 Queen Street, Charleston, SC 29401 RESERVE A TABLE Make their day. A Poogan’s Hospitality gift card is the perfect way to treat someone special to a warm welcome and an unforgettable dining experience. ​ Choose the amount that fits the occasion, whether it’s a casual bite or a full Southern feast. Available for purchase in person or delivered instantly via email or text, our gift cards make last-minute gifting effortless. You can even schedule a digital delivery for a future date or time. And with no expiration date, they can savor their meal whenever the moment feels just right. PURCHASE - Ashton C. I’ve lived in Charleston for two years as an avid eater. I love to try all different kinds of food, and the Holy City is one of the best for it. I've always heard about Poogan’s Porch from friends, but never made the stop until today. Am I glad I did! Not only was the fried chicken the best I’ve ever had, the biscuits and drinks were to die for! As if incredible food wasn’t enough, the service was beyond spectacular. As I walked in, I was greeted by their staff as if I was an old friend returning home. I felt genuine care for my experience and will forever recommend Poogan’s Porch as a premier restaurant in Charleston. If you find yourself within an hour of the city, please do yourself and your stomach a favor and check them out. - Ben T. My wife and I were roaming Charleston on Christmas Eve and popped in here thanks to our friends' recommendation. We ordered and shared the Cobb Wedge salad and Poogan's Fried Chicken sandwich. We've never had a cobb wedge constructed like it was, and I will say that it was very good. The marinated butter beans really added a unique flavor to the salad. I don't even know where to begin with the sandwich. It was absolutely delicious and one of the best I've had. Every topping worked and complemented the perfectly seasoned and crispy fried chicken. I also enjoyed the fries! As a Charleston visitor, I'd say check out Poogan's because I think you'll have a great meal. Kind words from good folks. Your turn to dish! Tell us about your visit, and you just might see your words featured here. LEAVE A REVIEW bottom of page",
      "hash": "6161f67bd9bd",
      "downloadedAt": "2026-01-19T15:29:42.408Z",
      "trimmedAt": "2026-01-19T15:42:48.900Z",
      "sizeReduction": "99.7%"
    },
    {
      "url": "https://www.poogansporch.com/menus",
      "text": "[Page Title: Menus | Poogan's Porch]\n\ntop of page Rooted in tradition. Inspired by the future. Since 1976, Poogan’s Porch has been a place where tradition and hospitality come together at the table. As we approach our 50th anniversary, we’re honoring the recipes that made us a Charleston staple while embracing the flavors that keep us moving forward. ​ Some things never change, like our warm welcome and our famous shrimp & grits, but every season brings something new. Here’s to the next bite. Brunch Served daily from 9am - 3pm EYE-OPENERS ZOE'S ICED COFFEE Espresso vodka, Irish cream, coffee liqueur $13 MIMOSA Orange, pineapple, grapefruit, cranberry, or apple juice glass $10 carafe $36 POOGAN'S BLOODY MARY Pearl cucumber vodka or Dixie black pepper vodka, house bloody mary mix, pickled okra $12 STARTERS FRIED GREEN TOMATOES Charred onion dip, pickled vegetables $15 BACON & EGGS Crispy pork, deviled egg salad, cheese straw biscuit $15 PIMENTO CHEESE FRITTERS Bacon jam $14 MAC & CHEESE Country ham, cornbread crumbs, green onions $14 CAROLINA CRAB CAKE Lump crab, aged cheddar grits, sweet corn bisque $23 SHE-CRAB SOUP Seasoned blue crab, chives cup $9 bowl $13 SALADS HOUSE SALAD Spring mix, cherry tomato, shallot, red onion, blue cheese, lemon basil vinaigrette add fried chicken $9 add grilled chicken $9 add sautéed shrimp $12 add salmon $16 SOUTHERN CAESAR SALAD Butter beans, cheese cracklin, cornbread gremolata, Caesar dressing add fried chicken $9 add grilled chicken $9 add sautéed shrimp $12 add salmon $16 BREAKFAST ENTRÉES DOWN-HOME BREAKFAST Two eggs, choice of bacon or sausage, choice of fried potatoes or grits $14 TOMATO PIE OMELET Egg whites, confit heirloom tomato, smoked bacon, southern cheeses, herbs, fried potatoes $18 LOWCOUNTRY HASH Fire engine corned beef hash, bacon fat rice, two Storey Farms fried eggs, red-eye hot sauce $18 CHICKEN & WAFFLES Buttermilk fried chicken tenders, malted waffle, peaches, bourbon huckleberry syrup $22 CRAB CAKE BENEDICT Grit cake, country ham, hollandaise, fried potatoes $25 SMOTHERED BISCUITS & GRAVY Cheese straw biscuits, sack sausage gravy, nduja, fried onion, two Storey Farms eggs $18 LUNCH ENTRÉES AWARD-WINNING SHRIMP & GRITS (as featured in USA Today) Cooper River Farms andouille sausage, onions, peppers, Tasso ham gravy Add egg $2.5 POOGAN'S FAMOUS BONE-IN FRIED CHICKEN Hoppin' John with country ham, collard greens, hot honey $24 SMASH BURGER Double patty, American cheese, burger sauce, lettuce, tomato, onion, brioche bun, french fries Add bacon $2 POOGAN'S FRIED CHICKEN SANDWICH Pimento cheese, tomato bacon jam, lettuce, cajun remoulade, brioche bun, french fries $16 SIDES Two Storey Farms Eggs $6 Three Sausage Links $6 Four Bacon Slices $6 Smoked Country Ham $6 Grits $6 Fries $6 Fried Breakfast Potatoes $6 DESSERTS BANANA PUDDING Bourbon vanilla pudding, whipped cream, bananas, Nilla wafers $10 CAST-IRON PEACH COBBLER Mee-Maw's biscuit, biscuit streusel, candied pecans, vanilla bean ice cream $12 PECAN PIE Vanilla bean ice cream, caramel sauce $12 bottom of page",
      "hash": "96314b73b586",
      "downloadedAt": "2026-01-19T15:29:42.591Z",
      "trimmedAt": "2026-01-19T15:42:49.071Z",
      "sizeReduction": "99.8%"
    },
    {
      "url": "https://www.poogansporch.com/events",
      "text": "[Page Title: Catering & Events | Poogan's Porch]\n\ntop of page Your special occasion, our Southern touch. We’re honored to be part of your special moments. While Poogan’s Porch doesn’t host private events within our restaurant, we do have sister restaurants and venues nearby that can make your gathering unforgettable. And with our pickup catering option, we can make sure your favorites from Poogan’s Porch are at your celebration, no matter the location. Select the venue option that suits your party preferences. Not sure which venue to choose, or need a little more guidance? Fill out the inquiry form below and our sales manager will be in touch. Poogan's Courtyard (For parties of 15-125 guests) From rehearsal dinners to family reunions to birthdays and weddings, Poogan's Courtyard offers a sophisticated space to host your next event. Your guests will enjoy the convenience of our downtown Charleston location – just a short walk from nearby hotels, shopping, and attractions. Learn More 12 Cumberland Steet, Charleston, SC 29401 (French Quarter – Downtown Charleston) Poogan's Smokehouse (For parties of 15-40 guests) Classically and casually Southern, Poogan's Smokehouse specializes in authentic, slow-smoked BBQ. Located in historic downtown Charleston on East Bay Street, Poogan's Smokehouse's industrial-style loft offers the perfect setting for your next event, whether it's a corporate dinner or birthday celebration. Learn More 188 East Bay Street, Charleston, SC 29401 (French Quarter – Downtown Charleston) Poogan's Southern Kitchen (For parties of 15-70 guests) From our famous buttermilk fried chicken to our fluffy biscuits, Poogan's Southern Kitchen offers a comfortable and approachable private dining experience in Nexton Square in Summerville, SC! Enjoy family-style favorites or passed appetizers in our spacious second-floor mezzanine. Learn More 101 Nexton Square Drive, Summerville, SC 29486 (Nexton Square – Summerville, South Carolina) Pickup Catering (For parties of 6+ guests) Make your next event a hit with catering from Poogan's. From fried green tomatoes to shrimp & grits and deviled eggs, we've got the Southern comfort covered. Place your order online and it will be ready at Poogan's Smokehouse. The only work you’ll have to do is picking up your order! View our menu below. Order Now 188 East Bay Street, Charleston, SC 29401 (French Quarter – Downtown Charleston) \nAt Your Service\nMeet Poogan's Hospitality's Senior Sales Manager. Zoe is here to help you navigate the planning process and ensure you have an exceptional event experience. Zoe Stewart, Fill out the form below to inquire about one of our unique spaces, then Zoe will be in touch with you shortly with details. bottom of page",
      "hash": "d97370d6d94f",
      "downloadedAt": "2026-01-19T15:29:43.143Z",
      "trimmedAt": "2026-01-19T15:42:49.135Z",
      "sizeReduction": "99.6%"
    }
  ],
  "sizeReduction": "99.7%"
}