{
  "venueId": "ChIJDZ7DvBF6_ogRhOZ4IH9ehhE",
  "venueName": "82 Queen",
  "venueArea": "Downtown Charleston",
  "website": "https://www.82queen.com/",
  "scrapedAt": "2026-01-19T15:41:56.013Z",
  "trimmedAt": "2026-01-19T15:43:00.643Z",
  "pages": [
    {
      "url": "https://www.82queen.com/charleston-french-quarter-82-queen-drink-menu",
      "text": "[Page Title: 82 Queen - Drink Menu]\n\nOur Drinks\nCocktails Beer Wines Spirits Non-Alcoholic",
      "hash": "3ba3f41935d9",
      "downloadedAt": "2026-01-19T15:26:37.154Z",
      "trimmedAt": "2026-01-19T15:43:00.609Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "https://www.82queen.com/charleston-french-quarter-82-queen-food-menu",
      "text": "[Page Title: 82 Queen - Food Menu]\n\nOur Menu\nBrunch Menu Lunch Menu Dinner Menu Kids Menu Mid-Day Menu Christmas Eve Menu New Years Eve Menu",
      "hash": "cf0b60eaa433",
      "downloadedAt": "2026-01-19T15:26:36.573Z",
      "trimmedAt": "2026-01-19T15:43:00.616Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "https://www.82queen.com/",
      "text": "[Page Title: 82 Queen - French Quarter, Charleston, SC]\n\nParties & Groups - Host your next party or get together\nBook your party Parties & Groups - Host your next party or get together \nCatering - Cater your birthday party, holiday party, corporate events, wedding festivities and more!\nCatering Packages Catering - Cater your birthday party, holiday party, corporate events, wedding festivities and more! \nJob Listings - We're hiring! Call, email or submit an inquiry today to learn more!\nJob Listings Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! \n82 Queen Street, Charleston, SC 29401\nmap marker pin About Us \nQuintessentially Lowcountry. Simply Delicious.\nQuintessentially Lowcountry. Simply Delicious. \nIn 1982, three restaurateurs had the vision to provide a uniquely “Charleston” dining experience with a focus on fresh, local cuisine and gracious hospitality. They had the perfect setting consisting of three buildings and a garden courtyard nestled in the Historic French Quarter, but they could not agree on a name.\nRead more about us \nReservations\n\nWe look forward to seeing you!\n\nEnsure you never miss out. Make an online reservation.\nBook your 82 Queen reservation on Resy \nFRESH AND SEASONAL CUISINE\nour menu \nYOUR PRIVATE PARTY SPOT\nparties \nBOOK A TABLE ONLINE\nreservations Dot slide navigation number 1 Dot slide navigation number 2 Dot slide navigation number 3 slideshow start stop playing Book a Party! \nQuality, Service, Hospitality.\n\nNeed the perfect space for your special event?\nYour search is over. Host your party at 82 Queen.\nYou invite the guests and we will take care of the rest!\nparties book \nGallery\n\nReviews\n\nreview by - Google\n\nRudolf M:\n\n82 Queen was such a special treat. The staff was more than friendly upon our arrival. We didn’t have a reservation but I felt like it wouldn’t have been a bad idea to get one before we dined there. The food was amazingly delicious with tons of flavor. Never had She crab soup and it was amazing. Go ahead a treat yourself to a great southern style meal.\n\nreview by - Google\n\nSarah G:\n\nThe food was delicious, & the presentation made the meal feel all the more special! The restaurant's layout is unique & takes advantage of the historic building it's in; the patio is cozy and inviting! I'm so glad we happened to walk by when we were looking for a nice place for dinner!\n\nreview by - Google\n\nMichelle W:\n\nWe went for brunch and loved everything we ordered! The place is super popular so make sure you make reservation well ahead of time. Shrimp and grits, crab cakes Benedict, French toast, jambalaya, fish and grits, all very delicious\n\nreview by - Google\n\nApril W:\n\nThe ambiance was lovely. We sat outside on a beautiful day and got a great seat under the gazebo! Loved that. Our food was yummy! We tried the she crab soup which was nice. The bbq shrimp and grits were good. The star of the show was the chefs special that day though. The kids pasta and shrimp was delicious and our son liked his po’boy very much but I think he liked the homemade chips best. Our server was very friendly and great.\n\nreview by - Google\n\nTammy A:\n\nBeautiful decor and atmosphere for our anniversary. The food was simply delicious and larger servings than I excepted. We had She Soup, very good with lots of flavor. We shared the salad and then I had crab cakes, which were delicious!! Desert was a refreshing lemon and creme cake. Thank you for the great service!!\nStop reviews carousel Play reviews carousel \nNewsletter\n\nLocation\n\n82 Queen Street\n\nCharleston, SC\n\n29401\n\nHours\n\nMonday-Friday Lunch:\n\nFirst seating is at 11:00am.\n\nLast seating is at 2:00pm.\n\nSaturday and Sunday Brunch:\n\nFirst seating is at 10:00am.\n\nLast seating is at 2:00pm.\n\nMid-day Daily:\n\n2:00pm - 5:00pm.\n\nDinner Daily:\n\nFirst seating is at 5:00pm.\n\nLast seating is at 9:30pm.\n\nFind us on...\nInstagram page \nContact us\n(843)-723-7591 82Queen@QueenStreetHospitality.com \nPowered by:\nWebsite design, Social Media marketing and Email marketing provided by SpotHopper. × \nNewsletter",
      "hash": "d9389b252b9c",
      "downloadedAt": "2026-01-19T15:26:36.492Z",
      "trimmedAt": "2026-01-19T15:43:00.643Z",
      "sizeReduction": "97.7%"
    }
  ],
  "sizeReduction": "99.0%"
}