{
  "venueId": "ChIJP9EbCOB8_ogRdlMHzf0-lzY",
  "venueName": "Pizza Hut",
  "venueArea": "West Ashley",
  "website": "https://locations.pizzahut.com/sc/charleston/2457-ashley-river-rd?utm_medium=organic&utm_source=local&utm_campaign=googlelistings&utm_content=website&utm_term=310161",
  "scrapedAt": "2026-01-19T15:41:58.170Z",
  "trimmedAt": "2026-01-19T15:44:59.920Z",
  "pages": [
    {
      "url": "https://locations.pizzahut.com/",
      "text": "[Page Title: Pizza Hut Near Me - Store Locations | Pizza Hut]\n\nPIZZA HUT LOCATIONS\n\nSearch by zip or address to find your closest Pizza Hut using the \"Find a Pizza Hut Near Me\" button below.\n\nAlternatively, browse our 6,000+ locations by city and state below. With online  and  ordering options, Pizza Hut makes it easy to skip the line. Our menu includes pizza, wings, pasta and more. Try our  or grab a slice of a classic . And if you’re feeling hungry on-the-go, drop by one of The Hut Lane™  locations. Enjoy!\ndelivery take out Original Stuffed Crust® Pizza Pepperoni Pizza drive thru Find a Pizza Hut Near Me Alaska (11) Alabama (143) Arkansas (99) Arizona (141) California (507) Colorado (116) Connecticut (10) Washington DC (5) Delaware (9) Florida (441) Georgia (266) Guam (5) Hawaii (36) Iowa (82) Idaho (37) Illinois (168) Indiana (168) Kansas (157) Kentucky (115) Louisiana (151) Massachusetts (32) Maryland (99) Maine (16) Michigan (130) Minnesota (99) Missouri (191) Northern Mariana Islands (1) Mississippi (109) Montana (30) North Carolina (252) North Dakota (14) Nebraska (67) New Hampshire (13) New Jersey (81) New Mexico (50) Nevada (70) New York (156) Ohio (264) Oklahoma (133) Oregon (46) Pennsylvania (191) Rhode Island (4) South Carolina (108) South Dakota (32) Tennessee (166) Texas (965) Utah (66) Virginia (191) Vermont (5) Washington (100) Wisconsin (105) West Virginia (47) Wyoming (28)",
      "hash": "537cf5c8535c",
      "downloadedAt": "2026-01-19T15:37:33.869Z",
      "trimmedAt": "2026-01-19T15:44:59.870Z",
      "sizeReduction": "99.1%"
    },
    {
      "url": "https://locations.pizzahut.com/sc/charleston/2457-ashley-river-rd?utm_medium=organic&utm_source=local&utm_campaign=googlelistings&utm_content=website&utm_term=310161",
      "text": "[Page Title: Pizza Hut: Pizza & Wings - Delivery & Take Out From 2457 Ashley River Rd.]\n\n$ Pizza Pizza Hut \nPizza Delivery & Take Out\n\nPizza Hut\n\nIn Charleston SC, 2457 Ashley River Rd\nFind your nearby Pizza Hut® at 2457 Ashley River Rd. in Charleston, SC. You can try, but you can’t OutPizza the Hut. We’re serving up classics like Meat Lovers® and Original Stuffed Crust® as well as signature wings, pastas and desserts at many of our locations. Order online or on the mobile app for carryout, curbside or delivery. \nDelivery\n\nCarryout\n\nLocation details\n2457 Ashley River Rd Ste. 1 Charleston , SC 29414 Get Directions \n(843) 735-6500\n(843) 735-6500 Map Pin Google Listing \nRestaurant hours\nDELIVERY CARRY-OUT Day of the Week Hours Mon 10:00 AM - 12:00 AM Tue 10:00 AM - 12:00 AM Wed 10:00 AM - 12:00 AM Thu 10:00 AM - 12:00 AM Fri 10:00 AM - 12:00 AM Sat 10:00 AM - 12:00 AM Sun 10:00 AM - 12:00 AM Day of the Week Hours Mon 10:00 AM - 12:00 AM Tue 10:00 AM - 12:00 AM Wed 10:00 AM - 12:00 AM Thu 10:00 AM - 12:00 AM Fri 10:00 AM - 12:00 AM Sat 10:00 AM - 12:00 AM Sun 10:00 AM - 12:00 AM \nDelivery hours may vary\n\nDownload The App!\nDownload today for the easiest way to order your favorite pizza, wings, desserts and more! We’ve added contactless ordering features, so you and your family can get your favorite pizza without worry. Our app is designed for pizza lovers, making fast food delivery and takeout even easier. \nRead More About Pizza Hut in Charleston, SC\n\nAbout Pizza Hut Charleston, SC\n\nCalling all pizza lovers! There’s a Pizza Hut® near you at 2457 Ashley River Rd. in Charleston, SC that’s serving up your favorite , & more.\npizza wings \nDo we have the best pizza in Charleston? With decades of experience serving your favorites, Pizza Hut® is your go-to destination for all things pizza in Charleston. With our easy-to-navigate site & seamless online ordering, getting your hands on the pizzas you love has never been easier. Whether \nyou’re fueling up for game night, planning a low-key dinner or just treating yourself at the end of a long day, Pizza Hut’s got you. With & options in Charleston, your faves are never too far away.\nfamily carryout delivery \nDiscover great available at your local Hut on 2457 Ashley River Rd.. There’s something for every craving & budget. Plus, our commitment to quality & service means that every pizza is made with care and quality ingredients. So why wait? now and get ready to experience pizza perfection!\ndeals Start your online order \nStart Your Order\n\nMenu\nOrder online from our menu of pizzas, wings, desserts, sides and more! Start with one of our popular recipes like Ultimate Cheese Lover’s® pizza, Pepperoni Lover’s® pizza, Meat Lover's® pizza, Veggie Lover's® pizza, or Supreme. Or, build your own pizza by choosing one of our crust types such as Original Pan® pizza, Hand Tossed pizza, Thin ‘N Crispy® or  and then add your favorite toppings. Check out PizzaHut.com or browse our  for more information. Original Stuffed Crust® sitemap View Full Menu Pizza Wings Sides Pasta Dessert Drinks \nCrust Types\nOriginal Stuffed Crust® You just can’t beat the original. Original Stuffed Crust® Pizza is topped & stuffed with over 1/2 a pound of cheese. It’s the OG Stuffed Crust pizza & it’s only at Pizza Hut. Don’t wait—treat yourself to a cheese-filled classic today & get a large  with your favorite topping today. Additional charges apply for extra toppings and extra cheese. Original Stuffed Crust® Hand Tossed Pizza You can’t go wrong with a classic Hand Tossed Pizza. Our Hand Tossed crust is handcrafted with a lighter, airier crust and is one of-a-kind, every time. Load it up with your favorite toppings or keep it classic with cheese. No matter how you top it, Hand Tossed Pizza is the perfect way to treat yourself on pizza night. Original Pan® Pizza With a crust that's crispy on the outside & fluffy on the inside,  is as legendary as it is delicious. Load it up with your favorite toppings or keep it classic with cheese. Not feeling a medium or large? No problem. Get the flavor you love in a size fit for one when you order . Original Pan® Pizza Personal Pan Pizza® \nDelivery\n\nCarryout\n\nMore about Pizza Hut\n\nWe're Hiring\n\nApply today for jobs as a team member, delivery driver, restaurant management, and more. Passionate about pizza? Come join the team!\nApply Now \nHut Rewards\n\nEarn free pizza fast. When your faves are free in as few as two to three visits, you'll be redeeming rewards items in no time. For every $1 you spend on food and drinks you'll earn 2 points.\nApply Now \nWe're Here For You\n\nPizza Hut is open and here to provide you nationwide contactless options to get your pizza any way you want it: delivery, carryout or curbside pickup.\nApply Now \nTrending searches\nFood Places Near Me Takeout Near Me Pizzeria Near Me Fast Food Near Me Delivery Near Me Wings Near Me \nFAQs\nDoes Pizza Hut Offer Delivery? While most stores offer delivery, availability of delivery varies by location. Click here to find a participating store near you. Where is My Nearest Pizza Hut? Click here to find a store near you. Does Pizza Hut Offer Coupons? Availability of coupons varies by location. Find your nearest store and click on the deals tab to see the latest offers. Does Pizza Hut Have Wings? Pizza Hut serves up traditional and boneless wings tossed in 9 signature sauces and rubs. Availability of wings and flavors varies by location. Click here to find a participating store near you. What Pizzas Are on the Menu? If you're craving it, Pizza Hut's baking it. Choose one of our classic recipes or create your own on one of 4 signature crusts: Hand-Tossed, Thin 'N Crispy®, Original Pan® or Original Stuffed Crust® . Product availability varies by location.",
      "hash": "65ebfbaccfe2",
      "downloadedAt": "2026-01-19T15:37:33.262Z",
      "trimmedAt": "2026-01-19T15:44:59.901Z",
      "sizeReduction": "96.5%"
    },
    {
      "url": "https://locations.pizzahut.com/pizza-calculator",
      "text": "[Page Title: Pizza Calculator - How Many Pizzas to Order | Pizza Hut]\n\nPizza Calculator\n\nEstimate how many pizzas you’ll need for any group size or appetite.\nAdults – ＋ Children – ＋ Appetite Level Normal Hungry Starving Slices per pizza – ＋ \n(most Pizza Hut pizzas are 8 slices)\nCalculate Order Now Number of people Number of pizzas 5-10 2-4 pizzas 15-20 6-8 pizzas 25-30 10-12 pizzas 35-40 14-15 pizzas 45-50 17-19 pizzas \nHow Many Pizzas Do You Need?\n\nFor a baseline, Pizza Hut chefs recommend planning for 2-3 slices per person if you expect hearty appetites. Group events, study sessions, and family nights all have different needs, so using our Pizza Calculator can quickly provide a tailored suggestion. Enter your group size, hunger level, and slice count to get a precise recommendation - so you can focus on enjoying your meal instead of doing math.\n\nPizza Hut’s Expert Tip\n\nFor hearty appetites, plan for 2-3 slices per adult, 1-2 per child. You may need a little more for athletes and big party crowds, or a little less for lighter eaters and casual gatherings.\n\nHow Many Slices of Pizza?\n\nSince Pizza Hut pizzas are typically cut into 8 slices, it’s easy to estimate how many pies you'll need - though keep in mind that slice counts can vary at other pizza places. Start with your headcount, multiply by slices per person, and divide by eight to get a solid baseline for how many pizzas to order.\n\nPizzas for Group Events\n\nOrdering pizza for a group - whether it’s roommates, a club meeting, or a birthday party - requires balancing appetites, group size, and the number of slices per pizza. Guessing can lead to hungry guests or piles of leftovers, but using our pizza calculator can assist by removing some of the uncertainty.\n\nAdjustment Tips for Appetites\n\nFor events with mostly teens or athletes, increase your order by a little more. For lighter eaters or events with lots of other food, reduce it slightly. Always round up to the next whole pizza to avoid running short. Our pizza calculator lets you input these variables quickly, giving you a clear, tailored recommendation for your event.\n\nPizza Hut Menu Options for Groups\n\nPizza Hut offers several menu options tailored to different group sizes, making event planning easier and more cost-effective.\n\nThe Big Dinner Box is designed for sharing, including two medium one-topping pizzas, five breadsticks, and wings*. This box is ideal for groups of 4–6, providing variety and enough food to go around without the need for complex calculations.\nBig Dinner Box: \nThe Triple Treat Box bundles two medium one-topping pizzas, five breadsticks, and Cinnamon Sticks. This limited time option suits smaller gatherings or family nights, offering a complete meal with dessert included.\nTriple Treat Box: \nAdding sides like Breadsticks, Cheese Sticks, Pasta, and Salad can stretch your pizza order further, especially for larger groups or events with mixed appetites.\nSides and Add-Ons: View Menu \nFAQs\nView All How does the Pizza Calculator work? What’s the best way to calculate pizzas for a party? How many slices are in a large pizza? How many slices are in a medium pizza? How many pizzas should I order for 20 people? How many pizzas should I order for 30 people? How many slices of pizza do adults typically eat? How many slices of pizza do children typically eat? How many slices in a large Pizza Hut pizza? How many pizzas can I order from Pizza Hut? View All \n*Includes 2 medium 1 topping pizzas, breadsticks, and 8 count boneless wings. Additional charge for large pizza upgrade, extra toppings, extra cheese, pasta, bone-in wings, stick upgrade, and dipping sauce. Availability of fried wings and flavors may vary. Not available on Stuffed Crust. Product availability, prices & participation vary. Priced higher in some locations, including CA. Taxes, tip & fees not included.\n\n**Limited time only. Includes 2 medium 1-topping pizzas. Additional charge for more than 1 pizza topping, Pan & extra cheese. Additional charge for select dessert options & cheese stick upgrade. Product availability (including special holiday packaging), prices & participation vary. Priced higher in some locations, including CA. Taxes, tip & delivery fees not included.\n\nTrending Searches\nBig Dinner Box Triple Treat Box Pizza Near Me",
      "hash": "d67748b673d7",
      "downloadedAt": "2026-01-19T15:37:33.332Z",
      "trimmedAt": "2026-01-19T15:44:59.920Z",
      "sizeReduction": "96.7%"
    }
  ],
  "sizeReduction": "97.5%"
}