{
  "venueId": "ChIJN6vZ__Nx_ogRB7Yns22lvr4",
  "venueName": "IHOP",
  "venueArea": "Mount Pleasant",
  "website": "https://restaurants.ihop.com/en-us/sc/mount-pleasant/breakfast-1787-n.-hwy-17-4467?utm_source=google&utm_medium=organic&utm_campaign=google_my_business&utm_term=4467&utm_content=website",
  "scrapedAt": "2026-01-19T15:41:57.834Z",
  "trimmedAt": "2026-01-19T15:44:56.721Z",
  "pages": [
    {
      "url": "https://restaurants.ihop.com/en-us/",
      "text": "[Page Title: IHOP® Restaurant Locations | Breakfast, Lunch & Dinner - Pancakes 24/7]\n\nSelect Search Type Find an IHOP Near You Enter address, city, or zip code Search Takeout & Phone Orders Catering Open Now \nThere are no locations in your search area. Please try a different search area.\nPREVIOUS Next \nIHOP® Restaurant Locations | Breakfast, Lunch & Dinner - Pancakes 24/7\nHome \n/\nLOCATIONS \nWhether you're hungry for one of our popular breakfast items or looking for lunch, dinner, or late night dining ideas there is an IHOP® location near you ready to serve.\nDid You Know?... \nFor 67 years, the IHOP® family restaurant chain has served our world-famous pancakes and a wide variety of breakfast, lunch and dinner items that are loved by people of all ages - offering an affordable, everyday dining experience with warm and friendly service.\nCome as You Are \nDon't worry about formal attire, come as you are, as we offer a casual dining experience. See what other guests have enjoyed about their experiences by visiting our pages on or .\nFacebook YouTube \nBrowse IHOP Restaurants by State\nAlabama Alaska Arizona Arkansas California Colorado Connecticut Delaware District of Columbia Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Virginia Washington West Virginia Wisconsin Puerto Rico \nConnect with this IHOP",
      "hash": "08913b472751",
      "downloadedAt": "2026-01-19T15:31:36.521Z",
      "trimmedAt": "2026-01-19T15:44:56.630Z",
      "sizeReduction": "99.1%"
    },
    {
      "url": "https://restaurants.ihop.com/en-us/sc/mount-pleasant/breakfast-1787-n.-hwy-17-4467/specials",
      "text": "[Page Title: Mount Pleasant Breakfast & Pancake Specials - Daily Lunch & Meal Deals - IHOP® Location in 29464]\n\nSelect Search Type Find an IHOP Near You Enter address, city, or zip code Search \nAll-Day Breakfast & Daily Lunch Specials in Mount Pleasant\n1787 N. Hwy 17 Mount Pleasant, SC 29464 (843) 849-0639 \nAt IHOP, we serve breakfast and lunch specials all-day in Mount Pleasant. Whether you're craving fluffy Pancakes, Waffles, savory breakfast combos, or a hearty entrée, we have something to satisfy any taste.\n\nRestaurant Hours\nMonday Open 24 Hours Tuesday Open 24 Hours Wednesday Open 24 Hours Thursday Open 24 Hours Friday Open 24 Hours Saturday Open 24 Hours Sunday Open 24 Hours Directions Start Order View Menu \nLocation Amenities\n\nLet's put a smile on your plate\nCurbside Pickup Open 24 Hours Wi-Fi Available Dine-In Online Ordering Mount Pleasant Takeout Mount Pleasant Delivery Mount Pleasant Late Night Food Mount Pleasant Specials Mount Pleasant Burgers Mount Pleasant Omelettes Mount Pleasant Pancakes Mount Pleasant Waffles Home \n/\nLocations \n/\nSOUTH CAROLINA \n/\nMount Pleasant \n/\nIHOP 1787 N. Hwy 17 \n/\nSpecials \nTakeout Breakfast Specials in Mount Pleasant - Get 20% off your first online order\n** \nIHOP in Mount Pleasant has amazing takeout specials just for you! Order online with code IHOP20 for 20% off at checkout until 12/31/26. Don't miss out on the excitement- order now!\nOrder Takeout \n** Valid for 1-time use only and limit 1 per order. Tax and gratuity excluded. Not valid with other coupons and discounts. No cash value. Offer expires 12/31/26. Account sign up required. Online orders via IHOP site or app only. At participant restaurants. Further restrictions apply. 2026 IHOP Restaurants LLC.\n\nShare Joy with an IHOP Gift Card\n\nEnjoy delicious breakfast food with those who matter most with an IHOP gift card! Whether it's a birthday, anniversary, or just because, an IHOP gift card is sure to bring a smile to their face. Visit your local IHOP in Mount Pleasant to pick up a gift card today or send a card and make someone's day a little sweeter!\ndigital gift Buy Now \nGet Free Birthday Pancakes!\n\nJoin IHOP rewards and get the gift of a free birthday stack and other exclusive offers. Redeem points for free treats, and specialty items from the Stack Market. Sign up today!.\nJoin Now \nTry Family Feasts To Go in Mount Pleasant - IHOP 'N GO Specials\n\nLooking for a delicious meal to satisfy the whole family? Check out our Family Feast meal, available only with IHOP 'N Go.With IHOP's Family Feast, you can enjoy all your favorite IHOP classics, including pancakes, French toast, waffles, and burgers in the comfort if your own home! Simply order online and we'll have your Family Feast ready for pick-up or delivery in Mount Pleasant.\nStart Order PREVIOUS Next \nFrequently Asked Questions About IHOP Specials in Mount Pleasant\n\nDoes IHOP have a special for birthdays?\n\nYes! Get a free short stack of pancakes on your birthday at IHOP when you sign up for our rewards program.\n\nDoes IHOP have a breakfast special?\n\nOur breakfast specials are always changing, so be sure to check in with your local IHOP or on our website to see what delicious deals we're serving up.\n\nWhere can I find IHOP specials and coupons?\n\nYou can find the latest IHOP specials and coupons by signing up for our free rewards program. By signing up, you can earn points towards free food and gain access to special offers.\n\nFind Another IHOP Nearby\nIHOP Centre Point Dr Close \n4936 Centre Point Dr\n\nN. Charleston, SC 29418\n\nDistance 11.2 mi\n\nCurbside Pickup\n\nOpen 24 Hours\n\nWi-Fi Available\n\nDine-In\n\nOnline Ordering\n\nTakeout Available\n\nDelivery Available\n\nLate Night Food\n(854) 222-3743 View Menu Directions Start Order IHOP Mazyck Rd Close \n7361 Mazyck Rd\n\nN. Charleston, SC 29406\n\nDistance 14.4 mi\n\nCurbside Pickup\n\nOpen 24 Hours\n\nWi-Fi Available\n\nDine-In\n\nOnline Ordering\n\nTakeout Available\n\nDelivery Available\n\nLate Night Food\n(843) 824-9390 View Menu Directions Start Order IHOP N Main St Close \n1217 N Main St\n\nSummerville, SC 29483\n\nDistance 23.6 mi\n\nCurbside Pickup\n\nWi-Fi Available\n\nDine-In\n\nOnline Ordering\n\nTakeout Available\n\nDelivery Available\n(843) 851-3400 View Menu Directions Start Order \nThere are no locations in your search area. Please try a different search area.\n\nConnect with this IHOP\n\n*Prices may vary, see server for details. Available while supplies last. © 2026 IHOP Restaurants LLC.",
      "hash": "ad44cb248ae6",
      "downloadedAt": "2026-01-19T15:31:37.357Z",
      "trimmedAt": "2026-01-19T15:44:56.680Z",
      "sizeReduction": "97.8%"
    },
    {
      "url": "https://restaurants.ihop.com/en-us/sc/mount-pleasant/breakfast-1787-n.-hwy-17-4467?utm_source=google&utm_medium=organic&utm_campaign=google_my_business&utm_term=4467&utm_content=website",
      "text": "[Page Title: IHOP® Breakfast in Mount Pleasant, SC on 1787 N. Hwy 17]\n\nSelect Search Type Find an IHOP Near You Enter address, city, or zip code Search \nIHOP Breakfast Restaurants Near You at 1787 N. Hwy 17\n\n1787 N. Hwy 17\n\nMount Pleasant, SC 29464\n(843) 849-0639 Start Order Directions \nRestaurant Hours\nMonday Open 24 Hours Tuesday Open 24 Hours Wednesday Open 24 Hours Thursday Open 24 Hours Friday Open 24 Hours Saturday Open 24 Hours Sunday Open 24 Hours \nRestaurant Amenities\nCurbside Pickup Open 24 Hours Wi-Fi Available Dine-In Online Ordering Late Night Food \nOffered in Mount Pleasant\nTakeout Delivery Late Night Food Careers Specials Burgers Omelettes Pancakes Waffles \nRestaurant Amenities\nCurbside Pickup Open 24 Hours Wi-Fi Available Dine-In Online Ordering Late Night Food Home \n/\nLocations \n/\nSOUTH CAROLINA \n/\nMount Pleasant \n/\nIHOP 1787 N. Hwy 17 \nVisit your Favorite Breakfast Restaurant in Mount Pleasant\n\nAs you make your way down Mazzy Ln or N Hwy 17, take a break and dine in at your local IHOP restaurant! Our menu is full of variety and ready for you any time of day. For the breakfast lovers, we’ve got stacks of world-famous and an array of delicious freshly made , or you can dive into our newest breakfast items and try our tasty or our . And if you happen to be gluten intolerant, never fear! We’ve now launched our options with pancakes and more!\nIHOP Pancakes Omelettes Eggs Benedicts Sweet and Savory Crepes Gluten-Friendly \nMaybe you’re on your way to Mount Pleasant Regional-Faison Field Airport and hungry for mouth-watering food? Why not try our popular like Grilled or ? Or peruse our or Menus – we serve it all!\nEntrées Atlantic Salmon Sirloin Steak Tips Big Breakfast Burrito Platters \nAt IHOP, we invite the whole family to join us - Appetites big and small, we cater to all. Choose one of our fun-filled or order from our exclusive just for . The best part – use the convenient App and get 20% off by using code IHOP20 on your 1st order. Now that is savings the whole family will love!\nKids Menu 55+ Menu IHOP 'N Go \nThis IHOP breakfast restaurant is located at 1787 N. Hwy 17, Mount Pleasant 29464 between Mazzy Ln and N Hwy 17. Our nearest bus stop is Hwy 17 / Venning Rd.\nGET DIRECTIONS \nTrending in Mount Pleasant\nTakeout In Mount Pleasant Delivery In Mount Pleasant Late Night Food In Mount Pleasant Careers In Mount Pleasant Specials In Mount Pleasant Burgers In Mount Pleasant Omelettes In Mount Pleasant Pancakes In Mount Pleasant Waffles In Mount Pleasant \nThe Best Lunch and Dinner Spots Near 29464\n\nFuel up with a mouthwatering lunch or dinner at this Mount Pleasant IHOP at the intersection of Mazzy Ln and N Hwy 17. Try our , or any of our juicy and more menu favorites that are sure to delight!\nCountry Fried Steak Bacon Avocado Ranch Start Order \nWhat's on the Menu at IHOP\n Mount Pleasant\n\nFamily Feasts (IHOP ‘N GO only)\n\nOmelettes\n\nBurritos & Bowls\n\nWorld-Famous Buttermilk Pancakes & Crepes\n\nHand-Crafted Melts\n\n55+ Menu\n\nCombos\n\nBurgers & Chicken Sandwiches\n\nKids Menu (12 & Under)\nSee Full Menu \nSo Many Delicious Menu Choices at IHOP\n\nOur pancakes are world-famous, but we pride ourselves on continuously updating our current offerings! for a sure way to satisfy every appetite. The or would make the perfect feast for today. Take advantage of each limited time offer of discounted menu items. Come on in and enjoy the food you love with the people you love!\nTry Our New Menu Items Juicy Steakburger Chicken Sandwich PREVIOUS Next \nEnjoy IHOP and Soak up Some Sunshine at Palmetto Islands County Park\n\nWhether you’re looking to enjoy the outdoors or just want some flavorful food at home, order some IHOP favorites for or and live your best life!\nTakeout Delivery \nHere are some easy locations nearby to savor your IHOP meal:\n\nPalmetto Park Observation Tower\n\nFort Palmetto Park\n\nWe’ve got the answer for your next fiesta too – IHOP offers for events like team-building, birthday parties, family reunions, you name it! Place a quick and convenient order that will put a smile on your plate!\nCatering \nOur Breakfast Restaurant Bordering Charleston, SCand Near These Mount Pleasant Destinations\n\nWhen you visit this IHOP location for our world-famous pancakes and delicious lunch and dinner specials, you’re in great company with nearby Iron Gate Plaza shopping. This local community is host to celebrated annual events!\n\nSweetgrass Half Marathon\n\nMount Pleasant Farmers Market\n\nWe also salute those serving our local neighborhood, including the staff at Charleston Area Convention Center and Isle of Palms Police Department, and the hard-working teams at Charleston Traffic Enforcement and Mount Pleasant Fire Dept. Station 4. We’re thrilled to share this vibrant Mount Pleasant neighborhood with you!\n\nMaking a hunger stop on your road trip? You’ll find our location nestled near these cities and landmarks:\n\nCharleston, SC\n\nNorth Charleston, SC\n\nHanahan, SC\n\nGoose Creek, SC\n\nFoster Creek\n\nHorlbeck Creek\n\nFrequently Asked Questions About IHOP Restaurant in Mount Pleasant\n\nDoes IHOP in Mount Pleasant, SC Have a Senior Discount?\n\nIHOP’s special senior menu offers guests 55+ delicious menu items at lower prices!\n\nFind Another IHOP Nearby\nIHOP Centre Point Dr Close \n4936 Centre Point Dr\n\nN. Charleston, SC 29418\n\nDistance 11.2 mi\n\nCurbside Pickup\n\nOpen 24 Hours\n\nWi-Fi Available\n\nDine-In\n\nOnline Ordering\n\nTakeout Available\n\nDelivery Available\n\nLate Night Food\n(854) 222-3743 View Menu Directions Start Order IHOP Mazyck Rd Close \n7361 Mazyck Rd\n\nN. Charleston, SC 29406\n\nDistance 14.4 mi\n\nCurbside Pickup\n\nOpen 24 Hours\n\nWi-Fi Available\n\nDine-In\n\nOnline Ordering\n\nTakeout Available\n\nDelivery Available\n\nLate Night Food\n(843) 824-9390 View Menu Directions Start Order IHOP N Main St Close \n1217 N Main St\n\nSummerville, SC 29483\n\nDistance 23.6 mi\n\nCurbside Pickup\n\nWi-Fi Available\n\nDine-In\n\nOnline Ordering\n\nTakeout Available\n\nDelivery Available\n(843) 851-3400 View Menu Directions Start Order \nThere are no locations in your search area. Please try a different search area.",
      "hash": "b7f7a2fb71e8",
      "downloadedAt": "2026-01-19T15:31:36.465Z",
      "trimmedAt": "2026-01-19T15:44:56.721Z",
      "sizeReduction": "97.4%"
    }
  ],
  "sizeReduction": "98.0%"
}