{
  "venueId": "ChIJYfnNmQ56_ogRSJA7qbJcQJs",
  "venueName": "The Vendue, Charleston's Art Hotel",
  "venueArea": "Downtown Charleston",
  "website": "https://www.thevendue.com/",
  "scrapedAt": "2026-01-19T15:42:01.007Z",
  "trimmedAt": "2026-01-19T15:48:46.976Z",
  "pages": [
    {
      "url": "https://www.thevendue.com/hotel-deals-charleston/",
      "text": "[Page Title: Hotel Deals in Charleston, SC: Available at The Vendue]\n\nEveryone likes\na good deal \nFor those of you traveling to Charleston, whether it’s for business or pleasure (and let’s be honest, it’ll be a hell of a time no matter what), see if any of these deals fit the bill. A leisurely stay or a quick, in-and-out handshake deal… stay here, play here.\nExplore Offers \nSneaky Good Hotel Offers\nBook Offer \nSelect Dates\n\nEnjoy 15% OFF your room and $25 credit to The Rooftop when you stay on select dates.\n*Offer is valid for new reservations over select dates only. One $25 dining credit per reservation. Not applicable to groups, corporate-negotiated, or third-party rates. This offer is non-commissionable. Cannot be combined with any other promotion or offer. Subject to availability and blackout dates. Taxes and gratuities are not included. Book Offer Book Offer \n20% OFF 4+ Nights\n\nCharleston is buzzing with energy—festivals, live music, art walks, and endless opportunities to experience the Holy City’s charm. At The Vendue, you’ll find yourself in the heart of it all, steps from the waterfront, historic sites, and world-class dining.\n\nBook four or more nights and enjoy 20% off your stay. With more reasons to linger, take time to wander through Charleston’s cobblestone streets, savor the City’s events, and pause to enjoy the art-lined walls of our hotel.\n\nYour Charleston story deserves more than just a weekend—stay awhile at The Vendue.\n*Offer is valid for new reservations of four nights or more. If the reservation is changed to be less than four nights, the discount will no longer apply and a higher nightly rate will be charged. Offer is non-commissionable and not applicable to groups, corporate-negotiated, or third-party rates. Cannot be combined with any other promotions or offers. Subject to availability and blackout dates. Taxes and gratuities are not included. Book Offer Book Offer \n20% OFF Advance Purchase Offer\n\nBook a room at least 10 days in advance & enjoy 20% OFF your stay!\n*Offer must be booked at least 10 days prior to arrival. Reservations are fully pre-paid, non-cancellable, non-changeable, and non-refundable. Not applicable to groups, corporate-negotiated, or third-party rates. Cannot be combined with any other promotion or offer. Subject to availability and blackout dates. Taxes and gratuities are not included. Book Offer \nWorth Noting\n\nKeep exploring. There’s more to discover.\n\nFeatured at The Vendue – Charleston’s Art Hotel.\n\nSleep & Stay\n\nPrivate Events\n\nPhoto Gallery\n\nSleep & Stay\n\nPrivate Events\n\nPhoto Gallery\nSign up for deals and discounts. No spam. Promise. Follow Along Book Stay Close Share Toggle Fullscreen Zoom Previous Next",
      "hash": "0d9fa99888e5",
      "downloadedAt": "2026-01-19T15:30:09.044Z",
      "trimmedAt": "2026-01-19T15:48:46.891Z",
      "sizeReduction": "97.1%"
    },
    {
      "url": "https://www.thevendue.com/newsletter/",
      "text": "[Page Title: The Vendue Newsletter - Sign Up for News, Events & Deals]\n\nNews, events\n& special offers \nStay up to date with all the latest news, events and special offers from The Vendue. No spam. Promise.\nEmail Address (required) Sign Up \nWorth Noting\n\nKeep exploring. There’s more to discover.\n\nFeatured at The Vendue – Charleston’s Art Hotel.\n\nSleep & Stay\n\nPrivate Events\n\nPhoto Gallery\n\nSleep & Stay\n\nPrivate Events\n\nPhoto Gallery\nFollow Along Book Stay Close Share Toggle Fullscreen Zoom Previous Next",
      "hash": "33872a09eac5",
      "downloadedAt": "2026-01-19T15:30:12.970Z",
      "trimmedAt": "2026-01-19T15:48:46.905Z",
      "sizeReduction": "99.4%"
    },
    {
      "url": "https://www.thevendue.com/",
      "text": "[Page Title: Welcome to The Vendue Charleston: Art Hotel, Not Hotel Art]\n\nArt hotel,\nnot hotel art. \nWelcome to The Vendue… Charleston’s art hotel. Reverie at its finest. Stay a while. Bursting with modern energy and an undeniable flair amidst historic bones, The Vendue is like no other place in Charleston.\nBook your experience Booking Direct Benefits \nTwo comp in-room cocktails or mocktails\n\nA better-than-average shot at early check-in\n\nTake your time: 2 PM late checkout\nStand Behind the Stay That Stands Out \nParticipate in Travel + Leisure’s 2026 World’s Best Awards survey and help shape The Vendue’s ever-evolving story of art, expression, and inspired hospitality.\nCast Your Vote Photo Gallery \nExplore Offers\n\nBook a room at least 10 days in advance & enjoy 20% OFF your stay!\nBook Offer \nSleep\nExplore The Vendue Explore The Enclave \nRest easy now.\n\nThe Vendue is a combination of two historic Charleston buildings. Yes, two. Each with their own vibe.\nThe Vendue \nA modern design aesthetic with a little flair. A hotspot of good energy, where excitement meets warmth and entertainment.\nExplore The Vendue The Enclave \nA sanctuary of privacy enriched by exclusive amenities. An atmosphere distinctly different from The Vendue's vibrant pulse.\nExplore The Enclave Check us out \nCharleston’s original hotel dedicated to art. Good art.\n\nAn Art Hotel, not hotel art. 200 pieces of original art for your viewing pleasure. We love a good excuse to show off.\nPause Video Explore Exhibits \nEat & Drink\nDine with us \nRevival\n\nModern Cuisine with Southern Flair. Tastefully creative.\nDine with us Eat & Drink \nThe Rooftop Bar\n\nCharleston’s #1 Rooftop Bar. You’ll see why.\nEat & Drink \nEvents\n\nA soirée your way? Glad you’re here.\n\nHost your next event with us. Where memories are made and deals are sealed. Good times happen here.\nPlan an Event Sign up for deals and discounts. No spam. Promise. Art below. Cocktails above. Flavor all around. Wel Gerard Boersma’s 'Marilyn' is bold, bright, and This room's got more personality than your last th The Gallery at The Enclave is a one-of-a-kind even Follow Along Book Stay Close Share Toggle Fullscreen Zoom Previous Next",
      "hash": "9d26e1188b2b",
      "downloadedAt": "2026-01-19T15:30:08.964Z",
      "trimmedAt": "2026-01-19T15:48:46.933Z",
      "sizeReduction": "98.2%"
    },
    {
      "url": "https://www.thevendue.com/events-faq/",
      "text": "[Page Title: Charleston, SC Hotel Private Event Venue FAQs – The Vendue]\n\nIn case you\nwere wondering … \nYou don’t know if you don’t ask, right? If we can’t answer it below, please contact us so we can further assist your curiosities and inquiries. We know a thing or two and are happy to help.\nExplore FAQ \nOur Gallery can accommodate a maximum of 50 for a seated reception, and up to 75 for a cocktail reception. Set-ups vary based on group size and we can get real creative with that!\nHow many people can The Gallery hold? \nBeauty is in the eye of the beholder and not everyone loves everything. We understand; however, artwork cannot be physically removed. As a plus, though, we do have pipe and draping available to rent for $150.00 (plus tax). Or feel free to bring in an outside vendor to provide draping services of your preference.\nI’m not a fan of the current artwork on display in The Gallery. Can it be removed? \nValet parking is available to overnight guests at the hotel for $49 per night. For guests not staying overnight, there is nearby street parking and two parking garages within a short and lovely stroll of the hotel.\nHow does parking work? \nUnfortunately, we do not.\nDo you have bus parking? \nEarly check-in based upon availability. Late check-out is complimentary until noon based upon availability.\nCan we check-in early or check-out late? \nAh… the key to things sounding and looking great for groups. You are welcome to rent A/V through the hotel or bring in an outside vendor of your choice at no additional cost.\nCan we bring our own A/V? \nThe hotel does not offer storage for groups and assumes no responsibility for personal items brought into the function space. Any gift bags, decor, centerpieces, etc. may be brought to the hotel the day of the function (not earlier due to lack of ability to store all your lovelies). Likewise, no items may remain in the hotel function space longer than one hour following the function. If any items are brought to the hotel for a function prior to the day of the event or left in the event space after the conclusion of the event, a non-refundable storage and handling fee of $250.00 (plus tax) per day will be automatically applied to the group’s bill. So, definitely have a plan for drop off and pick-up, no matter how much fun is on the menu!\nI have items being shipped. How does that work? \nWhy yes it is… and it’s complimentary in The Gallery and all hotel rooms.\nIs Wi-Fi available? \nSocial groups can begin set-up three hours prior to the start of the event and will have one hour after the event to break down. Early access can be offered based upon space availability for an additional charge. Corporate groups can coordinate with the Sales Manager for set-up/break-down times.\nHow early can I come in to set-up/break-down? \nAll food and drinks must be purchased through the hotel… and you’ll be glad you did. It’s two LESS things on your plate to handle.\nCan we bring our own food/alcohol? \nYou are fully covered here at The Vendue… The Rooftop is open daily for lunch and dinner. Revival is open daily for dinner service. Full bellied and well pleased, you’ll be. Also, both offer amazing drink menus, to boot. Pre-game, post-game… we gotcha.\nDo you have an on-site restaurant? \nOf course we are and are happy to do so. Just talk to your Sales Manager who will work with you and the catering team to offer specialty meals.\nAre you able to accommodate dietary restrictions? \nAs is typical, we do require a deposit along with the signed contract that is based on the contracted spend of the group. The remaining balance is due at least 75 business days prior to the event. Your Sales Manager gladly will walk you through all of it.\nDo you require a deposit? If so, what is the deposit schedule like? \nSure it is and way to make it easy! Approved direct billing application required.\nI would prefer to be directly billed. Is that an option? \nThe question is what is there NOT to do here? You’re in a great spot. We are fortunately located in The French Quarter within walking distance of a slew of amazing restaurants, art galleries, shops, bars, ghost tours (right?), and all sorts of Charleston-esque activities. Make time for some more fun on top of your big event. Waterfront Park is a block from the hotel with access to the Water Taxi that can take you through the harbor to Patriot’s Point in Mt. Pleasant. You’ll definitely want the experience. The Battery and White Point Gardens is a 10 min walk, Rainbow Row is only 5 min, and Charleston’s City Market is just 2 blocks away. We’re happy to point you in any direction per your preference… just let us know your vibe.\nWhat is there to do around town? \nWe hope we answered most of your burning questions, but if not…\nContact Us \nWorth Noting\n\nKeep exploring. There’s more to discover.\n\nFeatured at The Vendue – Charleston’s Art Hotel.\n\nSleep & Stay\n\nPrivate Events\n\nPhoto Gallery\n\nSleep & Stay\n\nPrivate Events\n\nPhoto Gallery\nSign up for deals and discounts. No spam. Promise. Follow Along Book Stay Close Share Toggle Fullscreen Zoom Previous Next",
      "hash": "a6b051c8949c",
      "downloadedAt": "2026-01-19T15:30:14.864Z",
      "trimmedAt": "2026-01-19T15:48:46.951Z",
      "sizeReduction": "94.9%"
    },
    {
      "url": "https://www.thevendue.com/charleston-event-venues/",
      "text": "[Page Title: Charleston Event Venues, Downtown - The Vendue]\n\nParty or business\nin Charleston \nFrom team meetings to milestone celebrations, we’ve got the perfect space for it. From our unique venues—art gallery, rooftop bar, and fine dining restaurant—to full-service catering, we know how to host an event that impresses. At The Vendue, we’ve mastered the art of creating unforgettable experiences\nView Sales Kit Book Event Events FAQ \nDecisions. Decisions.\n\nMatchmaking at its finest. Here’s your chance to connect. Choose the space that suits you best. Each is a canvas for your pending enjoyment.\n\nVenues\n\n3\n\nBanquet Space\n\n3,300ft\n2 \nLargest Capacity\n\n75\n\nHost unforgettable events in our venues.\n\nSpace for any occasion.\n\nHave a drink with us.\n\nA variety of spaces for any type of event.\n\nHost your private event at The Rooftop.\n\nViews from The Rooftop.\n\nChoice Spaces\nThe Gallery Revival The Rooftop \nThe Gallery\nTour Venue \nThe Gallery\n\nA charming and intimate space in The Enclave featuring original artwork among historic exposed brick walls. The gallery provides an elegant and unique backdrop that is sure to impress and inspire guests.\n\n1000ft\nSpace: 2 \nSeated Reception | 50 Cocktail Reception | 75 Classroom with One Side | 30 Classroom with Two Sides | 48 U-Shaped Meeting | 26 Boardroom Meeting | 22 Theater with One Side | 40 Theater with Two Sides | 60\nCapacities: Tour Venue \nRevival\nTour Venue \nRevival\n\nRevival is our full-service restaurant located at The Vendue. Featuring stunning, old-world architectural elements but bursting with modern art and design, it’s a smart choice for seated events.\n\n1000ft\nSpace: 2 \n50 | Seated Dinner\nCapacity: Tour Venue \nThe Rooftop\nTour Venue \nThe Rooftop\n\nVendue’s Rooftop Bar, located at The Vendue, provides sweeping views of the harbor and Charleston’s skyline. With views for days and quite a lively vibe, this is the place to make the memories you won’t soon forget.\n\n1,300ft\nSpace: 2 \n75 | Cocktail Reception\nCapacity: Tour Venue \nWine and dine a plenty\n\nFrom business luncheons to celebratory dinners we’ll craft a menu that hits just the right note. Our executive chef will provide custom menus and quotes for most any edible adventure. Every detail is expertly crafted to ensure you and your guests are well fed and giddy with delight.\n\nDive into the details.\nView Sales Kit Book Event Events FAQ Sign up for deals and discounts. No spam. Promise. Follow Along Book Event Close Share Toggle Fullscreen Zoom Previous Next",
      "hash": "f189ad8003f2",
      "downloadedAt": "2026-01-19T15:30:11.079Z",
      "trimmedAt": "2026-01-19T15:48:46.976Z",
      "sizeReduction": "97.5%"
    }
  ],
  "sizeReduction": "97.4%"
}