{
  "venueId": "ChIJbeP2cxZ6_ogRX1-9ELT111g",
  "venueName": "Circa 1886 Restaurant",
  "venueArea": "Downtown Charleston",
  "website": "https://www.circa1886.com/?utm_source=google&utm_medium=organic&utm_campaign=business-listing",
  "scrapedAt": "2026-01-19T15:42:01.481Z",
  "trimmedAt": "2026-01-19T15:48:54.127Z",
  "pages": [
    {
      "url": "https://www.circa1886.com/?utm_source=google&utm_medium=organic&utm_campaign=business-listing",
      "text": "[Page Title: Charleston Historic District Fine Dining Restaurant | Circa 1886]\n\nSkip to Main Content \nDinner: Monday, Tuesday, & Thursday-Saturday From 5:00-9:00pm\n\nDinner: Monday, Tuesday, & Thursday-Saturday From 5:00-9:00pm\n\nDinner: Monday, Tuesday, & Thursday-Saturday From 5:00-9:00pm\n\nDinner: Monday, Tuesday, & Thursday-Saturday From 5:00-9:00pm\n\nDinner: Monday, Tuesday, & Thursday-Saturday From 5:00-9:00pm\n\nDinner: Monday, Tuesday, & Thursday-Saturday From 5:00-9:00pm\n\nDinner: Monday, Tuesday, & Thursday-Saturday From 5:00-9:00pm\n\nDinner: Monday, Tuesday, & Thursday-Saturday From 5:00-9:00pm\n\nDinner: Monday, Tuesday, & Thursday-Saturday From 5:00-9:00pm\n\nWelcome to Circa 1886\n\nAn Elevated Culinary Experience\n\nWelcome to Circa 1886 Restaurant, where contemporary cuisine meets historic charm inside the original carriage house of Wentworth Mansion®. Discover imaginative tasting menus, seasonal ingredients, and an intimate fine dining experience that has made Circa 1886 one of Charleston’s most acclaimed restaurants.\nReserve a Table \nEXPLORE OUR MENUS FOR DINNER, WINE, AND COCKTAILS.\n\nDiscover the flavors that define Circa 1886.\nMenus \nPrivate Gatherings\n\nIntimate Celebrations\n\nFrom anniversaries and family reunions to weddings and rehearsal dinners, our staff is experienced in creating unique, personalized, and memorable events.\nLearn More \nEvents & Experiences\n\nCelebrate the art of fine taste\n\nDiscover the art of celebration at Circa 1886. From elegant wine and cocktail classes to extraordinary seasonal events, each experience invites you to savor the creativity, craftsmanship, and charm that define Charleston’s most refined gatherings.\nLearn More \nA Legacy of Charleston Hospitality\n\nOur Story\n\nDiscover the story of Circa 1886—where Charleston’s rich history and timeless setting at Wentworth Mansion® meet the creativity and dedication of the culinary team who bring our vision to life.\nLearn More \nExecutive Chef\n\nMarc Collins\n\nExecutive Chef Marc Collins has been masterfully creating culinary magic for more than 20 years, transforming any ordinary night out into a spectacular experience.\nMeet The Team \n\"Our dining experience surpassed our expectations.\"\n\nIt is well beyond time that the Michelin folks award at least two stars to Circa 1886. In our experience, it has met or surpassed that standard on every occasion. For 15 years. Thank you Circa, for so many truly memorable meals!\n\nGail R.\n\n\"Top-notch dining experience\"\n\nWhat an amazing dining experience this was. Set in what was once the carriage house. Beautifully decorated and a lovely restful experience. Our waiter was superb (and we connected immediately with him as he is originally from the same state and area as we live). My husband and I each had the tasting menu. He had the Cooper Menu and I had the Ashley Menu. The food was absolutely top rate! If you want a quiet, elegant meal, I highly recommend Circa 1886.\n\nC6239KKmonicad | Nashua, New Hampshire | 4/30/23\n\n\"Perfection!\"\n\nHusband and I had each of the 5-course tasting menus. The service all around was top-notch. Wine pairings were perfection, and the quality and quantity of food was amazing. Best meal. I cannot speak highly enough of this hidden gem!\n\ndpp74 | St. Augustine, Florida | 12/31/22\n\nAwards & Accolades\n\nCelebrating Excellence\n\nTop 1% Worldwide\n\nBest of the Best Date Night Restaurant\n\nTripadvisor 2025\n\nPastry Chef of the Year\n\nExecutive Pastry Chef Ashley Cardona\n\nStars of the Industry 2025\n\nBest of\n\nAward of Excellence\n\nWine Spectator since 2004\nView All circa1886 View Instagram post by circa1886 Jan 17 Open post by circa1886 with ID 18181836103361987 Step into the heart of Circa 1886, where every ingredient and every movement is guided by care. Passion meets precision so that what lands on your table is effortless, memorable, and meant to be savored. 🍴 Book your table now via the link in bio.#Circa1886 #TastingMenu #LuxuryHospitality #MeetTheTeam #CulinaryExperience ... 26 0 circa1886 View Instagram post by circa1886 Jan 15 Open post by circa1886 with ID 18089789623993115 This Valentine’s Day, indulge in an unforgettable evening at Circa 1886. Candlelit ambiance, exceptional cuisine, and attentive hospitality create a setting designed for meaningful moments. 🕯️ Secure your reservation via the link in our bio.#Circa1886 #CharlestonDining #TastingMenu #CulinaryExperience #FineDining #ValentinesDay #VisitCharleston #DateNight #CharlestonDate #ExploreCharleston #Foodie ... 9 0 circa1886 View Instagram post by circa1886 Jan 13 Open post by circa1886 with ID 17892478077261746 A reason to dine out more this month. 🥬 Enjoy three courses from our à la carte menu for $85 per person, or take 10% off our tasting menus with wine pairings. Offer ends January 31st. Be sure to mention the January Special when you make your reservation or tell your server. Book your table today through the link in our bio.#Circa1886 #FineDining #TastingMenu #ExploreCharleston #DiningExperience #DiningSpecials #RestaurantWeek #CharlestonEats #VisitCharleston #Foodie ... 10 1 circa1886 View Instagram post by circa1886 Jan 11 Open post by circa1886 with ID 17906613957166101 Sip mindfully, savor fully. Circa 1886’s alcohol-free wines and crafted mocktails let you enjoy every flavor, aroma, and ritual of fine dining—without the alcohol. 🥂 Explore our Dry January guide through the link in bio.#Circa1886 #Mocktails #SpiritFree #Cocktailsofinstagram #Cocktails #FineDining #MocktailRecipe #AlcoholFree #CharlestonCocktails #CharlestonDining #ExploreCharleston ... 9 0 circa1886 View Instagram post by circa1886 Jan 9 Open post by circa1886 with ID 17844813105669686 26 years, countless toasts, and a whole lot of delicious memories. 🥂 Circa 1886 has been honored to welcome guests from near and far, sharing meals, stories, and special moments together. Join us at the table—reserve your next visit via the link in our bio.#Circa1886 #FineDining #TastingMenu #ExploreCharleston #DiningExperience ... 22 0 circa1886 View Instagram post by circa1886 Jan 7 Open post by circa1886 with ID 18116380348601950 Ever wonder what the perfect first bite feels like? Our amuse-bouche is always a small bite that makes a big impression. Swipe to see it in action, then come taste it for yourself! 🍷 Reserve your table through the link in our bio.#Circa1886 #FineDining #WineandDine #TastingMenu #ExploreCharleston #DiningExperience #CharlestonEats #VisitCharleston #Foodie ... 15 1 circa1886 View Instagram post by circa1886 Jan 4 Open post by circa1886 with ID 18051402926433857 📣 The New Year calls for some much-needed R&R! Circa 1886 will be closed January 4–8 for a short winter break. Our team is taking this time to rest, recharge, and dream up even more delicious experiences for you in 2026. We look forward to seeing you on our return - book your table through the link in bio.#Circa1886 #FineDining #WineandDine #TastingMenu #ExploreCharleston #DiningExperience #CharlestonEats #VisitCharleston #Foodie ... 31 3 circa1886 View Instagram post by circa1886 Jan 2 Open post by circa1886 with ID 17871039789501275 At Circa 1886, exceptional service is at the heart of every experience. As guest Haley shared after a recent celebration, it was \"easily the best service we’ve had at a restaurant in a long time.\" From attentive hospitality to every thoughtful detail, we pride ourselves on making each visit memorable. Reserve your table through the link in bio today and experience it for yourself.#Circa1886 #Cocktails #FineDining #SouthernCuisine #TastingMenu #ExploreCharleston #DiningExperience #CulinaryExperience #CharlestonEats #LuxuryHospitality #Testimonial ... 9 0 circa1886 View Instagram post by circa1886 Dec 31 Open post by circa1886 with ID 18105050251662222 2025 at Circa 1886 was a year defined by thoughtful cuisine, gracious service, and experiences designed to linger. We’re grateful to each and every guest who joined us at the table and made each moment feel meaningful, whether big or small. What was your favorite moment spent with us this year? 🥂#Circa1886 #Cocktails #FineDining #BehindTheScenes #ExploreCharleston ... 22 1 circa1886 View Instagram post by circa1886 Dec 29 Open post by circa1886 with ID 18066892037167459 The perfect people + the perfect place = the perfect 2026 celebration! 🍸 Host your next event at Circa 1886, where historic charm and impeccable hospitality set the stage. Visit the link in bio to start planning today.#Circa1886 #Cocktails #Cocktailsofinstagram #Cocktailsforyou #FineDining #SouthernCuisine #TastingMenu #CulinaryExperience #CharlestonEvents #EventPlanning #PrivateDining #ExploreCharleston ... 17 0 circa1886 View Instagram post by circa1886 Dec 27 Open post by circa1886 with ID 17871155754494889 The quality of our 62° Storey Farms Egg starts locally on Johns Island. For years, we’ve worked alongside Storey Farms, sharing a commitment to precision and quality. Their pasture-raised, cage-free eggs reflect the care we both value, and this collaboration allows us to bring the best of the Lowcountry to our kitchen and your plate.#Circa1886 #Cocktails #FineDining #SouthernCuisine #TastingMenu #BehindTheScenes #LuxuryHospitality #ExploreCharleston #DiningExperience #CulinaryExperience #LocalProducts #CharlestonEats #VisitCharleston ... 10 0 circa1886 View Instagram post by circa1886 Dec 25 Open post by circa1886 with ID 18135628321486831 As the season shines around us, we hope your Christmas is filled with light, love, and moments worth savoring. Warmest wishes from Circa 1886. 🔔#Circa1886 #HolidayEvents #Christmas #TastingMenu #CulinaryExperience #Charleston #ExploreCharleston ... 17 0 circa1886 View Instagram post by circa1886 Dec 23 Open post by circa1886 with ID 17916786630238954 Whether shared in Champagne toasts or opening night moments, we welcome another year of Charleston Wine + Food. Circa 1886 is honored to be part of @chswineandfood’s 20th anniversary celebration in 2026. Tickets are now available at chswf.org. 🎟️#CHSWF #CHSWF26 #CharlestonWineandFood #Circa1886 #FineDining #WineandDine #TastingMenu #ExploreCharleston #DiningExperience #CharlestonEats #VisitCharleston #Foodie ... 10 1 circa1886 View Instagram post by circa1886 Dec 21 Open post by circa1886 with ID 17996039447715674 Another holiday season has come and gone, and once again the Dickens Dinner filled Circa 1886 with candlelight, storytelling, and tradition. Missed it—or already dreaming of next year? Sign up for our newsletter to be the first to know when seats for 2026 become available. 🎁#Circa1886 #HolidayEvents #Christmas #TastingMenu #CulinaryExperience ... 28 0 circa1886 View Instagram post by circa1886 Dec 17 Open post by circa1886 with ID 17864103849539427 Sometimes it’s the smallest touches that make the biggest impact. That final sweet bite, perfectly presented and savored slowly, is the moment that stays with you long after the last course. Explore our full menu through the link in bio and see what awaits. 🍓#Circa1886 #CharlestonDining #Pastry #TastingMenu #CulinaryExperience #FineDining #SweetTreat #HolyCityEats #BehindTheScenes #Charleston #VisitCharleston #Dessert ... 23 1 circa1886 View Instagram post by circa1886 Dec 15 Open post by circa1886 with ID 18165775489387282 Every dish begins with intention, and the dining room is where it all comes together. 🕯️ Chef Marc Collins shares the stories behind Circa 1886’s menus in our blog—discover how seasonal ingredients, inventive flavor pairings, and decades of experience shape every plate. Link in bio!#Circa1886 #Cocktails #FineDining #SouthernCuisine #TastingMenu #ExploreCharleston #DiningExperience #CulinaryExperience #NewMenu #CharlestonEats #LuxuryHospitality #MeetTheTeam ... 35 3 circa1886 View Instagram post by circa1886 Dec 13 Open post by circa1886 with ID 18173646673329736 New to the menu and always changing. 🐡 Our Catch of the Day changes with the tide, served over White Acre Pea Cream Stew with smoked trout, spinach, and artichokes. Come see what the culinary team is cooking up—reserve via the link in bio.#Circa1886 #Cocktails #FineDining #SouthernCuisine #TastingMenu #BehindTheScenes #LuxuryHospitality #ExploreCharleston #DiningExperience #CulinaryExperience #NewMenu #CharlestonEats #VisitCharleston #Foodie ... 24 1 circa1886 View Instagram post by circa1886 Dec 11 Open post by circa1886 with ID 18062843807559769 Looking for a holiday gift that goes beyond the ordinary? Treat someone special to Sommelier Anne Hampton’s Secrets of the Sommeliers experience. 🍷 Through guided tastings and curated pairings, she transforms every sip into a story. Learn more or book through the link in our bio.#Circa1886 #Cocktails #FineDining #SouthernCuisine #TastingMenu #Sommelier #WineLover #LuxuryHospitality #MeetTheTeam #DiningExperience #CulinaryExperience #Holiday #Gifting #Experiences ... 13 0 circa1886 View Instagram post by circa1886 Dec 9 Open post by circa1886 with ID 18112518271717238 From prep to the final flourish, our pastry team pours care and creativity into every dish. Today, for National Pastry Day, we’re spotlighting the behind-the-scenes dedication you may not see—but always taste.#Circa1886 #CharlestonDining #Pastry #TastingMenu #CulinaryExperience #FineDining #SweetTreat #HolyCityEats #BehindTheScenes #Charleston #VisitCharleston #Dessert #NationalPastryDay ... 17 0 circa1886 View Instagram post by circa1886 Dec 6 Open post by circa1886 with ID 18062376146221450 Help us welcome Antoinette, the newest member of the Circa 1886 team! Her love for farm-to-table cooking, Italian-inspired warmth, and artistry on the plate shines through in everything she creates. We’re thrilled to have her in our kitchen as she completes her culinary externship and continues learning alongside our team.#Circa1886 #Cocktails #FineDining #SouthernCuisine #TastingMenu #SousChef #LuxuryHospitality #MeetTheTeam #DiningExperience #CulinaryExperience ... 45 2 Load More Follow on Instagram \nManage Consent\n\nTo provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions.\nFunctional Always active Functional The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} \nManage Consent\n\nTo provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions.\nFunctional Always active Functional The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent Manage consent \nKeep in Touch!\n\nStay connected for promotions, announcements, & more!\nYes, I would like to receive updates. Get Updates",
      "hash": "0e4aef6a0fb6",
      "downloadedAt": "2026-01-19T15:26:53.191Z",
      "trimmedAt": "2026-01-19T15:48:54.127Z",
      "sizeReduction": "95.5%"
    }
  ],
  "sizeReduction": "95.5%"
}