{
  "venueId": "ChIJpxyeb9B7_ogRzBgTkN6Q4dY",
  "venueName": "Osaka Asian Bistro",
  "venueArea": "West Ashley",
  "website": "http://www.charlestonosakaonline.com/",
  "scrapedAt": "2026-01-19T15:42:05.237Z",
  "trimmedAt": "2026-01-19T15:49:49.623Z",
  "pages": [
    {
      "url": "http://www.charlestonosakaonline.com/",
      "text": "[Page Title: Osaka Asian Bistro - Asian Restaurant｜Online Order｜ Charleston｜SC]\n\nChinese & Japanese dishes, plus creative Maki\nOnline Order Career-join us Book your Osaka Asian Bistro reservation on Resy \nAbout Osaka Asian Bistro\n\nAs one of the oldest Asian restaurants in Charleston, the history of Osaka can trace back to 1999. This family-owned restaurant is dedicated in serving the Lowcountry with simple and quality food. The menu features a wide selection of dishes including Hibachi, traditional Chinese entrees and sushi.\n\nPopular Dishes\nDiner reviews ☆ ☆ ☆ ☆ ☆ \n- Brant Lara\nVisiting Charleston from out of town for a week and had to come here twice! The best Asian restaurant, you won’t regret it! Seseme chicken, teriyaki chicken on a stick, beef and broccoli, and fried rice! \n- Scotty Parr\nGreat food and great relaxed atmosphere. The sushi was absolutely amazing and very fresh. Will definitely return!! \n- BKV\nUdon Curry Noodles with Beef and the Insanity Roll were delicious and I want to go back just for that. Convenient location with free parking in a local shopping center. I have been here many times and will be returning. \n- Margra Ferrier\nFood was delicious and service was awesome! We had the dumplings, almond roll, spicy salmon cracker and Charleston rolls. All were great! \n- XMatxG Avalos\nFirst of all the food was so yummy I had to eat everything in the plate second the service was great every 5 minutes they came to give us more tea and check up on us then the atmosphere felted like a 5 star restaurant then the bathroom looked like the future with so much privacy I give this place a five star rating \nContact Us\n\nTue\n\nClosed\n\nMon / Wed - Thu\n\n11:30AM - 3:00PM\n\nMon / Wed - Thu\n\n4:30PM - 9:30PM\n\nFriday\n\n11:30AM - 3:00PM\n\nFriday\n\n4:30PM - 10:00PM\n\nSaturday\n\n2:00PM - 10:00PM\n\nSunday\n\n3:00AM - 9:30PM\nFollow \nTEL ：+1 843-852-9979\nBook your Osaka Asian Bistro reservation on Resy",
      "hash": "504e2b21119b",
      "downloadedAt": "2026-01-19T15:37:33.301Z",
      "trimmedAt": "2026-01-19T15:49:49.623Z",
      "sizeReduction": "98.8%"
    }
  ],
  "sizeReduction": "98.8%"
}