{
  "venueId": "ChIJL-Wr3Ntx_ogRsDw9lP54Abo",
  "venueName": "Wendy's",
  "venueArea": "Mount Pleasant",
  "website": "https://locations.wendys.com/united-states/sc/mount-pleasant/596-long-point-road?utm_source=Yext&utm_medium=Google_My_Business&utm_campaign=Local_Search",
  "scrapedAt": "2026-01-19T15:41:57.490Z",
  "trimmedAt": "2026-01-19T15:44:51.924Z",
  "pages": [
    {
      "url": "https://locations.wendys.com/index.html",
      "text": "[Page Title: All Wendy's Locations | fast food, burgers, chicken, chicken sandwiches, salads, Frosty, breakfast, open late, drive thru, meal deals]\n\nSkip to content Return to Nav \nAll Wendy's Locations\nCanada (451) United States (5831)",
      "hash": "02842399f7bc",
      "downloadedAt": "2026-01-19T15:33:14.752Z",
      "trimmedAt": "2026-01-19T15:44:51.879Z",
      "sizeReduction": "98.9%"
    },
    {
      "url": "https://locations.wendys.com/united-states/sc/mount-pleasant/596-long-point-road?utm_source=Yext&utm_medium=Google_My_Business&utm_campaign=Local_Search",
      "text": "[Page Title: Wendy's 596 Long Point Road: fast food, burgers, chicken, chicken sandwiches, salads, Frosty®, breakfast, open late, drive thru, meal deals in Mount Pleasant, SC]\n\nSkip to content Return to Nav \nWendy's Long Point in Mount Pleasant, SC\nOpens At 6:30 AM Opens At 6:30 AM Opens At 6:30 AM Opens At 6:30 AM Opens At 6:30 AM Opens At 6:30 AM Opens At 6:30 AM \nVisit Us Today!\nGet Directions \nContact\n596 Long Point Road Mount Pleasant , SC 29464 US \nMain Number\n(843) 284-9433 (843) 284-9433 Order Now \nDelivery Options\n\nAt This Location:\nBreakfast Coca-Cola Freestyle Mobile Ordering Mobile Payment Wi-Fi Open Late Open Late Open Late Open Late Open Late Open Late Open Late \nRestaurant Hours\nDay of the Week Hours Monday 6:30 AM - 2:00 AM Tuesday 6:30 AM - 2:00 AM Wednesday 6:30 AM - 2:00 AM Thursday 6:30 AM - 2:00 AM Friday 6:30 AM - 2:00 AM Saturday 6:30 AM - 2:00 AM Sunday 6:30 AM - 2:00 AM Breakfast ends at 6:30 AM Breakfast ends at 6:30 AM Breakfast ends at 6:30 AM Breakfast ends at 6:30 AM Breakfast ends at 6:30 AM Breakfast ends at 6:30 AM Breakfast ends at 6:30 AM \nHoliday Hours May Vary\n\nDrive Thru Hours\nDay of the Week Hours Monday 6:30 AM - 2:00 AM Tuesday 6:30 AM - 2:00 AM Wednesday 6:30 AM - 2:00 AM Thursday 6:30 AM - 2:00 AM Friday 6:30 AM - 2:00 AM Saturday 6:30 AM - 2:00 AM Sunday 6:30 AM - 2:00 AM \nWendy’s New Biggie Deals® are here at $4, $6, and $8.\n\nPick and choose the deal that’s best for you between our $4 Biggie® Bites, $6 Biggie Bag®, and our $8 Biggie® Bundle.\nORDER NOW \nFreshen Up Your Morning.\n\nWendy's breakfast can turn any bland morning into a flavorful one. Like with a Breakfast Baconator® or a Honey Buddy or even a Sausage Breakfast Burrito. It's a breakfast you'll actually want to wake up to.\nORDER NOW \nWhat's New at Wendy's\n\nJoin Wendy's Rewards!\n\nThe only thing better than eating Wendy’s, is earning more Wendy’s while you eat. And that, friends, is what Wendy’s Rewards is all about. Sign up today and make eating at your favorite restaurant even better.\nJoin Now \nWendy's Delivery\n\nWhether you're hungry for breakfast, lunch, or dinner, there’s more than one way to get Wendy’s delivered. You can start your delivery order straight from our app, or head to any of our official third-party partners, DoorDash, Grubhub, Postmates, and Uber Eats. So, you can get your Wendy’s favorites from your favorite delivery app anytime you want it.\nOrder Delivery \nFeatured Menu Items\nTaco Salad \nMade fresh daily with romaine lettuce, shredded cheddar cheese, diced tomatoes, fire roasted corn, chile lime taco strips, our famous, hearty chili and creamy salsa dressing. A fresh take on tacos perfect for Tuesdays, Wednesdays, or any other days for that matter.\nOrder Now Chili \nPerfectly seasoned and positively irresistible. Red’s kind of our thing, you know.\nOrder Now Baconator® \nA half-pound* of fresh beef, American cheese, 6 pieces of crispy Applewood smoked bacon, ketchup, and mayo. Carnivores rejoice!\nOrder Now Classic Chocolate Frosty \nThe Chocolate Frosty® was born out of Dave’s desire for a signature dessert to go with his vision of the perfect meal. Thick enough to use a spoon, smooth enough to use a straw, and perfect when enjoyed on the end of a fry.\nOrder Now View Menu \nFeatured Menu Items\nBreakfast Biggie Bundles \nGrilled, breakfast sausage on a soft buttermilk biscuit. Simple breakfast perfection.\nOrder Now Honey Butter Chicken Biscuit \nJuicy white meat, lightly breaded and seasoned, and topped with maple honey butter on a fluffy buttermilk biscuit. It’s sweet, it’s savory, and it’s a great reason to get out of bed in the morning.\nOrder Now Breakfast Burrito, Bacon \nFresh-cracked grade A eggs, Applewood smoked bacon, American cheese, and seasoned potatoes smothered in a creamy Swiss cheese sauce and wrapped in a warm, flour tortilla with Cholula® Hot Sauce on the side. Breakfast will never burrito the same. Cholula is a registered trademark of SPICY LIQUID LLC © 2023, used under license.\nOrder Now Cinnabon® Pull-Apart \nWarm, buttery, dough bites baked together with world-famous Cinnabon®? cinnamon and topped with their signature cream cheese frosting. Ooey, gooey corporate synergy. Cinnabon® and the Cinnabon® logo are registered trademarks of Cinnabon Franchisor SPV LLC. ©2024 Cinnabon Franchisor SPV LLC.\nOrder Now Chocolate Frosty® Cream Cold Brew \nSmooth, cold-brewed coffee, creamer made from our classic Frosty, and rich chocolate syrup all swirled together and served over ice.\nOrder Now Breakfast Baconator® \nGrilled sausage, American cheese, Applewood smoked bacon, a fresh-cracked grade A egg, (deep breath) more cheese and more bacon all covered in swiss cheese sauce. Don’t just break your fast. Destroy it.\nOrder Now Breakfast Burrito, Sausage \nFresh-cracked grade A eggs, grilled savory sausage, American cheese, and seasoned potatoes smothered in a creamy cheese sauce and wrapped in a warm flour tortilla with Cholula® Hot Sauce on the side. Breakfast will never burrito the same. Cholula is a registered trademark of SPICY LIQUID LLC © 2023, used under license\nOrder Now View Menu \nFeatured Menu Items\nSpicy Chicken Sandwich \nA juicy chicken breast marinated and breaded in our unique, fiery blend of peppers and spices to deliver more flavor inside and out, cooled down with crisp lettuce, tomato, and mayo. It’s the original spicy chicken sandwich, and the one you crave\nOrder Now Chocolate Frosty® \nThe Chocolate Frosty® was born out of Dave’s desire for a signature dessert to go with his vision of the perfect meal. Thick enough to use a spoon, smooth enough to use a straw, and perfect when enjoyed on the end of a fry.\nOrder Now $5 Biggie Bag \nFresh beef, Applewood smoked bacon, American cheese, crisp lettuce, tomato, and mayo. It’s a favorite of bacon lovers everywhere.\nOrder Now Baconator® \nA half-pound* of fresh beef, American cheese, 6 pieces of crispy Applewood smoked bacon, ketchup, and mayo. Carnivores rejoice!\nOrder Now View Menu \nAbout Wendy's 596 Long Point Road\n\nAt Wendy’s in Mount Pleasant, SC, we got breakfast, lunch, and dinner. From fresh-cracked eggs to fresh, never-frozen beef, We Got You®.Our square-pattied hamburgers always bring the freshness, our chicken sandwiches changed the game, and you know you love our nuggets. But we also got fresh-made salads, hot and crispy fries, even old-school chili and baked potatoes. You can start strong with one of our new breakfast sandwiches and a coffee drink, or satisfy your sweet tooth with a Frosty® or something from our bakery. From Kids’ Meals to meal deals, our menu is stacked with value. So, stop by Wendy’s at 596 Long Point Road in Mount Pleasant, SC. And don’t forget to download our app for restaurant info like hours, menu, nutrition, and exclusive deals. Fresh beef available in the contiguous U.S., Alaska and Canada.\nwendys.com Apple App Store link Google Play link \nNearby Wendy's Locations\n361 Johnnie Dodds Blvd. Opens At 6:30 AM Opens At 6:30 AM Opens At 6:30 AM Opens At 6:30 AM Opens At 6:30 AM Opens At 6:30 AM Opens At 6:30 AM 361 Johnnie Dodds Blvd. Mount Pleasant , SC 29464 US \nMain Number\n(843) 849-1909 (843) 849-1909 Get Directions Visit Store Page 343 Folly Rd. Opens At 6:30 AM Opens At 6:30 AM Opens At 6:30 AM Opens At 6:30 AM Opens At 6:30 AM Opens At 6:30 AM Opens At 6:30 AM 343 Folly Rd. Charleston , SC 29412 US \nMain Number\n(843) 405-1066 (843) 405-1066 Get Directions Visit Store Page 1721 Sam Rittenberg Blvd Opens At 6:30 AM Opens At 6:30 AM Opens At 6:30 AM Opens At 6:30 AM Opens At 6:30 AM Opens At 6:30 AM Opens At 6:30 AM 1721 Sam Rittenberg Blvd Charleston , SC 29407 US \nMain Number\n(843) 408-0150 (843) 408-0150 Get Directions Visit Store Page 5275 International Blvd Opens At 6:30 AM Opens At 6:30 AM Opens At 6:30 AM Opens At 6:30 AM Opens At 6:30 AM Opens At 6:30 AM Opens At 6:30 AM 5275 International Blvd Charleston , SC 29418 US \nMain Number\n(843) 459-5702 (843) 459-5702 Get Directions Visit Store Page Find a Wendy's \nFrequently Asked Questions\n\nIs Long Point Wendy's still open?\nYes! Just as we are committed to serving the best quality food every single day, we are committed to serving you during this time. \nIs Wendy’s delivery available near me?\nTo find out if delivery is available near you, go to our app or wendys.com/delivery. Is Wendy’s hiring in Mount Pleasant, SC? \n, enter Mount Pleasant, SC into the appropriate form fields and submit your search. If any jobs are currently available at this location or one nearby, they should appear within the results list.\n\nIf there are no open positions at your preferred restaurant at the time of your search, we recommend checking back often.\nTo check if this Wendy’s location is currently hiring, visit our Careers page \nHow do I contact Wendy’s with questions or feedback about this location?\nFeedback about your experience with this Wendy’s location may be provided to our Customer Care team. To reach out through Live Chat or to leave a message, please visit our ; use 888-624-8140 to call.\n\nYou may also provide feedback by filling out a . You will need to refer to your receipt for the restaurant number, date and time of visit.\n\nIf you need to reach this location directly, please call (843) 284-9433. Contact page Wendy’s Customer Satisfaction Survey \nWhere can I buy Wendy’s gift cards?\nWendy’s gift cards are available in-restaurant, through several brick & mortar and online retailers and through our own online shop. To place an individual or bulk order online, please visit our \n\nAlready have a gift card? gift card portal. Check your balance! \nWhere can I find menu pricing?\nPricing may vary slightly depending on your location. To see menu prices for the Wendy’s of your choice, please visit or the mobile app. Once you’ve selected your location, prices should appear for each menu item. order.wendys.com. \nWhere can I find nutrition and allergen information?\nThis information can be found on our , within our mobile app and in-restaurant. To access via our website or mobile app: Click through to a specific menu item and then select the blue “Nutrition & Allergens” link found underneath the description and calorie count. If you are on the Wendy’s website or the mobile app, you’ll notice that the nutrition statistics will update as you customize your order.\n\nA nutrition information poster is also located in each Wendy’s restaurant. A crew member will be happy to assist in directing you to it. menu website \nDoes Long Point Wendy’s serve breakfast?\nYes, this Wendy’s location in Mount Pleasant, SC serves breakfast! Go to or the mobile app, select this location, and choose from our selection of breakfast combos, croissant, biscuit and classic sandwiches, coffee and sides. order.wendys.com.",
      "hash": "bd528072a0f5",
      "downloadedAt": "2026-01-19T15:33:14.708Z",
      "trimmedAt": "2026-01-19T15:44:51.924Z",
      "sizeReduction": "91.7%"
    }
  ],
  "sizeReduction": "92.7%"
}