{
  "venueId": "ChIJDUE4SzN6_ogRkMuN1OfcjHo",
  "venueName": "Harborview Restaurant & Lounge",
  "venueArea": "West Ashley",
  "website": "https://www.ihg.com/holidayinn/hotels/us/en/charleston/chsrv/hoteldetail/dining",
  "scrapedAt": "2026-01-18T17:04:24.326Z",
  "trimmedAt": "2026-01-18T17:05:20.030Z",
  "pages": [
    {
      "url": "https://www.ihg.com/holidayinn/hotels/us/en/charleston/chsrv/hoteldetail/hotel-packages",
      "text": "Skip To main content View Prices See all photos Holiday Inn Charleston-Riverview Important Announcements Great water views near Downtown Charleston SC Enjoy Gorgeous Waterfront Views of Charleston Harbor. Our beautiful Charleston, SC hotel is conveniently located off Savannah Highway and overlooks the Ashley River. Our location is perfect for guests looking for accommodations near Charleston’s best attractions. Charleston is known for its amazing history, restaurants, and shops. We offer a shuttle service to the historic Downtown Charleston area for your comfort and convenience. Looking to enjoy a day in the sun? Folly Beach, Sullivan’s Island and Isle of Palms are all within a short drive of our amazing downtown Charleston hotel. Be sure to visit nearby attractions such as the South Carolina Aquarium, Fort Sumter, Magnolia Plantation and Gardens, Charleston City Market, or the USS Yorktown. We are conveniently located only ten miles from the Charleston International Airport. The Holiday Inn Charleston Riverview hotel provides guests with great amenities such as an outdoor pool, 1200-sq ft meeting room, Executive Board Room, a newly renovated Fitness Center, and 24-hour Business Center. Don’t forget to grab dinner and drinks at our on-site Harborview Restaurant and Lounge, located on the top floor of this 14 story Charleston hotel. You are sure to enjoy our spectacular panoramic views of the Charleston city scape and harbor. Kids eat free Limited housekeeping Ev chargers Fitness center On-site parking Pool 1 On-site restaurant Smoke-free hotel Wi-fi Area shuttle Kids eat free Limited housekeeping Ev chargers Fitness center On-site parking Pool 1 On-site restaurant Smoke-free hotel Wi-fi Area shuttle View all amenities Accommodations Standard Rooms Book Now Suite Book Now Standard Rooms Book Now Suite Book Now Reservations: Front desk: 1-843-5567100 Email: CHSRVFrontOfficeManager@northph.com 301 Savannah Hwy Charleston, South Carolina 29407 United States Parking and transportation details : 3:00 PM Check-in : 11:00 AM Check-out : 21 Minimum check-in age The highlights The highlights Contractor Rates Available! Shuttle Service to Downtown Charleston SC Parking Included Harborview Restaurant and Lounge Outdoor Pool Contractor Rates Available! Contact the Sales Department for discounted rates while working in the Charleston Area. We are centrally located to Downtown, James Island, Johns Island, and West Ashley. Learn more Shuttle Service to Downtown Charleston SC Hotel shuttle service to Downtown Charleston is included in your Amenity Fee & designed to eliminate the hassle of traffic and parking. Simply sit back, relax, and let our shuttle take you on a journey of discovery. The shuttle runs once every hour daily from 7:30 am to 10:30 pm so that you can explore the city at your own pace without any worries. Parking Included Parking is included in the Amenity Fee and is exclusively for our registered guests. You can now enjoy your stay more and worry less about parking or logistics. This is one of the many ways we endeavor to make your time with us unforgettable. We recommend booking one of our parking packages if you require long-term parking. Harborview Restaurant and Lounge Experience the breakfast buffet at Harborview Restaurant and Lounge, situated on the 14th floor of our hotel. Enjoy the delectable American cuisine and skillfully mixed cocktails while admiring the breathtaking views of Charleston Harbor, Downtown Charleston, and the serene Ashley River. Outdoor Pool Enjoy amazing views from our pool deck on the third floor. The pool is open until October 31st, 2025. Explore Holiday Inn Charleston-Riverview Sleep well, rest easy View rooms Elevate your experience View amenities See it to believe it View photos Sleep well, rest easy View rooms Elevate your experience View amenities See it to believe it View photos HOTEL PACKAGES AVAILABLE Prices shown reflect an average per night stay from View all packages Offers View All Offers FAQs for Holiday Inn Charleston-Riverview Does Holiday Inn Charleston-Riverview have a pool? Yes, Holiday Inn Charleston-Riverview has an outdoor pool. How much is parking at Holiday Inn Charleston-Riverview? Complimentary parking is available at Holiday Inn Charleston-Riverview for hotel guests. Can I bring my pet to Holiday Inn Charleston-Riverview? No, pets are not allowed at Holiday Inn Charleston-Riverview. Can I cancel my booking at Holiday Inn Charleston-Riverview for a full refund? Always check the hotel's cancellation policy before booking a rate. Room cancellation is subject to rate booked at time of reservation and cancellation policy varies by rate. Does Holiday Inn Charleston-Riverview have a restaurant on site? Holiday Inn Charleston-Riverview has 1 restaurant. Is there a complimentary shuttle available at Holiday Inn Charleston-Riverview? Yes, Holiday Inn Charleston-Riverview offers a complimentary local area shuttle. Check our for more details. Transportation page What are the check-in and check-out times for Holiday Inn Charleston-Riverview? Check-in at Holiday Inn Charleston-Riverview is from 3:00 PM, and check-out time is 11:00 AM. Contact the hotel directly for options available for early check-in or late check-out. Does Holiday Inn Charleston-Riverview offer free Wi-Fi? Yes, the Holiday Inn Charleston-Riverview offers free WiFi! Read more FAQs View in other languages English English (GB) 日本語 Deutsch 繁體中文 Español 中文 Français Español (España) Italiano Nederlands Русский Português 한국어 ไทย العربية Português (BR) Bahasa Indonesia Türkçe Polski Tiếng Việt",
      "hash": "449410b79ec5",
      "downloadedAt": "2026-01-18T17:02:39.524Z",
      "trimmedAt": "2026-01-18T17:05:19.949Z",
      "sizeReduction": "97.5%"
    },
    {
      "url": "https://www.ihg.com/holidayinn/hotels/us/en/charleston/chsrv/hoteldetail/dining",
      "text": "Skip To main content View Prices See all photos Holiday Inn Charleston-Riverview DINING Discover the Harborview Restaurant and Lounge located on the top floor of the 14-story round Holiday Inn Charleston-Riverview hotel. Elevate your culinary journey to new heights and immerse yourself in the heart and soul of Lowcountry American cuisine. The highlights The highlights Harborview Restaurant and Lounge Harborview Restaurant and Lounge Experience the breakfast buffet at Harborview Restaurant and Lounge, situated on the 14th floor of our hotel. Enjoy the delectable American cuisine and skillfully mixed cocktails while admiring the breathtaking views of Charleston Harbor, Downtown Charleston, and the serene Ashley River. Harborview Restaurant american Cuisine: Top Floor of the Hotel Location: 1-843-5567100 Restaurant phone: Breakfast is served daily from 6:30am to 10am. Dinner hours are Sunday to Thursday 5pm to 9pm and Friday to Saturday from 5pm to 10pm. Sunday Brunch is served every Sunday 11:30am to 2pm. Come indulge in a dining experience like no other while enjoying captivating panoramic views of the Charleston skyline. Download menu 6:30 AM-10:00 AM5:00 PM-9:00 PM Hours: Breakfast: Monday, Tuesday, Wednesday, Thursday, Friday, Saturday, Sunday: 6:30 AM-10:00 AM Dinner: Monday, Tuesday, Wednesday, Thursday, Friday, Saturday, Sunday: 5:00 PM-9:00 PM Breakfast, Brunch, Dinner Serves: Harborview Lounge american Cuisine: Top Floor of the Hotel Location: 1-843-5567100 Restaurant phone: Our cocktail lounge offers specialty cocktails, beer, and wine. Unwind with large flat screen TVs that offer a perfect blend of entertainment and relaxation. Watch the game, catch up on the latest news, or simply revel in the company of friends old and new. Hours are Sunday to Thursday 3:30pm to 9pm and Friday to Saturday from 3:30pm to 10pm. 3:30 PM-9:00 PM Hours: Harborview Lounge Top Floor over looking the Ashley River Location: 1-843-4601460 Bar phone: The Harborview Lounge is located on the top floor of the hotel and has spectacular panoramic views of the city of Charleston. 3:30 PM - 9:00 PM Hours: View in other languages English English (GB) 日本語 Deutsch 繁體中文 Español 中文 Français Español (España) Italiano Nederlands Русский Português 한국어 ไทย العربية Português (BR) Bahasa Indonesia Türkçe Polski Tiếng Việt",
      "hash": "51c984668114",
      "downloadedAt": "2026-01-18T17:02:38.318Z",
      "trimmedAt": "2026-01-18T17:05:19.976Z",
      "sizeReduction": "98.2%"
    },
    {
      "url": "https://www.ihg.com/holidayinn/hotels/us/en/charleston/chsrv/hoteldetail/hotel-offers",
      "text": "Skip To main content View Prices Holiday Inn Charleston-Riverview OFFERS Save on your hotel stay with these exclusive Holiday Inn Charleston-Riverview deals. HOTEL PACKAGES AVAILABLE Prices shown reflect an average per night stay from VIEW ALL PACKAGES View in other languages English English (GB) 日本語 Deutsch 繁體中文 Español 中文 Français Español (España) Italiano Nederlands Русский Português 한국어 ไทย العربية Português (BR) Bahasa Indonesia Türkçe Polski Tiếng Việt",
      "hash": "c088a638f867",
      "downloadedAt": "2026-01-18T17:02:40.080Z",
      "trimmedAt": "2026-01-18T17:05:19.995Z",
      "sizeReduction": "99.6%"
    },
    {
      "url": "https://www.ihg.com/holidayinn/hotels/us/en/charleston/chsrv/hoteldetail/events-facilities",
      "text": "Skip To main content View Prices See all photos Holiday Inn Charleston-Riverview MEETINGS & EVENTS The Holiday Inn Charleston-Riverview specializes in all types of special events. From small meetings to wedding receptions. Our experienced staff can assist you with every detail. Request a proposal The highlights The highlights Meeting & Event Space Meeting & Event Space Space available for large and small meetings and events. Call +1-843-4601440 Call +1-843-4601440 Sumter Room The Holiday Inn's conference room is 1,100 square feet of unobstructed meeting room space. AV screen, LCD Television, flip charts, podium, power cords and complimentary wireless internet is available throughout the hotel. 10th and above FLOOR 52 GUESTS Executive Board Room Executive Board can seat up to 12 people. Featuring a large conference table, 12 executive desk chairs, kitchenette, private bath and 2 large window for natural light. 10th and above FLOOR 20 GUESTS Harborview Restaurant - Semi Private Harborview Restaurant - Semi Private area with views of the Charleston Skyline, can be used for banquets, celebrations, weddings, rehearsal dinners, bridesmaids luncheons and family reunion dinners. Top floor FLOOR 100 GUESTS Harborview Restaurant & Lounge Book the entire Harborview Restaurant and Lounge for your next Party, Wedding or Banquet. Your guest will be mesmerized by the incredible views of the city, fresh catering options and attentive staff. Contact the Sales Department for more information. Top floor FLOOR 120 GUESTS WE'VE GOT YOU COVERED Office supplies available for meeting rooms Creative meeting and event concept consultation Fax services Printer Wi-Fi access throughout the hotel Event planning available Catering available Event Offers Have more questions? Contact us View in other languages English English (GB) 日本語 Deutsch 繁體中文 Español 中文 Français Español (España) Italiano Nederlands Русский Português 한국어 ไทย العربية Português (BR) Bahasa Indonesia Türkçe Polski Tiếng Việt",
      "hash": "f3f44618250d",
      "downloadedAt": "2026-01-18T17:02:40.678Z",
      "trimmedAt": "2026-01-18T17:05:20.030Z",
      "sizeReduction": "98.6%"
    }
  ],
  "sizeReduction": "98.3%"
}