{
  "venueId": "ChIJBUxFNWp6_ogRbCCh69ktiXo",
  "venueName": "Uncork Charleston",
  "venueArea": "Downtown Charleston",
  "website": "https://www.uncorkchs.com/",
  "scrapedAt": "2026-01-18T17:04:24.146Z",
  "trimmedAt": "2026-01-18T17:05:09.670Z",
  "pages": [
    {
      "url": "https://www.uncorkchs.com/",
      "text": "× Buy Tickets Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! Job Listings Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! Parties & Groups - Host your next party or get together Book your party Parties & Groups - Host your next party or get together Reservations - We recommend making a reservation ahead of time. Book your table today! Book Table Reservations - We recommend making a reservation ahead of time. Book your table today! Order Online - Order your favorite dishes in seconds! Order Online Order Online - Order your favorite dishes in seconds! 476 King Street, Charleston, SC 29403 map marker pin Order Don't feel like cooking today? We’ve got you covered - order now! Pickup order DoorDash order Uncork & Unwind Menu private parties Book a party daily specials See all specials Dot slide navigation number 1 Dot slide navigation number 2 Dot slide navigation number 3 slideshow start stop playing Reservations For parties over 6 and less than 14, please call the restaurant! Reserve now Reviews Review by - Yelp Julie R: Came here to have a couple drinks before dinner and their she crab soup was some of the best I have ever had. It was so fresh and came with a baguette to dip in it. The wine stations were pretty awesome as well and improbably tried about four different wines... Review by - Yelp Lowanda J: Dropped in for some wine after dinner. My guest was a regular so I felt like VIP when we entered. We were greeted with hugs and smiles and once they found out we were celebrating my birthday, they treated us to a toast of Prosecco! Such a sweet gesture! Review by - Yelp Cindy P: Great HAPPY HOUR. Very good drinks but the SHE CRAB SOUP was AMAZING. The stuffed mushrooms were also very good. We came to town for 2 days and went to Uncork both days. Great staff. Thanks Review by - Yelp Paige P: Brought my girls here for a fun night for my bachelorette and loved everything about it! We enjoyed the live music, fun drinks, boards, at beautiful atmosphere! Review by - Yelp Pamela H: Fantastic! Terrific food- try the crostini with strawberries, goat cheese and basalmic glaze= delicious. Several seating choices, we selected the arm chairs. Super comfy. Nice selection of wines, giving you the option to have a one, three, or six ounce pour... Stop reviews carousel Play reviews carousel Newsletter Location 476 King Street Charleston, SC 29403 Hours Monday: Closed Tuesday - Thursday: 4pm - 10pm Friday - Saturday: 1pm - 11pm Sunday: 11am - 8pm Weekly Deals and Events: Wednesdays: $15 Pastas Thursdays 7pm: Pop Culture Trivia (free to play) Fridays 7-10pm: Live Music by Philip Blackstone Saturdays 7-10pm: Live Music Find us on... Facebook page Instagram page Yelp page Tripadvisor page Contact us (854)-222-3939 info@uncorkchs.com Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "27a945fdeee9",
      "downloadedAt": "2026-01-18T16:55:10.510Z",
      "trimmedAt": "2026-01-18T17:05:09.653Z",
      "sizeReduction": "98.2%"
    },
    {
      "url": "https://www.uncorkchs.com/charleston-uncork-charleston-food-menu",
      "text": "Our Menu Food Wine Craft Cocktails Charcuterie & After Dinner Happy Hour",
      "hash": "852f3dc5df1e",
      "downloadedAt": "2026-01-18T16:55:10.579Z",
      "trimmedAt": "2026-01-18T17:05:09.660Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "https://www.uncorkchs.com/charleston-uncork-charleston-events",
      "text": "Events Sunday Strings with Claire Allen Sunday January 18th Every Sunday Is there any better way to tie off the weekend than with drinks and beautiful music? The very talented, Claire Allen will take the stage at 3pm. Get a glass, get comfortable, and have a day! 03:00 PM - 06:00 PM F&B Tuesdays Tuesday January 20th Every Tuesday Can you relate? Food & Bev industry folks get some very special discounts every Tuesday at Uncork! Featuring $6 Vodka or Tequila Sodas AND $6 Lemon Drop Martinis-- Start your night off here! 04:00 PM - 11:00 PM Dance Night Wednesday January 21st Wednesdays every 2 weeks Every other Wednesday means dancing and tasting with star instructor, Kim Lyons! Hit her Instagram bio to sign up @KimRLyons ! 07:00 PM - 11:00 PM Friday Night Music: Phil Blackstone Friday January 23rd Every Friday Happy Friday! Come kick back with good tunes and even better vibes with local talent, Phil Blackstone. We'll have the wine wall rolling as usual, plus beers and specialty cocktails all night long. See y'all then! 07:00 PM - 10:00 PM Saturday Night Music: Anna Bradley Saturday January 24th Every Saturday This is your perfect Saturday night... Whether you're starting a big night on the town or just getting out of the house for dinner, we'll have the wine, food, and music to make it a good one! We've got the very talented, Anna Bradley taking the stage from 7-10pm. Come for the music, stay for the wine! 07:00 PM - 10:00 PM Red Party with Orin Swift Wines Thursday February 12th It's an Orin Swift Red Party takeover at Uncork—one night of all-red everything for the bold, the reckless, and the best dressed. Taste some of the rarest, most exclusive wines from the iconic producer, enter a rare-wine raffle, shop select Orin Swift bottles, & snack on a themed charcuterie + dessert bar. Tickets won’t last—secure yours before this one sells out at https://www.citypapertickets.com/events/179425684/the-red-party 07:00 PM - 10:00 PM",
      "hash": "f09f1b3ea8d5",
      "downloadedAt": "2026-01-18T16:55:11.760Z",
      "trimmedAt": "2026-01-18T17:05:09.665Z",
      "sizeReduction": "97.5%"
    },
    {
      "url": "https://www.uncorkchs.com/charleston-uncork-charleston-happy-hours-specials",
      "text": "Specials Sunday January 18th Brunch 12:00 PM - 03:30 PM Live Music 01:00 PM - 04:00 PM Craft Cocktails $10.00 Select Dishes $9.00 Local Draft Beers $7.25 15% Off Wine 05:00 PM - 07:00 PM Wednesday January 21st $15 Pastas 04:00 PM - 10:00 PM Craft Cocktails $10.00 Select Dishes $9.00 Local Draft Beers $7.25 15% Off Wine 05:00 PM - 07:00 PM Thursday January 22nd Happy Hour Craft Cocktails $10.00 Select Dishes $10.00 Local Draft Beers $7.25 15% Off Wine 05:00 PM - 07:00 PM Pop Culture Trivia (free to play) 07:00 PM - 09:00 PM Friday January 23rd Happy Hour Craft Cocktails $10.00 Select Dishes $10.00 Local Draft Beers $7.25 15% Off Wine 05:00 PM - 07:00 PM Live Music 07:00 PM - 10:00 PM Saturday January 24th Happy Hour Craft Cocktails $10.00 Select Dishes $10.00 Local Draft Beers $7.25 15% Off Wine 05:00 PM - 07:00 PM Live Music 07:00 PM - 10:00 PM",
      "hash": "fa50ddb044a6",
      "downloadedAt": "2026-01-18T16:55:11.167Z",
      "trimmedAt": "2026-01-18T17:05:09.670Z",
      "sizeReduction": "98.9%"
    }
  ],
  "sizeReduction": "98.7%"
}