{
  "venueId": "ChIJR6L5JFJw_ogRi7_OKt9exRc",
  "venueName": "The Shellmore",
  "venueArea": "Mount Pleasant",
  "website": "http://www.theshellmore.com/",
  "scrapedAt": "2026-01-19T03:25:41.494Z",
  "trimmedAt": "2026-01-19T03:28:33.022Z",
  "pages": [
    {
      "url": "https://www.theshellmore.com/about",
      "text": "[Page Title: ABOUT | eatdrinkshellmore]\n\ntop of page Scroll OYSTERS     RESTAURANT     PATIO Our menu changes daily and typically consists of chilled oysters, 2-3 small plates, 4-5 entrees and something sweet to finish. This is, of course, accompanied by plenty of superb wines by the glass and bottle. ​ PRIVATE EVENTS - ​ The Shellmore is one of Charleston's premier indoor-outdoor event venues for rehearsal dinners and corporate wine tastings. ​ ​ Private seated dining is available for parties of up to 30 guests and stand-up events are available for parties of up to 65 guests. For event inquiry please email us at: SHELLMOREEVENTS@GMAIL.COM We hope to see you soon. CHEF ERIC MILLEY Instagram bottom of page",
      "hash": "526637a05206",
      "downloadedAt": "2026-01-19T02:12:38.520Z",
      "trimmedAt": "2026-01-19T03:28:32.987Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "http://www.theshellmore.com/",
      "text": "[Page Title: HOME | eatdrinkshellmore]\n\ntop of page Scroll \"CHEF ERIC'S FOOD IS SUPERB. AND HE   COOKS THE WAY I LIKE TO EAT. IF YOU  DON'T KNOW, NOW YOU KNOW\" ​ MICHAEL RUHLMAN ​ -JAMES BEARD AWARD WINNING AUTHOR OF TOO MANY BOOKS TO LIST OYSTERS   RESTAURANT  PATIO THE SHELLMORE IS AN INTIMATE NEIGHBORHOOD RESTAURANT WITH INDOOR AND OUTDOOR DINING LOCATED WITHIN I'ON VILLAGE. ​ ​ ​ ERIC MILLEY, FORMER EXECUTIVE CHEF OF JEFFERY'S GROCERY IN MANHATTAN'S WEST VILLAGE, LIVES BY THE ETHOS THAT LESS IS MORE - \"LET THE INGREDIENTS SHINE, FOCUS ON CLASSIC TECHNIQUE AND GET OUT OF THE WAY\". ​ ​ LEARN MORE ABOUT US & PRIVATE EVENTS DAILY MENU VIA INSTAGRAM bottom of page",
      "hash": "94ba21b444b2",
      "downloadedAt": "2026-01-19T02:12:38.411Z",
      "trimmedAt": "2026-01-19T03:28:33.022Z",
      "sizeReduction": "99.9%"
    }
  ],
  "sizeReduction": "99.9%"
}