{
  "venueId": "ChIJr7V7JuZk_ogRY2YvPVRCz5M",
  "venueName": "The Mill",
  "venueArea": "North Charleston",
  "website": "http://bookingforthemill.wixsite.com/themill",
  "scrapedAt": "2026-01-18T17:04:31.364Z",
  "trimmedAt": "2026-01-18T17:12:47.662Z",
  "pages": [
    {
      "url": "http://bookingforthemill.wixsite.com/themill",
      "text": "top of page This website was built on Wix. Create yours today. Get Started Live Music and libations Pool Tables Large Patio Jukebox book your band We keep over 100 craft, import and domestic beers in stock. We offer a wide array of spirits at some of the most comparable prices around! We have a small kitchen that produces big flavor. We maintain a warm and friendly clientele that we welcome you to join! Touring and regional bands! Never a Cover! Follow us: Reverbnation Dreams come true on East Montague! bottom of page",
      "hash": "38ad4f176469",
      "downloadedAt": "2026-01-18T17:01:37.751Z",
      "trimmedAt": "2026-01-18T17:12:47.602Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "https://bookingforthemill.wixsite.com/themill/events",
      "text": "top of page This website was built on Wix. Create yours today. Get Started Upcoming Events We are currently not booking entertainment until we feel it safe to do so. Thanks. We serve Happy Hour, mon-friday from 4-7 p.m. offering great prices including $1 PBR cans! Please continue to check here for upcoming shows and events. Like our and stay in the loop with events, specials and any other wild schemes we come up with. We look forward to meeting you! Facebook page bottom of page",
      "hash": "9978992a5720",
      "downloadedAt": "2026-01-18T17:01:38.552Z",
      "trimmedAt": "2026-01-18T17:12:47.628Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "https://bookingforthemill.wixsite.com/themill/the-bar",
      "text": "top of page This website was built on Wix. Create yours today. Get Started The Bar 1026 East Montague Our Patio and Courtyard The Mill! 1026 East Montague 1/10 Photo Gallery bottom of page",
      "hash": "b2c796679a5d",
      "downloadedAt": "2026-01-18T17:01:37.935Z",
      "trimmedAt": "2026-01-18T17:12:47.662Z",
      "sizeReduction": "100.0%"
    }
  ],
  "sizeReduction": "99.9%"
}