{
  "venueId": "ChIJs0RnmKhz_ogRVZIdPdRELl8",
  "venueName": "The Palms Oceanfront Hotel",
  "venueArea": "Isle of Palms",
  "website": "https://palmscharleston.com/?utm_source=google&utm_medium=organic&utm_campaign=business_listing",
  "scrapedAt": "2026-01-18T17:04:31.432Z",
  "trimmedAt": "2026-01-18T17:12:49.309Z",
  "pages": [
    {
      "url": "https://palmscharleston.com/explore/upcoming-local-events",
      "text": "Upcoming Local Events Your Insider’s Guide to Isle of Palms Unlock more than a room; immerse yourself in the heartbeat of Isle of Palms. Our central location makes it easy to access the island’s most popular events while offering a tranquil retreat when you’re ready to unwind. Halloween Golf Cart Parade & Carnival October 26, 2024 Bring the entire family and enjoy a costume golf cart parade, a drive through haunted house, inflatables, food vendors, trick or treat bags, games and much more! The parade begins just a few blocks away from our front doors. Holiday Street Festival December 7, 2024 Kick off the holiday season with Isle of Palms Holiday Street Festival. Enjoy arts and crafters, food vendors, children activities, live entertainment, and Santa Clause! The festival is steps away from our hotel. Festival of Lights November 15 - December 31, 2024 The Festival of Lights is a favorite Lowcountry tradition during the holidays. Drive through James Island County Parks and enjoy more than 700 shimmering light displays and holiday tunes!",
      "hash": "3435568075f4",
      "downloadedAt": "2026-01-18T16:55:27.071Z",
      "trimmedAt": "2026-01-18T17:12:49.289Z",
      "sizeReduction": "99.4%"
    },
    {
      "url": "https://palmscharleston.com/offers",
      "text": "Isle of Palms Hotel Deals New Year’s Getaway 26% OFF Stays Wave goodbye to last year and ring in the New Year with sun, sand, and savings! Book today and travel to the coast for less this year. 26% Off Accommodations book now READ MORE Advanced Purchase Book Ahead & Save 15% Save 15% Book 45+ more days in advance Book Now Read More Coastal Romance Bottle of Prosecco + Chocolates Relaxing Accommodations Bottle of Prosecco Local Artisan Chocolates Book Now Read More Book Direct & Save 10% Off & EXTRA PERKS 10% Off Stays 3 Free Gifts of Your Choice Book Now Read More Everyday Heroes 10% OFF 10% Off Accommodations Book Now Read More",
      "hash": "52a696693082",
      "downloadedAt": "2026-01-18T16:55:26.442Z",
      "trimmedAt": "2026-01-18T17:12:49.298Z",
      "sizeReduction": "99.7%"
    },
    {
      "url": "https://palmscharleston.com/?utm_source=google&utm_medium=organic&utm_campaign=business_listing",
      "text": "For Sun Lovers And Sea Turtles An Island Retreat The Palms Oceanfront Hotel Welcome to Completely reimagined, the Palms Oceanfront Hotel charts a fresh new course on Isle of Palms. Highlights of the oceanfront hotel include a new pool deck with outdoor showers, a stylish lobby and guest rooms with whitewashed finishes, modern furnishings, and granite bathrooms. Book Direct Benefits Lowest Rate Guaranteed Welcome Drink Upon Request Offers New Year’s Getaway 26% OFF Stays Wave goodbye to last year and ring in the New Year with sun, sand, and savings! Book today and travel to the coast for less this year. 26% Off Accommodations Read more Offers Discover the Coast 15% Off Stays 15% Off Accommodations Read more Offers Advanced Purchase Book Ahead & Save 15% Save 15% Book 45+ more days in advance Read more Offers Coastal Romance Bottle of Prosecco + Chocolates Relaxing Accommodations Bottle of Prosecco Local Artisan Chocolates Read more Offers Book Direct & Save 10% Off & EXTRA PERKS 10% Off Stays 3 Free Gifts of Your Choice Read more Offers Everyday Heroes 10% OFF 10% Off Accommodations Read more Offers For AAA Members 10% OFF 10% OFF Read more Reasons to Stay Oceanfront Location With oceanfront views and direct access to the beach, The Palms Oceanfront Hotel provides everything you need for the perfect beach stay. Reasons to Stay Say “Hello” To Family-Friendly Affordability Give your beach budget a break! The Palms Oceanfront Hotel offers unparalleled value, right on the beach – and reasonably close to downtown Charleston. Reasons to Stay Easy Access To All The Essentials The Palms Oceanfront Hotel is located in close proximity to local restaurants, grocery stores, and charming country shops, including Acme Low Country Kitchen, a perennial favorite. Reasons to Stay Exploring Isle of Palms Isle of Palms is located on one of the East Coast’s most beautiful beaches. A favorite coastal getaway, our barrier island bustles with golf courses, water sports, biking, and old-fashioned family fun. Exploring Isle of Palms A favorite coastal getaway, our barrier island bustles with golf courses, water sports, biking, and old-fashioned family fun. Explore Isle Of Palms Guest Reviews GREAT PLACE TO STAY! We truly enjoyed our stay here! It's so close to the beach which was convenient for us to go swim or relax on the beach every evening after our days off exploring! - micheronemus Guest Reviews \"Isle of Palms Vacation\" We have been going here for several years and have never had a bad experience. We love walking around the small town and visiting the shops. A very good experience. - Bill J. Guest Reviews \"Loved our time at The Palms\" The Palms in Isle of Palms, SC is modern, comfortable and clean. The room was surprisingly large. We thoroughly enjoyed our stay right on the beach overlooking the ocean. - Christine K. Guest Reviews \"Stay at The Palms!\" Loved our stay there…right at the beach! Staff was friendly, helpful, and inviting. Rooms were clean and well put together. Restaurants in walking distance was even better! - Josh S. Guest Reviews \"Gorgeous Beachfront Hotel!\" This hotel was excellent. Steps from the ocean and bed was super comfortable. We got the Oceanfront Balcony Suite, and nothing beats going to sleep with the sounds of waves crashing. - Eugene P. Guest Reviews \"Great Location!\" We’ve been staying at the Palms Hotel for a few years. It’s always been a pleasant experience! Staff is super friendly, it’s clean and the location is great! - Jan E. #ThePalmsOceanfrontHotel",
      "hash": "7f952550cf5d",
      "downloadedAt": "2026-01-18T16:55:26.146Z",
      "trimmedAt": "2026-01-18T17:12:49.309Z",
      "sizeReduction": "98.1%"
    }
  ],
  "sizeReduction": "99.0%"
}