{
  "venueId": "ChIJdRpCqqhz_ogRhHfU-jYxqP0",
  "venueName": "The Dinghy",
  "venueArea": "Isle of Palms",
  "website": "http://www.dinghyiop.com/",
  "scrapedAt": "2026-01-19T02:19:36.178Z",
  "trimmedAt": "2026-01-19T02:25:59.177Z",
  "pages": [
    {
      "url": "https://www.dinghyiop.com/the-menu",
      "text": "[Page Title: The Menu | The Dinghy]\n\ntop of page The Dinghy Menu (2024) ​ Appetizers ​ Choose from Buffalo, Fire, Memphis dry rub, Lemon Pepper, Teriyaki, Sweet Thai Chili, BBQ, Honey BBQ, Garlic Parmesan, Sesame Teriyaki, Mango Habanero, or Honey Sriracha, served with ranch or blue cheese, and celery Six Jumbo Wings: 12 Dusted with House Autry, Fried and served with Chipotle sauce Alligator Bites: 14 blackened, buffalo or old bay seasoned with cocktail sauce Grilled Shrimp: 9 Fried and served with house cocktail or tarter Clam Strips: 9 Fried Mushrooms 7   Fried Avocado Slices 8  Jalapeño Poppers 9  Mac-N-Cheese Bites 9  Fried Calamari 10 Five Jumbo shrimp dredged in Japanese breadcrumbs and shredded coconut, fried and served with the Chef’s Sweet Thai Chili sauce Coconut Shrimp: 12 Sweet Potato fries topped with warm peanut butter, crispy bacon and fried plantains Dirty Elvis Fries: 10 Six cheese sticks served with marinara topped with grated Parmesan cheese Mozzarella Sticks: 9 with pita points, celery, and carrots Hummus: 9 Salads ​ \nCrispy Romaine lettuce with toasted almond slices, carrots, sesame seeds, and fried noodles topped with Asian sesame dressing\nAsian Salad: 9.5 \nCrisp Romaine lettuce topped with Bacon, Tomato, Blue cheese crumbles, Red Onion with Blue Cheese dressing\nDinghy Salad: 9.5 \nCrispy romaine lettuce with croutons, tossed with Caesar dressing and shaved Parmesan Romano cheese blend\nCaesar Salad: 9.5 Add chicken ($6)  Add Mahi ($9)  Add Shrimp ($6) ​ Sandwiches & Such ​ Sandwiches come with choice of one side  (Onion Rings add $3) Add Bacon $1, add Mushrooms or Jalapeños .75 Tomato or extra cheese .50  Gluten-Free Bun add $1      Sub wheat bread optional All Beef Patty on toasted sesame seed bun with choice of American, cheddar, Swiss, Pepper Jack, or Bleu cheese, Mayo, Pickle, Lettuce, Onion and Tomato *Dinghy Cheeseburger: 14 Fried Flounder Filet on a Toasted Hoagie Roll with Lettuce, Tomato, and Tarter Sauce Fish Sandwich: 13 Mahi fillet on Ciabatta bread with lettuce, tomato, and lemon aioli Grilled Mahi Sandwich: 16 Boneless chicken breast on toasted sesame seed Bun with lettuce, tomato, onion and house chipotle sauce Grilled Chicken Sandwich: 13.5 Sliced drunken pork loin, ham, Swiss cheese and sliced dill pickle with Dijon mustard on Ciabatta Bread Panini Pressed Cuban Sandwich: 13.5 Shredded Sirloin Steak, sautéed peppers, onions, Philly Cheese sauce, and Swiss cheese on a hoagie roll Philly Cheese Steak Sandwich: 14 House hummus, Romaine Lettuce, Mushrooms, peppers and onions, Feta cheese, & tomato with Balsamic dressing Vegetarian Wrap: 12 Boneless Chicken Breast tossed with our Caesar Salad Grilled Chicken Caesar Wrap: 13.5 Fried Chicken tossed in Buffalo sauce with Romaine Lettuce, and Blue Cheese Crumbles Buffalo Chicken Wrap: 12.5 with lettuce, tomato, and mayo on white bread Fried Bologna Sandwich: 10 Piled high on 2 pieces of white bread with cheddar, ham, turkey, bacon, roast beef, lettuce, tomato, and mayo Club Sandwich: 13 Roast Beef soaked in Au Jus topped with melted Swiss cheese French Dip: 13 Lightly dusted with House Autry, fried Flounder with Fries, Cole Slaw, lemon wedge, and tartar sauce Fish and Chip Basket: 14 Chicken Fingers & Fries: 12                        Grilled cheese: 10                              BLT: 12 ​ Sides ​ French Fries, Sweet Potato Fries, Fried Plantains, Cole Slaw, Side Salad, Apple Sauce, Potato salad 4\n     Cajun Fries 4.5              Onion Rings 7 ​ Kids Menu ​ Grilled Cheese Sandwich plus side 7\nChicken Fingers plus side 8.5\nPBJ sandwich plus side 7.5 ​ *These items are cooked to order, and may be served raw or undercooked. Consuming raw or undercooked meats, poultry, seafood, shellfish, or eggs may increase your risk of food-borne illness. bottom of page",
      "hash": "0aa8209597ed",
      "downloadedAt": "2026-01-19T02:09:59.933Z",
      "trimmedAt": "2026-01-19T02:25:59.128Z",
      "sizeReduction": "99.1%"
    },
    {
      "url": "https://www.dinghyiop.com/the-bar",
      "text": "[Page Title: About the Bar | The Dinghy]\n\ntop of page \nTHE DINGHY'S STORY\nThe origin of The Dinghy came from the potential of a small vacant building located in the Front Beach District of The Isle of Palms. As one of the owners of The Windjammer, Malcolm Burgis wanted to put something in the vacant building adjacent the Windjammer. He asked his Friend, and Ten Year employee, Bret Jones, his thoughts on the building. Bret came to him with a dream and a few sketches. After some consideration, the Dinghy was born. ​ The Dinghy has a laid back Key West Vibe, great food options, and many unique Beers on Tap. The Dinghy features a spacious side porch, which features Live Music during Happy Hour, plenty of TVs, an Internet Juke Box, games and a friendly staff. Come check it out for yourself! We hope to be one of your stops on your tour of the beautiful Isle of Palms. SAY HELLO Have a question about the bar? Just wanna say hi? Have a good joke to share? Drop us a line! 8 J.C. Long Blvd. Isle of Palms, SC 29451  / dinghyiop@gmail.com T  /  843.242.8310 Success! Message received. Send bottom of page",
      "hash": "583f93faac0c",
      "downloadedAt": "2026-01-19T02:09:59.376Z",
      "trimmedAt": "2026-01-19T02:25:59.151Z",
      "sizeReduction": "99.7%"
    },
    {
      "url": "http://www.dinghyiop.com/",
      "text": "[Page Title: The Dinghy | Isle of Palms, SC Tap Room & Kitchen]\n\ntop of page \n1/4\n\nLive Music\n\nThe Bar\nThe Menu Happy Hour Check out our live music calendar and come enjoy some tunes on the patio. A favorite spot for both locals and guests of the IOP, learn more about our humble beginnings. From sandwiches to salads to Conch Fritters, the Dinghy menu has something for everyone! Great drinks specials every weekday from 4-7pm. See the Schedule> About the Dinghy> Current Menu> bottom of page",
      "hash": "8e480cd7e6f7",
      "downloadedAt": "2026-01-19T02:09:59.310Z",
      "trimmedAt": "2026-01-19T02:25:59.177Z",
      "sizeReduction": "99.9%"
    }
  ],
  "sizeReduction": "99.6%"
}