{
  "venueId": "ChIJU9dkxudx_ogRnerJ6cOlS0U",
  "venueName": "Cramer's Kitchen",
  "venueArea": "Mount Pleasant",
  "website": "https://cramerskitchen.co/",
  "scrapedAt": "2026-01-19T03:25:42.259Z",
  "trimmedAt": "2026-01-19T03:29:13.888Z",
  "pages": [
    {
      "url": "https://cramerskitchen.co/",
      "text": "[Page Title: Cramer's Kitchen]\n\n0 CRAMER’S KITCHEN SIMPLY ELEVATED CUISINE FOOD IS LIFE Welcome to Cramer's Kitchen, where dining becomes an elevated experience! We are open for both public reservation through Resy or private group dining via the contact form below. Come in and indulge in the culinary delights of Chef Owen’s (Owner of Cramers Cuisine) seasonal tasting menu, featuring 5+ courses, with the option to complement your experience with our curated selection of wines. At Cramer's, we strive to source our ingredients as locally as possible to provide not only the best quality, but the most sustainable. Cramer’s Kitchen was opened as an extension of Chef’s many years of private chef experiences and catering. At Cramer’s, you will find yourself stepping into his “home” rather than yours. *Our Chef's Tasting Menu aims to preserve Chef Owen's original culinary vision while accommodating common dietary preferences: vegetarian, pescatarian, gluten-free, shellfish allergy, and nut allergy. \nKITCHEN\n+ Restaurant $125 / person \nSeasonally rotating 5-7 course prix fix menu. See our current menu below in our Instagram slide!\nPrivate Dining $200 / person \nPrivate Group Dining. All inclusive experience for up to 20 people. Food, wine, and beer included. !\nInquire here catering Contact for Pricing \nFor catering, visit our sister company Cramers Cuisine !\nsite here Email Address Sign Up \nThank you!\ncommunity + Follow the Kitchen And NOW OPEN… \nNook Tiny Cafe & Market is co-owned by Chef Owen Bernstein, which features specialty coffee during the day, and a wine and charcuterie bar in the evening. Open now at 267 Rutledge in downtown Charleston.\n\nFollow along at or online at\n@nooktinycafe.com nooktinycafe.com",
      "hash": "f03155c4c6e9",
      "downloadedAt": "2026-01-19T02:10:56.845Z",
      "trimmedAt": "2026-01-19T03:29:13.888Z",
      "sizeReduction": "99.1%"
    }
  ],
  "sizeReduction": "99.1%"
}