{
  "venueId": "ChIJNVS6PEdj_ogR9uu7KviP-oQ",
  "venueName": "Chatty Magpie Cafe",
  "venueArea": "North Charleston",
  "website": "https://www.chattymagpie.cafe/",
  "scrapedAt": "2026-01-19T03:25:40.955Z",
  "trimmedAt": "2026-01-19T03:28:22.897Z",
  "pages": [
    {
      "url": "https://www.chattymagpie.cafe/",
      "text": "[Page Title: CHATTY MAGPIE CAFE]\n\n0 SHOP WHOLESALE ABOUT CONTACT “One Slice              One Gift            One Person          At a Time” \nOur Socials\n\nTestimonials\nThis place has amazing pastries and pies! She makes them from scratch! This place is so quaint, sat right outside and enjoyed the cool weather. Want some delicious delicacy! Caleb L. Nice little addition to the Pepperhill shopping complex! Poked my head in and saw an amazing variety of baked goods and bagels. Seems like specialty goods are their main focus, but their breakfasts are just as good. Jersey M Delicious treats. The owner obviously takes pride in her work and is happy to explain what she has on offer. For example, she is clearly from Eastern Europe/Russia and she has a \"Russian Tea Cake\" in the case. I was of course intrigued and took a huge slice home - perfect. Not too sweet, and a great match for herbal tea, as well as being able to stand up to stronger teas like chai and Earl Grey. This is a nice addition to North Charleston. I will be back. Kathleen P. Elena quickly helped us with an impressive Cake for our Family's private gender reveal party at the last minute. Elena has an amazing skill as well as true passion and enthusiasm for every project. I was pleasantly welcomed with her excitement and joy when she unveiled our cake for the first time. Thank you Elena (from the growing) Malesic Family!",
      "hash": "aa7fdb2c4b6f",
      "downloadedAt": "2026-01-19T02:13:34.615Z",
      "trimmedAt": "2026-01-19T03:28:22.885Z",
      "sizeReduction": "99.2%"
    },
    {
      "url": "https://www.chattymagpie.cafe/storemenu",
      "text": "[Page Title: StoreMenu — CHATTY MAGPIE CAFE]\n\n0 SHOP WHOLESALE ABOUT CONTACT Dutch Apple Pie [NF] \nFlavorful apple pie filling, flaky crust, buttery streusel crump topping\n\n$22.20\nKey Lime Pie [NF] \nGraham cracker crust, key lime juice\n\n$19.20\nChocolate Pie [GF] \nA buttery, flaky crust, dark chocolate pudding and chantily cream\n\n$21.20\nBerry British Scone[10] \nMoist with crisp crumbly edges, chocolate chips, berries[not sold individually]\n\n$9.20\nTea Cakes \nSmooth, sugar-dusted nut balls {not sold individually} contain walnuts\n\n$14.20\nRaspberry Tart \nPate sucree crust, raspberry curd, fresh raspberry\n\n$25.20\nPecan Tart \nCream cheese pastry cream, pecan vanilla filling\n\n$22.20\nManchester Tart \nShortcrust pastry shell, raspberry, coconut, Maraschino cherry\n\n$18.20",
      "hash": "fc4800b8d5d5",
      "downloadedAt": "2026-01-19T02:13:34.657Z",
      "trimmedAt": "2026-01-19T03:28:22.897Z",
      "sizeReduction": "99.4%"
    }
  ],
  "sizeReduction": "99.2%"
}