{
  "venueId": "ChIJ3V_SR997_ogRXp9jPUDZQjU",
  "venueName": "Groovers Listening Bar",
  "venueArea": "Downtown Charleston",
  "website": "https://grooverschs.com/",
  "scrapedAt": "2026-01-18T17:04:23.462Z",
  "trimmedAt": "2026-01-18T17:04:53.618Z",
  "pages": [
    {
      "url": "https://grooverschs.com/upcoming-events-music",
      "text": "Upcoming events. Jan 16 THE MIDNIGHT CITY BAND + disco with johnny Friday, January 16, 2026 7:00 PM 7:00 PM Google Calendar ICS LIVE MUSIC WITH THE MIDNIGHT CITY BAND DISCO WITH JOHNNY SEE YOU FRIDAY JANUARY 16TH! View Event → Jan 17 Vinly with DJ PAULY and disco with thematik Saturday, January 17, 2026 7:00 PM 8:00 PM Google Calendar ICS Saturday January 17th- View Event → Jan 21 INDUSTRY NIGHTS LIVE MUSIC Wednesday, January 21, 2026 7:00 PM 8:00 PM Google Calendar ICS LIVE MUSIC View Event → Jan 22 flip thru thursday with FLIP THRU Thursday, January 22, 2026 7:00 PM 8:00 PM Google Calendar ICS Flip Thru Thursday ! View Event → Jan 28 INDUSTRY NIGHTS LIVE MUSIC Wednesday, January 28, 2026 7:00 PM 8:00 PM Google Calendar ICS LIVE MUSIC View Event → Jan 30 THE MIDNIGHT CITY BAND + disco with johnny Friday, January 30, 2026 7:00 PM 8:00 PM Google Calendar ICS LIVE MUSIC WITH THE MIDNIGHT CITY BAND DISCO WITH JOHNNY View Event → Jan 15 flip thru thursday with FLIP THRU Thursday, January 15, 2026 7:00 PM 8:00 PM Google Calendar ICS Flip Thru Thursday ! View Event → Jan 14 INDUSTRY NIGHTS LIVE MUSIC Wednesday, January 14, 2026 7:00 PM 8:00 PM Google Calendar ICS LIVE MUSIC View Event → Jan 10 VINYL WITH CUTTY SMOKE + DISCO WITH SAAN Saturday, January 10, 2026 7:00 PM 7:00 PM Google Calendar ICS VINYL WITH CUTTY SMOKE DISCO WITH SAAN SATURDAY JANUARY 10TH - DOORS AT 7PM LIVE MUSIC + BEST PARTY IN DOWNTOWN CHARLESTON! View Event → Jan 9 THE MIDNIGHT CITY BAND + CAM BUZZ Friday, January 9, 2026 7:00 PM 7:00 PM Google Calendar ICS LIVE MUSIC WITH THE MIDNIGHT CITY BAND DISCO WITH CAM BUZZ SEE YOU FRIDAY JANUARY 9TH! View Event → Jan 3 DJ PAULY AND CURRY SAUCE Saturday, January 3, 2026 7:00 PM 8:00 PM Google Calendar ICS Saturday January 3rd- View Event → Dec 31 NYE AT GROOVERS Wednesday, December 31, 2025 7:00 PM 8:00 PM Google Calendar ICS NYE at Groovers get your tickets now and ring in 2026 with us! View Event → Dec 27 VINYL: Blacksmith DISCO: Johnny Saturday, December 27, 2025 7:00 PM 8:00 PM Google Calendar ICS VINYL: Blacksmith DISCO: Johnny View Event → Dec 26 Disco with Curry sauce Friday, December 26, 2025 7:00 PM 8:00 PM Google Calendar ICS Disco with Curry Sauce View Event → Dec 19 GATOR FOoD AND DISCO WITH DJ MEREBEAR Friday, December 19, 2025 7:00 PM 7:00 PM Google Calendar ICS LIVE BAND: Gator Ford then DISCO: with DJ Merebear View Event → Dec 17 Jazzy Blues Wednesday, December 17, 2025 7:00 PM 8:00 PM Google Calendar ICS LIVE MUSIC : Jazzy blues with AC Scar every Wednesday at Groovers! Doors at 7PM. View Event → Dec 11 flip thru thursday Thursday, December 11, 2025 7:00 PM 8:00 PM Google Calendar ICS Flip Thru Thursday! View Event → Dec 10 Jazzy Blues Wednesday, December 10, 2025 7:00 PM 8:00 PM Google Calendar ICS LIVE MUSIC : Jazzy blues with AC Scar every Wednesday at Groovers! Doors at 7PM. View Event → Dec 6 Saturday Vinyl with DIllard and disco with cam buzz Saturday, December 6, 2025 7:00 PM 8:00 PM Google Calendar ICS Saturday Night at Groovers!!VINYL with DILLARDDISCO with Cam Buzz View Event → Dec 5 noah of the heart and disco with curry sauce Friday, December 5, 2025 7:00 PM 8:00 PM Google Calendar ICS LIVE BAND: Noah of the Heart and then DISCO: with Curry Sauce View Event → Dec 4 flip thru thursday with FLIP THRU Thursday, December 4, 2025 7:00 PM 8:00 PM Google Calendar ICS Flip Thru Thursday ! View Event → Dec 3 Jazzy Blues Wednesday, December 3, 2025 7:00 PM 8:00 PM Google Calendar ICS LIVE MUSIC : Jazzy blues with AC Scar every Wednesday at Groovers! Doors at 7PM. View Event → Nov 26 Jazzy Blues with AC Scar Wednesday, November 26, 2025 7:00 PM 7:00 PM Google Calendar ICS LIVE MUSIC : Jazzy blues with AC Scar every Wednesday at Groovers! Doors at 7PM. View Event → Nov 21 The midnight city band and disco with noah friends Friday, November 21, 2025 7:00 PM 7:00 PM Google Calendar ICS LIVE BAND: The Midnight City band then DISCO: with Noah Friends View Event → Nov 20 flip thru thursday with cutty smoke Thursday, November 20, 2025 7:00 PM 7:00 PM Google Calendar ICS Flip Thru Thursday with Cutty Smoke! View Event → Nov 19 Jazzy Blues with AC Scar Wednesday, November 19, 2025 7:00 PM 7:00 PM Google Calendar ICS LIVE MUSIC : Jazzy blues with AC Scar every Wednesday at Groovers! Doors at 7PM. View Event → Nov 15 Saturday Vinyl with cutty smoke and disco with cam buzz Saturday, November 15, 2025 7:00 PM 7:00 PM Google Calendar ICS Saturday Night at Groovers!!VINYL with Cutty Smoke DISCO with Cam Buzz View Event → Nov 14 Noah of the heart and disco smartz Friday, November 14, 2025 7:00 PM 7:00 PM Google Calendar ICS LIVE BAND: Noah of the Heart then DISCO: with Smartz View Event → Nov 13 FLIP THRU THURSDAY Thursday, November 13, 2025 7:00 PM 7:00 PM Google Calendar ICS Flip Thru Thursday with Flip Thru! View Event → Nov 8 Vinyl with dj pauly and disco with curry sauce Saturday, November 8, 2025 7:00 PM 7:00 PM Google Calendar ICS This Saturday Night Vinyl with DJ Pauly and Disco with Curry Sauce, join us at 7pm! View Event → Nov 7 The Midnight city band and disco with curry sauce Friday, November 7, 2025 7:00 PM 7:00 PM Google Calendar ICS This Friday Night The Midnight City Band and Disco with Curry Sauce, join us at 7pm! View Event → Nov 6 FLIP THRU THURSDAY Thursday, November 6, 2025 7:00 PM 7:00 PM Google Calendar ICS Flip Thru Thursday with Cutty Smoke join us at 7pm View Event → Nov 1 Vinyl with Cutty smoke disco with thematik Saturday, November 1, 2025 7:00 PM 7:00 PM Google Calendar ICS LIVE MUSIC : Jazzy blues with AC Scar every Wednesday at Groovers! View Event → Oct 31 halloween night disco with noah friends and curry sauce Friday, October 31, 2025 7:00 PM 7:00 PM Google Calendar ICS DISCO with Noah Friends and Curry Sauce View Event → Oct 24 GROOVERS PRESENTS: A NIGHT AT STUDIO 54 Friday, October 24, 2025 9:00 PM 11:59 PM Groovers Charleston (map) Google Calendar ICS GROOVERS PRESENTS: A NIGHT AT STUDIO 54 Step into the golden age of disco! We’re bringing the glitz, glamour, and unapologetic disco vibes of the legendary dance floor to Groovers! Think sequins, sparkle, wild energy, and a night where the music never stops. Dress like the icons of Studio 54 and get ready to shine under the disco ball. Entertainment by Curry, Norway & Thematik This is more than a party—it’s a disco revival. Be the first to step into Studio 54 View Event → Oct 22 Jazzy Blues with AC Scar Wednesday, October 22, 2025 7:00 PM 7:00 PM Google Calendar ICS LIVE MUSIC : Jazzy blues with AC Scar every Wednesday at Groovers! View Event →",
      "hash": "741c3399d814",
      "downloadedAt": "2026-01-18T16:54:06.380Z",
      "trimmedAt": "2026-01-18T17:04:53.583Z",
      "sizeReduction": "97.7%"
    },
    {
      "url": "https://grooverschs.com/eventsrequests",
      "text": "Let’s party Interested in hosting an event with us at groovers? Whether it’s your wedding after party, or corporate retreat, we groove with it all.",
      "hash": "8ea24a558a92",
      "downloadedAt": "2026-01-18T16:54:07.637Z",
      "trimmedAt": "2026-01-18T17:04:53.591Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "https://grooverschs.com/",
      "text": "Welcome to groovers New years at GROOVERS Live Disco DJ set by Curry entry champagne toast at midnight : Groovers Charleston's best Listening Bar for Cocktails, Live Music, and Vinyl DJs Step into Groovers, Charleston's premier listening bar, where we're reviving the spirit of the legendary 90s Calhoun Streetmusic scene. Enjoy crafted cocktails while immersing yourself in an atmosphere where live musicand vinyl DJs take center stage. Experience the nostalgia, great tunes, and a unique vibe that transports you back in time. Whether you're seeking a laid-back evening of vinyl classics or an electrifying live music performance, Groovers is your go-to destination in Charleston for an unforgettable night. #GrooveOver • #GrooveOver • #GrooveOver • MUSIC SCHEDULE let's get groovy DRINK MENU let's get drinks “Very cool new spot and the only vinyl listening bar in Charleston. Great cocktails and ambiance.” “Groovers is a 10/10! So excited to have a spot like this in Charleston- really one of a kind with a vibrant atmosphere, comfortable lounge and bar seating, incredible music and awesome drinks!” Upcoming events. ABOUT Groovers Charleston’s go-to listening bar for an unforgettable night of cocktails, live music, and vinyl DJ sets. Paying tribute to the iconic 90s Calhoun Street venue, Groovers brings the best of classic vibes with a modern twist. Sip on cocktails while enjoying live performances or lose yourself in the nostalgic sounds of vinyl records. Whether you're a music lover, a cocktail enthusiast, or just looking for a unique nightlife experience in Charleston, Groovers offers the perfect blend of great tunes and timeless ambiance.",
      "hash": "ef87f862001f",
      "downloadedAt": "2026-01-18T16:54:06.244Z",
      "trimmedAt": "2026-01-18T17:04:53.613Z",
      "sizeReduction": "99.3%"
    },
    {
      "url": "https://grooverschs.com/menu",
      "text": "Click the record for drink menu",
      "hash": "f0823497fa50",
      "downloadedAt": "2026-01-18T16:54:07.005Z",
      "trimmedAt": "2026-01-18T17:04:53.618Z",
      "sizeReduction": "100.0%"
    }
  ],
  "sizeReduction": "98.9%"
}