{
  "venueId": "ChIJn5C08qlz_ogRsEyfIRdjQBg",
  "venueName": "The Refuge",
  "venueArea": "Isle of Palms",
  "website": "http://refugeiop.com/",
  "scrapedAt": "2026-01-19T02:45:57.314Z",
  "trimmedAt": "2026-01-19T02:53:07.014Z",
  "pages": [
    {
      "url": "http://refugeiop.com/isle-of-palms-isle-of-palms-the-refuge-drink-menu",
      "text": "[Page Title: The Refuge - Coffee Bar]\n\nCoffee Bar\nCoffee & Tea",
      "hash": "8d715d664b6f",
      "downloadedAt": "2026-01-19T02:10:00.001Z",
      "trimmedAt": "2026-01-19T02:53:06.965Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "http://refugeiop.com/isle-of-palms-isle-of-palms-the-refuge-happy-hours-specials",
      "text": "[Page Title: The Refuge - Specials]\n\nSpecials\n\nSunday January 18th\n\nFresh Lobster Night • Lobster night is a staff and customer favorite at The Refuge. Fresh-off-the-boat lobsters are flown down each Saturday from Vinalhaven, a small island located off the coast of Maine that is home to the second largest lobstering harbor in the world. All lobsters are one and half pounds and are perfectly steamed to order. They are served the Maine way with lemon, hot drawn butter and a variety of sides to choose from. Reservations are strongly suggested and quantities are limited. Come and enjoy the only whole steamed Maine lobster in the Low Country!\n\n05:00 PM - 09:00 PM\n\nTuesday January 20th\n\nSteakhouse Night • Steakhouse Night is overflowing with delicious cuts of meat, including Rib-eye. Choose from any of our six sauces and sides to complete your entree. All available cuts of meat are blackened or grilled.\n\n08:00 AM - 09:00 PM\n\nThursday January 22nd\n\nPrime Rib Night • We serve up delicious prime rib in 2 serving sizes, 10 oz (queen) or 12 oz (king), served with roasting fingerling potatoes, seared green beans, Au jus, and horseradish cream sauce.\n\n05:00 PM - 09:00 PM\n\nFriday January 23rd\n\nLive Music Night • Join us for live music featuring fun and lively local acts who know to bring entertainment and play all of your favorite songs. They even take requests! Come early for prime bar seating!\n\n07:00 PM - 10:00 PM",
      "hash": "8fefc1d80e30",
      "downloadedAt": "2026-01-19T02:10:01.301Z",
      "trimmedAt": "2026-01-19T02:53:06.969Z",
      "sizeReduction": "98.1%"
    },
    {
      "url": "http://refugeiop.com/isle-of-palms-isle-of-palms-the-refuge-food-menu",
      "text": "[Page Title: The Refuge - Food Menu]\n\nOur Menu\nMorning Tide Day Tide Evening Tide Kids Menu Lobster Night Menu Steak Night Menu Low Tide Menu 2pm-5pm Daily Weekend Brunch Menu",
      "hash": "be7dd0ba6b8b",
      "downloadedAt": "2026-01-19T02:09:59.365Z",
      "trimmedAt": "2026-01-19T02:53:06.976Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "http://refugeiop.com/isle-of-palms-isle-of-palms-the-refuge-drinks",
      "text": "[Page Title: The Refuge - Drinks]\n\nDrinks\nBourbons Cocktails Wine",
      "hash": "e6d1ebe95482",
      "downloadedAt": "2026-01-19T02:10:00.618Z",
      "trimmedAt": "2026-01-19T02:53:06.983Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "http://refugeiop.com/",
      "text": "[Page Title: The Refuge - Isle of Palms, Isle of Palms, SC]\n\n× \nLobster Night Every Sunday!\n\nJoin us for Lobster Night every Sunday evening from 5-9pm! Indulge in a one and a half pound steamed Maine lobster with two sides for only $47! Make your reservations today and be sure to let us know if you'd like to pre-reserve a certain amount of lobsters in the comments section!\nBook your Sunday Night Lobster Dinner today! \n1517 Palm Blvd suite a, Isle of Palms, SC 29451\nmap marker pin Welcome To The Refuge \nTucked away from the hustle and bustle of Charleston sits The Refuge in Isle of Palms. This family owned and operated venue is sure to please all. Enjoy your morning Macchiato with a fresh omelet or shrimp and grits from The Refuge's Morning Tide menu. Follow up with us in our dining room, where we also serve fresh, local food for lunch and dinner. A night at The Refuge wouldn't be complete without one of our signature cocktails concocted by our in-house mixologist. Planning a special event in Isle of Palms just got easier with our customized catering services available at The Refuge. Whether you're looking for a quick bite for lunch or a memorable evening of dining, let us be your refuge.\nour menu Cater with us! \nWe cater to all occasions.\n\nLet us be your professional caterers for your next event\ncatering \nReservations\n\nJoin us today\n\nClick the button below to make a reservation.\nReserve a table \nHost your next party with us\n\nQuality, Service, Hospitality\nparties \nCall For Reservations\n\nOr reserve online\nreservations \nCatering Services Available\ncatering Dot slide navigation number 1 Dot slide navigation number 2 Dot slide navigation number 3 slideshow start stop playing Private Parties \nHost your next party with us\n\nWe look forward to making your event memorable, tailored with you in mind.\nparties \nBlackened Triggerfish Sandwich\n\nInterior, bar area\n\nSeared scallops, with microgreens, grilled brussels sprouts, lemon...\n\nBurrata Caprese salad, with tomatoes, basil, cheese, prosciutto,...\n\nTurtle cheesecake, with caramel, chocolate and nuts\n\nPink lemonade\n\nInterior, lounging area, sofas with pillows, octopus mural on the...\n\nBagel, cream cheese, salmon, capers, gherkins, tomato, cucumbers, red...\n\nGrilled Angus beef steak, fries, and dressings\n\nBurrata Caprese salad\n\nSeared scallops\n\nButtermilk Pancakes, with blueberries, strawberries, whipped cream...\n\nTuna Tartare steak, with avocado, cilantro, crispy wontons and honey...\n\nShrimp and Grits\n\nReuben sandwich and fries\n\nGluten free red velvet cupcake\n\nThe Refuge\n\nThe Refuge\n\nThe Refuge\n\nMusicians performing live, vocals, guitar and percussion setup\n\nLiquor selection on the bar shelf, closeup\n\nReviews\n\nReview by - Yelp\n\nSteve S:\n\nExcellent food and breakfast very friendly staff and great coffee We highly recommend the Refuge!\n\nReview by - Yelp\n\nLisa L:\n\nThe menu changes but still keeps some of their classic choices. Always friendly staff and reasonable availability during busy season on IOP\n\nReview by - Yelp\n\nLynne S:\n\nExcellent food. I had their breakfast 2 eggs, hash browns, bacon & toast 2 days in a row it was so good and it arrived piping hot.\n\nReview by - Yelp\n\nJim D:\n\nOutstanding in every way. Had dinner and breakfast and was very pleased with the waitstaff, quality of food and atmosphere.\n\nReview by - Yelp\n\nHailey N:\n\nAmazing breakfast food! Wide range of menu options. The biscuits and gravy were fantastic!\nStop reviews carousel Play reviews carousel \nNewsletter\n\nLocation\n\n1517 Palm Blvd suite a\n\nIsle of Palms, SC\n\n29451\n\nHours\n\nSun, Mon, Tue, Wed, Thur, Fri, Sat\n\n8:00 AM - 9:00 PM\n\nFind us on...\nFacebook page Instagram page Yelp page \nContact us\n(843)-242-8934 therefuge1517@gmail.com \nPowered by:\nWebsite design, Social Media marketing and Email marketing provided by SpotHopper. × \nNewsletter",
      "hash": "ff6516516497",
      "downloadedAt": "2026-01-19T02:09:59.254Z",
      "trimmedAt": "2026-01-19T02:53:07.014Z",
      "sizeReduction": "97.5%"
    }
  ],
  "sizeReduction": "99.0%"
}