{
  "venueId": "ChIJz_jMVeVv_ogR5dVUOkNnOSc",
  "venueName": "Ristorante LIDI",
  "venueArea": "Daniel Island",
  "website": "http://www.ristorantelidi.com/",
  "scrapedAt": "2026-01-18T17:04:32.243Z",
  "trimmedAt": "2026-01-18T17:13:10.307Z",
  "pages": [
    {
      "url": "http://www.ristorantelidi.com/daniel-island-daniel-island-ristorante-lidi-happy-hours-specials",
      "text": "Specials Saturday January 17th Open for Dinner. Come check out our new Summer menu. Smaller portions designed to share at the table. 04:00 PM - 09:00 PM Sunday January 18th Open for Dinner. Come check out our new Summer menu. Smaller portions designed to share at the table. 04:00 PM - 09:00 PM Monday January 19th Open for lunch, Come grab a sandwich or lighter fare 11:00 AM - 02:00 PM Open for Dinner. Come check out our new Summer menu. Smaller portions designed to share at the table. 04:00 PM - 09:00 PM Tuesday January 20th Open for Lunch 11:00 AM - 02:00 PM Closed On Tuesday Evenings 04:00 PM - 09:30 PM Wednesday January 21st Open for Lunch 11:00 AM - 02:00 PM Open for Dinner. Come check out our new Summer menu. Smaller portions designed to share at the table. 04:00 PM - 09:00 PM Thursday January 22nd Open for Lunch 11:00 AM - 02:00 PM Open for Dinner. Come check out our new Summer menu. Smaller portions designed to share at the table. 04:00 PM - 09:00 PM Friday January 23rd Open for Lunch 11:00 AM - 02:00 PM Open for Dinner. Come check out our new Summer menu. Smaller portions designed to share at the table. 04:00 PM - 09:00 PM",
      "hash": "0f5fd7a1bcde",
      "downloadedAt": "2026-01-18T16:08:11.956Z",
      "trimmedAt": "2026-01-18T17:13:10.274Z",
      "sizeReduction": "98.3%"
    },
    {
      "url": "http://www.ristorantelidi.com/daniel-island-daniel-island-ristorante-lidi-food-menu",
      "text": "Our Menu Dinner Kids Dolci Lunch",
      "hash": "52e38a5188b1",
      "downloadedAt": "2026-01-18T16:08:10.671Z",
      "trimmedAt": "2026-01-18T17:13:10.285Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://www.ristorantelidi.com/",
      "text": "× We are taking online reservations! Let’s ensure you get a great table: Book today! We recommend making a reservation ahead of time. Book your table today! Book Table 901 Island Park Dr Suite A, Daniel Island, SC map marker pin A Destination Welcome home to Ristorante Lidi Ristorante LIDI was inspired by the world’s great Italian family restaurants known for simple, authentic dishes in intimate contemporary settings. A Ristorante LIDI experience incorporates the area’s unique island lifestyle, ease of access, and top-shelf service. We live and work here, and strive to make a positive contribution to the neighborhood’s culture and community Read more about us Parties Book your next party with us! Ristorante LIDI would be honored to provide our services for your next event. Each event is bespoke to your tastes and needs, to provide the best experience possible for you and your guests. Parties book now Try one of the Chef's daily features! Take A Look At Our Menu Our Menu Authentic Italian Reservations Don't miss Monday - Friday Happy Hour! Specials Dot slide navigation number 1 Dot slide navigation number 2 Dot slide navigation number 3 Dot slide navigation number 4 Dot slide navigation number 5 Dot slide navigation number 6 Dot slide navigation number 7 Dot slide navigation number 8 Dot slide navigation number 9 Dot slide navigation number 10 Dot slide navigation number 11 slideshow start stop playing Reservations Join Us Today Click button below to make a reservations Reservations Reviews Review by - Yelp Maria F: This restaurant never disappoints, both in service, and food quality! I absolutely love their pizza (home made crust!) we have gone multiple times, and everything has been outstanding. I love their gnoqui. Review by - Yelp Kelly F: Great place for lunch. We had the spaghetti and meatball ($8) and chicken park ($10). Both were very good. Nice atmosphere and clean. Reasonable prices. I'll be back. Ravioli, soup and salad were great. Review by - Yelp Gerry R: We have been here from NYC FOR 18 months and have been underwhelmed with the Italian food here Well tonight we \"came home\" and had an excellent meal served by a Pro! Bravo LIDI WE will be back!!! Review by - Yelp Tiffany C: This is our favorite Italian spot in Charleston. Everything is made from scratch and cooked to perfection. The braised veal short ribs are to die for. Stuffed mushrooms, calamari, and sausage and pea fettuccine Alfredo are a must. And Don't forget the espresso martini for dessert! You won't regret visiting LIDI. Review by - Yelp Stephanie D: Dropped by after a concert for a app and drink. Food was delicious and the drinks were on point! Quentin and Cody were great. Cozy atmosphere and the staff were energetic and professional! We will certainly be back! Stop reviews carousel Play reviews carousel Newsletter Location 901 Island Park Dr Suite A Daniel Island, SC Hours Lunch: Monday through Friday 11 am to 2 pm Dinner: Wednesday through Monday 4 pm to 9 pm Closed on Tuesday Evenings Happy Hour Monday, Wednesday, Thursday and Friday 4 pm to 6 pm Find us on... Facebook page Instagram page Yelp page Contact us (843)-471-1597 info@ristorantelidi.com Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "a085fc00b7b3",
      "downloadedAt": "2026-01-18T16:08:10.505Z",
      "trimmedAt": "2026-01-18T17:13:10.302Z",
      "sizeReduction": "97.5%"
    },
    {
      "url": "http://www.ristorantelidi.com/daniel-island-daniel-island-ristorante-lidi-drink-menu",
      "text": "Our Drinks Beer Wine Cocktails Non-Alcoholic",
      "hash": "c099367b173f",
      "downloadedAt": "2026-01-18T16:08:11.322Z",
      "trimmedAt": "2026-01-18T17:13:10.307Z",
      "sizeReduction": "100.0%"
    }
  ],
  "sizeReduction": "98.8%"
}