{
  "venueId": "ChIJ67NU_eJw_ogRrqRa1k6qZQs",
  "venueName": "The Pickled Palate cafe",
  "venueArea": "Mount Pleasant",
  "website": "http://www.thepickledpalate.com/",
  "scrapedAt": "2026-01-18T17:04:23.717Z",
  "trimmedAt": "2026-01-18T17:05:03.667Z",
  "pages": [
    {
      "url": "http://www.thepickledpalate.com/location-contact",
      "text": "Location & Contact Located inside Mainland Container Co. The Pickled Palate 1528 Ben Sawyer BlvdMt. Pleasant, SC, 29464 (843)936-6718",
      "hash": "2c35f71df2d9",
      "downloadedAt": "2026-01-18T16:57:39.339Z",
      "trimmedAt": "2026-01-18T17:05:03.641Z",
      "sizeReduction": "99.8%"
    },
    {
      "url": "http://www.thepickledpalate.com/menu",
      "text": "Menu MENU Subject to change daily ORDER ONLINE Appetizers served with toast points Aunt C’s Crab Dip served with toast points Pimento Cheese with potato chips Onion Dip Soup Roasted Red Pepper & Tomato She Crab Rotating Soup Specials Salads house made dressings | balsalmic vinaigrette, greek, ranch, creamy italian, maple vinaigrette mixed greens, tomatoes, cucumbers, sunflower seeds and your choice of dressing House Salad mixed greens, tomatoes, cucumbers, olives, pepperoncini, red onion, feta, greek dressing Greek Salad the greek salad with italian meats & italian dressing Italian Salad feta cheese, glazed pecans, red onion, arugula, maple vinaigrette Beet Salad heart of palm, artichoke, parmesan, red onion, salami, arugula and your choice of dressing Heart of Palm - Balsamic, Greek, Ranch, House made dressings Paninis served with choice of | chips. blue cheese slaw, or potato salad top sirloin, swiss, horseradish mayo French Dip raspberry mayo & swiss Turkey with fig jam Turkey Brie provolone, ham, salami, capicola with basil mayo Italian tuna fish, creole mayo, swiss, house-made sandwich pickles, mustard, mojo dipping sauce Tuna Melt smoked gouda & creole mayo Ham mozzarella, tomato, basil, balsalmic drizzle Caprese roasted pork, ham, swiss, house-made sandwich pickle, mustard, mojo dipping sauce. Classic Cuban house-made pimento cheese on toasted white bread Pimento Cheese Grilled Cheese Sandwiches served with choice of | chips. blue cheese slaw, or potato salad swiss, arugula, sprouts, tomato, artichoke mayo on toasted 9-grain Turkey Special arugula, tomato, cucumber, red onion, sprouts, sunflower seeds, house-made pickles, veganaise on toasted 9-grain Vegan vegan sandwich + pimento cheese Almost Vegan with fresh herbs, arugula, tomato on toasted 9-grain Chicken Salad mixed with fresh dill, lemon, celery seed, dijon, red onion, mayo, on toasted 9-grain Tuna Salad Kids on toasted focaccia, served with chips Peanut Butter & Jelly on toasted focaccia, served with chips Grilled Cheese - Call Desserts, Pups are welcome! All meats are hormone & antibiotic free! Bread is locally made.",
      "hash": "3a81973359d9",
      "downloadedAt": "2026-01-18T16:57:38.791Z",
      "trimmedAt": "2026-01-18T17:05:03.648Z",
      "sizeReduction": "96.6%"
    },
    {
      "url": "http://www.thepickledpalate.com/events",
      "text": "Events No upcoming events.",
      "hash": "514b51599460",
      "downloadedAt": "2026-01-18T16:57:40.012Z",
      "trimmedAt": "2026-01-18T17:05:03.650Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://www.thepickledpalate.com/",
      "text": "Welcome (scroll down) SCROLL DOWN Welcome (scroll down) View fullsize A Destination The Pickled Palate food wagon offers you a wonderful opportunity to escape for lunch in our magical location. We offer fresh Italian panini made with local breads, homemade soups and wonderful salads. We are located at the mainland container parked under the beautiful oak trees. Mainland is offering a full bar while we are in operation. Mainland container is a wonderful destination just a few minutes to Sullivans Island. So come see us and grab lunch on the way to the beach. View fullsize Great Wine Selection Large selection of wines and unique beers to purchase on premise or to go. Enjoy a bottle outside in the garden View fullsize Fresh Brewed Teas Organic teas made fresh daily as well as Charleston Roaster Coffee. We also offer cucumber and lemon water. View fullsize Vintage Garden Come escape in our magical vintage garden and enjoy a glass of wine, food with friends family and your favorite pet. We are very dog friendly. Eat Together Great Food, Great Wine & Always Great Friends! Eat Together Great Food, Great Wine & Always Great Friends! View fullsize View fullsize View fullsize View the full menu → Our Story Thanks for an awesome elven years! I opened this restaurant with a friend over eleven years ago and our business plan was that we planned to do business. I am a Horticulturist and my at the time business partner was a retired police officer. We opened with not much experience in the food and beverage buisness other then loving food, wine and the passion for hospitallity. It’s been a great run and we have enjoyed feeding people from all over and especially enjoyed meeting everyone. A big shout out to our locals and the friendships we have made. I love and will miss feeding all of you! Lisa Our Story Thanks for an awesome elven years! I opened this restaurant with a friend over eleven years ago and our business plan was that we planned to do business. I am a Horticulturist and my at the time business partner was a retired police officer. We opened with not much experience in the food and beverage buisness other then loving food, wine and the passion for hospitallity. It’s been a great run and we have enjoyed feeding people from all over and especially enjoyed meeting everyone. A big shout out to our locals and the friendships we have made. I love and will miss feeding all of you! Lisa The Pickled Palate Great Wines & Local Food When we created The Pickled Palate our goal was to provide a delicious & affordable dining experience in a welcoming environment. We hope that you come and visit us soon! Visit us on Facebook! Check Out Our Great Reviews! This place is FANTASTIC!! Probably the best panini I have ever had. Get the tuna melt! - Matt N. Yelp Super cute place, friendly staff & amazing food! The Italian panini was delicious, highly recommended. - Shana S. Getting pickled Getting pickled",
      "hash": "e2b0f474272a",
      "downloadedAt": "2026-01-18T16:57:38.514Z",
      "trimmedAt": "2026-01-18T17:05:03.667Z",
      "sizeReduction": "97.1%"
    }
  ],
  "sizeReduction": "98.2%"
}