{
  "venueId": "ChIJdTtvBWT2_SwRpVmNRBl_Ob4",
  "venueName": "Dragonfly Cocktails & Spirits",
  "venueArea": "West Ashley",
  "website": "https://www.dragonflycocktails.com/?utm_source=google&utm_medium=wix_google_business_profile&utm_campaign=13046419136876533749",
  "scrapedAt": "2026-01-19T02:19:36.219Z",
  "trimmedAt": "2026-01-19T02:26:00.331Z",
  "pages": [
    {
      "url": "https://www.dragonflycocktails.com/?utm_source=google&utm_medium=wix_google_business_profile&utm_campaign=13046419136876533749",
      "text": "[Page Title: Dragonfly Cocktails & Spirits | Bartending services]\n\ntop of page Your Bar is not just a bar to us, it's a chance to tell a story, coupled with experience and knowledgeable bartenders, and bar planners who think of everything,  we believe it does matter who is behind your bar.!  Book us today! Welcome ABOUT Our Story , is a woman owned company.  Owner Carrie Eddings-Foster saw a need to create bars that were classy, memorable and backed with experience,  so s Dragonfly Cocktails & Spirits he took her 10+ years experience in the Bartending industry and the Event Planning Industry to create Dragonfly Cocktails and Spirits. At Dragonfly our mission and belief is \"The Bar\" is the experience!  It's a place to tell a story, a place everyone gathers, a place were everyone deserves extraordinary cocktails and service. This means expertly crafted cocktails, professional & experienced staff, stunning décor, impeccable customer service, promptness and a seamless sales process to make your your planning and event unforgettable, and seem effortless. ​W hether it’s a corporate event, private party, or a wedding, our team is dedicated to making sure each guest has a great experience and that your bar stands out above the rest!! (Tips Certified, Licensed and Insured) ​ It does matter whose behind your bar! Our Services Flyer Know your bars options Cocktail Making Parties Party Favors & Flavors Bar Preliminary Pricing Cheat Sheet Getting Married? Here is a Bar Check List Shopping for 100 -(If you the Client is providing the product) Legal Terms & Contract Tips Certified, Licensed & Insured Thank yall so much. Yall were fantastic. Thanks, Lauren O' \nDragonfly is a name that holds a special meaning. It is a tribute to a hardworking and kind-hearted woman who always had a soft spot for those in need. Dragonflies are believed to be spiritual creatures that bring good luck, and seeing one is a sign that someone is looking after you. With this name, we honor the legacy of a woman who touched the lives of many and left a lasting impact on our hearts.\nOur Services My staff in the evening said y’all were amazing! ~ Hart Meadows Ranch, Andrea bottom of page",
      "hash": "03ffe8cc7c5b",
      "downloadedAt": "2026-01-19T02:16:51.874Z",
      "trimmedAt": "2026-01-19T02:25:59.648Z",
      "sizeReduction": "99.8%"
    },
    {
      "url": "https://www.dragonflycocktails.com/about-4",
      "text": "[Page Title: TIPS CERTIFIED & INSURED | Dragonfly Cocktails]\n\ntop of page We are TIPS CERTIFIED\n& INSURED What does being TIPS Certified and Insured mean? \nWhy is it important when selecting Bar Services or Bartending Service? is a State Certification process for people serving alcohol.  Being Tips Certified is essential for any bar services business, bartenders and it's employees.  TIPS training also enhances customer service by equipping employees with the skills to identify and prevent problematic behaviors related to alcohol consumption. Lastly, it ensures compliance with state requirements, as many jurisdictions mandate alcohol server training. Always check local regulations to determine if TIPS certification is necessary for your establishment/ venue. TIPS certification ​ Being Insured \naggregate. ​\nInsurance is crucial for mobile bartenders in South Carolina as it safeguards against potential financial losses associated with serving alcohol. Liquor liability insurance is essential, covering legal expenses and damages if a customer is injured or causes harm while intoxicated. This protection includes coverage for property damage, personal injury, or event. In South Carolina, it's important to note that the minimum coverage required is $1 million per occurrence and $2 million in Many venues require this insurance for your event.  If your venue requires it.  Please contact your bar planner, she will get the necessary COI (Certificate of Insurance) to your venue 30 days prior to event date, with its specific requirements. ​ You can rest easy knowing we have your bar covered! ​ Need a COI from us for your event?  Please message us the details Get in touch so we can start working together. First Name Last Name Email Message Send Thanks for submitting! bottom of page",
      "hash": "0b11d857ee0b",
      "downloadedAt": "2026-01-19T02:16:56.609Z",
      "trimmedAt": "2026-01-19T02:25:59.684Z",
      "sizeReduction": "99.8%"
    },
    {
      "url": "https://www.dragonflycocktails.com/category/all-products",
      "text": "[Page Title: All Products | Dragonfly Cocktails]\n\ntop of page Browse by All Products All inclusive Bar Services Bar Menus & Signature Cocktails Bars & Barrels Bartending Services Cocktail Gifts & Favors Hangover Kits Merch Pick me up Shots Simples & Salts Skin Care \nFilter by\nProduct type \nHangover Kits\n\nSkin Care\n\nCocktail Gifts & Favors\n\nPick me up Shots\n\nAll inclusive Bar Services\n\nBar Menus & Signature Cocktails\n\nBars & Barrels\n\nMerch\n\nSimples & Salts\nPrice $0 $20 \nAll Products\n\n12 products\nSort by: \nRecommended\n\nBars & Barrels\nPrice $0.00 \nBar Services\nPrice $0.00 \nFor the body & hair\nPrice $20.00 \nBar Menus & Signature Cocktail Menus\nPrice $10.00 \nDragonfly Stickers\nPrice $1.00 \nCocktail or Mocktail Simples\nPrice $10.00 \nDried Flavored Spices & Sugars\nPrice $8.00 \nSpecial \"Me\" Window Box Cocktail Favor\nPrice $7.50 \nPocket Cocktail Favors\nPrice $5.00 \nMason Jar Cocktails\nPrice $15.00 \nImmunity Pick-Me Up Shots\nPrice $5.00 \nHang Over Kits\nPrice $15.00 bottom of page",
      "hash": "27b20d63e717",
      "downloadedAt": "2026-01-19T02:16:53.217Z",
      "trimmedAt": "2026-01-19T02:25:59.807Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "https://www.dragonflycocktails.com/articles-stories",
      "text": "[Page Title: OUR STORY & MORE | Dragonfly Cocktails]\n\ntop of page bottom of page",
      "hash": "4afad667ca09",
      "downloadedAt": "2026-01-19T02:16:55.477Z",
      "trimmedAt": "2026-01-19T02:25:59.834Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "https://www.dragonflycocktails.com/general-9",
      "text": "[Page Title: BOOK A COCKTAIL MAKING PARTY | Dragonfly Cocktails]\n\ntop of page Lets Book a Cocktail Making Party!! All Cocktail Parties are approximately 2 hours long, We supply all the Tips Certified Bartender/instructor, all the materials needed to make 4 different cocktails & parting recipes & gifts There is an Initial Set-up/Booking fee of $600 & then a per person fee per the count of people at your party.  Fees per person depends on the number in a party. Parties need to be at least 10 people or more Group Discounts are available on quantities above 10 people Please fill out Cocktail Class Form or call 843-290-2698 First name * Last name * Email * Phone * Multi-line address Country/Region * Address * City * Zip / Postal code * Day you are wanting to book? * Are you an individual booking for a group or are you a Company booking a team building? Please indicated your role and what type of event it is you are booking * \nWhat type of Cocktail Class are you wanting to book?\n\nCocktail Making Party\n\nTIPS Certification\n\nBartender & Bar Ediquitte\n\nOther\nHow Many People are you expecting? * \nTime you wanting event to start?: Please know most parties/classes are an average of 2 hours long and set up is usually an hour before start time\n* \nTime\n: Hours Minutes AM \nWhere will event take place?\n\nVenue\n\nPlace of Business\n\nVacation Rental Home\n\nPersonall Home\n\nRestaurant\n\nPark\n\nOther\nAddress where event will take place (please share venue and full address to location) * Are there any special requests? Any Allergies we need to know about? Anything you would like us to know about this event? \nOnce we receive this submittal form, a Bar Planner will be in contact with you to book a quick chat over the phone, to discuss details and any questions we or you many have, do you understand this?\n* \nYes, I understand\nSubmit bottom of page",
      "hash": "93b90e2952b3",
      "downloadedAt": "2026-01-19T02:16:54.923Z",
      "trimmedAt": "2026-01-19T02:25:59.941Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "https://www.dragonflycocktails.com/services-5",
      "text": "[Page Title: BARS & BARRELS | Dragonfly Cocktails]\n\ntop of page BARS & BARRELS AVAILIABLE TO RENT At Dragonfly Cocktails, we are a Bartending Service Business dedicated to offering exceptional Bartending Services tailored to your unique event needs. While our primary focus is on delivering outstanding service, we are growing our business every day to offer more options and flexibility. For now, we are pleased to provide our exclusive Bars & Barrels available to rent with any of our Bartending Services, or alone. Elevate your next event with our professional expertise in Event Bar Planning & Bartending Services and let us bring memorable cocktails and experiences to you! \nLinen Bar\nComes in Black Linen (recommended)  or  White Linen as well (there is an up charge for the dry-cleaning for White Linen) ​ Can come in sizes: 6ft 8ft 12 ft 16ft ​ ​ Can come stand alone \"I\" shape or \"L\" Shaped or \"U\" Shaped \nWheel Barrel Bar or Table\nRustic \"Jack Daniels\" Wheel Barrels can add a unique rustic look to your bar. ​ Used as: Bar Ends to the Linen Bars Stand alone Table (like shown in picture) 6ft recommended As Cocktail Tables with no top or Glass Top on them ​ Get a Free Quote First name * Last name * Email * Phone * Multi-line address Country/Region * Address * City * Zip / Postal code * \nI would like to get more information on:\n* \nLinen Bar\n\nWheel Barrel\n\nOther\nAny questions or details you would like to share?: * Submit bottom of page",
      "hash": "acfea9a09426",
      "downloadedAt": "2026-01-19T02:16:54.362Z",
      "trimmedAt": "2026-01-19T02:26:00.025Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "https://www.dragonflycocktails.com/photo-album",
      "text": "[Page Title: PHOTO ALBUM | Dragonfly Cocktails]\n\ntop of page Our Collection bottom of page",
      "hash": "cf38f841d8d0",
      "downloadedAt": "2026-01-19T02:16:52.601Z",
      "trimmedAt": "2026-01-19T02:26:00.051Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "https://www.dragonflycocktails.com/",
      "text": "[Page Title: Dragonfly Cocktails & Spirits | Bartending services]\n\ntop of page Your Bar is not just a bar to us, it's a chance to tell a story, coupled with experience and knowledgeable bartenders, and bar planners who think of everything,  we believe it does matter who is behind your bar.!  Book us today! Welcome ABOUT Our Story , is a woman owned company.  Owner Carrie Eddings-Foster saw a need to create bars that were classy, memorable and backed with experience,  so s Dragonfly Cocktails & Spirits he took her 10+ years experience in the Bartending industry and the Event Planning Industry to create Dragonfly Cocktails and Spirits. At Dragonfly our mission and belief is \"The Bar\" is the experience!  It's a place to tell a story, a place everyone gathers, a place were everyone deserves extraordinary cocktails and service. This means expertly crafted cocktails, professional & experienced staff, stunning décor, impeccable customer service, promptness and a seamless sales process to make your your planning and event unforgettable, and seem effortless. ​W hether it’s a corporate event, private party, or a wedding, our team is dedicated to making sure each guest has a great experience and that your bar stands out above the rest!! (Tips Certified, Licensed and Insured) ​ It does matter whose behind your bar! Our Services Flyer Know your bars options Cocktail Making Parties Party Favors & Flavors Bar Preliminary Pricing Cheat Sheet Getting Married? Here is a Bar Check List Shopping for 100 -(If you the Client is providing the product) Legal Terms & Contract Tips Certified, Licensed & Insured Thank yall so much. Yall were fantastic. Thanks, Lauren O' \nDragonfly is a name that holds a special meaning. It is a tribute to a hardworking and kind-hearted woman who always had a soft spot for those in need. Dragonflies are believed to be spiritual creatures that bring good luck, and seeing one is a sign that someone is looking after you. With this name, we honor the legacy of a woman who touched the lives of many and left a lasting impact on our hearts.\nOur Services My staff in the evening said y’all were amazing! ~ Hart Meadows Ranch, Andrea bottom of page",
      "hash": "d2357ff8ebe5",
      "downloadedAt": "2026-01-19T02:16:51.998Z",
      "trimmedAt": "2026-01-19T02:26:00.108Z",
      "sizeReduction": "99.8%"
    },
    {
      "url": "https://www.dragonflycocktails.com/tip-your-bartenders",
      "text": "[Page Title: TIP YOUR BARTENDERS | Dragonfly Cocktails]\n\ntop of page bottom of page",
      "hash": "da930f4c0c68",
      "downloadedAt": "2026-01-19T02:16:56.038Z",
      "trimmedAt": "2026-01-19T02:26:00.133Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "https://www.dragonflycocktails.com/book-online",
      "text": "[Page Title: SERVICES | Dragonfly Cocktails]\n\ntop of page \nWHAT WE DO\nNothing to book right now. Check back soon. bottom of page",
      "hash": "e0bb5812bd71",
      "downloadedAt": "2026-01-19T02:16:57.195Z",
      "trimmedAt": "2026-01-19T02:26:00.165Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "https://www.dragonflycocktails.com/get-a-price-quote",
      "text": "[Page Title: GET A SERVICES QUOTE | Dragonfly Cocktails]\n\ntop of page First Name Last name Phone * Email * Multi-line address Country/Region * Address * City * Zip / Postal code * If getting Married, what is your Partner's name? If you are a Planner please add your full name, company name and address here. \nType of Event\n* Date of Event * \nStart Time of Event/Bar\n* \nTime\n: Hours Minutes AM \nEnd Time of Event\n* \nTime\n: Hours Minutes AM Venue Location & Address * How many People are you planning on attending? * \nWhat would you say the average age group (Demographic) will be attending (it is our experience different age ranges drink more or less than others) this is just for our reference to plan appropriately.\n* \nAges 21-31\n\nAges 31-41\n\nAges 41-51\n\nAges 60+\n\nChildren/ Underage will be present 0-20\n\nOther\n\nWho will be providing the alcohol?\n* \nWe want Dragonfly to provide the alcohol\n\nWe (the client) will be providing the alcohol\n\nBar Services\n* \nBeer & Wine Bar (Beer & Wine w/ Mixers)\n\nBackyard Bar(Beer, Wine, and Hard Seltzer w/Mixers )\n\nBasic Full Bar (Liquor w/ Mixers, Bar Juices & Garnishes)\n\nClassic Cocktail Premium Bar (Liquor w/ Mixers, Bar Juices, Garnishes and Cocktail Extras for more complex cocktails)\n\nI would like to see about scheduling a Specialty Bar (like a Sunrise Bar, a Ladies/Bridesmaid or Gentlemen's Bar, a Martini bar or Margarita bar)\n\nBartender Service Only with Bar Materials\n\nScheduling a Private Cocktail Making Party\n\nOther\n\nADD ON Services Requested\n\nSignature Cocktails ADD ON (Batched)\n\nChampagne Service & or Cocktail Server Service\n\nMixers and Garnishes ADD ON (great if client is providing alcohol and wants us to provide Mixers and garnishes)\n\nHydration Station ADD ON (water, Lemon infused water & Cucumber Mint water)\n\nLemonade, Swt Tea & Un Swt Tea ADD ON\n\nCoffee behind the bar ADD ON\n\nOther\n\nAdditional Services\n\nIce & Coolers ADD ON\n\nTrash Cans & Liners for bar only \n(Please note: we do not haul trash off site,)\n\nChampagne Toast Services\n(If you are planning on doing a champagne toast, wall or tower)\n\nTable Services\n(Servers to provide water, wine service and drink clean up at tables )\n\nDrink Cart Services \nRolling / Moving Cart with signature cocktails serviced by a Tips Certified Bartender, straight from cart.\n\nHappy Hour Cart (great for Team building) for business or any work team or friend situation\n\nHappy Hour Bouquets (Deliver a little fun to a friend or office)\n\nParty Favors (great for guests to be placed at bar, as welcome gifts or for goodie bags bachelors, balconettes)\n\nOther\nPlease list any specific requests, signature cocktails or specialty bars you would like to see added to your services If getting married, what time is your ceremony? How many Bars will you be wanting at your event? * \nPlease tell us about your bar\n* \nThere is a bar at the venue\n\nRenting a bar from an outside vendor\n\nWould like to rent a bar from Dragonfly\n\nBars you can rent from Dragonfly\n\nPlease provide simple WHITE LINEN BAR ( Build-a-Bar on location with bar table, bar riser, bar back table, and white linen) Comes in 4 ft, 6ft, or 12ft\n\nPlease provide simple BLACK LINEN BAR Build-a-Bar on location with bar table, bar riser, bar back table, and black linen) Comes in 4 ft, 6ft, or 12ft\n\nI would like the option of having a Flower Bar.\n\nI am interested in renting Jack Daniels Whiskey barrels, (2) to enhance the bar, or for cocktail tables by the bar\n\nRenting Whiskey Barrels\n\nI would like one on each end of the bar\n\nI would like to use them as Cocktail Tables\n\nOther\n\nIf renting a Linen bar from Dragonfly please indicate these below your options\n\nI would like a 4ft bar (small bar, 1 bartender size)\n\nI would like at 6 ft bar (standard 2 bartender bar)\n\nI would like at 12 ft bar (larger bar 4 bartenders)\n\nI would like a U-Shape bar\n\nI would like a L-Shape bar\n\nOther\n\nGlassware\n* \nI will be renting glassware from an outside Vendor\n\nI will need to rent glassware from Dragonfly\n\nDisposable is great with me\nAny Specialty Services you would like to add? Please list any questions you many have here: Do you have a budget for your bar? If so please share the number you are working to say within. * Are you active or retired military, police officer, fireman or currently working in F&B? If so, please list out: How did you hear about us? * Thank you for taking the time to fill out, as each question helps us build a more customized quote for you! If we have missed anything you want to have a part of your event please list it here. \nOnce we receive this submittal, we will look over all the information you provided then we will have a bar planner contact you for a quick chat over the phone to confirm details to get the quote started.\n\nYes, I understand and am excited to speak with someone to start the process\nSubmit bottom of page",
      "hash": "e22477ff93d0",
      "downloadedAt": "2026-01-19T02:16:53.793Z",
      "trimmedAt": "2026-01-19T02:26:00.331Z",
      "sizeReduction": "99.7%"
    }
  ],
  "sizeReduction": "99.9%"
}