{
  "venueId": "ChIJ7-ktN_tw_ogRrhsYKp-XzI4",
  "venueName": "Water's Edge",
  "venueArea": "Mount Pleasant",
  "website": "http://waters-edge-restaurant.com/",
  "scrapedAt": "2026-01-18T17:04:23.756Z",
  "trimmedAt": "2026-01-18T17:05:04.280Z",
  "pages": [
    {
      "url": "http://waters-edge-restaurant.com/mount-pleasant-shem-creek-water-s-edge-drink-menu",
      "text": "Our Drinks Beverage Beer Wine Cocktails",
      "hash": "0c666f658a56",
      "downloadedAt": "2026-01-18T16:58:04.903Z",
      "trimmedAt": "2026-01-18T17:05:04.196Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://waters-edge-restaurant.com/mount-pleasant-shem-creek-water-s-edge-food-menu",
      "text": "Our Menu Lunch Dinner Brunch Kid's Menu Desserts Cabana Bar Menu",
      "hash": "0efbe6265902",
      "downloadedAt": "2026-01-18T16:58:04.279Z",
      "trimmedAt": "2026-01-18T17:05:04.203Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://waters-edge-restaurant.com/mount-pleasant-shem-creek-water-s-edge-happy-hours-specials",
      "text": "Specials Sunday January 18th Sunday Brunch! 10 am - 2 pm. Full Brunch Menu. Full Lunch Menu. Brunch Buffet ($21). Featuring a Build Your Own Bloody Mary Bar! You pick your spirit of choice and We turn you loose with 15 bloody mary mixes, 20 different types of pickled vegetables, 30 different hot sauces, and more to choose from! Book Now Through The Resy App! 10:00 AM - 02:00 PM Monday January 19th Happy Hour available at Both Bars & Bar Seating Areas. Monday Through Friday 4pm til 7pm. $2.75 Domestic Beers $3.75 Well Liquors $5 Select Wines $10 Bar Bites We also have Music Trivia at our Cabana Bar starting at 5:00 pm on Monday! 04:00 PM - 07:00 PM Tuesday January 20th Happy Hour available at Both Bars & Bar Seating Areas. Monday Through Friday 4pm til 7pm. $2.75 Domestic Beers $3.75 Well Liquors $5 Select Wines $10 Bar Bites 04:00 PM - 07:00 PM Wednesday January 21st Happy Hour available at Both Bars & Bar Seating Areas. Monday Through Friday 4pm til 7pm. $2.75 Domestic Beers $3.75 Well Liquors $5 Select Wines $10 Bar Bites 04:00 PM - 07:00 PM Thursday January 22nd Prime Rib! 12-14 oz House Roasted Prime Rib, Creamy Mashed Potatoes, Sautéed Vegetables, Horseradish Cream, & Au Jus. $36 04:00 PM - 10:00 PM Almost Friday! Happy Hour available at Both Bars & Bar Seating Areas. Monday Through Friday 4pm til 7pm. $2.75 Domestic Beers $3.75 Well Liquors $5 Select Wines $10 Bar Bites 04:00 PM - 07:00 PM Friday January 23rd Happy Hour available at Both Bars & Bar Seating Areas. Monday Through Friday 4pm til 7pm. $2.75 Domestic Beers $3.75 Well Liquors $5 Select Wines $10 Bar Bites 04:00 PM - 07:00 PM Saturday January 24th $3 Mexican Beers & $5 Margaritas at The Cabana Bar 11:00 AM - 04:00 PM",
      "hash": "4a7ea90a35ca",
      "downloadedAt": "2026-01-18T16:58:05.524Z",
      "trimmedAt": "2026-01-18T17:05:04.211Z",
      "sizeReduction": "97.7%"
    },
    {
      "url": "http://waters-edge-restaurant.com/mount-pleasant-shem-creek-water-s-edge-events#",
      "text": "Events Valentine's Day Saturday February 14th Join us on Valentine's Day for the perfect romantic evening! 11:00 AM - 11:00 PM Mardi Gras Tuesday February 17th Come celebrate Mardi Gras with us. 11:00 AM - 09:30 PM National Margarita Day Sunday February 22nd Come celebrate National Margarita day with us on February 22nd. 11:00 AM - 10:00 PM St. Patrick's Day Tuesday March 17th Grab your best green garb and join us for St. Patrick's Day! 11:00 AM - 10:00 PM Easter Sunday April 5th Come celebrate Easter with us! 11:00 AM - 10:00 PM",
      "hash": "6c6b53f53d87",
      "downloadedAt": "2026-01-18T16:58:09.004Z",
      "trimmedAt": "2026-01-18T17:05:04.218Z",
      "sizeReduction": "99.3%"
    },
    {
      "url": "http://waters-edge-restaurant.com/mount-pleasant-shem-creek-water-s-edge-food-menu#",
      "text": "Our Menu Lunch Dinner Brunch Kid's Menu Desserts Cabana Bar Menu",
      "hash": "71b96b4319d7",
      "downloadedAt": "2026-01-18T16:58:08.372Z",
      "trimmedAt": "2026-01-18T17:05:04.233Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://waters-edge-restaurant.com/",
      "text": "1407 Shrimpboat Lane, Mount Pleasant, SC 29464 map marker pin View 1407 Shrimpboat Lane, Mount Pleasant, SC 29464 on Google maps - opens in a new tab WATERFRONT DINING On Historic Shem Creek Read more about us Let golden sunsets and shimmering tides guide you to the classic elegance of Water's Edge Restaurant Enjoy dining and drinks on the banks of Shem Creek, just minutes from Historic Downtown Charleston our menu slideshow start stop playing Slide 1 content Slide 2 content Slide 3 content Slide 4 content Slide 5 content Slide 6 content Slide 7 content Slide 8 content Waterfront dining On Historic Shem Creek our drinks Treat yourself drinks our menu Good food done right Menu events live music all events Group Reservations and Parties Book your next party with us! Whatever the occasion, our tailored service will bring your vision to life. Book now a private party Make some memories Join us today Click the button below to make a reservation! Book your Water’s Edge reservation on Resy Water's Edge Water's Edge Water's Edge Water's Edge A smoothy drink and limes in the sunlight People outside at the docks Water's Edge Water's Edge Water's Edge Water's Edge Water's Edge Water's Edge Water's Edge Water's Edge People clinking glasses in a toast Water's Edge A set table Prime rib steak People posing for a photo outside Drink cans and a Pelican bird outside Glasses clinking Various served dishes Paella A served meal People sitting at the patio A person in the sunlight Water's Edge Water's Edge Water's Edge Water's Edge Water's Edge Water's Edge Water's Edge Water's Edge Water's Edge Water's Edge Water's Edge Water's Edge Water's Edge Water's Edge Water's Edge Water's Edge Water's Edge Water's Edge Water's Edge Water's Edge Separate special part for dinner Water's Edge A person holding a drink Reviews Stop reviews carousel Play reviews carousel Review by - Yelp Charlene F: five star review by The restaurant has a comfortable feel and it faces the water. The water is a beautiful view. The waitress was great and knowledgeable of the menu. The pork dish featured tender and flavorful pork, paired harmoniously with creamy mashed potatoes and vibrant broccolini... Review by - Yelp Lynne H: five star review by Beautiful location, great service and fabulous menu. Had lunch with a large party on a Saturday afternoon. Lots of reasonably priced lunch choices and fun specialty cocktails. Outside bar on lower level was fun too. Can't wait to visit again. Review by - Yelp Sydney B: five star review by Monday Madness was made that much easier by the amazing Baked Crab and Spinach Dip, calamari and strong margaritas at Water Edge. Did I mention the great views of the water? Bergerknowsbest will be returning for another post work day... Review by - Yelp Cynthia R: five star review by I have never had a whole fried dish before but decided to venture out my norm. So glad I did, this fried whole flounder dish did not disappoint. So flavorful, so most, just ridiculously good. The service was excellent too, as well as the decor... Review by - Yelp LaVonne L: five star review by Fantastic place! Sat on the water watching the boats and tiki boats go by while enjoying a Crab Cake Eggs Benedict! One of the best I've ever had with the Chef's handmade lime Hollinday sauce wowza! The chef himself brought me the plate and explained the sauce and the benedict... Newsletter Location 1407 Shrimpboat Lane Mount Pleasant, SC 29464 Hours Monday - Thursday 11:00 am - 9:00 pm Friday - Saturday 11:00 am - 10:00 pm Sunday 10:00 am - 9:00 pm Sunday Brunch Buffet 10:00 am - 2:00 pm Find us on... Facebook page Instagram page Yelp page Contact us (843)-884-4074 Call us at events.watersedge1407@gmail.com Write us at Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "955fed86110f",
      "downloadedAt": "2026-01-18T16:58:04.188Z",
      "trimmedAt": "2026-01-18T17:05:04.268Z",
      "sizeReduction": "97.6%"
    },
    {
      "url": "http://waters-edge-restaurant.com/mount-pleasant-shem-creek-water-s-edge-drink-menu#",
      "text": "Our Drinks Beverage Beer Wine Cocktails",
      "hash": "d036070ddd73",
      "downloadedAt": "2026-01-18T16:58:07.728Z",
      "trimmedAt": "2026-01-18T17:05:04.273Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://waters-edge-restaurant.com/mount-pleasant-shem-creek-water-s-edge-events",
      "text": "Events Valentine's Day Saturday February 14th Join us on Valentine's Day for the perfect romantic evening! 11:00 AM - 11:00 PM Mardi Gras Tuesday February 17th Come celebrate Mardi Gras with us. 11:00 AM - 09:30 PM National Margarita Day Sunday February 22nd Come celebrate National Margarita day with us on February 22nd. 11:00 AM - 10:00 PM St. Patrick's Day Tuesday March 17th Grab your best green garb and join us for St. Patrick's Day! 11:00 AM - 10:00 PM Easter Sunday April 5th Come celebrate Easter with us! 11:00 AM - 10:00 PM",
      "hash": "da74b7eddea2",
      "downloadedAt": "2026-01-18T16:58:06.154Z",
      "trimmedAt": "2026-01-18T17:05:04.280Z",
      "sizeReduction": "99.3%"
    }
  ],
  "sizeReduction": "99.2%"
}