{
  "venueId": "ChIJNR8eak17_ogRet3-eYxx7_4",
  "venueName": "Haberdash",
  "venueArea": "Downtown Charleston",
  "website": "https://www.haberdashcharleston.com/",
  "scrapedAt": "2026-01-19T02:19:33.297Z",
  "trimmedAt": "2026-01-19T02:22:11.152Z",
  "pages": [
    {
      "url": "https://www.haberdashcharleston.com/non-wedding-events",
      "text": "[Page Title: Special Events | Haberdash Speakeasy | Charleston, SC]\n\ntop of page HABERDASH EVENTS \nHaberdash is the place to be for all events! Our 1500 sq.ft building is in the heart of downtown Charleston and filled with flat screen TVs, pool table, shuffle board, foosball, air hockey, & more. Our special event packages are customizable and can include your choice of Gourmet Catering, Bourbon Bar, Bloody Mary Bar, Cigar Bar, & Decorations for your event. We are happy to customize your experience to meet the needs of your event and guests.\nRehearsal Dinners Wedding Receptions Corporate Events Birthday Parties Poker Nights Sporting Events Family Functions Bachelor/Bachelorette Parties Holiday Gatherings \nHaberdash offers a changing room & shower which makes it the perfect place to pregame and then get ready for your night out in downtown Charleston.\nInquire About Rates & Availability bottom of page",
      "hash": "2172a02eea5d",
      "downloadedAt": "2026-01-19T02:08:46.259Z",
      "trimmedAt": "2026-01-19T02:22:11.051Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "https://www.haberdashcharleston.com/corporate-events",
      "text": "[Page Title: Corporate Event Venue | Haberdash Speakeasy | Charleston, SC]\n\ntop of page CORPORATE EVENTS \nThere is no better place to bring your staff for a night of fun, laughs, and team building. Located in the heart of downtown on Market Street, we have the perfect location to let your staff experience what Charleston is all about. Our team will make your staff feel comfortable, relaxed, and catered to during their time at Haberdash. At Haberdash, our goal is to provide you with a memorable corporate event that is neither overly complicated or expensive. Let our owner, Kacie, do the planning for you! We guarantee your staff will be talking about Haberdash for years to come and you will quickly become the best boss they’ve ever had!\nWhat's Included \nYour Corporate event rental will include billiards, darts, air hockey, shuffle board, foosball, xBox One, Buck Hunter, Golden Tee 2020, a poker table, 3 Flat Screen TVs, Bose speaker system with bluetooth hookup, a catering package, a drink package, optional cigar bar & bourbon bar, outdoor courtyard, corn hole, & two staff members to serve you.\nWhat Is The Cost? We have two package options:​​ \n$300 rental fee + $100/person: Includes catering, beer, wine, & non-alcoholic offerings\n#1) ​ \n$300 rental fee + $125/person: Includes catering, beer, wine, Vodka, Bourbon, mixers & non-alcoholic offerings\n#2) \nEach rental is 3 hours. Please inquire for pricing if you would like to book additional time.\nHow Large is Haberdash? \nHaberdash is 1500sq. ft and can comfortably accommodate up to 50 guests. We have a large main area that hosts all of the games, a kitchen, state of the art bathroom with a shower, a quieter back room with another flat-screen TV, and an outdoor courtyard where you can enjoy corn hole and cigars.\nInquire About Rates & Availability bottom of page",
      "hash": "d8f00b6f6861",
      "downloadedAt": "2026-01-19T02:08:47.153Z",
      "trimmedAt": "2026-01-19T02:22:11.107Z",
      "sizeReduction": "99.8%"
    },
    {
      "url": "https://www.haberdashcharleston.com/",
      "text": "[Page Title: Haberdash Event Venue & Groom's Lounge | Charleston, SC]\n\ntop of page WELCOME TO CHARLESTON’S ONLY EXCLUSIVE SPEAK EASY, HABERDASH! Haberdash is a speak easy themed event lounge located in the heart of downtown Charleston! Haberdash was created to host grooms and their groomsmen on the wedding day, however, it is also the perfect space for an event of any type! Haberdash is filled with flat screen TVs, game systems, billiards, shuffleboard, air hockey, foosball, a poker table & more. Your group will enjoy gourmet catering with the option to include a Bloody Mary Bar, Bourbon Bar, & Cigar Bar. ​ Haberdash has large dressing rooms, full bathrooms with showers, and luxury Jack Black toiletries. The Haberdash staff is happy to offer steaming services for the suits and getting ready photos. The Haberdash rental includes use of the space for 3 hours with two staff members. Transportation for the group from Haberdash to the wedding venue or next destination is available upon request and based upon availability. ​ Your groom, groomsmen, or event guests will be talking about their experience at Haberdash for years to come. Inquire About Rates & Availability bottom of page",
      "hash": "ffe261574a8a",
      "downloadedAt": "2026-01-19T02:08:46.058Z",
      "trimmedAt": "2026-01-19T02:22:11.152Z",
      "sizeReduction": "99.9%"
    }
  ],
  "sizeReduction": "99.9%"
}