{
  "venueId": "ChIJC4n-xyN7_ogRFpS2Bz2a7Wg",
  "venueName": "Little Palm",
  "venueArea": "Downtown Charleston",
  "website": "https://www.littlepalmchs.com/?utm_source=google-gbp&utm_medium=organic&utm_campaign=gbp",
  "scrapedAt": "2026-01-18T17:04:24.191Z",
  "trimmedAt": "2026-01-18T17:05:10.191Z",
  "pages": [
    {
      "url": "https://www.littlepalmchs.com/menu",
      "text": "Main content starts here, tab to start navigating Menu Slide 1 of 5 Slide 2 of 5 Slide 3 of 5 Slide 4 of 5 Slide 5 of 5 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Restaurant Week Cocktails Breakfast Brunch Lunch Dinner Beer & Wine January 8-18, 2026 Dinner $55/person, choice of one of each To Start Chicken Tortilla Soup Avocado, Roasted Chicken, Oaxaca Cheese, Tortilla Strips Warm Sweet Potato & Winter Kale Salad Roasted Sweet Potato, Shaved Kale, Toasted Cashews, Crispy Shallots, Maple Tamarind Vinaigrette vegan Charred Carrot & Avocado Salad Farm Carrots, Arugula, Watercress, Avocado, Toasted Coconut, Pepitas, Carrot-Ginger Dressing Endive Salad Roasted Beets, Winter Citrus, Toasted Almonds, Goat Cheese & Balsamic Vinaigrette gluten free, vegetarian Entrees Fresh Catch Butternut Squash, Lacinato Kale, Holy City Hogs Pork & Black-Eyed Peas *Seared Lump Crabcake Lump Crab, Celery Root, Snow Peas & Apple *lp Double Cheeseburger American Cheese, Garlic Aioli, Caramelized Onion, Lettuce, Pickle & Yucca Fries Dessert Warm Sticky Toffee Pudding Grilled Starfruit, Chantilly Hot Chocolate Tres Leches Spiced Chocolate Ganache, Swiss Merengue, Cocoa Pebbles Lunch $35/person, choice of one of each To Start Chicken Tortilla Soup Avocado, Roasted Chicken, Oaxaca Cheese, Tortilla Strips Warm Sweet Potato & Winter Kale Salad Roasted Sweet Potato, Shaved Kale, Toasted Cashews, Crispy Shallots, Maple Tamarind Vinaigrette vegan Charred Carrot & Avocado Salad Farm Carrots, Arugula, Watercress, Avocado, Toasted Coconut, Pepitas, Carrot-Ginger Dressing Endive Salad Roasted Beets, Winter Citrus, Toasted Almonds, Goat Cheese & Balsamic Vinaigrette gluten free, vegetarian Entrees Ahi Tuna Sandwich Guacamole, Little Palm Slaw, Brioche Bun, Yucca Fries Poke Bowl *Tuna, Jasmine Rice, Roasted Corn, Edamame, Green Onion, Avocado, Cilantro, Sub Protein: Tofu, Shrimp, Grilled Chicken dairy free *lp Double Cheeseburger American Cheese, Garlic Aioli, Caramelized Onion, Lettuce, Pickle & Yucca Fries Cuban Sandwich Holy City Hogs Pork Shoulder, Brown Sugar Smoked Ham, Swiss Cheese, Dijon, Pickles, Cuban Bread & Yucca Fries *Consuming raw or undercooked meats, poultry, seafood, shellfish or eggs may increase your risk of foodborne illness. Cocktails Nitro Espresso Martini Absolut, Kahlua, Espresso 16 $ Jinglebird in Paradise Derrumbes Mezcal, Apricot, Cinnamon Infused Aperol, Lemon, Seltzer 16 $ Applechai of My Eye Chai Infused Ketel One, Cointreau, Apple, Cranberry, Lime 16 $ Saint Nick Beefeater Gin, Blood Orange, Grapefruit, Lemon, Cinnamon, Mumm Napa Brut Sparkling 16 $ The Ginger Did It New Amsterdam Vodka, Cranberry, Orange, Cinnamon, Lime, Ginger Beer 16 $ Slayin’ (Frozen) Casamigos Reposado, Kahlua Dunkin Salted Caramel, Espresso 16 $ Zero Proof High Society High Rise THC Citrus Spirit, Blood Orange, Citrus, Seltzer 13 $ The Nice List Seedlip Notas De Agave, Cranberry, Orange, Cinnamon, Lime, Ginger Beer 13 $ On Tap Venetian Spritz Sera Luce, Veneto, Italy 9% 13 $ Sangria Le Sueca, Catalonia, Spain 14 $ Canned Beers/Seltzers Res. Culture ‘Island Time’ 16oz Mexican Lager, Charlotte, NC - 4.5% 11 $ HHBC Tropical Lager Lager, Hilton Head, SC - 4.5% 8 $ Edmunds Oast, ‘Arcade’ Pale Ale, Charleston, SC - 4.7% 8 $ Fattys ‘Lazy Hazy’ Hazy IPA, Charleston, SC - 8% 8 $ Potter’s Grapefruit Hibiscus Cider, Charlottesville, VA - 4.2% 8 $ Holy City ‘Washout Wheat’ Hefeweizen, Charleston, SC - 5.3% 8 $ High Noon Hard Seltzers Variety - 4.5% 10 $ Sunboy Spiked Coconut Water Pineapple, Passion Fruit or Coconut - 5% 10 $ Surfside Vodka + Iced Tea, Lemonade or Half/Half - 4.5% 10 $ Athletic ‘Upside Dawn’ Non Alcoholic - Wheat Ale, CT < 0.5% Abv 7 $ Beach Break Thc Seltzer Watermelon 7 $ High Rise D9 Seltzers Rotating Flavors 8 $ Wine Sparkling Cava Catalonia, SP | Freixenet Cordón Brut 15 $ 60 $ Brut Rosé Burgundy, FR | Cave de Bissey 16 $ 64 $ Champagne Champagne, FR | G.H. Mumm Grand Cordon Brut 25 $ 100 $ White Albariño Rias Baixas, SP | A Veira Do Mar 13 $ 52 $ Sauvignon Blanc Marlborough, NZ | Black Cottage 14 $ 56 $ Chardonnay Mendocino, CA | Poco a Poco 16 $ 64 $ Rosé & Orange Rosé Côtes de Provence, FR | Sainte Marguerite ‘Symphonie’ 14 $ 56 $ Pinot Grigio Ramato (Orange) Friuli, IT | Conte Brandolini 17 $ 68 $ Red Pinot Noir Central Valley, CL | El Viejo Del Valle 13 $ 52 $ Tempranillo Rioja, SP | Gomez Cruzado ‘Crianza’ 15 $ 60 $ Malbec Valle Calchaquí, AR | Colomé ‘Estate’ 16 $ 64 $ Monday–Saturday: 8:00 AM – 11:00 AM Drinks Coffee Coffee by Foresight 4 $ Tea 5 $ Orange 5 $ Grapefruit 5 $ Specialty Coffee Hand Crafted Coffee Beverages from The Coffee Counter Available after 10 AM Cocktails Mimosa Orange Juice, Bubbles 14 $ Bloody Mary Vodka, Charleston Bloody Mary Mix 16 $ Plates 2 Eggs Any Style* 2 Storey Farm Eggs Any Style, Sausage or Bacon & Side of Potatoes 19 $ Sausage Egg Burrito Storey Farm Eggs, Cheese, Crispy Potatoes, Sausage, Tomato, Side of Ranchero Sauce 19 $ Tres Leches French Toast Fresh Brioche, Seasonal Fruit, Whip Cream 17 $ *Shrimp & Crab Omelette 3 Storey Farms Eggs, Lump Crab meat, Shrimp, Avocado, Crema & Ranchero sauce 24 $ Avocado Toast* Grilled Ciabatta Bread, Oaxaca Cheese Crust, Avocado, Lemon, Onion, Cilantro, Arugula, Red Radish, Poached Egg & Extra Virgin Olive Oil 19 $ Add Extra Egg + 3 $ Chicken & Waffles Belgian-Style Waffle, Fried Chicken, Hot Honey Butter 18 $ Overnight Oats Coconut Milk, Local Honey, Pistachio Granola & Dried Blueberries 14 $ Sides Fresh Baked Pastries 7 $ Storey Farm Maple Sausage 8 $ Smoked Bacon 7 $ Crispy Potatoes 7 $ Fruit 7 $ Please note, a 20% gratuity will automatically be added to groups of 6 or more and tabs left open. We continue to support the growth of the culinary community by including a 2.5% service charge for our hardworking kitchen team. A 2.5% CCR fee for all payments made with a credit card. Thank you for your support. *Consuming raw or undercooked meats, poultry, seafood, shellfish or eggs may increase your risk of foodborne illness, especially if you have certain medical conditions. Sunday: 8:00 AM – 4:00 PM Available Sundays 8 AM- 4 PM Brunch 2 Eggs Any Style* 2 storey farms eggs any style, sausage or bacon on a side of potatoes 20 $ Tees Leches French Toast Fresh Brioche, Seasonal Fruit, Whipped Cream 17 $ Sausage Egg Burrito* Storey Farms Eggs, Cheese, Crispy Potatoes, Sausage, Tomato + Side Of Ranchero Sauce 19 $ *Shrimp & Crab Omelette 3 Storey Farms Eggs, Lump Crab meat, Shrimp, Avocado, Crema & Ranchero sauce 24 $ Fried Tarvin Shrimp Wrap Local Tarvin Shrimp, Papaya & Chili Slaw, Umami Sauce 8 $ Avocado Toast Grilled Ciabatta Bread, Oaxaca Cheese Crust, Avocado Spread, Arugula, Red Radish, Poached Egg & Extra Virgin Olive Oil 19 $ Chicken & Waffles Belgian style waffle, fried chicken, hot honey butter 19 $ Steak & Egg* Grilled Ciabatta Bread, Oaxaca Cheese Crust, Avocado Spread, Arugula, Red Radish, Poached Egg & Extra Virgin Olive Oil 35 $ Pork Tostadas Slow Roasted Holy City Hogs Pork Shoulder, Fire-Roasted Winter Squash & Citrus 18 $ Smashed Avocado Corn Tortilla Chips 17 $ Beet & Citrus Endive Salad Goat Cheese, Winter Citrus, Toasted Almonds, Balsamic Vinaigrette 17 $ Chilled Mojo Chicken + 7 $ Poached Shrimp + 8 $ Poached Shrimp + 13 $ Warm Sweet Potato & Winter Kale Roasted Sweet Potato, Shaved Kale, Toasted Cashews, Crispy Shallots, Maple Tamarind Vinaigrette $18 Roasted Sweet Potato, Shaved Kale, Toasted Cashews, Crispy Shallots, Maple Tamarind Vinaigrette 18 $ Chilled Mojo Chicken + 7 $ Poached Shrimp + 8 $ *Ahi Tuna + 13 $ Cuban Sandwich Roasted Pork, Brown Sugar Smoked Ham, Swiss Cheese, Dijon, Pickles, Cuban Bread & Yucca Fries 20 $ LP Double Cheeseburger* Two Patties, American Cheese, Garlic Aioli, Caramelized Onion, Lettuce, Pickles & Yucca Fries 22 $ Add Extra Egg + 3 $ Serves 3-5 Group Punch Little Saint Nick Served In A Disco Ball! Beefeater Gin, Blood Orange, Grapefruit, Lemon, Cinnamon, GH Mumm Sparkling 65 $ Call Your X-Mas Served In A Copper Flamingo! Codigo Reposado, Pomegranate, Tamarind, Lemon, Seltzer 70 $ Cocktails Nitro Espresso Martini Absolut, Kahlua, Espresso 16 $ Little Saint Nick Beefeater Gin, Blood Orange, Grapefruit, Lemon, Cinnamon, GH Mumm Sparkling 16 $ Jinglebird in Paradise Derrumbes Mezcal, Apricot, Cinnamon Infused Aperol, Lemon, Bubbles 16 $ Four Christmases Bulleit Bourbon, Mr. Black Coffee, Creme de Mure, Pandan, lime 16 $ Call Your X-Mas Codigo Reposado, Pomegranate, Tamarind, Lemon 17 $ Coquito Rumhaven, Rumchata Coconut, Coconut Milk, Warming Spices 16 $ The Ginger Did It New Amsterdam Vodka, Cranberry, Orange, Cinnamon, Lime, Ginger 16 $ Applechai of My Eye Chai Infused Ketel One Vodka, Apple, Cointreau, Cranberry, Lime 16 $ Frozen 16 Slayin' Casamigos Reposado, Kahlua Dunkin' Salted Caramel, Espresso Zero Proof 13 All the Jingle Ladies Seedlip Garden, Blood Orange, Grapefruit, Lemon, Cinnamon, Seltzer The Nice List Seedlip Notas De Agave, Cranberry, Orange, Lime, Ginger Please note, a 20% gratuity will automatically be added to groups of 6 or more and tabs left open. We continue to support the growth of the culinary community by including a 2.5% service charge for our hardworking kitchen team. A 2.5% CCR fee for all payments made with a credit card. Thank you for your support. *consuming raw or undercooked meats, poultry, seafood, shellfish or eggs may increase your risk of foodborne illness, especially if you have certain medical conditions. Monday–Saturday | 11:00 AM – 5:00 PM Favorites Smashed Avocado Corn Tortilla Chips 17 $ Mojo Wings Sour Orange, Adobo Rub 18 $ dairy free Tuna Tiradito* Yellowfin Tuna, Yellow Chili, Passion Fruit, Red Onion 18 $ dairy free, gluten free Fried Tarvin Shrimp Wrap per each Local Tarvin Shrimp, Papaya & Chili Slaw, Umami Sauce 8 $ Soups Chicken Tortilla Avocado, Roasted Chicken, Oaxaca Cheese, Tortilla Strips 18 $ Coastal Seafood Stew Fish, Clams, Shrimp & Mussels with Potato, Avocado & Coconut Milk 22 $ Shareables Pan Con Tomate Olive Oil Marinated Tomato, Grilled Bread 13 $ Manchego Cheese + 4 $ Serrano Ham or Chorizo + 5 $ vegan Chicken Croquettes Pulled Chicken, Béchamel 15 $ Crispy Street Corn Bites Grilled Corn, Cilantro Aioli, Cheese Crumble, Jalapeño 14 $ vegetarian Pork Tostadas Slow Roasted Holy City Hogs Pork Shoulder, Fire-Roasted Winter Squash & Citrus 18 $ dairy free Available Monday-Friday Lunch Combo Half Cuban Sando Roasted Pork, Brown Sugar Smoked Ham, Swiss Cheese, Dijon, Pickles, Cuban Bread, Yucca Fries 24 $ CHOICE OF: Seasonal Soup or Salad & Soft Drink or Iced Tea Greens Charred Carrot & Avocado Salad Farm Carrots, Arugula, Watercress, Avocado, Toasted Coconut, Pepitas, Carrot-Ginger Dressing 18 $ Endive Salad Roasted Beets, Winter Citrus, Toasted Almonds, Goat Cheese & Balsamic Vinaigrette 17 $ gluten free, vegetarian Warm Sweet Potato & Winter Kale Salad Roasted Sweet Potato, Shaved Kale, Toasted Cashews, Crispy Shallots, Maple Tamarind Vinaigrette 18 $ vegan Add On Chilled Mojo Chicken + 7 $ Poached Shrimp + 8 $ Ahi Tuna* + 13 $ Plates & Mains Ahi Tuna Sandwich Guacamole, Little Palm Slaw, Brioche Bun, Yucca Fries 23 $ Cuban Sandwich Holy City Hogs Pork Shoulder, Brown Sugar Smoked Ham, Swiss Cheese, Dijon, Pickles, Cuban Bread & Yucca Fries 20 $ LP Double Cheeseburger* American Cheese, Garlic Aioli, Caramelized Onion, Lettuce, Pickle & Yucca Fries 24 $ Poke Bowl* Tuna*, Jasmin Rice, Roasted Corn, Edamame, Green Onion, Avocado, Cilantro 25 $ Substitute Protein Tofu 22 $ Shrimp 24 $ Grilled Chicken 22 $ dairy free Sweets Coconut Custard Berries, Toasted Coconut 14 $ gluten free, vegan Hot Chocolate Tres Leches Spiced Chocolate Ganache, Swiss Merengue, Cocoa Pebbles 14 $ Warm Sticky Toffee Pudding Grilled Starfruit, Chantilly 14 $ *Consuming raw or undercooked meats, poultry, seafood, shellfish or eggs may increase your risk of foodborne illness, especially if you have certain medical conditions. We continue to support the growth of the culinary community by including a 2.5% service charge for our hardworking kitchen team, as well as a 2.5% charge for all payments made with credit card. Monday–Thursday | 5:00 PM – 10:00 PMFriday & Saturday | 5:00 PM – 11:00 PMSunday | 4:00 PM – 9:00 PM Favorites Smashed Avocado Corn Tortilla Chips 17 $ Mojo Wings Sour Orange, Adobo Rub 18 $ dairy free Tuna Tiradito* Yellowfin Tuna, Yellow Chili, Passion Fruit, Red Onion 18 $ dairy free, gluten free Fried Tarvin Shrimp Wrap per each Local Tarvin Shrimp, Papaya & Chili Slaw, Umami Sauce 8 $ Soups Chicken Tortilla Avocado, Roasted Chicken, Oaxaca Cheese, Tortilla Strips 18 $ Coastal Seafood Stew Fish, Clams, Shrimp & Mussels with Potato, Avocado, and Coconut Milk 22 $ Shareables Pan Con Tomate Olive Oil Marinated Tomato, Grilled Bread 13 $ Manchego Cheese + 4 $ Serrano Ham or Chorizo + 5 $ vegan Chicken Croquettes Pulled Chicken, Béchamel 15 $ Yellow Curry Clams Local Clams, Coconut Curry, Charred Corn, Chili Crisp & Grilled Bread 17 $ Pork Tostadas Slow Roasted Holy City Hogs Pork Shoulder, Fire-Roasted Winter Squash and Citrus 18 $ Crispy Street Corn Bites Grilled Corn, Cilantro Aioli, Cheese Crumble, Jalapeño 14 $ vegetarian Greens Charred Carrot & Avocado Salad Farm Carrots, Arugula, Watercress, Avocado, Toasted Coconut, Pepitas, Carrot-Ginger Dressing 18 $ Endive Salad Roasted Beets, Strawberries, Pepita Crumble, Goat Cheese & Balsamic Vinaigrette 17 $ gluten free, vegetarian Warm Sweet Potato & Winter Kale Salad Roasted Sweet Potato, Shaved Kale, Toasted Cashews, Crispy Shallots, Maple Tamarind Vinaigrette 18 $ vegan Add On Chilled Mojo Chicken + 7 $ Poached Shrimp + 8 $ Ahi Tuna* + 13 $ Plates & Mains Fresh Catch Butternut Squash, Lacinato Kale, Holy City Hogs Pork & Black-Eyed Peas 32 $ Cuban Sandwich Holy City Hogs Pork Shoulder, Brown Sugar Smoked Ham, Swiss Cheese, Dijon, Pickles, Cuban Bread & Yucca Fries 20 $ Seared Lump Crabcake* Lump Crab, Celery Root, Snow Peas, and Apple 29 $ LP Double Cheeseburger* American Cheese, Garlic Aioli, Caramelized Onion, Lettuce, Pickle & Yucca Fries 24 $ Grilled Beef Bavette* Smoked Carrot Puree, Roasted Fingerling Potatoes, Oyster Mushrooms and Chimichurri 38 $ Sweets Coconut Custard Berries, Toasted Coconut 14 $ gluten free, vegan Hot Chocolate Tres Leches Spiced Chocolate Ganache, Swiss Merengue, Cocoa Pebbles 14 $ Warm Sticky Toffee Pudding Grilled Starfruit, Chantilly 14 $ *Consuming raw or undercooked meats, poultry, seafood, shellfish or eggs may increase your risk of foodborne illness, especially if you have certain medical conditions. Beers On Tap Venetian Spritz Sera Luce, Veneto, Italy 9% 13 $ Sangria Le Sueca, Catalonia, Spain 14 $ Canned Beers/Seltzers Res. Culture ‘Island Time’ 16oz Mexican Lager, Charlotte, NC - 4.5% 11 $ Hhbc Tropical Lager Lager, Hilton Head, SC - 4.5% 8 $ Edmunds Oast, ‘Arcade’ Pale Ale, Charleston, SC - 4.7% 8 $ Fattys ‘Lazy Hazy’ Hazy IPA, Charleston, SC - 8% 8 $ Potter’s Grapefruit Hibiscus Cider, Charlottesville, VA - 4.2% 8 $ Holy City ‘Washout Wheat’ Hefeweizen, Charleston, SC - 5.3% 8 $ Sunboy Spiked Coconut Water Pineapple, Passion Fruit or Coconut - 5% 10 $ Surfside Vodka + Iced Tea, Lemonade or Half/Half - 4.5% 10 $ Athletic ‘Upside Dawn’ Non Alcoholic - Wheat Ale, Ct < 0.5% Abv 7 $ Beach Break Thc Seltzer Watermelon 7 $ High Rise D9 Seltzers Rotating Flavors 8 $ Wine Sparkling Cava Catalonia, SP | Freixenet Cordón Brut 15 $ 60 $ Brut Rosé Burgundy, FR | Cave De Bissey 16 $ 64 $ Champagne Champagne, FR | G.H. Mumm Grand Cordon Brut 25 $ 100 $ White Albariño Rias Baixas, SP | A Veira Do Mar 13 $ 52 $ Sauvignon Blanc Marlborough, NZ | Black Cottage 14 $ 56 $ Chardonnay Mendocino, CA | Poco a Poco 16 $ 64 $ Rosé & Orange Rosé Côtes de Provence, FR | Sainte Marguerite ‘Symphonie’ 14 $ 56 $ Arancino Sicily, IT | Caruso & Minini 17 $ 68 $ Red Pinot Noir Central Valley, CL | El Viejo Del Valle 13 $ 52 $ Tempranillo Rioja, SP | Gomez Cruzado ‘Crianza’ 16 $ 60 $ Malbec Valle Calchaquí, AR | Colomé ‘Estate’ 16 $ 64 $ *consuming raw or undercooked meats, poultry, seafood, shellfish or eggs may increase your risk of foodborne illness, especially if you have certain medical conditions. Non-Spirited All The Jingle Ladies Seedlip Garden, Blood Orange, Grapefruit, Cinnamon, Lemon, Seltzer 13 $ The Nice List Seedlip Notas de Agave, Cranberry, Orange, Cinnamon, lime, Ginger Beer 13 $ Reservations Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Little Palm | Bar & Swim Club in Charleston, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "1f24e876b040",
      "downloadedAt": "2026-01-18T16:54:16.898Z",
      "trimmedAt": "2026-01-18T17:05:10.061Z",
      "sizeReduction": "91.3%"
    },
    {
      "url": "https://www.littlepalmchs.com/location/little-palm/",
      "text": "Main content starts here, tab to start navigating Reserve a Table Hours & Location 237 Meeting Street, Charleston, SC 29401 (843) 414-8030 Little Palm Sunday - Thursday | 8 AM-10 PM Friday & Saturday | 8 AM-12 AM ___________________________________________ Menus BreakfastMonday–Saturday | 8:00 AM – 11:00 AM BrunchSunday | 8:00 AM – 4:00 PM LunchMonday–Saturday | 11:00 AM – 5:00 PM DinnerMonday–Thursday | 5:00 PM – 9:00 PMFriday & Saturday | 5:00 PM – 11:00 PMSunday | 4:00 PM – 9:00 PM Happy HourMonday – Thursday | 4 PM – 6 PM As a guest of Little Palm enjoy the convenience of valet parking at The Ryder for $10. For parties of up to 7 guests, reserve multiple seats on Resy. For parties of 8-19 guests, email our team at info@littlepalmbar.com For parties of 20+, please and our team will send over pricing and availability. visit us here Get Directions Find Us On Instagram @littlepalmchs Reservations Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Little Palm | Bar & Swim Club in Charleston, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "22644de54a3e",
      "downloadedAt": "2026-01-18T16:54:15.672Z",
      "trimmedAt": "2026-01-18T17:05:10.069Z",
      "sizeReduction": "94.5%"
    },
    {
      "url": "https://www.littlepalmchs.com/happenings",
      "text": "Main content starts here, tab to start navigating Happenings at Little Palm ___________________ The only thing we love more than going to a party is hosting one! Reservations Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Little Palm | Bar & Swim Club in Charleston, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "4574a37f87e4",
      "downloadedAt": "2026-01-18T16:54:17.538Z",
      "trimmedAt": "2026-01-18T17:05:10.075Z",
      "sizeReduction": "96.5%"
    },
    {
      "url": "https://www.littlepalmchs.com/location/little-palm",
      "text": "Main content starts here, tab to start navigating Reserve a Table Hours & Location 237 Meeting Street, Charleston, SC 29401 (843) 414-8030 Little Palm Sunday - Thursday | 8 AM-10 PM Friday & Saturday | 8 AM-12 AM ___________________________________________ Menus BreakfastMonday–Saturday | 8:00 AM – 11:00 AM BrunchSunday | 8:00 AM – 4:00 PM LunchMonday–Saturday | 11:00 AM – 5:00 PM DinnerMonday–Thursday | 5:00 PM – 9:00 PMFriday & Saturday | 5:00 PM – 11:00 PMSunday | 4:00 PM – 9:00 PM Happy HourMonday – Thursday | 4 PM – 6 PM As a guest of Little Palm enjoy the convenience of valet parking at The Ryder for $10. For parties of up to 7 guests, reserve multiple seats on Resy. For parties of 8-19 guests, email our team at info@littlepalmbar.com For parties of 20+, please and our team will send over pricing and availability. visit us here Get Directions Find Us On Instagram @littlepalmchs Reservations Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Little Palm | Bar & Swim Club in Charleston, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "a78d67fd2775",
      "downloadedAt": "2026-01-18T16:54:18.193Z",
      "trimmedAt": "2026-01-18T17:05:10.081Z",
      "sizeReduction": "94.5%"
    },
    {
      "url": "https://www.littlepalmchs.com/special-events/",
      "text": "Main content starts here, tab to start navigating Special Events Large Parties & Special Events Looking to host a larger gathering? We're ready to accommodate your party and its needs. Whether a corporate dinner, bachelorette party, family gathering, or a more intimate affair, host your special occasion at Little Palm. For parties of up to 7 guests, please book directly through Resy. Book your Little Palm reservation on Resy Party With Us For groups of , we offer chef-curated, tropical-inspired family-style menus priced per course. This ensures a relaxed dining experience with a customized menu tailored for your group. 8-20 guests Please note that a commitment is required to secure large party reservations. Plan Your Large Party Special Events For parties of , please contact our sales team and we will be happy to send over menus, pricing, and availability. 21 or more Note: Private and semi-private spaces are subject to availability. A contract and deposit may be required for larger events. Plan Your Special Event Chef Curated Menus Enjoy chef-curated menus perfect for any large party. Note: Custom menus require 72-hour notice. Learn More Find Us On Instagram @littlepalmchs Reservations Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Little Palm | Bar & Swim Club in Charleston, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "be248b6812fc",
      "downloadedAt": "2026-01-18T16:54:16.206Z",
      "trimmedAt": "2026-01-18T17:05:10.087Z",
      "sizeReduction": "94.4%"
    },
    {
      "url": "https://www.littlepalmchs.com/?utm_source=google-gbp&utm_medium=organic&utm_campaign=gbp",
      "text": "Home Main content starts here, tab to start navigating Slide 1 of 6 Slide 2 of 6 Slide 3 of 6 Slide 4 of 6 Slide 5 of 6 Slide 6 of 6 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Little Palm in Charleston, SC A breezy tropical retreat in the heart of Charleston, bringing the vibrant coastal spirit to every moment—from brunch to nightfall. Indulge in our tropically inspired menu, created for sharing, and savor the flavors of the coast across Little Palm’s layered spaces – be it poolside, a vibey restaurant & bar, or lush open-air Backyard. Whether planning a special event or a casual gathering, Little Palm invites you to relax, unwind, and immerse yourself in the warmth of connection. At Little Palm, we craft experiences that go beyond the ordinary. So come for the tropical vibes, stay for the moments that linger. A coastal experience View Menu The only thing we love more than going to a party is hosting one. View Happenings Visit Us /happenings Visit Find Us On Instagram @littlepalmchs Reservations Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Little Palm | Bar & Swim Club in Charleston, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "c50955d2a42c",
      "downloadedAt": "2026-01-18T16:54:14.577Z",
      "trimmedAt": "2026-01-18T17:05:10.094Z",
      "sizeReduction": "95.1%"
    },
    {
      "url": "https://www.littlepalmchs.com/menu/",
      "text": "Main content starts here, tab to start navigating Menu Slide 1 of 5 Slide 2 of 5 Slide 3 of 5 Slide 4 of 5 Slide 5 of 5 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Restaurant Week Cocktails Breakfast Brunch Lunch Dinner Beer & Wine January 8-18, 2026 Dinner $55/person, choice of one of each To Start Chicken Tortilla Soup Avocado, Roasted Chicken, Oaxaca Cheese, Tortilla Strips Warm Sweet Potato & Winter Kale Salad Roasted Sweet Potato, Shaved Kale, Toasted Cashews, Crispy Shallots, Maple Tamarind Vinaigrette vegan Charred Carrot & Avocado Salad Farm Carrots, Arugula, Watercress, Avocado, Toasted Coconut, Pepitas, Carrot-Ginger Dressing Endive Salad Roasted Beets, Winter Citrus, Toasted Almonds, Goat Cheese & Balsamic Vinaigrette gluten free, vegetarian Entrees Fresh Catch Butternut Squash, Lacinato Kale, Holy City Hogs Pork & Black-Eyed Peas *Seared Lump Crabcake Lump Crab, Celery Root, Snow Peas & Apple *lp Double Cheeseburger American Cheese, Garlic Aioli, Caramelized Onion, Lettuce, Pickle & Yucca Fries Dessert Warm Sticky Toffee Pudding Grilled Starfruit, Chantilly Hot Chocolate Tres Leches Spiced Chocolate Ganache, Swiss Merengue, Cocoa Pebbles Lunch $35/person, choice of one of each To Start Chicken Tortilla Soup Avocado, Roasted Chicken, Oaxaca Cheese, Tortilla Strips Warm Sweet Potato & Winter Kale Salad Roasted Sweet Potato, Shaved Kale, Toasted Cashews, Crispy Shallots, Maple Tamarind Vinaigrette vegan Charred Carrot & Avocado Salad Farm Carrots, Arugula, Watercress, Avocado, Toasted Coconut, Pepitas, Carrot-Ginger Dressing Endive Salad Roasted Beets, Winter Citrus, Toasted Almonds, Goat Cheese & Balsamic Vinaigrette gluten free, vegetarian Entrees Ahi Tuna Sandwich Guacamole, Little Palm Slaw, Brioche Bun, Yucca Fries Poke Bowl *Tuna, Jasmine Rice, Roasted Corn, Edamame, Green Onion, Avocado, Cilantro, Sub Protein: Tofu, Shrimp, Grilled Chicken dairy free *lp Double Cheeseburger American Cheese, Garlic Aioli, Caramelized Onion, Lettuce, Pickle & Yucca Fries Cuban Sandwich Holy City Hogs Pork Shoulder, Brown Sugar Smoked Ham, Swiss Cheese, Dijon, Pickles, Cuban Bread & Yucca Fries *Consuming raw or undercooked meats, poultry, seafood, shellfish or eggs may increase your risk of foodborne illness. Cocktails Nitro Espresso Martini Absolut, Kahlua, Espresso 16 $ Jinglebird in Paradise Derrumbes Mezcal, Apricot, Cinnamon Infused Aperol, Lemon, Seltzer 16 $ Applechai of My Eye Chai Infused Ketel One, Cointreau, Apple, Cranberry, Lime 16 $ Saint Nick Beefeater Gin, Blood Orange, Grapefruit, Lemon, Cinnamon, Mumm Napa Brut Sparkling 16 $ The Ginger Did It New Amsterdam Vodka, Cranberry, Orange, Cinnamon, Lime, Ginger Beer 16 $ Slayin’ (Frozen) Casamigos Reposado, Kahlua Dunkin Salted Caramel, Espresso 16 $ Zero Proof High Society High Rise THC Citrus Spirit, Blood Orange, Citrus, Seltzer 13 $ The Nice List Seedlip Notas De Agave, Cranberry, Orange, Cinnamon, Lime, Ginger Beer 13 $ On Tap Venetian Spritz Sera Luce, Veneto, Italy 9% 13 $ Sangria Le Sueca, Catalonia, Spain 14 $ Canned Beers/Seltzers Res. Culture ‘Island Time’ 16oz Mexican Lager, Charlotte, NC - 4.5% 11 $ HHBC Tropical Lager Lager, Hilton Head, SC - 4.5% 8 $ Edmunds Oast, ‘Arcade’ Pale Ale, Charleston, SC - 4.7% 8 $ Fattys ‘Lazy Hazy’ Hazy IPA, Charleston, SC - 8% 8 $ Potter’s Grapefruit Hibiscus Cider, Charlottesville, VA - 4.2% 8 $ Holy City ‘Washout Wheat’ Hefeweizen, Charleston, SC - 5.3% 8 $ High Noon Hard Seltzers Variety - 4.5% 10 $ Sunboy Spiked Coconut Water Pineapple, Passion Fruit or Coconut - 5% 10 $ Surfside Vodka + Iced Tea, Lemonade or Half/Half - 4.5% 10 $ Athletic ‘Upside Dawn’ Non Alcoholic - Wheat Ale, CT < 0.5% Abv 7 $ Beach Break Thc Seltzer Watermelon 7 $ High Rise D9 Seltzers Rotating Flavors 8 $ Wine Sparkling Cava Catalonia, SP | Freixenet Cordón Brut 15 $ 60 $ Brut Rosé Burgundy, FR | Cave de Bissey 16 $ 64 $ Champagne Champagne, FR | G.H. Mumm Grand Cordon Brut 25 $ 100 $ White Albariño Rias Baixas, SP | A Veira Do Mar 13 $ 52 $ Sauvignon Blanc Marlborough, NZ | Black Cottage 14 $ 56 $ Chardonnay Mendocino, CA | Poco a Poco 16 $ 64 $ Rosé & Orange Rosé Côtes de Provence, FR | Sainte Marguerite ‘Symphonie’ 14 $ 56 $ Pinot Grigio Ramato (Orange) Friuli, IT | Conte Brandolini 17 $ 68 $ Red Pinot Noir Central Valley, CL | El Viejo Del Valle 13 $ 52 $ Tempranillo Rioja, SP | Gomez Cruzado ‘Crianza’ 15 $ 60 $ Malbec Valle Calchaquí, AR | Colomé ‘Estate’ 16 $ 64 $ Monday–Saturday: 8:00 AM – 11:00 AM Drinks Coffee Coffee by Foresight 4 $ Tea 5 $ Orange 5 $ Grapefruit 5 $ Specialty Coffee Hand Crafted Coffee Beverages from The Coffee Counter Available after 10 AM Cocktails Mimosa Orange Juice, Bubbles 14 $ Bloody Mary Vodka, Charleston Bloody Mary Mix 16 $ Plates 2 Eggs Any Style* 2 Storey Farm Eggs Any Style, Sausage or Bacon & Side of Potatoes 19 $ Sausage Egg Burrito Storey Farm Eggs, Cheese, Crispy Potatoes, Sausage, Tomato, Side of Ranchero Sauce 19 $ Tres Leches French Toast Fresh Brioche, Seasonal Fruit, Whip Cream 17 $ *Shrimp & Crab Omelette 3 Storey Farms Eggs, Lump Crab meat, Shrimp, Avocado, Crema & Ranchero sauce 24 $ Avocado Toast* Grilled Ciabatta Bread, Oaxaca Cheese Crust, Avocado, Lemon, Onion, Cilantro, Arugula, Red Radish, Poached Egg & Extra Virgin Olive Oil 19 $ Add Extra Egg + 3 $ Chicken & Waffles Belgian-Style Waffle, Fried Chicken, Hot Honey Butter 18 $ Overnight Oats Coconut Milk, Local Honey, Pistachio Granola & Dried Blueberries 14 $ Sides Fresh Baked Pastries 7 $ Storey Farm Maple Sausage 8 $ Smoked Bacon 7 $ Crispy Potatoes 7 $ Fruit 7 $ Please note, a 20% gratuity will automatically be added to groups of 6 or more and tabs left open. We continue to support the growth of the culinary community by including a 2.5% service charge for our hardworking kitchen team. A 2.5% CCR fee for all payments made with a credit card. Thank you for your support. *Consuming raw or undercooked meats, poultry, seafood, shellfish or eggs may increase your risk of foodborne illness, especially if you have certain medical conditions. Sunday: 8:00 AM – 4:00 PM Available Sundays 8 AM- 4 PM Brunch 2 Eggs Any Style* 2 storey farms eggs any style, sausage or bacon on a side of potatoes 20 $ Tees Leches French Toast Fresh Brioche, Seasonal Fruit, Whipped Cream 17 $ Sausage Egg Burrito* Storey Farms Eggs, Cheese, Crispy Potatoes, Sausage, Tomato + Side Of Ranchero Sauce 19 $ *Shrimp & Crab Omelette 3 Storey Farms Eggs, Lump Crab meat, Shrimp, Avocado, Crema & Ranchero sauce 24 $ Fried Tarvin Shrimp Wrap Local Tarvin Shrimp, Papaya & Chili Slaw, Umami Sauce 8 $ Avocado Toast Grilled Ciabatta Bread, Oaxaca Cheese Crust, Avocado Spread, Arugula, Red Radish, Poached Egg & Extra Virgin Olive Oil 19 $ Chicken & Waffles Belgian style waffle, fried chicken, hot honey butter 19 $ Steak & Egg* Grilled Ciabatta Bread, Oaxaca Cheese Crust, Avocado Spread, Arugula, Red Radish, Poached Egg & Extra Virgin Olive Oil 35 $ Pork Tostadas Slow Roasted Holy City Hogs Pork Shoulder, Fire-Roasted Winter Squash & Citrus 18 $ Smashed Avocado Corn Tortilla Chips 17 $ Beet & Citrus Endive Salad Goat Cheese, Winter Citrus, Toasted Almonds, Balsamic Vinaigrette 17 $ Chilled Mojo Chicken + 7 $ Poached Shrimp + 8 $ Poached Shrimp + 13 $ Warm Sweet Potato & Winter Kale Roasted Sweet Potato, Shaved Kale, Toasted Cashews, Crispy Shallots, Maple Tamarind Vinaigrette $18 Roasted Sweet Potato, Shaved Kale, Toasted Cashews, Crispy Shallots, Maple Tamarind Vinaigrette 18 $ Chilled Mojo Chicken + 7 $ Poached Shrimp + 8 $ *Ahi Tuna + 13 $ Cuban Sandwich Roasted Pork, Brown Sugar Smoked Ham, Swiss Cheese, Dijon, Pickles, Cuban Bread & Yucca Fries 20 $ LP Double Cheeseburger* Two Patties, American Cheese, Garlic Aioli, Caramelized Onion, Lettuce, Pickles & Yucca Fries 22 $ Add Extra Egg + 3 $ Serves 3-5 Group Punch Little Saint Nick Served In A Disco Ball! Beefeater Gin, Blood Orange, Grapefruit, Lemon, Cinnamon, GH Mumm Sparkling 65 $ Call Your X-Mas Served In A Copper Flamingo! Codigo Reposado, Pomegranate, Tamarind, Lemon, Seltzer 70 $ Cocktails Nitro Espresso Martini Absolut, Kahlua, Espresso 16 $ Little Saint Nick Beefeater Gin, Blood Orange, Grapefruit, Lemon, Cinnamon, GH Mumm Sparkling 16 $ Jinglebird in Paradise Derrumbes Mezcal, Apricot, Cinnamon Infused Aperol, Lemon, Bubbles 16 $ Four Christmases Bulleit Bourbon, Mr. Black Coffee, Creme de Mure, Pandan, lime 16 $ Call Your X-Mas Codigo Reposado, Pomegranate, Tamarind, Lemon 17 $ Coquito Rumhaven, Rumchata Coconut, Coconut Milk, Warming Spices 16 $ The Ginger Did It New Amsterdam Vodka, Cranberry, Orange, Cinnamon, Lime, Ginger 16 $ Applechai of My Eye Chai Infused Ketel One Vodka, Apple, Cointreau, Cranberry, Lime 16 $ Frozen 16 Slayin' Casamigos Reposado, Kahlua Dunkin' Salted Caramel, Espresso Zero Proof 13 All the Jingle Ladies Seedlip Garden, Blood Orange, Grapefruit, Lemon, Cinnamon, Seltzer The Nice List Seedlip Notas De Agave, Cranberry, Orange, Lime, Ginger Please note, a 20% gratuity will automatically be added to groups of 6 or more and tabs left open. We continue to support the growth of the culinary community by including a 2.5% service charge for our hardworking kitchen team. A 2.5% CCR fee for all payments made with a credit card. Thank you for your support. *consuming raw or undercooked meats, poultry, seafood, shellfish or eggs may increase your risk of foodborne illness, especially if you have certain medical conditions. Monday–Saturday | 11:00 AM – 5:00 PM Favorites Smashed Avocado Corn Tortilla Chips 17 $ Mojo Wings Sour Orange, Adobo Rub 18 $ dairy free Tuna Tiradito* Yellowfin Tuna, Yellow Chili, Passion Fruit, Red Onion 18 $ dairy free, gluten free Fried Tarvin Shrimp Wrap per each Local Tarvin Shrimp, Papaya & Chili Slaw, Umami Sauce 8 $ Soups Chicken Tortilla Avocado, Roasted Chicken, Oaxaca Cheese, Tortilla Strips 18 $ Coastal Seafood Stew Fish, Clams, Shrimp & Mussels with Potato, Avocado & Coconut Milk 22 $ Shareables Pan Con Tomate Olive Oil Marinated Tomato, Grilled Bread 13 $ Manchego Cheese + 4 $ Serrano Ham or Chorizo + 5 $ vegan Chicken Croquettes Pulled Chicken, Béchamel 15 $ Crispy Street Corn Bites Grilled Corn, Cilantro Aioli, Cheese Crumble, Jalapeño 14 $ vegetarian Pork Tostadas Slow Roasted Holy City Hogs Pork Shoulder, Fire-Roasted Winter Squash & Citrus 18 $ dairy free Available Monday-Friday Lunch Combo Half Cuban Sando Roasted Pork, Brown Sugar Smoked Ham, Swiss Cheese, Dijon, Pickles, Cuban Bread, Yucca Fries 24 $ CHOICE OF: Seasonal Soup or Salad & Soft Drink or Iced Tea Greens Charred Carrot & Avocado Salad Farm Carrots, Arugula, Watercress, Avocado, Toasted Coconut, Pepitas, Carrot-Ginger Dressing 18 $ Endive Salad Roasted Beets, Winter Citrus, Toasted Almonds, Goat Cheese & Balsamic Vinaigrette 17 $ gluten free, vegetarian Warm Sweet Potato & Winter Kale Salad Roasted Sweet Potato, Shaved Kale, Toasted Cashews, Crispy Shallots, Maple Tamarind Vinaigrette 18 $ vegan Add On Chilled Mojo Chicken + 7 $ Poached Shrimp + 8 $ Ahi Tuna* + 13 $ Plates & Mains Ahi Tuna Sandwich Guacamole, Little Palm Slaw, Brioche Bun, Yucca Fries 23 $ Cuban Sandwich Holy City Hogs Pork Shoulder, Brown Sugar Smoked Ham, Swiss Cheese, Dijon, Pickles, Cuban Bread & Yucca Fries 20 $ LP Double Cheeseburger* American Cheese, Garlic Aioli, Caramelized Onion, Lettuce, Pickle & Yucca Fries 24 $ Poke Bowl* Tuna*, Jasmin Rice, Roasted Corn, Edamame, Green Onion, Avocado, Cilantro 25 $ Substitute Protein Tofu 22 $ Shrimp 24 $ Grilled Chicken 22 $ dairy free Sweets Coconut Custard Berries, Toasted Coconut 14 $ gluten free, vegan Hot Chocolate Tres Leches Spiced Chocolate Ganache, Swiss Merengue, Cocoa Pebbles 14 $ Warm Sticky Toffee Pudding Grilled Starfruit, Chantilly 14 $ *Consuming raw or undercooked meats, poultry, seafood, shellfish or eggs may increase your risk of foodborne illness, especially if you have certain medical conditions. We continue to support the growth of the culinary community by including a 2.5% service charge for our hardworking kitchen team, as well as a 2.5% charge for all payments made with credit card. Monday–Thursday | 5:00 PM – 10:00 PMFriday & Saturday | 5:00 PM – 11:00 PMSunday | 4:00 PM – 9:00 PM Favorites Smashed Avocado Corn Tortilla Chips 17 $ Mojo Wings Sour Orange, Adobo Rub 18 $ dairy free Tuna Tiradito* Yellowfin Tuna, Yellow Chili, Passion Fruit, Red Onion 18 $ dairy free, gluten free Fried Tarvin Shrimp Wrap per each Local Tarvin Shrimp, Papaya & Chili Slaw, Umami Sauce 8 $ Soups Chicken Tortilla Avocado, Roasted Chicken, Oaxaca Cheese, Tortilla Strips 18 $ Coastal Seafood Stew Fish, Clams, Shrimp & Mussels with Potato, Avocado, and Coconut Milk 22 $ Shareables Pan Con Tomate Olive Oil Marinated Tomato, Grilled Bread 13 $ Manchego Cheese + 4 $ Serrano Ham or Chorizo + 5 $ vegan Chicken Croquettes Pulled Chicken, Béchamel 15 $ Yellow Curry Clams Local Clams, Coconut Curry, Charred Corn, Chili Crisp & Grilled Bread 17 $ Pork Tostadas Slow Roasted Holy City Hogs Pork Shoulder, Fire-Roasted Winter Squash and Citrus 18 $ Crispy Street Corn Bites Grilled Corn, Cilantro Aioli, Cheese Crumble, Jalapeño 14 $ vegetarian Greens Charred Carrot & Avocado Salad Farm Carrots, Arugula, Watercress, Avocado, Toasted Coconut, Pepitas, Carrot-Ginger Dressing 18 $ Endive Salad Roasted Beets, Strawberries, Pepita Crumble, Goat Cheese & Balsamic Vinaigrette 17 $ gluten free, vegetarian Warm Sweet Potato & Winter Kale Salad Roasted Sweet Potato, Shaved Kale, Toasted Cashews, Crispy Shallots, Maple Tamarind Vinaigrette 18 $ vegan Add On Chilled Mojo Chicken + 7 $ Poached Shrimp + 8 $ Ahi Tuna* + 13 $ Plates & Mains Fresh Catch Butternut Squash, Lacinato Kale, Holy City Hogs Pork & Black-Eyed Peas 32 $ Cuban Sandwich Holy City Hogs Pork Shoulder, Brown Sugar Smoked Ham, Swiss Cheese, Dijon, Pickles, Cuban Bread & Yucca Fries 20 $ Seared Lump Crabcake* Lump Crab, Celery Root, Snow Peas, and Apple 29 $ LP Double Cheeseburger* American Cheese, Garlic Aioli, Caramelized Onion, Lettuce, Pickle & Yucca Fries 24 $ Grilled Beef Bavette* Smoked Carrot Puree, Roasted Fingerling Potatoes, Oyster Mushrooms and Chimichurri 38 $ Sweets Coconut Custard Berries, Toasted Coconut 14 $ gluten free, vegan Hot Chocolate Tres Leches Spiced Chocolate Ganache, Swiss Merengue, Cocoa Pebbles 14 $ Warm Sticky Toffee Pudding Grilled Starfruit, Chantilly 14 $ *Consuming raw or undercooked meats, poultry, seafood, shellfish or eggs may increase your risk of foodborne illness, especially if you have certain medical conditions. Beers On Tap Venetian Spritz Sera Luce, Veneto, Italy 9% 13 $ Sangria Le Sueca, Catalonia, Spain 14 $ Canned Beers/Seltzers Res. Culture ‘Island Time’ 16oz Mexican Lager, Charlotte, NC - 4.5% 11 $ Hhbc Tropical Lager Lager, Hilton Head, SC - 4.5% 8 $ Edmunds Oast, ‘Arcade’ Pale Ale, Charleston, SC - 4.7% 8 $ Fattys ‘Lazy Hazy’ Hazy IPA, Charleston, SC - 8% 8 $ Potter’s Grapefruit Hibiscus Cider, Charlottesville, VA - 4.2% 8 $ Holy City ‘Washout Wheat’ Hefeweizen, Charleston, SC - 5.3% 8 $ Sunboy Spiked Coconut Water Pineapple, Passion Fruit or Coconut - 5% 10 $ Surfside Vodka + Iced Tea, Lemonade or Half/Half - 4.5% 10 $ Athletic ‘Upside Dawn’ Non Alcoholic - Wheat Ale, Ct < 0.5% Abv 7 $ Beach Break Thc Seltzer Watermelon 7 $ High Rise D9 Seltzers Rotating Flavors 8 $ Wine Sparkling Cava Catalonia, SP | Freixenet Cordón Brut 15 $ 60 $ Brut Rosé Burgundy, FR | Cave De Bissey 16 $ 64 $ Champagne Champagne, FR | G.H. Mumm Grand Cordon Brut 25 $ 100 $ White Albariño Rias Baixas, SP | A Veira Do Mar 13 $ 52 $ Sauvignon Blanc Marlborough, NZ | Black Cottage 14 $ 56 $ Chardonnay Mendocino, CA | Poco a Poco 16 $ 64 $ Rosé & Orange Rosé Côtes de Provence, FR | Sainte Marguerite ‘Symphonie’ 14 $ 56 $ Arancino Sicily, IT | Caruso & Minini 17 $ 68 $ Red Pinot Noir Central Valley, CL | El Viejo Del Valle 13 $ 52 $ Tempranillo Rioja, SP | Gomez Cruzado ‘Crianza’ 16 $ 60 $ Malbec Valle Calchaquí, AR | Colomé ‘Estate’ 16 $ 64 $ *consuming raw or undercooked meats, poultry, seafood, shellfish or eggs may increase your risk of foodborne illness, especially if you have certain medical conditions. Non-Spirited All The Jingle Ladies Seedlip Garden, Blood Orange, Grapefruit, Cinnamon, Lemon, Seltzer 13 $ The Nice List Seedlip Notas de Agave, Cranberry, Orange, Cinnamon, lime, Ginger Beer 13 $ Reservations Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Little Palm | Bar & Swim Club in Charleston, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "c6a25e7942a9",
      "downloadedAt": "2026-01-18T16:54:15.143Z",
      "trimmedAt": "2026-01-18T17:05:10.186Z",
      "sizeReduction": "91.3%"
    },
    {
      "url": "https://www.littlepalmchs.com/happenings/",
      "text": "Main content starts here, tab to start navigating Happenings at Little Palm ___________________ The only thing we love more than going to a party is hosting one! Reservations Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Little Palm | Bar & Swim Club in Charleston, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "d8118367ea8e",
      "downloadedAt": "2026-01-18T16:54:14.610Z",
      "trimmedAt": "2026-01-18T17:05:10.191Z",
      "sizeReduction": "96.5%"
    }
  ],
  "sizeReduction": "92.7%"
}