{
  "venueId": "ChIJhzUgGWp6_ogRGKwEztiXyYg",
  "venueName": "Prohibition",
  "venueArea": "Downtown Charleston",
  "website": "http://prohibitioncharleston.com/",
  "scrapedAt": "2026-01-18T17:04:28.800Z",
  "trimmedAt": "2026-01-18T17:11:27.233Z",
  "pages": [
    {
      "url": "http://prohibitioncharleston.com/drinks",
      "text": "drinks menu red wine Adelaida zinfandel : California 80 red and black fruit, boysenberry, nutmeg, black pepper Epifanio “erial” Tempranillo : Spain 65 intense fruits, bold flavors, blackberry, fine vanilla Ultra violet cABERNET sauvignon : california 14/53 pure black fruit, herbaceous, silky texture hedges red blend : washington 14/53 plum, cherry, clove, velvety & bright, medium long finish le p’tit paysan cabernet sauvignon : california 95 dark stone fruits, mûre, wild flower, earthy minerals manos negras malbec : argentina 14/53 cassis, blackberry, boysenberry. full body, tannins primarius pinot noir : oregon 14/53 red fruits, baked rhubarb, toasted cocoa, silky tannins robert sinskey P.O.V red blend : california 105 rich and intense, crushed berries, fennel, rosemary white wine Clement Berthier sauvignon blanc : France 65 clean mineral, flint, complex fruits Vassaltis Assyrtiko : greece 90 fresh mineral, zingy yellow fruits, lively acidit la racauderie vouvray : france 65 bosc pear, orchard blossoms, pineapple, juicy aci massey dacta sauvignon blanc : new zealand 14/53 fresh exotic fruit, green apple, kiwi montefresco pinot grigio : italy 14/53 crisp, light bodied, pear, honeydew, citrus zest paysan chardonnay : california 70 lemon peel, sandstone, dried pear, mandarin primary chardonnay : california 14/53 rich fruit and oak notes vina cartin albarino : spain 14/53 dry, crisp, saline, granny smith, spring flowers sparkling Moet & chandon champagne : france - 187ml/750ml 25/105 crisp pear, small bubbles, traditional champagne col mesian rosé : italy 13/51 raspberry, white peach, bright acidit montefresco pROSECCO : italy 13/51 light, refreshing, pear, green apple rosé & orange kivelstadt cellars orange wine : california 64 fresh peach, melon, nervy acidity la plage ROSé : FRANCE 14/53 fresh watermelon, cherries, pleasant minerality cocktails 547 MANHATTAN / AGED 547 MANHATTAN 16/18 Templeton Rye, sweet vermouth, Grand Marnier, bitters Margarita fuego 16 blanco tequila, cointreau, mango, lime, jalapeno, chipotle Negroni diversi 16 gin, Campari, sweet vermouth, strawberry, coconut Old fashioned ways 16 bourbon, peach, rooibos, bitters THE WARTHOG 16 Striped Pig Gin, spiced pear, lemon, honey, rosemary The jackalope 16 Irish gin, fancy tonic, botanicals, grapefruit rose mist bourbon thyme 16 Granny Smith Bourbon, Aperol, lemon, thyme, honey, bitters carolina wren 16 apricot vodka, lemon, honey, apricot liqueur, egg white, bitters castle sour 16 Jameson, vanilla, clove, lemon, egg white cherry sour 16 gin, cherry, lemon, vanilla, egg white nockturnal days 16 Nock Tequila Blanco, Nock Mezcal Joven, pineapple, passionfruit, ginger, honey, cilantro, bitters schrute sour 16 beet vodka, rosemary, lemon, egg white stateline swizzle 16 silver rum, passionfruit, lime, demerara, mint, bitters s’express 16 grey goose, mr black, cold brew, lemon oil draught Charles Towne Fermentory Sungazer Hazy IPA : Charleston 9 Guinness Stout : ireland 9 Pilsner Urquell Plzen, CZ 9 Smithwicks Red Ale : Dublin, IRE 9 allagash white wheat beer : maine 9 creature comforts tropicalia ipa : athens, ga 9 lofi mexican lager : charleston 9 lofi glitter pony tripel : charleston 9 magners cider : ireland 9 snafu rotating sour : north charleston 9 packaged Yeungling 7 athletic brewing co. ipa 8 blue moon 7 bud light 6 budweiser 6 coors light 6 corona 7 goose island ipa 8 michelob ultra 6 miller lite 6 seltzer Surfside Iced Tea + Vodka 11 Surfside Lemonade + Vodka 11 high noon grapefruit 12 high noon watermelon 12 Prohibition is available for private bookings, corporate events, rehearsal dinners and weddings. In addition to our main dining room which seats 70 guests, and over 120 standing, we also offer two distinctive and beautiful climate controlled outdoor patio and indoor patio areas that can seat up to 150 guests. Whether your event requires a tailor made menu or a custom crafted cocktail, our team is happy to work with you in creating your next memorable event. 547 King St, Charleston, SC 29403 843-459-7214 info@prohibitioncharleston.com BUSINESS HOURS Mon - wed 4pm - Closethurs - Sunday 11am - close‍Happy Hour Monday-Thursday 4pm-6pm (bar only) SEO by Rank The Coast",
      "hash": "29bf77a8a3d9",
      "downloadedAt": "2026-01-18T16:54:41.926Z",
      "trimmedAt": "2026-01-18T17:11:27.213Z",
      "sizeReduction": "87.6%"
    },
    {
      "url": "http://prohibitioncharleston.com/",
      "text": "Sippin' santa takes over prohibition From November 27th through New Year’s Eve, Prohibition will be transformed into Sippin’ Santa — our annual Tiki-themed Christmas pop-up bar. During this time, the restaurant will be fully decked out in over-the-top tropical holiday décor, complete with twinkling lights, themed glassware, and a lively, festive atmosphere throughout the space. We will be taking some very limited reservations. Walk-ins are encouraged. reserve a table brunch lunch dinner drinks whiskey tickets for nye available now! Ring in 2026 at Sippin' Santa for a night of festive drinks and good vibes.Come join us at for a night of festive fun and celebration as we ring in the new year in style! Conveniently located on upper King Street at Prohibition, Sippin' Santa has three bars with a large outdoor heated patio that is the perfect setting to enjoy New Years Eve with your closest friends. Welcome to New Year's Eve at Sippin' Santa!‍ Prohibition presents: Sippin' Santa click to book bottle service available now Prohibition Charleston is excited to announce its new bottle service, elevating our nightlife experience to new heights. Patrons can now indulge in a curated selection of Champagnes & Premium Spirits (with complimentary mixers). This exclusive service ensures guests enjoy personalized attention and a touch of luxury, perfect for celebrations or a refined night out.Whether you’re toasting a special occasion or simply enjoying a night on the town, Prohibition Charleston’s bottle service promises an unforgettable experience. click to book music events saturday brunch MUSIC Beginning on 1/25/25Local Singer/Songwriter Krystal Halvorson plays at Prohibition every Saturday from 11am-2pm sunday brunch music The superb talents of Bluegrass band New Ghost Town play at Prohibition every Sunday from 11am-2pm Mondays with evelyn ivory from 9pm Thursdays - Rotating Bands starting at 9:30 (no cover)12/4 Evelyn Ivory Trio12/11 Krystal and the Drive Home12/18 Evelyn Ivory Trio1/8 Good Company 1/15 Krystal and the Drive Home 1/22 Evelyn Ivory Trio 1/29 Evelyn Ivory Trio2/5 Krystal and the Drive Home2/12 Krystal and the Drive Home2/19 Evelyn Ivory Trio2/26 Evelyn Ivory Trio3/5 Krystal and the Drive Home3/12 Evelyn Ivory Trio3/19 Evelyn Ivory Trio3/26 Krystal and the Drive Home live djs on fridays - jerry feels good + special Guests 10pm - 2am (23y/o+) Saturdays - Rotating djs 10pm - 2am (23y/o+)December :6th Tommy Tangie13th DJ DAYZ20th SparksTheeDJ27th Seth G.January:3rd DBLCRWN10th Tommy Tangie 🎺17th LYRIKILL24th LYRIKILL31st The Mixstress Madi JoFebruary:7th Clark on Sax 🎷14th DJ LYRIKILL21st DJ LYRIKILL28th SparksTheeDJMarch:7th DJ DAYZ14th SEE JANE SPIN21st Seth G. 🎻28th DJ DollaMenu live dj on sundays - dj pep in yo stepp from 10pm about prohibition PROHIBITION BAR & RESTAURANT A nod to the classic 1920’s speakeasy, Prohibition feels like you’re stepping back in time with its vintage-inspired decor. Our cocktails and cuisine, however, are anything but old-fashioned. Begin with an inventive cocktail crafted by Beverage Director Jim McCourt, who constantly dreams up balanced and thought-provoking libations. In the kitchen our acclaimed chef Greg Garrison puts a sophisticated and modern spin on Southern classics. BEST OF CHARLESTON 2020 Thank you to everyone who showed us love by nominating Prohibition under “Best Downtown Bar” & “Best Cocktails” for Charleston City Paper “Best of Charleston 2020”! PRIVATE EVENT SPACE Make your next event a memorable one at Prohibition Charleston. With 3 distinct areas available to book and a capacity to host up to 150 people, Prohibition offers an unique setting for your next Birthday Party, Anniversary Party, Rehearsal Dinner, Wedding Reception, Corporate event, Team Banquet, and more! book your event Prohibition is available for private bookings, corporate events, rehearsal dinners and weddings. In addition to our main dining room which seats 70 guests, and over 120 standing, we also offer two distinctive and beautiful climate controlled outdoor patio and indoor patio areas that can seat up to 150 guests. Whether your event requires a tailor made menu or a custom crafted cocktail, our team is happy to work with you in creating your next memorable event. 547 King St, Charleston, SC 29403 843-459-7214 info@prohibitioncharleston.com BUSINESS HOURS Mon - wed 4pm - Closethurs - Sunday 11am - close‍Happy Hour Monday-Thursday 4pm-6pm (bar only) SEO by Rank The Coast",
      "hash": "4af497e7cd21",
      "downloadedAt": "2026-01-18T16:54:40.419Z",
      "trimmedAt": "2026-01-18T17:11:27.222Z",
      "sizeReduction": "83.5%"
    },
    {
      "url": "http://prohibitioncharleston.com/private-events",
      "text": "PRIVATE EVENTS Make your next event a memorable one at Prohibition Charleston. With 3 distinct areas available to book and a capacity to host up to 150 people, Prohibition offers an unique setting for your next Birthday Party, Anniversary Party, Rehearsal Dinner, Wedding Reception, Corporate event, Team Banquet, and more! The perfect place for your engagement or bachelorette party! private events packet book an event book your event If you’re interested in booking an event at Prohibition, please enter the following information, including your phone number, and we’ll be in touch with you soon. Type of Event Brunch Non-Corporate Rehearsal Dinner Wedding Reception Corporate Event Late Night Thank you! Your submission has been received! Oops! Something went wrong while submitting the form. Prohibition is available for private bookings, corporate events, rehearsal dinners and weddings. In addition to our main dining room which seats 70 guests, and over 120 standing, we also offer two distinctive and beautiful climate controlled outdoor patio and indoor patio areas that can seat up to 150 guests. Whether your event requires a tailor made menu or a custom crafted cocktail, our team is happy to work with you in creating your next memorable event. 547 King St, Charleston, SC 29403 843-459-7214 info@prohibitioncharleston.com BUSINESS HOURS Mon - wed 4pm - Closethurs - Sunday 11am - close‍Happy Hour Monday-Thursday 4pm-6pm (bar only) SEO by Rank The Coast",
      "hash": "d0e426f2ba70",
      "downloadedAt": "2026-01-18T16:54:41.259Z",
      "trimmedAt": "2026-01-18T17:11:27.226Z",
      "sizeReduction": "88.5%"
    },
    {
      "url": "http://prohibitioncharleston.com/#menus",
      "text": "Sippin' santa takes over prohibition From November 27th through New Year’s Eve, Prohibition will be transformed into Sippin’ Santa — our annual Tiki-themed Christmas pop-up bar. During this time, the restaurant will be fully decked out in over-the-top tropical holiday décor, complete with twinkling lights, themed glassware, and a lively, festive atmosphere throughout the space. We will be taking some very limited reservations. Walk-ins are encouraged. reserve a table brunch lunch dinner drinks whiskey tickets for nye available now! Ring in 2026 at Sippin' Santa for a night of festive drinks and good vibes.Come join us at for a night of festive fun and celebration as we ring in the new year in style! Conveniently located on upper King Street at Prohibition, Sippin' Santa has three bars with a large outdoor heated patio that is the perfect setting to enjoy New Years Eve with your closest friends. Welcome to New Year's Eve at Sippin' Santa!‍ Prohibition presents: Sippin' Santa click to book bottle service available now Prohibition Charleston is excited to announce its new bottle service, elevating our nightlife experience to new heights. Patrons can now indulge in a curated selection of Champagnes & Premium Spirits (with complimentary mixers). This exclusive service ensures guests enjoy personalized attention and a touch of luxury, perfect for celebrations or a refined night out.Whether you’re toasting a special occasion or simply enjoying a night on the town, Prohibition Charleston’s bottle service promises an unforgettable experience. click to book music events saturday brunch MUSIC Beginning on 1/25/25Local Singer/Songwriter Krystal Halvorson plays at Prohibition every Saturday from 11am-2pm sunday brunch music The superb talents of Bluegrass band New Ghost Town play at Prohibition every Sunday from 11am-2pm Mondays with evelyn ivory from 9pm Thursdays - Rotating Bands starting at 9:30 (no cover)12/4 Evelyn Ivory Trio12/11 Krystal and the Drive Home12/18 Evelyn Ivory Trio1/8 Good Company 1/15 Krystal and the Drive Home 1/22 Evelyn Ivory Trio 1/29 Evelyn Ivory Trio2/5 Krystal and the Drive Home2/12 Krystal and the Drive Home2/19 Evelyn Ivory Trio2/26 Evelyn Ivory Trio3/5 Krystal and the Drive Home3/12 Evelyn Ivory Trio3/19 Evelyn Ivory Trio3/26 Krystal and the Drive Home live djs on fridays - jerry feels good + special Guests 10pm - 2am (23y/o+) Saturdays - Rotating djs 10pm - 2am (23y/o+)December :6th Tommy Tangie13th DJ DAYZ20th SparksTheeDJ27th Seth G.January:3rd DBLCRWN10th Tommy Tangie 🎺17th LYRIKILL24th LYRIKILL31st The Mixstress Madi JoFebruary:7th Clark on Sax 🎷14th DJ LYRIKILL21st DJ LYRIKILL28th SparksTheeDJMarch:7th DJ DAYZ14th SEE JANE SPIN21st Seth G. 🎻28th DJ DollaMenu live dj on sundays - dj pep in yo stepp from 10pm about prohibition PROHIBITION BAR & RESTAURANT A nod to the classic 1920’s speakeasy, Prohibition feels like you’re stepping back in time with its vintage-inspired decor. Our cocktails and cuisine, however, are anything but old-fashioned. Begin with an inventive cocktail crafted by Beverage Director Jim McCourt, who constantly dreams up balanced and thought-provoking libations. In the kitchen our acclaimed chef Greg Garrison puts a sophisticated and modern spin on Southern classics. BEST OF CHARLESTON 2020 Thank you to everyone who showed us love by nominating Prohibition under “Best Downtown Bar” & “Best Cocktails” for Charleston City Paper “Best of Charleston 2020”! PRIVATE EVENT SPACE Make your next event a memorable one at Prohibition Charleston. With 3 distinct areas available to book and a capacity to host up to 150 people, Prohibition offers an unique setting for your next Birthday Party, Anniversary Party, Rehearsal Dinner, Wedding Reception, Corporate event, Team Banquet, and more! book your event Prohibition is available for private bookings, corporate events, rehearsal dinners and weddings. In addition to our main dining room which seats 70 guests, and over 120 standing, we also offer two distinctive and beautiful climate controlled outdoor patio and indoor patio areas that can seat up to 150 guests. Whether your event requires a tailor made menu or a custom crafted cocktail, our team is happy to work with you in creating your next memorable event. 547 King St, Charleston, SC 29403 843-459-7214 info@prohibitioncharleston.com BUSINESS HOURS Mon - wed 4pm - Closethurs - Sunday 11am - close‍Happy Hour Monday-Thursday 4pm-6pm (bar only) SEO by Rank The Coast",
      "hash": "ee484ad3bfba",
      "downloadedAt": "2026-01-18T16:54:40.605Z",
      "trimmedAt": "2026-01-18T17:11:27.233Z",
      "sizeReduction": "83.5%"
    }
  ],
  "sizeReduction": "85.5%"
}