{
  "venueId": "ChIJhRZB6_B6_ogRzcrTCfdU3aA",
  "venueName": "Rancho Lewis",
  "venueArea": "Downtown Charleston",
  "website": "http://www.rancholewischs.com/",
  "scrapedAt": "2026-01-18T17:04:28.748Z",
  "trimmedAt": "2026-01-18T17:11:25.755Z",
  "pages": [
    {
      "url": "http://www.rancholewischs.com/menu/kids-menu/",
      "text": "Main content starts here, tab to start navigating Los Ninos For the kids! Mains Bean + Cheese Burrito Cheese Quesadilla Lil Juan's Chicken Tenders Mini Corn Dogs Sides Rice Charro Beans French Fries Handmade Tortillas Dessert Cowpoke Sundae Vanilla Ice Cream, Chocolate Syrup, Whipped Cream + a Cherry on Top Call 843-996-4500 Take Out Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "316355e6d16a",
      "downloadedAt": "2026-01-18T16:54:42.400Z",
      "trimmedAt": "2026-01-18T17:11:25.730Z",
      "sizeReduction": "98.1%"
    },
    {
      "url": "http://www.rancholewischs.com/",
      "text": "Home Main content starts here, tab to start navigating Slide 1 of 5 Slide 2 of 5 Slide 3 of 5 Slide 4 of 5 Slide 5 of 5 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Bienvenidos! Rancho Lewis honors the multicultural traditions of West Texas, Chihuahua Mexico, and New Mexico with time- honored techniques and border-food-meets cowboy cuisine. Pull up a bar stool or grab a table and dig into the dishes and drinks Pitmaster John Lewis grew up enjoying. Fine Mexican Food & Drinks We take reservations! If you don't see a reservation available for the date and time you are looking for, no problem, come on in! We have a huge bar and courtyard to wait for your table to become available. View Menus Make a Reservation Large Party Gather ‘round y’all! We accept reservations for parties of up to 12 guests. To request a reservation for 13 or more, fill out the Large Party Event Form and we will be in touch as soon as possible! Start Planning Call 843-996-4500 Take Out Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "4495db834a24",
      "downloadedAt": "2026-01-18T16:54:40.054Z",
      "trimmedAt": "2026-01-18T17:11:25.734Z",
      "sizeReduction": "96.6%"
    },
    {
      "url": "http://www.rancholewischs.com/menu/dinner/",
      "text": "Main content starts here, tab to start navigating Main Menu Offered all day, seven days a week! Check out our Happy Hour held Monday - Friday from 4 pm to 6 pm! Download PDF From the Mesquite Grill Rancho Fajitas Grilled, sizzling fajitas with peppers & onions served with charro beans, Spanish rice, guacamole, sour cream, lettuce, and pico de gallo Served with your choice of corn or flour tortillas. Chicken, steak, shrimp, or veggie. The Jay J. Armes. Mixed Grill Mesquite grilled steak, shrimp, and quail. Served with charro beans, Spanish rice, guacamole, sour cream, lettuce, and pico de gallo and your choice of warm corn or flour tortillas. Green Chile Steak Burger 8oz ground steak burger smothered in hatch green chiles and American cheese. Served with seasoned fries and red chile ketchup! Beef Back Ribs “Half the Cow!” Full rack, slow cooked in our mesquite pit overnight, served with cowboy slaw, charro beans, and a green chile baked potato. The Best in Town! Steak & Shrimp 16 oz grilled ribeye served with crispy masa battered shrimp, green chile baked potato, peppers and onions Para Comenzar Guacamole Fresh made, served with stone ground corn tostadas vegetarian Chile con Queso Roasted hatch green chiles and chihuahuan cheese served with chips Queso Asado Northern Mexican cheeses, griddled with chiles and chorizo. Served with your choice of homemade corn or flour tortillas. Shrimp Cocktail Marinated shrimp, avocado, cucumber, cilantro, and citrus Nachos Especiales Individually prepared bean & cheese nachos topped with pickled jalapeños. Add mesquite grilled chicken, steak, or shrimp. Ensaladas Y Soups West Texas Wedge Mesquite bacon, avocado, cotija cheese, grilled corn, and pico de gallo served with our Rancho Dressing! Sun City Caesar Romaine, queso anejo, crispy corn tortilla, chile rajas, and cilantro served with our twist on a Caesar vinaigrette. Add mesquite-grilled chicken or shrimp! vegetarian Green Chile Pozole Fire roasted hatch chiles, hominy, and mushrooms in a savory broth, topped with cilantro crema and traditional garnish. Offered as a cup or bowl. vegetarian Chicken Tortilla Soup Red Chile tomato broth, chicken tinga, avocado, and cilantro crema topped with crispy corn tortilla strips. Offered as a cup or bowl. Sides and Add Ons Refried or Charro Beans Spanish Rice French Fries Mexican Slaw Green Chile Baked Potato Mas Tortillas All plates served with Spanish rice and Marrow Farms pinto beans. Mexican Favorites Smoked Brisket Enchiladas Smoked brisket rolled in house-made corn tortillas, topped with sun dried red chile sauce, cheese, and onion. Chicken Enchiladas Verdes Slow cooked chicken tinga rolled in corn tortillas and topped with fire roasted green chile sauce and cheese. Christmas Burrito Fresh, made to order, flour tortilla stuffed with red chile pork, charro beans, and cheese, smothered with red and green chile sauces and topped with fine Mexican cheeses. North Mesa Street Tacos Your choice of tender mesquite grilled steak or chicken, griddled cheese, chile salsa, onions and cilantro. Veggie Enchiladas New Mexico style stacked enchiladas layered with roasted onions and peppers, grilled corn, mushrooms, and diced potatoes in crema. Covered with sun-dried red chile sauce and topped with cotija cheese and a runny egg. Served with Marrow Farms pinto beans and Spanish Rice. Chiles Rellenos Smothered Hatch green chiles stuffed with asadero cheese. Cora’s Combo Mesquite grilled chicken breast paired with two cheese and onion enchiladas topped with green chile sauce, cheese, guacamole salad. *served with a complementary scoop of lime sorbet to finish The Lloyd Lewis Mesquite grilled steak served with two red chile, cheese, & onion enchiladas, a side of Spanish rice and refried beans and guacamole salad. From the Sea Fish Tacos Griddled Grouper or Grilled Shrimp, pineapple slaw, charred jalapeno aioli. Served with rice and beans. Crispy Tortillas Fish Market fish encrusted in a house-milled tortilla batter, topped with jalapeno aioli and corn relish, served with pineapple slaw. Postres Sopapillas A true favorite!! Soft and crispy pillows of fried dough dusted with cinnamon sugar, and served with mesquite honey. Mexican Sundae Double dark chocolate ice cream, cajeta caramel, chocolate sauce, whipped cream, candied pecans and candied red chiles. Orange Scented Flan Creamy custard, candied oranges The Three Amigos Trio of seasonal sorbets and gelatos Call 843-996-4500 Take Out Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "4e5d2b6b4da7",
      "downloadedAt": "2026-01-18T16:54:40.671Z",
      "trimmedAt": "2026-01-18T17:11:25.744Z",
      "sizeReduction": "91.3%"
    },
    {
      "url": "http://www.rancholewischs.com/location/rancho-lewis/",
      "text": "Main content starts here, tab to start navigating Hours & Location 1503 King St., Charleston, SC 29405 843-996-4500 Sunday - Thursday :: 11 am - 9 pmFriday + Saturday :: 11 am - 10 pm Get Directions Call 843-996-4500 Take Out Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "a392e2cb5256",
      "downloadedAt": "2026-01-18T16:54:40.119Z",
      "trimmedAt": "2026-01-18T17:11:25.747Z",
      "sizeReduction": "98.2%"
    },
    {
      "url": "http://www.rancholewischs.com/menu/cantina/",
      "text": "Main content starts here, tab to start navigating Cantina Download PDF Margarita de La Casa Lunazul margarita shaken extra cold, served on the rocks Glass 11 $ Pitcher 45 $ Traditional Frozen Margarita 11 $ add fresh mango or spicy green chile 2 $ Rancho Rita Reposado Tequila, Cointreau, lime Glass 14 $ Pitcher 55 $ So Far So Bueno big clay bowl filled with tequila, grapefruit and citrus juices 13 $ Mexican Martini (Limit 2) 100% blue agave tequila, lime, olive, served up 15 $ make it spicy 1 $ Vampiro Lunazul tequila, Viuda de Sánchez, chile, soda 13 $ El Viejo Seasonal Old Fashioned 15 $ Rattlesnake Milk tequila, Mexican rum, egg white, with a bite! 13 $ Hibiscus Cooler A refreshing spirit free cocktail 6 $ Call 843-996-4500 Take Out Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "ce5c364bbe09",
      "downloadedAt": "2026-01-18T16:54:41.216Z",
      "trimmedAt": "2026-01-18T17:11:25.752Z",
      "sizeReduction": "97.3%"
    },
    {
      "url": "http://www.rancholewischs.com/menu/lunch/",
      "text": "Main content starts here, tab to start navigating Lunch Weekday Specials offered alongside our ! Main Menu Available Monday - Friday from 11 am to 4 pm! In addition to our full regular menu, we are serving a menu of weekday lunch specials! Weekday Lunch Specials El Duo Small Chile Con Queso y Guacamole with Stone Ground Tortillas Lunch Break Fajitas Lunch-Sized Portion of Sizzling Steak + Chicken Fajitas, Peppers + Onions, Corn or Flour Tortillas, served with Charro Beans, Spanish Rice, Guacamole, Sour Cream, Lettuce, Pico De Gallo Vegetarian Combo One Veggie Rajas Enchilada + One Chile Relleno Smothered in Sun-Dried Red Chile + Cheese, served with Spanish Rice + Pinto Beans Juan's Combo Choice of One Enchilada (Smoked Brisket or Chicken Verde) + Choice of One Street Taco (Mesquite Grilled Steak or Chicken), served with Spanish Rice + Pinto Beans Call 843-996-4500 Take Out Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "e5cd2ab08576",
      "downloadedAt": "2026-01-18T16:54:41.765Z",
      "trimmedAt": "2026-01-18T17:11:25.755Z",
      "sizeReduction": "96.5%"
    }
  ],
  "sizeReduction": "95.9%"
}