{
  "venueId": "ChIJYXaIdFhv_ogRODFmqQXoURA",
  "venueName": "Mac's Daniel Island",
  "venueArea": "Daniel Island",
  "website": "http://www.macsdi.com/",
  "scrapedAt": "2026-01-18T17:04:27.804Z",
  "trimmedAt": "2026-01-18T17:11:07.233Z",
  "pages": [
    {
      "url": "http://www.macsdi.com/daniel-island-mac-s-daniel-island-food-menu",
      "text": "Our menu Menu",
      "hash": "1ab00b248a69",
      "downloadedAt": "2026-01-18T16:08:02.685Z",
      "trimmedAt": "2026-01-18T17:11:07.139Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://www.macsdi.com/",
      "text": "× Did you know we do catering? Whatever your occasion, however big or small, we have the perfect options to choose from. Cater your birthday party, holiday party, corporate events, wedding festivities and more! Call to Inquire × Let us host your special event! Whether a birthday party, office function or any other special occasion - we take care of all the fine details, bringing your event to life, just as you imagined. Host your next party or get together with us! Book your party × We are taking online reservations! Let’s ensure you get a great table: Book today! We recommend making a reservation ahead of time. Book your table today! Book Table Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! Job Listings Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! NFL Playoffs - Come watch the NFL Playoffs with us! Upcoming Events NFL Playoffs - Come watch the NFL Playoffs with us! 259 Seven Farms Drive ste 1-A, Daniel Island, SC 29492 map marker pin Parties We host. You party! Need the perfect space for your special event? Your search is over. Parties About us WELCOME TO MACS! We are Macs restaurant. Come to enjoy our tasty cuisine and relaxing atmosphere. We are expecting you! Our Menu Reservations Make some memories Reserve your table, we look forward to seeing you! Reservations Good food done right Our Menu Your private party spot Parties Taste is everything Order Full bar available Drinks Make some memories Reservations Dot slide navigation number 1 Dot slide navigation number 2 Dot slide navigation number 3 Dot slide navigation number 4 Dot slide navigation number 5 slideshow start stop playing Order online Take us home with you! Treat yourself to your favorites, wherever you are! Order Reviews review by - Google MAHALO: great food at a great price. the staff is always pleasant and willing to help. they make great suggestions and the atmosphere is also welcoming and friendly... review by - Google Nathan B: Family atmosphere that caters to adults, children and pets. The outdoor space is wonderful. Good pub food too! review by - Google Matthew D: Very Cool place to chill and eat ! Have eaten there at least 20 times never disappointed! review by - Google Sean C: Great happy hour deals and good food, will definitely be back! review by - Google Kelly C: Great staff and amazing food. Stop reviews carousel Play reviews carousel Newsletter Location 259 Seven Farms Drive ste 1-A Daniel Island, SC 29492 Hours Mon, Tue, Wed, Thur, Fri 11:00 AM - 2:00 AM Sun, Sat 10:00 AM - 2:00 AM Find us on... Contact us (855)-681-7364 garret@macsdi.com Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "1caba193e1c0",
      "downloadedAt": "2026-01-18T16:08:02.546Z",
      "trimmedAt": "2026-01-18T17:11:07.214Z",
      "sizeReduction": "98.1%"
    },
    {
      "url": "http://www.macsdi.com/daniel-island-mac-s-daniel-island-events",
      "text": "Events We are updating our events Please stay tuned",
      "hash": "39ee7443b34d",
      "downloadedAt": "2026-01-18T16:08:04.574Z",
      "trimmedAt": "2026-01-18T17:11:07.223Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "http://www.macsdi.com/daniel-island-mac-s-daniel-island-drink-menu",
      "text": "Our drinks Beer Wine Cocktails",
      "hash": "4109e06a7f90",
      "downloadedAt": "2026-01-18T16:08:03.325Z",
      "trimmedAt": "2026-01-18T17:11:07.228Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://www.macsdi.com/daniel-island-mac-s-daniel-island-happy-hours-specials",
      "text": "Specials Friday January 23rd Live Music on the Patio 06:00 PM - 09:00 PM",
      "hash": "57e03eb7f205",
      "downloadedAt": "2026-01-18T16:08:03.951Z",
      "trimmedAt": "2026-01-18T17:11:07.233Z",
      "sizeReduction": "99.9%"
    }
  ],
  "sizeReduction": "99.3%"
}