{
  "venueId": "ChIJ4evE4URj_ogRg-9axKZc1Bg",
  "venueName": "Thai Palm Restaurant",
  "venueArea": "North Charleston",
  "website": "https://www.thaipalmrestaurantsc.com/",
  "scrapedAt": "2026-01-18T17:04:23.583Z",
  "trimmedAt": "2026-01-18T17:04:59.090Z",
  "pages": [
    {
      "url": "https://www.thaipalmrestaurantsc.com/",
      "text": "Skip to main content Authentic Thai Cuisine Savor Authentic Thai takeout and delivery with dishes like Pad Thai and Green Curry. Customers love our bold flavors and great service in North Charleston, Hanahan, and Goose Creek. Located at Tanger Outlets. We’re your go-to for delicious lunch and dinner, crafted with fresh ingredients! Order Online View Menu Discover Thai Palm Restaurant in North Charleston, SC Welcome to Thai Palm Restaurant, a local gem at 4958 Centre Pointe Dr, North Charleston, SC, serving Authentic Thai Cuisine. Our menu shines with customer favorites like Tom Yum Soup, Basil Fried Rice, and Spring Rolls, all made with quality ingredients. Diners rave about our authentic dishes and welcoming vibe, earning us a 4.4-star rating. Whether you’re grabbing takeout or enjoying delivery, we’re here to bring vibrant Thai flavors to you! Location Thai Palm Restaurant CLOSED NOW • Closes at 09:00 pm 4958 Centre Pointe Drive Unit 103, North Charleston, SC 29418 8434330739 Pickup Delivery Hours of Operation (Takeout) Monday - Sunday 11:00 am - 09:00 pm Order Online View Menu Review us on Google Having you as part of our food lovers family means the world to us. We kindly ask you to spread the word about our restaurant by leaving a Google Review. Leave a review",
      "hash": "74c318858149",
      "downloadedAt": "2026-01-18T17:01:37.557Z",
      "trimmedAt": "2026-01-18T17:04:59.060Z",
      "sizeReduction": "98.0%"
    },
    {
      "url": "https://www.thaipalmrestaurantsc.com/p8g0ozrd/thai-palm-restaurant-north-charleston-29418/order-online#menu-section",
      "text": "Skip to main content",
      "hash": "c56254eb790e",
      "downloadedAt": "2026-01-18T17:01:38.290Z",
      "trimmedAt": "2026-01-18T17:04:59.090Z",
      "sizeReduction": "100.0%"
    }
  ],
  "sizeReduction": "99.8%"
}