{
  "venueId": "ChIJB8YsDvZ6_ogR0t-pyYrZcvk",
  "venueName": "Edmund's Original (Formerly Edmund's Oast)",
  "venueArea": "Mount Pleasant",
  "website": "https://www.edmundsoriginal.com/?y_source=1_MjAwNDAzMDE2OS03MTUtbG9jYXRpb24ud2Vic2l0ZQ%3D%3D",
  "scrapedAt": "2026-01-18T17:04:24.110Z",
  "trimmedAt": "2026-01-18T17:05:09.127Z",
  "pages": [
    {
      "url": "https://www.edmundsoriginal.com/bower-menus/",
      "text": "Main content starts here, tab to start navigating Bower Menus The Bower Food The Bower Beverage Happy Hour Sunday Brunch Snacks Spicy Pimento Cheese 14 $ Peanuts, steen’s cane syrup, ritz Dim Sum Shrimp Toast 16 $ Sesame, sour soy Plates Pickled Shrimp* 20 $ Grilled rye, aioli, pickled vegetables, herbs Spicy Korean Meatballs 18 $ Scallions, pineapple, basmati rice EO Cheeseburger 16 $ B&b pickles, onion, tomato, special sauce Smoked Salmon Toast* 20 $ Grilled rye, aioli, pickled cucumbers, arugula, sesame Italian Sandwich 15 $ Cold cuts, provolone, sub sauce, spicy giardiniera, LTO Artisan Meat Share Cheeseburger 16 $ Bacon jam, lettuce, onion, mustard, jalapeno Curried Vegetables 18 $ red curry, squash, basmati rice, peanuts Add fried chicken 6 $ Add grilled chicken 8 $ Add poached shrimp 9 $ Add smoked salmon 10 $ Fried Shrimp Po'boy 18 $ lettuce, tomato, onion, chili peanut crisps, dukes Salads Caesar Salad* 16 $ Too much dressing, croutons, parm Crunchy Salad 16 $ Apples, almonds, raisins, chickpea flour, green goddess Ginger Salad 13 $ cucumber, radish, shallot, sesame Additions Fried Chicken 6 $ Grilled Chicken 8 $ Smoked Salmon* 10 $ Poached Shrimp 9 $ On the Side Collards 8 $ Beans ‘n Rice 7 $ Pasta Salad 8 $ Fish Sauce + Vinegar Chips Basket 7 $ Curly Fries* Not GF 7 $ Mac ‘n Peas 10 $ Crispy Garlic Pots 10 $ original • korean • new orleans bbq • spicy • garlic crab Fried Chicken 8 Piece 36 $ Collards, pasta salad, pinto beans n’ rice 2 Piece 17 $ Collards, pasta salad 4 Piece 21 $ Collards, pasta salad The “Lunchbox” 17 $ Fried chicken sammy, pasta salad, brookie bite Sweets Brookie 6 $ Dense brownie meets a chocolate chip cookie New York Style Cheesecake 14 $ Graham cracker crust, caramelized peach gluten free Chocolate Layer Cake 15 $ Chocolate truffle icing, chocolate buttercream Key Lime Pie 14 $ Coconut lime tuile and candied lime peel gluten free Banana Pudding 10 $ Toasted meringue, nilla wafers gluten free Classic Tiramisu 14 $ Espresso, marscapone, kahlua Ice Cream 8 $ Vanilla, funfetti, cookies & cream, honey + pear sorbet Kids Cheesy Buttered Noodles 9 $ Cheeseburger 8 $ Grilled Cheese 6 $ Fried Chicken Sammy with Cheese 9 $ Cocktails Edmund’s Old Fashioned 13 $ Bourbon, raw sugar, bitters Margarita (Regular or Spicy) 12 $ Tequila, lime, triple sec, salt Red Wedding 15 $ Bourbon, averna, hibiscus ice cubes Frozen Drinks 12oz unless otherwise noted / Pitchers $32 House Beers House Blonde - 5% 8 $ Light-bodied, crushable, refreshing Festbier - 5.9% 12oz 8 $ German-style pale lager, honey, light toast Bellweather -5.9% 12oz 8 $ German-style pale ale, soft cirtrus, floral Darker Lariat- 4.3% 12oz 8 $ German-style dunkel, clove, banana, full body Off the Shire- 5.4% 12oz 8 $ New Zealand- style pilsner, white wine, gooseberry Flannel Stories- 5.4% 12oz 8 $ brown ale, smoked malt, dark chocolate, warm Winter's Calling 8 $ rye farmhouse ale, spruce tips, resinous, citrus, herbal Summer Practice - 6.1% 12 oz 8 $ Carolina gold rice IPA, El Dorado hop, bright A Light Breakfast - 4.5% 8 $ golden ale, coffee cacao nibs, lactose, crushable Wines Sauvignon Blanc Paul Buisse, France Glass 13 $ Bottle 51 $ Chenin Blanc Aperture, CA Glass 15 $ Bottle 58 $ Chardonnay Payson, California Glass 13 $ Bottle 54 $ Rosé Muga Rioja, Spain '24 Glass 13 $ Bottle 50 $ Pinot Noir In Sheep's Clothing, Dundee, Oregon 2023 Glass 16 $ Bottle 75 $ Cabernet Sauvignon Valravn, California Glass 15 $ Bottle 62 $ Cremant Elise, Loire, France NV Glass 10 $ Bottle 49 $ Cider + Other Nowadays- 5 Mg THC Beverage 10 $ Bright, flavors of tropical fruit recomended with soda + lime Non-Alcoholic Beer 6 $ Rotating selection from untitled art EOBC + Devil’s Foot Na Margarita 6 $ Non-alcoholic, orange, salt, cane syrup King Bean Nitro Cold Brew (na) 6.50 $ Velvety, dark chocolate, cherry Wolffer Estate, Dry Rosé Cider - 6.9% 9 $ Slightly sweet, crisp, refreshing To-Go Cans NA Margarita (4 Pk) 10.99 $ 0% Lime, Sugar Delicious EOBC Bound by Time (4 Pk) 13.99 $ 7% India Pale Ale EOBC Cereal for Dinner (4 Pk) 13.99 $ 5% blonde, vanilla, almond, coconut EOBC Fruit Sours (4 Pk) 15.99 $ 5% American Sour Ale- lemon lime, dragonfruit, concord grape, or cherry pineapple EOBC Arcade (6 Pk) 13.99 $ 4.7% American pale ale EOBC Something Cold (4 Pk) 10.99 $ 5% Premium Blonde Ale Westbrook White Thai (4 Pk) 13.99 $ 5% witbier, lemongrass, ginger, bright Coast Rye Knot (6 Pk) 10.99 $ 6.2% American Brown Ale Cider Creek (4pk) 11.99 $ 5.5% guava or orange creamsicle EOBC Boundless and Bare (4pk) 13.99 $ 6.3% American IPA EOBC Comfy Armchair (4pk) 11.99 $ 4.7% English Brown Ale EOBC Nightcap (4pk) 12.99 $ 6.3% Dark ale EOBC Mixed Tapes Volume II (4pk) 16.99 $ 6.5% India Pale Ale EOBC Plasma Gun (4pk) 16.99 $ 8% West Coast Style India Pale Ale EOBC Game Room (4pk) 13.99 $ 8% Double Pale Ale EOBC For a Few Shillings (4pk) 12.99 $ 4.8% Amber Pale Ale EOBC Death to Fresh (4pk) 15.99 $ 6.3% Fresh Hop India Pale Ale EOBC The Dark Stuff (4pk) 12.99 $ 4.7% Oatmeal Stout EOBC Cereal After Dark (4pk) 13.99 $ 5% Stout with toasted coconut, vanilla bean, cacao nibs, and lactose EOBC Leather Jacket (4pk) 12.99 $ 6.5% American porter EOBC Dunkelweizen (4pk) 12.99 $ 4.2% Dark wheat beer EOBC Company Scrip (4pk) 11.99 $ 4.5% English Style Pale Ale EOBC Spatial Distortion (4pk) 15.99 $ 6.5% American IPA The Bower & Indoor Bar | Monday - Friday: 3 p.m. - 6 p.m. Snacks CHICKEN SALAD SLIDERS (2) 7 $ Hawaiian roll, dill pickle chips FRIED BOLOGNA SANDWICH 7 $ American cheese, lettuce, yellow mustard, garlic mayo CONEY DOG 7 $ yellow mustard, onion, coney sauce SMALL FRY 4 $ Drink Specials BEER 4 $ any Edmund's Original beer WINE 6 $ House White, Red, or Rosé COCKTAILS 8 $ Edmund’s Old Fashioned or House Gimlet Every Sunday 11 a.m. - 3 p.m. | Vinyl DJ 12 p.m. - 4 p.m. Rotating Brunch Buffet Adults 32 $ Children (Under 12) 20 $ Reservations Order Online Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Edmund’s Original | Formerly Edmund's Oast, an American Restaurant in Charleston, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "5461e7507a98",
      "downloadedAt": "2026-01-18T16:56:06.987Z",
      "trimmedAt": "2026-01-18T17:05:08.982Z",
      "sizeReduction": "94.4%"
    },
    {
      "url": "https://www.edmundsoriginal.com/location/edmunds-original-bowero/",
      "text": "Main content starts here, tab to start navigating Edmund's Original The Bower Slide 1 of 2 Slide 2 of 2 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Hours & Location 1081 Morrison Dr., Charleston, SC 29403 1 (843) 727-1145 edmundsoriginal@theindigoroad.com Outdoor Hours: Monday - Friday: 3 p.m. - 10 p.m.Saturday & Sunday: 11 a.m. - 10 p.m. Happy Hour Monday - Friday: 3 p.m. - 6 p.m. Brunch Buffet Every Sunday: 11 a.m. - 3 p.m. Welcome to The Bower Our covered courtyard bar and dining garden sits just beside the main restaurant. With fire pits, relaxed lounge seating, and a menu of shareable tavern fare, sandwiches, and drinks, The Bower offers a more casual side of Edmund’s Original. We’re walk-in only – no reservations needed – so stop by anytime for happy hour or a laid-back dinner under the open sky. Get Directions Reservations Order Online Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Edmund’s Original | Formerly Edmund's Oast, an American Restaurant in Charleston, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "8a14be7d0f72",
      "downloadedAt": "2026-01-18T16:56:06.458Z",
      "trimmedAt": "2026-01-18T17:05:08.991Z",
      "sizeReduction": "95.8%"
    },
    {
      "url": "https://www.edmundsoriginal.com/location/edmunds-original-dining/",
      "text": "Main content starts here, tab to start navigating Dining Room Slide 1 of 2 Slide 2 of 2 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Edmund's Original Main Dining 1081 Morrison Dr., Charleston, SC 29403 1 (843) 727-1145 edmundsoriginal@theindigoroad.com Monday - Friday: 3 p.m. - 10 p.m.Saturday & Sunday: 11 a.m. - 10 p.m. Indoor Dining Hours: Happy Hour (Bar Only) Monday - Friday: 3 p.m. - 6 p.m. Step Inside the Dining Room Where the spirit of the American tavern is reimagined with polish and purpose. This intimate space is warm, storied, and a touch elevated, offering a menu that blends comforting classics with culinary curiosity. Expect thoughtful service, a well-traveled wine list, and an atmosphere that invites you to linger. Reservations recommended. Get Directions Reservations Order Online Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Edmund’s Original | Formerly Edmund's Oast, an American Restaurant in Charleston, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "bb81a4dafd97",
      "downloadedAt": "2026-01-18T16:56:05.933Z",
      "trimmedAt": "2026-01-18T17:05:08.997Z",
      "sizeReduction": "95.9%"
    },
    {
      "url": "https://www.edmundsoriginal.com/?y_source=1_MjAwNDAzMDE2OS03MTUtbG9jYXRpb24ud2Vic2l0ZQ%3D%3D",
      "text": "Home Main content starts here, tab to start navigating Slide 1 of 6 Slide 2 of 6 Slide 3 of 6 Slide 4 of 6 Slide 5 of 6 Slide 6 of 6 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides A Modern Tavern for the Curious Palate. Welcome to Edmund’s Original (Formerly Edmund's Oast) — where Southern hospitality meets thoughtful cooking in a setting built for gathering. Rooted in the spirit of the American tavern, our approach is warm, seasonal, and quietly adventurous. Whether you’re here for a drink with friends or a full-course dinner, you’ll find familiar flavors elevated by a curious hand. The Bower Indoor Dining Events & Private Dining Order Online About the Menu Our menu starts with comfort and ends with a little surprise. We serve American tavern fare inspired by the Lowcountry and lightly touched by flavors from across the world — think layered sauces, bright herbs, and inventive sides. It’s food that feels both classic and new, made to be shared or savored solo. Bower Menu Main Dining Menu About the Bower The courtyard is our sun-drenched hideaway — casual, open, and designed for lingering. With both covered and uncovered seating, cozy fire pits, and garden-style tables, it’s ideal for spontaneous happy hours and laid-back dinners under the Charleston sky. Visit Bower About the Dining Room Inside, the dining room channels the warmth of a timeless tavern — intimate lighting, rich materials, and a touch of polish. Open for dinner only, it’s our more elevated space, perfect for deeper conversations, a bottle shared, and dishes that call for a little extra attention. Visit Dining Room Our Story What began as a neighborhood brewery has evolved into something more A restaurant grounded in tradition but not bound by it. At Edmund’s Original, we celebrate craftsmanship, curiosity, and the joy of a well-cooked meal. We honor the classics, add our own twist, and always leave room for something unexpected. Read Story Reservations We accept reservations for the main dining room. Walk-ins are always welcome both inside and in The Bower. Whether you’re planning a casual happy hour, a long dinner, or something in between — we’d love to host you. Reserve Your Table Pull up a chair — we’ll bring the updates. Sign up to hear about new menus, events, and the occasional off-menu surprise. Join our Mailing List “One of Charleston’s most beloved dining destinations — refined, familiar, and always a little bit unexpected.” – Charleston City Paper Top 10 Unmissable Restaurants in the South - Condé Nast Traveler Reservations Order Online Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Edmund’s Original | Formerly Edmund's Oast, an American Restaurant in Charleston, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "c1ba8997f6c1",
      "downloadedAt": "2026-01-18T16:56:05.868Z",
      "trimmedAt": "2026-01-18T17:05:09.009Z",
      "sizeReduction": "94.5%"
    },
    {
      "url": "https://www.edmundsoriginal.com/main-dining/",
      "text": "Main content starts here, tab to start navigating Main Dining Menus Dinner Dessert Cocktails Beer Wine Sunday Brunch Restaurant Week Snacks Spicy Pimento Cheese 14 $ Peanuts, Steen’s cane syrup, ritz Thai Shaved Papaya 15 $ tomatoes, peanuts, nüøc cham Butter Bean Hummus 16 $ Cucumber, radish, pepitas, herbs Dim Sum Shrimp Toast 16 $ Sesame, sour soy New Orleans BBQ Escargot 16 $ Jalepeños, parsley, baguette Crab Cake 23 $ Cherry tomatoes, herbs, cucumber, jalapeño Plates Pickled Shrimp* 20 $ Grilled rye, aioli, pickled vegetables, herbs Smoked Salmon Toast* 20 $ Grilled rye, aioli, soy pickled cucumbers, arugula, sesame EO Cheeseburger 16 $ B&b pickles, onion, tomato, special sauce Artisan Meat Share Cheeseburger 16 $ Bacon jam, lettuce, onion, mustard, jalapeño Curried Vegetables 19 $ Red curry, seasonal vegetables, basmati, peanuts Spicy Korean Meatballs 18 $ Scallions, pineapple, basmati Mushrooms + Rice Noodles 18 $ Onions, peas, cilantro, basil Add fried chicken 6 $ Add grilled chicken 8 $ Add poached shrimp 9 $ Add smoked salmon 10 $ Salt Chicken 25 $ Green curry, basmati, makrut lime Mi Krop Salmon* 30 $ Crispy rice noodles, sweet + sour, bok choy Pork Skirt Steak* 32 $ Farro, shiitakes, maitakes, black garlic jus Catfish + Grits with Andouille Gravy 27 $ Cornmeal fried catfish, chives, parsley Local Fish + Shrimp Stew 30 $ White grits, paprika sauce, herbs Salads Crunchy Salad 16 $ Apples, almonds, raisins, chickpea flour, green goddess Add fried chicken 6 $ Add grilled chicken 8 $ Add poached shrimp 9 $ Add smoked salmon 10 $ Caesar Salad* 16 $ Too much dressing, croutons, parm Add fried chicken 6 $ Add grilled chicken 8 $ Add poached shrimp 9 $ Add smoked salmon 10 $ Ginger Salad 13 $ cucumber, radish, shallot, sesame Today’s Specials ORIGINAL • KOREAN • GARLIC CRAB NEW ORLEANS BBQ • SPICY Fried Chicken 8 Piece 36 $ Collards, pasta salad, pinto beans n’ rice 4 Piece 21 $ Collards, pasta salad 2 Piece 17 $ Collards, pasta salad all steaks served with garlic butter + sea salt Chargrilled Steaks 12 oz NY Strip* 36 $ 24 oz Ny Strip* 62 $ 8 oz Filet Mignon* 33 $ 8 oz Flat Iron* 32 $ Shareable Sides Mac N’ Peas 10 $ Fish Sauce + Vinegar Chips 7 $ Fries 7 $ Black Garlic Green Beans 8 $ Salt Crusted Loaded Baked Potato 9 $ Grilled Bok Choy 8 $ Spicy Tamarind Sauce and peanuts Crispy Garlic Potatoes 10 $ Roasted Mushrooms 10 $ Charred Onions 7 $ Miso Butter Pinto Beans + Rice 7 $ Spicy Collards 8 $ Pasta Salad 8 $ Desserts Red Velvet \"Cheese Cake\" Cake 15 $ white chocolate anglaise Key Lime Pie 14 $ Coconut lime tuile and candied lime peel gluten free Classic Tiramisu 14 $ Espresso, marscapone, kahlua Chocolate Cake 16 $ Chocolate truffle icing, chocolate buttercream Banana Pudding 12 $ Toasted meringue, wafers, bananas gluten free Brookie 6 $ Dense brownie meets a chocolate chip cookie House Made Ice Cream by The Scoop 8 $ Vanilla, funfetti, cookies & cream, and honey + pear sorbet House Classic Cocktails French 75 13 $ Gin, lemon, bubbly (substitute cognac +$3) Agricole Daiquiri 14 $ Neisson Agricole Blanc Rhum, lime, sugar Navy Strength Gimlet 16 $ Scapegrace navy strength gin, lime cordial New Orleans Espresso Martini 15 $ espresso, La Gritoña, Hoodoo Chicory liqueur, demerara Morbid Obsessions 14 $ Gin, campari, blood orange vermouth, oloroso Whiskey Sour* 14 $ Bourbon, egg white, lemon Edmund’s Old Fashioned 13 $ Bourbon, raw sugar, plenty of bitters Edmund’s Martini Service 17 $ Blend of gins, dry vermouth, orange bitters, all the garnishes The Red Wedding 15 $ Bourbon, averna, hibiscus ice cubes Edmund’s Original Summer Selections Featured Cocktail List The Ipkiss 16 $ cardamom + sage mezcal, cloosterbitter, lime, alpine amaro... Smmmokin! Tiger Upercutt 16 $ añejo tequila, thai cashew orgeat, yuzu curaçao, lime Low Country Martini 16 $ oyster infused gin, carolina gold rice blanc vermouth no substitutions please That no-good Jimmy Brown 16 $ chocolate milk-washed rum punch, calvados, orange, vanilla, walnut liqueur False Riffle 16 $ Hat Trick Gin, rosé, strawberry shrub, lemon, soda Other Fun Stuff Atxa Sweet Vermouth 10 $ White or Red, served chilled, we recommend on the rocks with an orange twist Razzle Dazzle (Thc Cocktail) 15 $ Nowadays 5mg THC spirit, blackberry raspberry shrub, lemon, soda Nowadays- 5 Mg Thc Beverage 10 $ Natural fruit flavors, bright, refreshing served over ice or with your favorite mixer Edmund’s Original House Beer House Blonde - 4.5% 16oz 8 $ Light bodied, crushable, refreshing A Light Breakfast - 4.5% 8 $ golden ale, coffee cacao nibs, lactose, crushable Festbier - 5.9% 12oz 8 $ German-style pale lager, honey, light toast Off the Shire- 5.4% 12oz 8 $ New Zealand- style pilsner, white wine, gooseberry The Local Pride - 3.7% 12oz 8 $ English Ordinary Bitter, toast earthy, session-able Winter's Calling - 5.8% 12oz 8 $ rye farmhouse ale, spruce tips, resinous, citrus, herbal Beneath the Thorns - 4.9% 12oz 8 $ blackberry and peach sour Bellweather -5.9% 12oz 8 $ German-style pale ale, soft cirtrus, floral Summer Practice - 6.1% Carolina gold rice IPA, el dorado hop, bright Pint 8 $ Pitcher 32 $ Toucan's Feather- 4.3% 12oz 8 $ Irish stout, dry, roasted coffee, chocolate Darker Lariat- 4.3% 12oz 8 $ German-style dunkel, clove, banana, full body Flannel Stories- 5.4% 12oz 8 $ brown ale, smoked malt, dark chocolate, warm The Lands Between - 10.4% 8oz 8 $ Imperial milk stout with lactose Realm of Shadow - 9.8% 8oz 8 $ Oak-aged dark ale Over the Hills - 11.9% 8oz 8 $ Old ale, sweet, molasses, malt finish Cider + Seltzer Wolffer Estate Dry Rose Cider, NY - 6.9% 8oz 9 $ Slightly sweet, crisp, refreshing Untitled Art, Florida Seltzer Blackberry Agave, WI-5% 12oz 9 $ Tart & Sour Guests EOBC, Lemon Lime, SC- 5.5% 12oz 8 $ American sour ale EOBC, Sour Cranberry, SC- 5.5% 12oz 8 $ American sour ale EOBC, Sour Cherry Pineapple, SC 5.5% 12oz 9 $ American sour ale Munkle, Oud Brune, SC 6.4% 12oz 9 $ Flemish-inspired brown ale, barrel rested, super complex Non-Alcoholic Options Westbrook, NA Keylime Gose, SC 12oz 6 $ lime, subtly tart Untitled Art, NA Italian Pilsner, WI 12oz 6 $ light, crisp Untitled Art, NA IPA, WI 12oz 6 $ juice, hoppy EOBC, Devil's Foot NA Margarita, SC (GF) 12oz 6 $ lime, orange, salt, cane syrup, honey Sweatman's Garden, Bouquet Lemonade, SC 12oz 7 $ floral, lemon, bubbly Sweatman's Garden, Ginger Beer, SC 12oz 7 $ ginger, sugar, bubbly Fizza, THC Kombucha Almondcello, SC-0% 12oz 9 $ refreshing, almond, citrus, contains 5mg THC Cask Feature The Local Pride - 3.7% 12oz 8 $ English Ordinary Bitter, toast earthy, session-able Golden Guests Resident Culture, Island Time, NC- 4.5% 12oz 9 $ Mexican-style lager, corn, lime, zest, clean Fonta Flora, Nebo Pilsner, NC- 5.2% 12oz 9 $ pilsner lager, creamy, mild hop, luscious EOBC, Cereal for Dinner, SC 5% 12oz 9 $ blonde ale, vanilla, almond, coconut, lactose Westbrook, White Thai, SC, 5% 12oz 9 $ Witbier, lemongrass, ginger, bright Munkle, Coffee Blonde, SC - 5.9% 12oz 9 $ blonde ale, coffee bean conditioned Coast, Following Seas, SC- 4.7% 12oz 9 $ Helles lager, effervescent, drinkable Westbrook, A Very Fine Lager, SC - 5% 12oz 9 $ American lager, clean, crisp Westbrook, Beer to Drink When it's Hot Outside, SC- 4.5% 12oz 9 $ German lager, key lime, flaked corn Hoppy Guests EOBC, Mix Tapes Vol. 2, SC- 6.5% 12oz 9 $ hazy IPA, green mango, tropical trail mix Maine, Lunch, ME- 7% 12oz 9 $ New England IPA, caramel, citrus, floral Lost in the Forest, EOBC, SC- 7.5% 12oz 9 $ spruce tip IPA, citrus peel, winter forest, burly Ghost Inside Our Bones, Burial, NC- 8% 12oz 9 $ double IPA, cryo-citra hop, cascade, haze Game Room, EOBC, SC- 8% 12oz 9 $ double pale ale, golden hop, lemon merengue, watermelon cream Plasma Gun, EOBC, SC- 8% 12oz 9 $ IPA, naval orange, papaya, white grapefruit, hop-splosion Dark & Stout Guests EOBC, Company Scrip, SC- 5.4% 12oz 9 $ English-style pale ale, Yorkshire yeast, biscuit, honey Southern Hops Brewing Co, Rooster Red, SC 5.2% 12oz 9 $ medium-bodied ale, malt forward, low bitterness Special Dark, EOBC, SC- 5.5% 12oz 9 $ Czech-style dark lager, hazelnut coffee, dried cherry, refined Munkle, My Freckled Friend, SC- 5.8% 12oz 9 $ English ale, copper color, classically balanced Nightcap, EOBC, SC- 6.3% 12oz 9 $ dark ale, cocoa, cinnamon, nutmeg, rich EOBC, Leather Jacket, SC- 6.5% 12oz 8 $ American porter, earthy chocolate, oak Sparkling Cremant Elise, Loire, France NV Glass 10 $ Bottle 49 $ Brut Rosé Raventos Blanc, Catalonia, Spain, 2022 Glass 13 $ Bottle 64 $ Moscato D’Asti 30 $ Elio Perrone, Piedmont, Italy (Half Bottle, 375ml) Champagne Extra Brut 135 $ Frederic Savart L'ouverture, Champagne, France NV Champagne Brut Reserve 140 $ Bereche & Fils, Champagne, France NV Champagne Brut Reserve 95 $ Louis Nicaise, Champagne, France, NV Whites by the Glass Sauvignon Blanc Les Chârtes, Touraine, Loire Valley, France 2023 Glass 13 $ Bottle 51 $ Chardonnay Le P'tit Paysan, Monterey, California 2023 Glass 15 $ Bottle 59 $ Rosé Muga Rioja, Spain '24 Glass 13 $ Bottle 50 $ Chenin Blanc Pax, Helios, California 2024 Glass 14 $ Bottle 56 $ Reds by the Glass Grenache/Syrah Château Pesquié \"Terrasses\" Rhone Valley, France 2022 Glass 12 $ Bottle 47 $ Nebbiolo Angelo Negro \"Angelin\" Langhe, Piedmont, Italy 2023 Glass 15 $ Bottle 59 $ Cabernet Sauvignon Valravn, Sonoma, California, 2021 Glass 17 $ Bottle 67 $ Pinot Noir In Sheep's Clothing, Dundee, Oregon 2023 Glass 16 $ Bottle 75 $ Red Blend Alpine, California Glass 10 $ Bottle 40 $ White Sancerre 79 $ Domaine La Barbotaine, Loire Valley, FR '23 Dry Riesling 63 $ Hermann Donnhoff, Nahe, Germany ‘23 Albariño 70 $ Alberto Nanclares “Dandelion”, Val Do Salnes, Rias Baixas, Spain ‘23 Grenache Blanc 83 $ Amevive , Santa Barbara, California ‘22 Pinot Gris 55 $ Belle Pente, Willamette Valley, Oregon 2019 Chardonnay 100 $ Lioco, Russian River, California ‘22 Red Gamay 72 $ Domaine Diochon Moulin-A-Vent, beaujolais, fr '23 Grenache 84 $ A Tribute to Grace, santa barbara county, ca '23 Pinot Noir 68 $ Lemelson Vineyards \"Thea's Selection,\" willamette valley, or '22 Pinot Noir 95 $ Jean Fournier, Marsannay, Burgundy, France ‘22 Syrah 128 $ Arnot Roberts, Sonoma Coast, California ‘22 Aglianico Del Vulture 65 $ Musto Carmelitano \"Pian Del Moro,\" basilicata, it '23 Cabernet Franc 88 $ Andre Will \"Two Blondes,\" columbia valley, washington state '21 Cabernet Sauvignon 120 $ Crossbarn by Paul Hobbs, sonoma county, ca '20 Every Sunday 11 a.m. - 3 p.m. | Vinyl DJ 12 p.m. - 4 p.m. Rotating Brunch Buffet Adults 32 $ Children (Under 12) 20 $ Available for South Carolina Restaurant Week January 8-18 3 course menu for $45 / person Choose One First Papaya Salad tomatoes, peanuts, nüøc cham Crunchy Salad apples, almonds, raisins, chickpea flour, green goddess Japanese Steakhouse-Style Ginger Salad cucumber, radish, shallot, sesame Chicken and Sausage Gumbo Choose One Second Braised Lamb Biryani cucumber, tomato, yogurt Beef Stroganoff egg noodles, mushrooms, dill Red Curry & Catfish Grits cornmeal fried catfish, chives, parsley Choose One Dessert Banana Pudding salted caramel, meringue Peanut Butter Cup Pie creamy peanut butter, rich milk chocolate ganache (gf) Reservations Order Online Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Edmund’s Original | Formerly Edmund's Oast, an American Restaurant in Charleston, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "d0ab0a454cbc",
      "downloadedAt": "2026-01-18T16:56:08.613Z",
      "trimmedAt": "2026-01-18T17:05:09.085Z",
      "sizeReduction": "93.1%"
    },
    {
      "url": "https://www.edmundsoriginal.com/private-events/",
      "text": "Main content starts here, tab to start navigating Private Events Slide 1 of 4 Slide 2 of 4 Slide 3 of 4 Slide 4 of 4 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Edmund’s Original represents a unique collection of dining and imbibing experience with a wide range of event spaces to accommodate any group or budget. Each venue represents a passion for high quality with an attention to detail in both service and selection. Inquire Now Main Dining Room With its beautiful high ceilings, comfortable seating and exquisite flourishes, the Main Dining Room is an elegant and versatile space that has something for everyone. The Main Dining Room can comfortably seat 100 guests for a sit-down rehearsal dinner, or we can remove some tables and throw an unforgettable cocktail party for 150 guests. From our open kitchen where you can see our talented chefs hard at work to our bar boasting up to 48 taps and an encyclopedic array of spirits the Main Dining Room offers an elevated experience with no rain plan needed. The Exchange The Exchange is our breathtaking event space that boasts two levels of honeyed pine floors and walls. This exquisite space is perfect for a cocktail party with heavy hors d’oeuvres for up to 80 guests or a dreamy, seated dinner for up to 60 guests. This unique space is sure to have your guests talking about it for years to come. The Entire Restaurant Renting out the entire restaurant includes all rooms available. It allows for rehearsal dinners to have a proper cocktail hour outside before guests come in for dinner. It also allows for up to 300 people to enjoy live music, order drinks at either bar, watch the sun set in the courtyard or even a bourbon bar in the Library room. Perhaps best of all, onsite parking is plentiful. The Library The Library is a completely private, intimate rectangular room near the kitchen of the main dining room. It can seat up to 32 people comfortably and could hold up to 45 people standing. The Library has a wall of windows with velvet curtains that can provide as little or as much privacy as you’d like. The Library is the only event space with a television screen and AV capabilities making it ideal for corporate banquets. This room is the perfect spot for private dinners, happy hours, bridal/baby showers, lectures, wine/beer tastings, and much more. The Bower This open timber-framed structure is the ideal backdrop for a variety of events and parties. Long wooden community tables are available for seated dinners of up to 100 people. The space is also ideal for parties and functions that can overflow in the adjacent courtyard. The entire space allows for up to 200 people standing. The Bower is a super flexible space that can host parties ranging from a corporate happy to a 100 person seated dinner to a lively dance floor. The Bower has fans for summer days and industrial ceiling heaters for the winter evenings. Both sides of The Bower have optional screens for privacy and intimacy. The Bower is complete with a full walkup bar. Inquire Now Reservations Order Online Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Edmund’s Original | Formerly Edmund's Oast, an American Restaurant in Charleston, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Private Event Software powered by Tripleseat Slide 1 of 6 Slide 2 of 6 Slide 3 of 6 Slide 4 of 6 Slide 5 of 6 Slide 6 of 6 Slide 1 of 7 Slide 2 of 7 Slide 3 of 7 Slide 4 of 7 Slide 5 of 7 Slide 6 of 7 Slide 7 of 7 Slide 1 of 6 Slide 2 of 6 Slide 3 of 6 Slide 4 of 6 Slide 5 of 6 Slide 6 of 6 Slide 1 of 6 Slide 2 of 6 Slide 3 of 6 Slide 4 of 6 Slide 5 of 6 Slide 6 of 6 Slide 1 of 6 Slide 2 of 6 Slide 3 of 6 Slide 4 of 6 Slide 5 of 6 Slide 6 of 6",
      "hash": "f7103f6b5ecb",
      "downloadedAt": "2026-01-18T16:56:08.081Z",
      "trimmedAt": "2026-01-18T17:05:09.107Z",
      "sizeReduction": "96.6%"
    },
    {
      "url": "https://www.edmundsoriginal.com/charleston-private-event-spaces/",
      "text": "Main content starts here, tab to start navigating Private Events Slide 1 of 4 Slide 2 of 4 Slide 3 of 4 Slide 4 of 4 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Edmund’s Original represents a unique collection of dining and imbibing experience with a wide range of event spaces to accommodate any group or budget. Each venue represents a passion for high quality with an attention to detail in both service and selection. Inquire Now Main Dining Room With its beautiful high ceilings, comfortable seating and exquisite flourishes, the Main Dining Room is an elegant and versatile space that has something for everyone. The Main Dining Room can comfortably seat 100 guests for a sit-down rehearsal dinner, or we can remove some tables and throw an unforgettable cocktail party for 150 guests. From our open kitchen where you can see our talented chefs hard at work to our bar boasting up to 48 taps and an encyclopedic array of spirits the Main Dining Room offers an elevated experience with no rain plan needed. The Exchange The Exchange is our breathtaking event space that boasts two levels of honeyed pine floors and walls. This exquisite space is perfect for a cocktail party with heavy hors d’oeuvres for up to 80 guests or a dreamy, seated dinner for up to 60 guests. This unique space is sure to have your guests talking about it for years to come. The Entire Restaurant Renting out the entire restaurant includes all rooms available. It allows for rehearsal dinners to have a proper cocktail hour outside before guests come in for dinner. It also allows for up to 300 people to enjoy live music, order drinks at either bar, watch the sun set in the courtyard or even a bourbon bar in the Library room. Perhaps best of all, onsite parking is plentiful. The Library The Library is a completely private, intimate rectangular room near the kitchen of the main dining room. It can seat up to 32 people comfortably and could hold up to 45 people standing. The Library has a wall of windows with velvet curtains that can provide as little or as much privacy as you’d like. The Library is the only event space with a television screen and AV capabilities making it ideal for corporate banquets. This room is the perfect spot for private dinners, happy hours, bridal/baby showers, lectures, wine/beer tastings, and much more. The Bower This open timber-framed structure is the ideal backdrop for a variety of events and parties. Long wooden community tables are available for seated dinners of up to 100 people. The space is also ideal for parties and functions that can overflow in the adjacent courtyard. The entire space allows for up to 200 people standing. The Bower is a super flexible space that can host parties ranging from a corporate happy to a 100 person seated dinner to a lively dance floor. The Bower has fans for summer days and industrial ceiling heaters for the winter evenings. Both sides of The Bower have optional screens for privacy and intimacy. The Bower is complete with a full walkup bar. Inquire Now Reservations Order Online Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Edmund’s Original | Formerly Edmund's Oast, an American Restaurant in Charleston, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Private Event Software powered by Tripleseat Slide 1 of 6 Slide 2 of 6 Slide 3 of 6 Slide 4 of 6 Slide 5 of 6 Slide 6 of 6 Slide 1 of 7 Slide 2 of 7 Slide 3 of 7 Slide 4 of 7 Slide 5 of 7 Slide 6 of 7 Slide 7 of 7 Slide 1 of 6 Slide 2 of 6 Slide 3 of 6 Slide 4 of 6 Slide 5 of 6 Slide 6 of 6 Slide 1 of 6 Slide 2 of 6 Slide 3 of 6 Slide 4 of 6 Slide 5 of 6 Slide 6 of 6 Slide 1 of 6 Slide 2 of 6 Slide 3 of 6 Slide 4 of 6 Slide 5 of 6 Slide 6 of 6",
      "hash": "f79f42b31a20",
      "downloadedAt": "2026-01-18T16:56:07.517Z",
      "trimmedAt": "2026-01-18T17:05:09.127Z",
      "sizeReduction": "96.6%"
    }
  ],
  "sizeReduction": "95.1%"
}