{
  "venueId": "ChIJMfZabtRk_ogRG4yD2ruZPAY",
  "venueName": "The CODfather, Proper Fish & Chips",
  "venueArea": "North Charleston",
  "website": "http://thecodfatherchippy.com/",
  "scrapedAt": "2026-01-18T17:04:25.577Z",
  "trimmedAt": "2026-01-18T17:07:13.483Z",
  "pages": [
    {
      "url": "http://thecodfatherchippy.com/",
      "text": "Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! Job Listings Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! 4254 Spruill Avenue, North Charleston, SC 29405 map marker pin Welcome to The Codfather Proudly serving our world famous authentic British fish and chips since 2016. We use only the best North Atlantic cod fillets, dipped in our traditional wet batter and served with hand cut chippy chips. Located in Park Circle, North Charleston we are the original and only proper fish and chips shop in the Lowcountry. Our menu Order Online Lets 'ave a proper chippy..! Ready for a portion of proper fish and chips..? Click the order now button below to see our menu. Order now The CODfather, Proper Fish & Chips The CODfather, Proper Fish & Chips The CODfather, Proper Fish & Chips The CODfather, Proper Fish & Chips The CODfather, Proper Fish & Chips The CODfather, Proper Fish & Chips The CODfather, Proper Fish & Chips The CODfather, Proper Fish & Chips The CODfather, Proper Fish & Chips The CODfather, Proper Fish & Chips The CODfather, Proper Fish & Chips The CODfather, Proper Fish & Chips The CODfather, Proper Fish & Chips The CODfather, Proper Fish & Chips The CODfather, Proper Fish & Chips The CODfather, Proper Fish & Chips We are hiring and want to hear from you We are looking for great people to join our amazing team! Check out our current job openings and apply with just a few clicks! Apply Now for a job Reviews Review by Google Keki W.: They have the best fish and chips I have ever eaten. The tarter sauce is an excellent blend. It has a touch of sweetness. I will definitely be taking this drive again. Review by Google Renee O.: Hidden gem for sure! English fish & chips with the BEST tartar sauce I’ve ever had. It’s very light, creamy and savory with a nice amount of dill. (No tangy pickle relish jarred tartar sauce here!) The staff was super nice and the food came out quick and piping hot. Review by Google Deborah S.: This was the best fish, chips, curry sauce and smashed peas! It was a very popular stop and we are grateful it was our first stop after arriving in town! The fish was crispy and cooked to perfection. The portion was exceptional and the curry sauce or chip “gravy” was delish! Enjoyed every morsel! Review by Google Andrea N.: This place is fantastic!!! The service was top notch! And the food was even better! When they say proper fish and chips they aren't lying! Perfectly cooked and huge portions! I would 100% recommend this place and go back if I am ever in the area. We ordered the World Famous Fish and Chips and the fish sandwich. Review by Google Justin B.: Great experience, as usual. I've been here several times and try to drop in any time I'm in Charleston over lunch. Good food and friendly staff. Highly recommend it. Stop reviews carousel Play reviews carousel Newsletter Location 4254 Spruill Avenue North Charleston, SC 29405 Hours Sun, Mon, Tue, Wed, Thur, Fri, Sat 11:00 AM - 9:00 PM Find us on... Instagram page Google page Contact us (843)-789-4649 Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "05fde20f5169",
      "downloadedAt": "2026-01-18T17:01:37.636Z",
      "trimmedAt": "2026-01-18T17:07:13.475Z",
      "sizeReduction": "97.4%"
    },
    {
      "url": "http://thecodfatherchippy.com/north-charleston-the-codfather-proper-fish-and-chips-drink-menu",
      "text": "Our Drinks Soft Drinks Beer and Wine",
      "hash": "66d6e51f38be",
      "downloadedAt": "2026-01-18T17:01:38.411Z",
      "trimmedAt": "2026-01-18T17:07:13.478Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://thecodfatherchippy.com/north-charleston-the-codfather-proper-fish-and-chips-food-menu",
      "text": "Our Menu Menu",
      "hash": "9838979cd3bf",
      "downloadedAt": "2026-01-18T17:01:37.780Z",
      "trimmedAt": "2026-01-18T17:07:13.481Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://thecodfatherchippy.com/north-charleston-the-codfather-proper-fish-and-chips-events",
      "text": "Events We are updating our events Please stay tuned",
      "hash": "c69f6d8cf1d7",
      "downloadedAt": "2026-01-18T17:01:39.052Z",
      "trimmedAt": "2026-01-18T17:07:13.483Z",
      "sizeReduction": "99.9%"
    }
  ],
  "sizeReduction": "99.0%"
}