{
  "venueId": "ChIJFXkWa-x-_ogRjzcq72m3hlQ",
  "venueName": "Ji Pizza",
  "venueArea": "West Ashley",
  "website": "http://ji-pizza.com/",
  "scrapedAt": "2026-01-18T17:04:24.590Z",
  "trimmedAt": "2026-01-18T17:05:25.495Z",
  "pages": [
    {
      "url": "http://ji-pizza.com/menu",
      "text": "Build Your Own All pizzas made with freshly made dough, mozzarella, and tomato sauce 14\" Cheese Pizza $13 Full Topping 2.00 Half Topping 1.50 18\" Cheese Pizza $17 Full Topping 3.00 Half Topping 2.00 24\" Cheese $23 Full Topping 4.00 Half Topping 3.00 Calzone $10 Mozzarella and Ricotta served with a side of Marinara Additional toppings $1 Stromboli $12 Pepperoni, Sausage, Ham, Mozzarella Additional toppings $1 Toppings Pepperoni, Sausage, Ham, Bacon, Meatball, Chicken, Salami Tomato, Onion, Spinach, Green Peppers, Black Olive, Green Olive, Red Pepper, Artichoke Heart, Banana Peppers, Mushroom, Pineapple, Basil, Cilantro Mozzarella, Cheddar, Feta, Ricotta, Gouda Specialty Pies Carnivore $18/ $25/$34 Pepperoni, Sausage, Ham, Bacon Tree Hugger $18/$25/$34 Tomato, Green Pepper, Mushroom, Onion, Black Olive Supreme $19/$26/$34 Pepperoni, Sausage, Mushroom, Onion, Green Pepper, Black Olive Great White $17/$22/$30 Olive Oil Base, Ricotta Cheese, Mozzarella, Provolone, Parm, Love Margarita $17/$20/$30 Olive Oil Base, Tomato, Basil Islander $19/$25/$34 Olive Oil Base, Spinach, Tomato, Mushroom, Artichoke Heart, Basil Cowboy $19/$25/$34 BBQ Sauce Base, Chicken, Green Peppers, Onion, Gouda, Cilantro Ranch Hand $19/$25/$34 Ranch Base, Chicken, Tomato, Bacon, Onion, Cheddar Spicy Buddha $19/$25/$34 Thai Peanut Sauce, Chicken, Red Pepper, Gouda, Cilantro Thee Goddess $22/$30/$42 Olive Oil Base, Ricotta, Spinach, Chicken, Mushroom, Tomato, Onion, Red Pepper, Gouda, Love Sandwiches All subs are on a toasted Amoroso roll Club $10 Chicken, Ham, Bacon, Cheddar, Lettuce, Tomato, Onion, Mayo Cheesesteak $12 Steak, Onion, Green Pepper, Cheese, Love Chicken Ranch $10 Chicken, Bacon, Ranch, Onion, Tomato, Mozz, Cheddar Italian $10 Ham, Pepperoni, Salami, Lettuce, Tomato, Onion, Italian Sauce, Mozz Meatball Or Chicken Parm $10 Your Choice of Meat, Marinara, Mozz, Love Cowgirl $10 BBQ Chicken, Onion, Green Pepper, Gouda Buff Chick $10 Buffalo Chicken, Lettuce, Tomato, Mozz, Ranch Caesar $10 Romaine, Croutons, Parm, Caesar, Tomato, Onions Caprese $10 Mozz, Tomato, Extra Virgin Olive Oil, Basil, Love Salads Dressing Options: Ranch, Italian, Greek, Caesar. Add Cicken $2 Garden $7 Romaine, Tomato, Green Pepper, Onion, Mushroom, Cheddar Caesar $7 Romaine, Parm, Crouton, Caesar Dressing Greek $8 Romaine, Spinach, Onion, Black & Green Olive, Artichoke, Feta Antipasto $9 Romaine, Salami, Pepperoni, Ham, Black Olives, Onions, Banana Peppers, Mozz Chef $9 Romaine, Ham, Chicken, Tomato, Onion, Mozz, Cheddar Pasta Served with 2 Garlic Knots Spaghetti & Meatballs $10 Chicken Alfredo $10 Extras Cheesy Breasticks $9 Served with a side of Marinara Garlic Knots (6) $5 Fountain Soda $2 Bottled Water $2 Extra Dressing $2 Marinara $1 Homemade Brownies $5 All Prices Subject to Change without Notice Copyright © 2025 Ji Pizza - All Rights Reserved. Powered by This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept",
      "hash": "441ae1f20a15",
      "downloadedAt": "2026-01-18T17:02:38.973Z",
      "trimmedAt": "2026-01-18T17:05:25.485Z",
      "sizeReduction": "97.8%"
    },
    {
      "url": "http://ji-pizza.com/",
      "text": "Pizza by the slice All slices come off the giant 24\" pizza Pizza by the slice All slices come off the giant 24\" pizza Pizza by the slice All slices come off the giant 24\" pizza Pizza by the slice All slices come off the giant 24\" pizza Full Menu Let us take care of dinner tonight! Order Online Visit Us JI Pizza 2770 Maybank Highway, Johns Island, South Carolina 29455, United States 843-559-9200 Hours Today Closed Get directions Copyright © 2025 Ji Pizza - All Rights Reserved. Powered by This website uses cookies. We use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept",
      "hash": "92985929cf18",
      "downloadedAt": "2026-01-18T17:02:38.707Z",
      "trimmedAt": "2026-01-18T17:05:25.495Z",
      "sizeReduction": "99.3%"
    }
  ],
  "sizeReduction": "98.4%"
}