{
  "venueId": "ChIJUU2vYvF7_ogRcHnlV1ElYBE",
  "venueName": "Mario's Italian Grill",
  "venueArea": "West Ashley",
  "website": "https://mariosgrillpizza.com/",
  "scrapedAt": "2026-01-19T03:25:42.276Z",
  "trimmedAt": "2026-01-19T03:29:14.036Z",
  "pages": [
    {
      "url": "https://mariosgrillpizza.com/",
      "text": "[Page Title: Best Italian Restaurant in Charleston | Pizza & Pasta]\n\n15% OFF your first online order! Use code: MARIOS20. One-time per customer.\nGet Direction Order Online Call Now \n.\n(843) 766.2049 Order Online Call Now \n.\n(843) 766.2049 Italian Restaurant, Pizza & Pasta in West Ashley Charleston \nAuthentic Italian Cuisine\nMarios Italian Grill is a family-owned Italian restaurant in Charleston's West Ashley, where we proudly serve classic Italian dishes made fresh daily. Our diverse menu features not only traditional favorites like pizza and pasta but also popular options such as gyro wings, burgers, and even a Philly cheesesteak near me for those craving something different. Whether you’re dining in, picking up takeout, or enjoying pizza delivery, we are committed to providing the West Ashley community with quality food and friendly service. Authentic Italian Cuisine Italian Restaurant Charleston - Pizza & Pasta in West Ashley Visit Us \nSpecial Requests?\nHave questions about our menu, including our famous gyro wings burger or the best Philly cheesesteak near me? Contact Mario’s Italian Grill, the top Italian restaurant in Charleston, for takeout, dine-in, or pizza delivery. We’re happy to help! \nMarios Italian Grill\n\n1300 Savannah Highway, Charleston, SC, USA\n+1.8437662049 \nHours\n\nOpen today\n11:00 am – 11:00 pm Contact Us \nContact Us\nName Email* Attach Files Attachments (0) \nThis site is protected by reCAPTCHA and the Google and apply.\nPrivacy Policy Terms of Service Send Cancel Contact Us Copyright © 2026 Marios Italian Grill - All Rights Reserved. Powered by Privacy Policy Terms and Conditions \nThis website uses cookies.\nWe use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept",
      "hash": "327b82515c48",
      "downloadedAt": "2026-01-19T02:17:06.279Z",
      "trimmedAt": "2026-01-19T03:29:14.036Z",
      "sizeReduction": "98.7%"
    }
  ],
  "sizeReduction": "98.7%"
}