{
  "venueId": "ChIJb_hrEl1v_ogRLSap1ppDAPg",
  "venueName": "Indigo Reef Brewing Company",
  "venueArea": "Daniel Island",
  "website": "https://www.indigoreefbrewing.com/",
  "scrapedAt": "2026-01-19T02:19:35.992Z",
  "trimmedAt": "2026-01-19T02:25:55.355Z",
  "pages": [
    {
      "url": "https://www.indigoreefbrewing.com/packaged-beer",
      "text": "[Page Title: PACKAGED BEER | Indigo Reef Brewing Company]\n\ntop of page \nPACKAGED BEER\nPACKAGED BEER AVAILABLE TO-GO Subject to availability Barrel-Aged Hilma Hooker Brandy Barrel Aged Belgian Tripel \n9.5%\n\nABV\n\n25\n\nIBU\nSize: 22 oz. bottle Price: $16 Aged in Brandy barrels for over 12 months. This Belgian Tripel is very easy drinking and has a dry finish with subtle flavors of fruit and honey. To give this beer a fun IRBC twist, we added 60lbs of honey during fermentation. The Hilma Hooker was a ship of many names and uses. Its last use before sinking was actually for illegal drug shipping. It is now a dive site in Bonaire (one of many that Christopher and Nicole visited on their honeymoon). ​ Barrel-Aged Night Dive Milk Stout \n6.7%\n\nABV\n\n29\n\nIBU\nSize: 22 oz bottle Price: $15 Barrel Aged Night Dive, our Milk Stout, aged in Heaven Hill barrels forover 12 months. ​ Drift Dive Citra IPA \n6.0%\n\nABV\n\n63\n\nIBU\nSize: 6-pack (12oz cans) Price: $12 A similar recipe we brewed for our wedding beer, this Citra IPA uses Nugget, Mosaic and, of course, Citra hops! A clean, crisp, West Coast IPA if that’s what you’re craving. ​ Hive Another Honey Cream Ale \n6.0%\n\nABV\n\n13\n\nIBU\nSize: 6-pack (12oz cans) Price: $12 We started homebrewing in Wisconsin so naturally we like our cream ales with a little more ABV than you might be used to. We rounded out this beer with 30 lbs of honey but don’t think you are about to drink a glass full of sweat honey nectar. Honey is a fermentable sugar so the yeast already ate most of it before it could get to your glass. What they left behind is pretty tasty though! Awards: 2022 Best of Craft Beer - BRONZE Mola Mola Juicy IPA \n5.9%\n\nABV\n\n50\n\nIBU\nSize: 6-pack (12oz cans) Price: $13 Our Mola Mola (aka Sunfish) is a juicy, hazy IPA we know you’ll enjoy. We used Warrior, Citra, Amarillo, and Mosaic hops combined with London Fog yeast. Even if you traditionally don’t enjoy juicy/New England IPAs, we encourage you to give this one a try. It has the right amount of bitterness and juiciness to satisfy every type of IPA drinker. ​ Shelly Beach Blonde Ale \n5.6%\n\nABV\n\n18\n\nIBU\nSize: 6-pack (12oz cans) Price: $11 Our first beer on tap and now our first beer we've canned. The Shelly Beach Blonde Ale is easy to drink making it the perfect beer for a hot day or as a gateway into craft beer if you're new to the scene Awards: 2024 SC Brewers Cup - GOLD Wake Up Call Coffee Blonde Ale \n5.0%\n\nABV\n\n18\n\nIBU\nSize: 6-pack (12oz cans) Price: $12 Before coffee became widely available, beer was the popular breakfast drink of choice. We love both types of beverages so we decided to combine the two. Wake Up Call is our Shelly Beach Blonde Ale with coffee grounds from Charleston Coffee Roasters. We think it's the perfect brunch beer but really it can be enjoyed at any time of the day. Awards: 2024 SC Brewers Cup - GOLD / 2022 SC Brewers Cup - BRONZE See something you like? Place To-Go Order Beers on Tap bottom of page",
      "hash": "3ad1005e5194",
      "downloadedAt": "2026-01-19T02:06:19.454Z",
      "trimmedAt": "2026-01-19T02:25:54.751Z",
      "sizeReduction": "99.6%"
    },
    {
      "url": "https://www.indigoreefbrewing.com/",
      "text": "[Page Title: BREWERY & TAPROOM | Indigo Reef Brewing Company | Charleston, SC]\n\ntop of page FROM HOPES TO HOPS visit us in our taproom & learn what we are all about Learn More Let the bags fly and may the best team win! Register Now! Spots are limited. Don't miss out on the fun! BEERS ON TAP VIEW WHAT'S ON TAP PLACE TO-GO ORDER PLACE ORDER EVENTS UPCOMING EVENTS mERCH & aPPAREL VIEW MERCH & APPAREL Hours of Operation Monday........Closed Tuesday........4pm-9pm Wednesday...4pm-9pm Thursday......4pm-9pm Friday..........2pm-9pm Saturday......12pm-9pm Sunday........12pm-8pm To-go beer sales continue to be available during hours of operation. Call (843) 867-6015 or visit our Online Store to place an order for pick-up. Order Online bottom of page",
      "hash": "83291576475b",
      "downloadedAt": "2026-01-19T02:06:17.336Z",
      "trimmedAt": "2026-01-19T02:25:54.797Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "https://www.indigoreefbrewing.com/kitchen-menu",
      "text": "[Page Title: Cork & Crust | Indigoreefbrewing]\n\ntop of page Cork & Crust Welcome to Cork & Crust, your culinary haven. Renowned for our inventive twist on classic Italian dishes, we offer an unforgettable feast for the senses. Our dedicated team is passionate about delivering exceptional service paired with dishes that are bursting with flavor. Non-Pizza Hot Pretzel served with Indigo Reef beer cheese $9.45 Meatballs 3 meatballs with Cork & Crust's marinara and mozzarella cheese $12.60 Pepperoni Roll pepperoni & mozzarella cheese stuffed pizza roll w/ Cork and Crust marina sauce on the side $9.45 Bread Sticks fresh made breadsticks with Cork & Crust parmesan seasoning & marinara $7.35 Chicken Caesar Wrap Romaine lettuce, Cork & Crust dressing, parmesan (served with chips) $12.60 Meatball Sub meatballs with mozzarella cheese on fresh baked bread $12.60 Caesar Salad Romaine lettuce, Cork & Crust dressing, parmesan & croutons (add chicken $5.00) No Chicken $9.45 Chicken $14.70 Pizzas Cheese C&C tomato sauce, mozzarella $13.65 Pepperoni C&C tomato sauce, pepperoni, mozzarella $15.75 Marghertia C&C tomato sauce, fresh Buffalo mozzarella, basil $15.75 Meat Lovers C&C tomato sauce, pepperoni, prosciutto, sausage, mozzarella $17.85 Veggie C&C tomato sauce, roasted bell peppers, onion, mushrooms, mozzarella $16.80 Meatball C&C tomato sauce, meatballs, mozzarella $16.80 Sausage & Peppers C&C tomato sauce, Italian sausage, bell peppers, mozzarella $16.80 Build Your Own $13 plus $2 per topping\n\nPepperoni, prosciutto, Italian sausage, onions, bell peppers, mushrooms $13.65 Menu & Pricing Subject to Change bottom of page",
      "hash": "9fd3521e0aa5",
      "downloadedAt": "2026-01-19T02:06:20.720Z",
      "trimmedAt": "2026-01-19T02:25:54.859Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "https://www.indigoreefbrewing.com/all-irbc-beers",
      "text": "[Page Title: ALL IRBC BEERS | Indigo Reef Brewing Company]\n\ntop of page \nALL BEERS - PAST & PRESENT\n2020 Barrel-Aged Penny For The Ferryman \n8.7%\n\nABV\n\n28\n\nIBU\nBelgian Dark Strong Ale 2020. Aged in Basil Hayden Barrels. A wintery version of our Charming Devil. This lightly bittered beer will warm your heart with its caramel, raisin, and fruity aroma and flavor. You may be wondering where the beautiful color of the beer comes from. We like to credit the dark candied syrup incorporated into the boil. It's not too sweet though! The Belgian Strong Ale yeast finishes it drier than you might expect. Like the Charming Devil, this one is more dangerous than it tastes. ​ A Crunchy Peach \n5.0%\n\nABV\n\n6\n\nIBU\nPeach Kettle Sour w/ Cinnamon What does peach, cinnamon, and lactose combined in a kettle sour taste like? Like biting into a crunchy peach cobbler. The lactose (aka milk sugar) with the peach and cinnamon balance out the sourness of the beer to create a delicious experience for your tastebuds. ​ Ardennes \n5.7%\n\nABV\n\n27\n\nIBU\nAmerican Kolsch Scott Salamone's winning recipe from our homebrew competition in February 2020 that is light, crisp, and refreshing. The Hallertauer Mittelfrueh hops will provide a lightly flowery and spicy aroma but the body of the beer comes from the Vienna malt. We think you'll enjoy this American twist on a German classic. ​ Barrel Aged Penny For The Ferryman \n8.7%\n\nABV\n\n28\n\nIBU\nBelgian Dark Strong Ale Aged in Cabernet Sauvignon Barrels for 9 months. A wintery version of our Charming Devil. This lightly bittered beer will warm your heart with its caramel, raisin, and fruity aroma and flavor. You may be wondering where the beautiful color of the beer comes from. We like to credit the dark candied syrup incorporated into the boil. It's not too sweet though! The Belgian Strong Ale yeast finishes it drier than you might expect. Like the Charming Devil, this one is more dangerous than it tastes. ​ Barrel-Aged Butter Go Nuts \n7.1\n\nABV\n\n68\n\nIBU\nBarrel-Aged Peanut Butter Porter Our Butter Go Nuts after sitting in Basil Hayden barrels for over 12 months. Our peanut butter porter is full of peanut butter powder and cocoa nibs added during the boil and in secondary to give it a nice resemblance to a Reese Cup. If you like a punch of peanut butter to the nose, we recommend getting the beer served with regular beer gas. If you like your PB creamy, try it on nitro! ​ Barrel-Aged Cenotes \n6.7%\n\nABV\n\n20\n\nIBU\nMexican Lager We took Cenotes (our Mexican lager) and kicked it up a notch by aging it in Tequila barrels and then adding Sea Salt and Lime to it. ​ Barrel-Aged Charming Devil \n9.6%\n\nABV\n\n33\n\nIBU\nGolden Strong Ale We barrel-aged our Charming Devil in bourbon barrels from Charleston distillery High Wire for 9 months to give this already surprising smooth, high ABV beer another dimension. We love the character the bourbon barrel gives to the beer and we think you will too! ​ Barrel-Aged Descent Into Darkness \n9.5%\n\nABV\n\n70\n\nIBU\nBA Horchata Stout Barrel-Aged Descent Into Darkness is a decadent and delicious stout with a unique twist. This bold and flavorful beer has been aged in bourbon barrels for an extended period of time, allowing the complex flavors of the barrel infuse with the rich, creamy horchata-style stout. Aromas of vanilla, cinnamon, and chocolate blend harmoniously with the robust notes of the barrel, while a hint of toasted oak rounds out the flavor. A truly unique and decadent beer, Barrel-Aged Descent Into Darkness is the perfect way to add some extra complexity to your beer selection. ​ Barrel-Aged Hilma Hooker \n9.5%\n\nABV\n\n25\n\nIBU\nBrandy Barrel-Aged Belgian Tripel Aged in Brandy barrels for over 12 months. This Belgian Tripel is very easy drinking and has a dry finish with subtle flavors of fruit and honey. To give this beer a fun IRBC twist, we added 60lbs of honey during fermentation. ​ Barrel-Aged Night Dive \n6.7\n\nABV\n\n29\n\nIBU\nBarrel-Aged Milk Stout Aged in Heaven Hill Bourbon Barrels for over 12 months.Silky-smooth, calming and refreshing with light roasty notes. We love the outcome of the 5+ hour boil, light carbonation, and lactose, which gives the beer a cream flavor and mouth feel, combination. It's so creamy and smooth you may even mistake this beer for a nitro! ​ Barrel-Aged Night Dive (Rum) \n6.7%\n\nABV\n\n29\n\nIBU\nBarrel-Aged Milk Stout Aged for over 12 months in Rum Barrels- Barrel Aged Night Dive is silky-smooth, calming, and refreshing with light roasty notes. We love the outcome of the 8+ hour boil, light carbonation, and lactose, which gives the beer a cream flavor and mouth feel, combination. It's so creamy and smooth you may even mistake this beer for a nitro! We wanted to give it a summer and island vibe so we added pineapple puree and coconut! ​ Barrel-Aged Shattered Seas \n6%\n\nABV\n\n24\n\nIBU\nBA Saison Our head brewer (Christopher) has been working hard over the years to create a delicious Saison that has complexity and depth but is easy drinking. He feels that he is nailed it with this one! This beer was then aged in Cab Sauv barrels to give it an extra something. ​ Barrel-Aged Tropical Storm \n7.0%\n\nABV\n\n45\n\nIBU\nTropical Storm Tropical Storm, our Tropical Stout, aged in bourbon barrels for 6 months. The perfect combination of tropical, chocolate, and roasted flavors in a single glass. We used Warrior hops for bittering but the Midnight wheat balances it out nicely. The Citra and Amarillo hops used during the whirlpool combined with Voss Kveik yeast gives this beer a little touch of tropical paradise in a stout form. ​ Barrel-Aged Voyage To Valhalla \n9.5%\n\nABV\n\n45\n\nIBU\nBA Adjunct Stout For our first brewery collaboration, we partnered with Two Blokes Brewing to brew up a chocolate, coconut, and vanilla porter. Two Blokes Head Brewer, Luke, and our Owner and Head Brewer, Christopher, started with Matty's recipe for Captain Bligh and put their own twist on it. This robust stout is bursting with flavor and is perfect for this cooler weather. We then aged the beer in bourbon barrels to add an extra layer of complexity. ​ Bella's Helles \n5.5%\n\nABV\n\n17\n\nIBU\nMunich Helles Our first lager on draft! A crisp, smooth, lager with a malt-forward profile from the pilsner malt. We let it lager for 6 weeks in the fermenters before putting it on draft. This inviting, refreshing beer is perfect for a hot, Charleston summer day and is named after our late husky, Bella. ​ Beresford Brown \n5.6%\n\nABV\n\n23\n\nIBU\nAmerican Brown You asked, we crafted. Here is the American Brown Ale ya'll have been asking for! This Brown Ale was created with mostly Maris Otter, some Two Row, and pinch of chocolate malt to create a smooth and surprisingly crisp beer. The Cascade hops add the right about of bitterness to round it all out. ​ Berried at Sea \n5.0%\n\nABV\n\n6\n\nIBU\nRaspberry Kettle Sour We split our first kettle sour and added raspberry puree to this half to create a sweet and sour, well balanced beer. At just 5% ABV, you'll find this beer quite refreshing on a hot summer day. ​ Berserker Blonde \n5.3%\n\nABV\n\n18\n\nIBU\nBlood Orange Blonde Ale Brewed in collaboration with The Bearded Ax in Park Circle. The juiciness of blood orange plus a bright and refreshing blonde ale creates a beer you'll keep coming back to! This beer will quench your thirst while satisfying your fruit fix and is perfect for a hot summer day. ​ Blackberry's Blockade \n5.0%\n\nABV\n\n6\n\nIBU\nBlackberry & Pomegranate Kettle Sour A fruitful kettle sour with blackberry and pomegranate. The combination of tart fruit, sweet lactose, and sour lactobacillus brevis makes a well-balanced beer for sour lovers and non-sour lovers alike. ​ Boone Hall Berry Bomb \n5.0%\n\nABV\n\n6\n\nIBU\nStrawberry Kettle Sour Our first kettle sour, soured with lactobacillus. We partnered with Boone Hall Farms in Mount Pleasant and added 180lb of fresh strawberries. At just 5% ABV and with the right balance of sour and strawberries, you'll find this beer quite refreshing on a hot summer day. ​ Bottom Time \n5.4%\n\nABV\n\n28\n\nIBU\nGerman Pilsner The core of this beer is our house lager strain. The grain bill is simple (as it should be), mostly pilsner malt with a touch a Victory. To round everything out we bittered with Magnum and added late additions of Hallertauer Mittlefrueh. Our cleanest, crispiest, most easy drinking beer yet! ​ Brave Noise \n4.6%\n\nABV\n\n87\n\nIBU\nHazy Pale Ale A juicy, hazy IPA brewed in collaboration with Brave Noise. ​ Broonie \n6.9%\n\nABV\n\n18\n\nIBU\nScottish Ale This 6.9% Scottish Ale is perfect to warm you up in the winter months. ​ Butter Go Coco-nuts \n7.1%\n\nABV\n\n68\n\nIBU\nPB Porter w/ Toasted Coconut Our Peanut Butter Porter with an extra dose of cocoa nibs plus toasted coconut gives this beer a chocolatey, toasty, sweetness. While each flavor can be enjoyed on its own, we love the way they come together in this well-balanced beer. ​ Butter Go Nuts \n7.1%\n\nABV\n\n68\n\nIBU\nPeanut Butter Porter Our peanut butter porter is full of peanut butter powder and cocoa nibs added during the boil and in secondary to give it a nice resemblance to a Reese Cup. If you like a punch of peanut butter to the nose, we recommend getting the beer served with regular beer gas. If you like your PB creamy, try it on nitro! ​ Caribbean Torpedo \n5.4%\n\nABV\n\n63\n\nIBU\nJuicy IPA Want to give your tastebuds an electric shock of the Caribbean? This juicy IPA combines Zeus, Cashmere, and Sabro hops that will remind you of a Caribbean drink while relaxing the beach. It's dry hopped with Cashmere and Sabro to remind you that it's a beer and not a fruity cocktail. ​ Carolina Comrade \n9.3%\n\nABV\n\n70\n\nIBU\nImperial Stout This Imperial Stout was brewed with a massive amount of Maris Otter grain to provide a biscuity base. Chocolate and Roasted Barley provide the color and the light roast, coffee, and chocolate characters. These are balance out with East Kent Golding hops and California Ale yeast. ​ Cenotes \n6.4%\n\nABV\n\n20\n\nIBU\nMexican Lager Smooth and easy to drink on a hot summer day. The sweetness from the flaked corn and a heavy dose of Vienna will pull through in our version of a Mexican lager but is balanced by the Zeus and Motueka hops, which gives a little citrus punch. The southern German lager yeast lets this one finish out clean and crisp. This beer will pair nicely with guacamole, tacos, or your personal favorite Mexican dish. ​ Charming Devil \n9.0%\n\nABV\n\n30\n\nIBU\nGolden Strong Ale Watch out! The charming devil will get you. This Golden Strong Ale doesn't drink like a 9% but as a dry, smooth, golden ale. We added 75 lb sugar during the boil and let it ferment for a month to until it got to exactly where we wanted it. ​ Clocktower IPA \n7.4%\n\nABV\n\n38\n\nIBU\nHazy IPA Brewed in collaboration with our good friends at Clock Tower Taproom in Simpsonville, SC. This hazy IPA checks all of the boxes we look for in a floral, juicy, IPA. ​ Corallium \n4.4%\n\nABV\n\n24\n\nIBU\nNitro Red Ale The Maris Otter grain provides a beautiful biscuity backbone, while crystal malt grains provide color and flavors of caramel and toffee. We added a sprinkle of black barley for color and a little bit of roast. To balance it all out, we added a single bittering dose of East Kent Goldings hops. This beer is served on nitro to add a fun, creamy texture. ​ Crystal Coral \n4.7%\n\nABV\n\n44\n\nIBU\nSession IPA Our take on a session IPA that allows for an easy drinking, low ABV beer, but still has enough body and hop backbone to remind you you're drinking a beer. We added a healthy amount of Vienna, Munich, and flaked oats to establish the body of the beer. We used Cashmere and Motueka hops to create a East meets West hop profile. ​ Depth Dweller \n12%\n\nABV\n\n70\n\nIBU\nBourbon Barrel Aged Imperial Stout Dive into the ocean depths with Depth Dweller, a bourbon barrel-aged imperial stout that embodies the essence of time and craft. Meticulously aged for over a year and a half in barrels from High Wire Distillery, this rich and robust stout is a symphony of flavors. Notes of dark chocolate, roasted coffee, and caramel intertwine with the warm embrace of bourbon, oak, and a hint of vanilla from the barrel. Bold yet velvety smooth, Depth Dweller invites you to explore its layers with every sip—a true masterpiece for the adventurous palate. 2025 World Beer Cup - GOLD / 2025 SC Brewers Cup - GOLD & BEST OF SHOW Dog Days of Sommers \n5.2%\n\nABV\n\n33\n\nIBU\nPale Ale The new and improved 'Pelican Plunge'. A very similar recipe with Cascade and Centennial hops but we dialed back the Crystal malt to subdue the sweetness and create a more balanced pale ale. ​ Drift Dive \n5.8%\n\nABV\n\n63\n\nIBU\nCitra IPA A similar recipe we brewed for our wedding beer, this Citra IPA uses Nugget, Mosaic and, of course, Citra hops! A clean, crisp, West Coast IPA if that’s what you’re craving. ​ Dublin Drought \n4.0%\n\nABV\n\n42\n\nIBU\nDry Irish Stout No one does Dry Irish Stouts like Ireland but we gave it a shot anyway. This beer got the stamp of approval from our friend from Dublin so that's a win in our book! The Dublin Drought is the perfect blend of cocoa, coffee, and roasted malt notes. The best (and only) way to serve this beer is on Nitro to enhance all the flavors and bring them together with creamy goodness. ​ Duke It Out \n7.3%\n\nABV\n\n67\n\nIBU\nIPA A solid IPA brewed with 100% Centennial hops. This was a beer we did early on in our homebrewing days and we are excited to debut it on the professional level. ​ French Angelfish \n5.8%\n\nABV\n\n20\n\nIBU\nFrench Saison This French Saison is balances Pilsner, Vienna, and Wheat malts with Willamette and Styrian Golding hops to create a fun, clean, and dry Saison. ​ Gili Isles \n5.8%\n\nABV\n\n23\n\nIBU\nBock Gili Isles is a Dunkles Bock that is perfect for this fall weather. This beer's rich maltness has characters of toastiness, caramel, and almost nut like flavors. It is balanced out with larger yeast to produce a complex fall beer. ​ Goliath Grouper \n8.7%\n\nABV\n\n74\n\nIBU\nDouble IPA Hop forward with notes of citrus and pine from Amarillo and Centennial hops, this beer is more bitter than a standard IPA. Behind the hops, you'll notice light caramel and biscuit added by the grain to create this big, bold, West Coast double IPA. ​ Halocline \n5.3%\n\nABV\n\n41\n\nIBU\nOat Cream Ale Halocline is a juice forward Oat Cream IPA. We used a pinch of Amarillo to give a little bit of bitterness to balance out the tropical fruit notes from Nelson Sauvin and Citra hops. We also used malted oats help create a uniquely smooth mouthfeel. ​ HiThyme \n4.7%\n\nABV\n\n11\n\nIBU\nFarmhouse Sour Hibiscus, Thai Basil, and Thyme Farmhouse Sour ​ Hilma Hooker \n8.3%\n\nABV\n\n25\n\nIBU\nBelgian Tripel This easy drinking 8.3% Belgian Tripel has a dry finish by subtle flavors of fruit and honey. To give this beer a fun IRBC twist, we added 60lbs of honey during fermentation. ​ Hive Another \n6.0%\n\nABV\n\n13\n\nIBU\nHoney Cream Ale We started homebrewing in Wisconsin so naturally we like our cream ales with a little more ABV than you might be used to. (Google “Wisconsin Cream Ale” if you aren’t sure what we are referencing). We rounded out this beer with 30 lbs of honey but don’t think you are about to drink a glass full of sweet honey nectar. Honey is a fermentable sugar so the yeast already ate most of it before it could get to your glass. What they left behind is pretty tasty though! Awards: 2022 Best of Craft Beer - BRONZE Honey, I Spiced The Pumpkin \n6%\n\nABV\n\n13\n\nIBU\nPumpkin Honey Ale Fall in a glass. ​ Humuhumunukunukuapua'a (aka Triggerfish) \n5.5%\n\nABV\n\n6\n\nIBU\nP.O.G. Kettle Sour This P.O.G. kettle sour (Passion fruit - Orange - Grapefruit) is as delicious as the Hawaiian juice puree added to it. Named after the Hawaiian state fish, one sip will make you feel like you're enjoying the pint on the beaches of Kona. ​ Into the Blue \n5.0%\n\nABV\n\n15\n\nIBU\nBlueberry Wheat We partnered with Boone Hall Farms again, this time for blueberry season! We added 210lb of their hand-picked blueberries to our Belgian Wheat to give it a fresh and fruity twist. Don't let the color fool you into thinking you're drinking Razzle Mania - one sip and you'll taste the blueberry deliciousness. ​ Knightfish \n6.2%\n\nABV\n\n62\n\nIBU\nPineapple IPA An IPA full of fruity flavor, partially from pineapple puree and partially from the Norwegian Voss Kveik yeast, which gives off fruits notes as it ferments at higher temperatures. We let the beer free rise and ferment at 86 degrees and used Nugget, Warrior, Amarillo, and Simcoe hops to round out the flavor profile. This beer is named after the Pineapplefish found in Australia. The armor-like scales of the fish resemble a knight's armor and…a pineapple! ​ La Dolce Vita \n5.2%\n\nABV\n\n39\n\nIBU\nItalian Pilsner This Italian Pilsner is clean and crisp and a great beer as we start to see some warmer weather. The Spalter and Saphir hops pair perfectly with our house lager yeast. ​ Limited Edition Mola Mola - Idaho Gem \n5.9\n\nABV\n\n50\n\nIBU\nJuicy IPA For our fourth anniversary, we created a special limited edition of our first Hazy IPA (Mola Mola). This edition was hit with an additional dry hop of Idaho Gem. We have a limited amount on tap and in 4-packs. ​ Lion's Mane \n6.3%\n\nABV\n\n37\n\nIBU\nOat Cream IPA This silky and smooth IPA will make you come back for more with each sip. We used Amarillo for bittering but it's well balanced with Cashmere and Idaho Gem hops (two of our current favorites!). The soft mouth feel comes from the malted oats and the creaminess is the result of lactose (milk sugar) added during the boil. ​ Mackinac Straits \n5.5%\n\nABV\n\n38\n\nIBU\nPale Ale This American Pale Ale was brewed using only Michigan grown Mackinac hops. This hop has strong tropical, citrus, melon, papaya, and spice characters. ​ Manta Cyclone \n5.6%\n\nABV\n\n43\n\nIBU\nJuicy IPA A juicy IPA using Mosaic, Amarillo, and Zeus hops. Aroma from the Mosaic and Amarillo hops will give off a dank scent. The Zeus hops add a bit of bitterness that balances out the juice character. Sometimes it's hazy, sometimes it's not, but it always tastes delicious! ​ Mendota \n5.6%\n\nABV\n\n6\n\nIBU\nMango Kettle Sour The sister beer to Monona. Mango puree was added to the other half of the kettle sour to create a similar yet very different beer. The combo of the sweet fruit and sourness creates a beer that quenches your thirst but then keeps you coming back for more. ​ Mermaid's Call \n6.1%\n\nABV\n\n32\n\nIBU\nBritish Pale Ale The winning recipe of our 2022 Homebrew Competition. All beers submitted to the competition had to use Kveik yeast. Diane Mott's British Pale Ale was the unanimous winner! ​ Mola Mola \n5.9%\n\nABV\n\n50\n\nIBU\nJuicy IPA Our Mola Mola (aka Sunfish) is a juicy, hazy IPA we know you’ll enjoy. We used Warrior, Citra, Amarillo, and Mosaic hops combined with London Fog yeast. Even if you traditionally don’t enjoy juicy/New England IPAs, we encourage you to give this one a try. It has the right amount of bitterness and juiciness to satisfy every type of IPA drinker. ​ Monk's Haven \n9%\n\nABV\n\n23\n\nIBU\nDoppelbock As Doppelbocks were traditionally brewed by monks in Munich, we thought it fitting to start with Light Munich malt and balance it out with some Pilsner and Blank Prinz malts. We used just enough Styrian Goldings and Hallertauer Mittlefrueh hops to balance out the large grain bill. We used our house Oktoberfest yeast to produce a 9% winter sipper that will deliver tastes of sweet biscuits, plum, raisin, and prune. ​ Monona \n5.6%\n\nABV\n\n6\n\nIBU\nPassion Fruit Kettle Sour A well-balanced, fruity kettle sour. We added passion fruit puree to this kettle sour to give it a punch of tropical fruitiness to balance nicely with the sourness from the lactobacillus. ​ Night Dive \n6.7%\n\nABV\n\n29\n\nIBU\nMilk Stout Silky-smooth, calming and refreshing with light roasty notes. We love the outcome of the 5+ hour boil, light carbonation, and lactose, which gives the beer a cream flavor and mouth feel, combination. It's so creamy and smooth you may even mistake this beer for a nitro! ​ Nitrox \n6.8%\n\nABV\n\n52\n\nIBU\nNitro IPA We tried something a little different and put a West Coast IPA on our nitro tap. The bitterness from the Zeus, Cascade, and Amarillo hops are mellowed out by pouring the beer on nitro and the reduced carbonation makes the beer crushable in the summer and leaves you with a silky, smooth mouthfeel. ​ Ocean Gem \n6.3%\n\nABV\n\n49\n\nIBU\nJuicy IPA We took the term Juicy IPA pretty literal with this beer by using Idaho Gem hops. Combined with the Mosaic hops, you'll notice fruit candy (like Juicy Fruit), citric grapefruit, and some mango on the nose and in the taste. We used flaked barley and oats to give the beer the right mouthfeel and added 55lb of wheat malt to make it hazy. Fermented out with London Fog yeast, it all comes together to make a delicious gem of a beer. ​ Parrotfish \n5.1%\n\nABV\n\n46\n\nIBU\nJuicy Pale Ale Just like a Parrotfish loves grazing on the coral reef, you're going to love grazing on this sessionable, juicy pale ale. Cashmere and Amarillo hops create the juiciness of this beer and cut through any bitterness left behind from the Zeus hops. Coming in at ~5%, it's an easy drinking beer. ​ Peach Inlet \n5.0%\n\nABV\n\n11\n\nIBU\nPeach Wheat We started with a traditional Belgian Wit beer with coriander and bitter orange peel and added a local twist by adding peaches grown and prepared by McLeod Farm and Boone Hall Farm to create this seasonal sipper. ​ Pearl Diver \n4.6%\n\nABV\n\n46\n\nIBU\nJuicy Pale Ale Don't let the lower ABV of this beer fool you. It's packed full of flavor! Citra and Simcoe provide a juicy, citrus flavor and are preceded by Zeus as the bittering hop. Torrified wheat and flaked barley and oats during the mash give this beer a smooth mouthfeel and haziness, not unlike a hot summer day in which this beer will be best enjoyed! ​ Pelican Plunge \n5.6%\n\nABV\n\n36\n\nIBU\nCascade Pale Ale You'll chase after this beer with the same intensity a pelican will plunge into the water to get its next meal. Our Pelican Plunge Pale Ale was brewed with Cascade, Zeus, and Centennial hops and then dry hopped with more Cascade. ​ Penny for the Ferryman \n8.0%\n\nABV\n\n28\n\nIBU\nBelgian Dark Strong A wintery version of our Charming Devil. This lightly bittered beer will warm your heart with its caramel, raisin, and fruity aroma and flavor. You may be wondering where the beautiful color of the beer comes from. We like to credit the dark candied syrup incorporated into the boil. It's not too sweet though! The Belgian Strong Ale yeast finishes it drier than you might expect. Like the Charming Devil, this one is more dangerous than it tastes. ​ Pineapple Dog Days \n5.2%\n\nABV\n\n33\n\nIBU\nPineapple Pale Ale Our pale ale brewed with Cascade and Centennial hops. We wanted to change it up with this batch though so we added pineapple puree to the beer during secondary. ​ Pink Ladyfish \n7.6%\n\nABV\n\n47\n\nIBU\nImperial IPA An Imperial Juicy IPA brewed by women on March 8th for International Women's Day to help raise the profile of women’s roles in the beer industry. The hops are a special blend created specifically for the 2021 Pink Boots Brew by Yakima Chief Hops and include Cashmere, Antanum, Citra, Loral, and Sabro. We love this blend and the way the tropical, herbal, citrus, and woody flavors and aromas come together to create a juicy, flavorful Imperial IPA. ​ Razzle Mania \n5.1%\n\nABV\n\n15\n\nIBU\nRaspberry Wheat Did you enjoy our Sheep for a Wheat Belgian Wheat and want to step it up a notch? Or maybe you're craving something fruity today? Either way, this beer is for you. We took our Belgian Wheat and added raspberry puree to give it a little razzle dazzle. Wine drinkers looking for a beer that's low on bitterness and has a hit of fruitiness - this beer's for you! ​ Rhincodon \n9.7%\n\nABV\n\n88\n\nIBU\nKveik Barelywine Named after the whale shark, the largest living fish, this is our biggest beer yet! We maxed out our mashtun to brew this barleywine with 735 lbs of grain. What makes this beer even more unique is our use of the Norwegian Kveik yeast to give it tropical fruity notes. This beer tastes great now but will taste even better if you pick up a bottle and let it age for up to two years. ​ Royal Merchant \n6.5%\n\nABV\n\n20\n\nIBU\nBelgian Dubbel This 6.5% Belgian Dubbel is perfect for fall weather. It's aroma is complex with rich malty sweetness. It's flavor has a malty sweetness, and hints of raisin and dried fruit that are balanced with a moderate hop character that goes perfectly with the Belgian Yeast strain. ​ Seltzer \n6.0%\n\nABV\n\n0\n\nIBU\nSeltzer House Seltzer with flavors added by the glass. Give it a try today! ​ Sharktoberfest \n5.8%\n\nABV\n\n22\n\nIBU\nMärzen In celebration of the cooler weather coming our way, we released our first Marzen, Sharktoberfest! This amber-brown lager highlights the toasty and bready characters of Maris Otter and Munich grains and finishes crisp and clean. This beer is perfect for fall in Charleston because it is light enough to drink in the sun during the day and malty enough to drink around a campfire at night. ​ Shattered Seas \n5.5%\n\nABV\n\n24\n\nIBU\nSaison A classic, dry saison with a light peppery finish. ​ Sheep for a Wheat \n5.1%\n\nABV\n\n15\n\nIBU\nBelgian Wheat The Belgian yeast used for this beer is intense. That's why we love it. We balance out the flavors brought on with the yeast with some coriander seed and orange peel for a well-balanced Belgian Wheat Ale. ​ Shelly Beach \n5.4%\n\nABV\n\n18\n\nIBU\nBlonde Ale Our first open water dive as certified scuba divers was at Shelly Beach in Sydney, Australia. It seemed only fitting to name the first beer we put on tap at Indigo Reef after that first dive. Just like our shore dive at Shelly Beach got us hooked on scuba diving, we think this blonde ale will get you hooked on us. The Shelly Beach Blonde Ale is easy to drink making it the perfect beer for a hot day or as a gateway into craft beer if you're new to the scene. Awards: 2024 SC Brewers Cup - GOLD Sigmund's Serenity \n5.8%\n\nABV\n\n22\n\nIBU\nVoss Kveik Saison A dry saison brewed with Voss Kveik, a special Norwegian yeast that ferments at much higher temperatures (70-100 degrees) than other yeast. We let this free rise to 86 degrees during fermentation to bring out the orange and citrus flavors you taste - that’s all from the yeast! ​ Siren's Song \n5.4%\n\nABV\n\n55\n\nIBU\nJuicy Pale Ale Our 2021 Brewster beer- brewed by women here in Charleston - is a Hazy Pale Ale brewed with the Pink Boots hop blend, Cashmere, and Citra Hops. The final product is a tropical fruit forward, easy drinking pale ale. $1 from every pint sold will go to Junior Girls Day Out- a local charity that aims to educate, enrich, and empower girls with programs for girls ages 4-14. THANK YOU to all the ladies who helped us brew this amazing beer- we think you're going to love it! ​ Sirens Song 2023 \n5.4%\n\nABV\n\n55\n\nIBU\nPale Ale Our 2023 Brewster beer is an American Pale Ale brewed with Amarillo and the 2023 Pink Boots Blend. It was brewed by an amazing group of local woman right here in Charleston! THANK YOU to all the ladies who helped us brew this amazing beer- we think you're going to love it! ​ Snookfish \n5.2%\n\nABV\n\n25\n\nIBU\nRed Ale Snookfish is a delightful and richly hued beer that offers a captivating blend of flavors and aromas. With a deep crimson color that mirrors its robust malt profile, this ale greets the senses with a toasty, caramelized sweetness and a hint of roasted nuts on the nose. The first sip reveals a harmonious balance of caramel and biscuit maltiness, complemented by a subtle hop bitterness that imparts a crisp finish, leaving a lingering, pleasant malt sweetness on the palate. Snookfish is a perfect companion for those seeking a well-rounded, medium-bodied beer that delivers both character and drinkability in every pour. ​ Soakin' Up The Sun \n5.5%\n\nABV\n\n54\n\nIBU\nHazy IPA Our first hazy beer fermented with Voss Kveik yeast. The predominant hops used in this beer were Azacca, which give the beer the an aroma of juicy mango, tropical fruits, and citrus. We added a sprinkle of Cascade to balance out the Azacca. ​ Sonic Wave \n5%\n\nABV\n\n6\n\nIBU\nCherry Lime Sour While we can't offer drive up or drive through service, we can sell you a beer that reminds you of a delicious beverage at a place that does. This Cherry Lime Sour is perfect for the warmer weather we are having. ​ Spice Merchant \n7%\n\nABV\n\n34\n\nIBU\nWinter Lager Introducing Spice Merchant, a rich and inviting brew that captures the essence of the season. Deep mahogany in color, this winter lager blends the sweetness of molasses with a carefully balanced medley of mulling spices, creating a harmonious dance of flavors. Aromas of cinnamon, cloves, and nutmeg waft from the glass, setting the stage for a velvety sip that unfolds with a malty backbone and a subtle caramel sweetness. The warming spices leave a lingering, festive finish, making this winter lager the perfect companion for cozy evenings by the fire or joyful gatherings with loved ones. Embrace the spirit of the season with each sip of Spice Merchant, a celebration of warmth and comfort. ​ Spirit Of Solstice \n7.5%\n\nABV\n\n34\n\nIBU\nBrandy Barrel Aged Winter Lager Embrace the warmth of the season with our Brandy Barrel-Aged Winter Lager, a festive brew that brings depth and cheer to chilly nights. This rich, malty lager is aged to perfection in brandy barrels, infusing it with notes of dried fruit, toasted oak, and a whisper of warming spice. The smooth, caramel backbone of the lager harmonizes beautifully with the delicate brandy sweetness, creating a balanced and luxurious drinking experience. Perfect for fireside moments or holiday celebrations, this winter lager is a toast to the cozy comforts of the season. ​ Surface Interval \n6%\n\nABV\n\n34\n\nIBU\nCzech Pilsner Surface Interval is a Czech Pilsner that uses Southern German Lager yeast and 100% Czech Saaz hops. The hops will give the beer a slight spicy character, which is a nice complement to the clean finishing yeast. Just like a diver's surface interval between dives, this beer is relaxing, chill, and rejuvenating. ​ Swim Through \n7.2%\n\nABV\n\n20\n\nIBU\nBelgian Saison A Belgian Saison with an extra yeast strain to add complexity and a unique flavor. You'll notice earthy and fruity notes mixed with a peppery and spicy finish. We love the way the Belgian and California Ale yeasts play together to make a delicious beer you'll want more of after the first sip. ​ Tap 17 \nN/A\n\nABV\n\n0\n\nIBU\nRotating Check out the Brewer's Taps list to see what we have on our experimental tap line (Tap 17). ​ Tha Community \n5.5%\n\nABV\n\n18\n\nIBU\nTepache Blonde Brewed in partnership with Tha Community, this Tepache blonde is bursting with Pineapple, Ginger, and Cinnamon ​ Three Years and a Dash \n5%\n\nABV\n\n6\n\nIBU\nTiki Sour This beer was brewed in partnership with our friends at Craft & Draft for their Irmo locations 3rd anniversary. It is a Tiki-Style Sour inspired by the 3 dots and a dash cocktail. CONTAINS ALMONDS. ​ Tropical Storm \n6.5%\n\nABV\n\n45\n\nIBU\nTropical Stout The perfect combination of tropical, chocolate, and roasted flavors in a single glass. We used Warrior hops for bittering but the Midnight wheat balances it out nicely. The Citra and Amarillo hops used during the whirlpool combined with Voss Kveik yeast gives this beer a little touch of tropical paradise in a stout form. ​ Uncle Ducky's Revenge \n7.9%\n\nABV\n\n56\n\nIBU\nBelgian IPA Fermented with a Belgian Strong Ale yeast, this Belgian IPA doesn't taste as strong as it is. The deliciousness of Zeus, Cascade, and Mosaic hops balance out the powerful flavors of the yeast. ​ Upside Down Brown \n5.6%\n\nABV\n\n25\n\nIBU\nFruited Brown Ale We took our Brown Ale and added Pineapple to it! ​ Voyage To Valhalla \n8.7%\n\nABV\n\n45\n\nIBU\nChocolate, Coconut, and Vanilla Stout For our first brewery collaboration, we partnered with Two Blokes Brewing to brew up a chocolate, coconut, and vanilla porter. Two Blokes Head Brewer, Luke, and our Owner and Head Brewer, Christopher, started with Matty's recipe for Captain Bligh and put their own twist on it. This robust stout is bursting with flavor and is perfect for this cooler weather. ​ Wake Up Call \n5.3%\n\nABV\n\n18\n\nIBU\nCoffee Blonde Ale Before coffee became widely available, beer was the popular breakfast drink of choice. We love both types of beverages so we decided to combine the two. Wake Up Call is our Shelly Beach Blonde Ale with coffee grounds from Charleston Coffee Roasters. We think it's the perfect brunch beer but really it can be enjoyed at any time of the day. Awards: 2025 Best of Craft Beer - Silver / 2025 SC Brewers Cup - Bronze / 2024 SC Brewers Cup - GOLD / 2022 SC Brewers Cup - BRONZE Wooden Walkway \n5.9%\n\nABV\n\n24\n\nIBU\nBelgian Saison Wooden Walkway will take your taste buds on a journey while you enjoy this Belgian Saison. You'll start with warm, biscutty flavors from the Vienna malt. Next, the Belgian yeast will throw in some cracked pepper to spice things up but will be balanced by citrus and tropical fruit from the Cashmere hops used during dry hopping. The journey will end with a dry finish. Enjoy! ​ Beers on Tap bottom of page",
      "hash": "c17115ff3e92",
      "downloadedAt": "2026-01-19T02:06:20.071Z",
      "trimmedAt": "2026-01-19T02:25:55.270Z",
      "sizeReduction": "98.0%"
    },
    {
      "url": "https://www.indigoreefbrewing.com/events",
      "text": "[Page Title: EVENTS | Indigo Reef Brewing Company]\n\ntop of page \nUPCOMING EVENTS\nView Facebook Events Tuesdays 6 pm - 8 pm Euchre Free Play w/ Charleston Euchre Club Every Tuesday Saturday, December 13th 12 pm - 4 pm Sip & Shop\nMarket Email to Sign Up Thursday, December 18th 6 pm Christmas Cookie Decorating Class Get Tickets Sunday, December 21st 6 pm - 8 pm Christmas Vacation Themed Trivia Learn More Wednesdays starting @ 7 pm Weekly Trivia \nw/ Trivia Time Charleston Every Wednesday Saturday, December 13th 1 pm - 4 pm Live Music w/\nEric Hatcher Learn More Friday, December 19th 4 pm - 9 pm Christmas Party & Ugly Sweater Contest Cheers! Saturday, December 27th 7:30 pm - 9pm The Brewery\nComedy Tour Early Bird Tickets Friday, December 12th 5:30 pm - 8:30 pm Live Music w/\nMegan Bridges Learn More Sunday, December 14th 1 pm - 3 pm Euchre Tournament w/ Charleston Euchre Club Learn More Friday, December 19th 5:30 pm - 8:30 pm Live Music w/\nRich Lorenzo Learn More bottom of page",
      "hash": "cb9a51fc1cdb",
      "downloadedAt": "2026-01-19T02:06:17.435Z",
      "trimmedAt": "2026-01-19T02:25:55.335Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "https://www.indigoreefbrewing.com/beers-on-tap",
      "text": "",
      "hash": "d3ebd363a546",
      "downloadedAt": "2026-01-19T02:06:18.881Z",
      "trimmedAt": "2026-01-19T02:25:55.335Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "https://www.indigoreefbrewing.com/events-calendar",
      "text": "[Page Title: EVENTS CALENDAR | Indigoreefbrewing]\n\ntop of page \nUPCOMING EVENTS CALENDAR\nbottom of page",
      "hash": "e713cd1a9820",
      "downloadedAt": "2026-01-19T02:06:18.012Z",
      "trimmedAt": "2026-01-19T02:25:55.355Z",
      "sizeReduction": "100.0%"
    }
  ],
  "sizeReduction": "99.3%"
}