{
  "venueId": "ChIJTTcM5Zx7_ogRlEKsvPVFWHM",
  "venueName": "Lowland",
  "venueArea": "Downtown Charleston",
  "website": "https://lowlandcharleston.com/?utm_source=google&utm_medium=Local&utm_campaign=Google+My+Business",
  "scrapedAt": "2026-01-18T17:04:26.608Z",
  "trimmedAt": "2026-01-18T17:08:02.361Z",
  "pages": [
    {
      "url": "https://lowlandcharleston.com/?utm_source=google&utm_medium=Local&utm_campaign=Google+My+Business",
      "text": "[Page Title: Follow us on Instagram] Menu Beverage Event Gift Cards Hotel Make a Reservation Reservation 5pm - 10pm Daily 854.895.4137 36 George St. CharlestonSouth Carolina 29401 Follow us on Instagram Lowland Charleston Located across from The Pinch Hotel, Lowland restaurant, which has been recognized by the , serves simple, modern comfort food. With a focus on supporting the abundance of the Lowcountry, alongside a worldly wine list and curated cocktails, Executive Chef Matt Dion and his team hosts a nightly Southern-inspired dinner party. Michelin Guide Guests can enjoy the full menu throughout the building: in the tavern, with its copper bar and original wood-burning fireplace, in the intimate parlour room, in the upstairs dining room decorated with hand painted mural as well as The Quinte—a storied 19th century hangout across the alley that's ideal for large parties and private events.",
      "hash": "76e0df0f8289",
      "downloadedAt": "2026-01-18T16:54:31.379Z",
      "trimmedAt": "2026-01-18T17:08:02.356Z",
      "sizeReduction": "98.5%"
    },
    {
      "url": "https://lowlandcharleston.com/event",
      "text": "[Page Title: Follow us on Instagram] Menu Beverage Event Gift Cards Hotel Make a Reservation Reservation 5pm - 10pm Daily 854.895.4137 36 George St. CharlestonSouth Carolina 29401 Follow us on Instagram Event You can host a private event—a family style or a la carte menu upstairs. Or buy out all of The Quinte for your next party. Inquire below, and a member of our team will be in touch. Private Event Software powered by Tripleseat",
      "hash": "99259a209fbc",
      "downloadedAt": "2026-01-18T16:54:31.809Z",
      "trimmedAt": "2026-01-18T17:08:02.361Z",
      "sizeReduction": "99.2%"
    }
  ],
  "sizeReduction": "98.8%"
}