{
  "venueId": "ChIJWz5HKtxx_ogRpUQy3tFE6ow",
  "venueName": "Fuji Sushi Bar & Grill",
  "venueArea": "Mount Pleasant",
  "website": "http://fujimountpleasant.com/",
  "scrapedAt": "2026-01-18T17:04:26.859Z",
  "trimmedAt": "2026-01-18T17:08:05.102Z",
  "pages": [
    {
      "url": "http://fujimountpleasant.com/mt-pleasant-belle-hall-fuji-sushi-long-point-rd-happy-hours-specials",
      "text": "Specials We are updating our specials Please stay tuned",
      "hash": "3897835971de",
      "downloadedAt": "2026-01-18T16:56:20.808Z",
      "trimmedAt": "2026-01-18T17:08:05.067Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "http://fujimountpleasant.com/",
      "text": "× Did you know we do catering? Whatever your occasion, however big or small, we have the perfect options to choose from. Cater your birthday party, holiday party, corporate events, wedding festivities and more! Catering Packages × We're hiring! Call, email, or submit an inquiry today to learn more! Job Listings × Turn moments into memories! Choose us for your next special occasion or get-together. Got a birthday party, rehearsal dinner, corporate or other event coming up? We're a great option for your gathering! Inquire today and let us know how we can make your special occasion perfect! Book your party About us Welcome to our very special place Fuji exudes a laid-back atmosphere, perfect for dinner with the family or a night out with friends. So come join our friendly staff any day of the week for delicious cocktails and mouth-watering eats. Read more about us we cater Let us cater your next event When it comes to your next event, let us take care of the food with our delicious and expertly crafted catering options featuring a wide range of our impeccable dishes that are sure to please any palate. catering our menu Enjoy atmosphere, perfect for dinner menu Order online Pick Up Your Favorite Food Don't feel like cooking today? We got you covered - order now! Order now Specials We are updating our specials Please stay tuned Events Start stop events carousel Valentine's Day Saturday February 14th Join us on Valentine's Day for the perfect romantic evening! Mardi Gras Tuesday February 17th Come celebrate Mardi Gras with us. National Margarita Day Sunday February 22nd Come celebrate National Margarita day with us on February 22nd. International Women's Day Sunday March 8th Come celebrate International Women's Day with us - March 8th St. Patrick's Day Tuesday March 17th Grab your best green garb and join us for St. Patrick's Day! Easter Sunday April 5th Come celebrate Easter with us! slideshow start stop playing Slide 1 content Slide 2 content previous slide next slide Private Parties Exclusive Events Tailored for You book now a private party our food Expertly Crafted, Tasty Options menu Skip Photo Gallery Reviews Start stop reviews carousel Review by - google Sharlette C: five star review by Great experience. They told us it would be a 25 minute wait for a table but it was really less than 10. The spicy pomegranate margarita was fantastic as well as the gyoza. All three of the rolls we got were also delicious and were very large. Decent happy hour specials, even on Friday. Review by - google Caroline S: five star review by Really good sushi and great lunch specials! I had the shrimp and vegetables tempura bento box and it was very plentiful! I couldn't even eat it all! My husband had the 'resolution roll' and really loved it by warns its very spicy! So, if you like heat, go for that one! They've always got great specials going. There is a nice outside area to sit and the inside is very cozy with a small bar area. It's got a great neighborhood feel to it! Review by - google Abigail W: five star review by I ordered take out and was really happy with my food. Got a shrimp tempura roll and avocado and cucumber roll. The shrimp tempura was cooked perfectly, super crispy and flavorful. The avocado and cucumber roll was incredibly fresh. They also provided a generous side of ginger and wasabi. Received way more pieces per roll than I was expecting which made it a fair price in my opinion. Looking forward to ordering again soon! Review by - google Arturo G: five star review by I'm glad my friends brought me to Fuji, first time being here and all I can say is that everything was amazing the service and the food. We had many different dishes and all were great! Definitely will be coming regularly and I recommend this place. Reservations Join us today Click the button below to make a reservation. Book your Fuji Sushi Bar and Grill - Belle Hall reservation on Resy Newsletter Location 644 Long Point Rd. Mt. Pleasant, SC 29464 Hours Sun, Mon, Tue, Wed, Thur, Fri, Sat 11:00 AM - 10:00 PM Find us on... Facebook page Instagram page Google page Contact us (843)-856-5798 Call us at fujichsevents@gmail.com Write us at Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "3fd068f300fd",
      "downloadedAt": "2026-01-18T16:56:20.093Z",
      "trimmedAt": "2026-01-18T17:08:05.091Z",
      "sizeReduction": "98.2%"
    },
    {
      "url": "http://fujimountpleasant.com/mt-pleasant-belle-hall-fuji-sushi-long-point-rd-food-menu",
      "text": "Our Menu Menu Lunch Specials",
      "hash": "6759ca7ce49a",
      "downloadedAt": "2026-01-18T16:56:20.182Z",
      "trimmedAt": "2026-01-18T17:08:05.098Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://fujimountpleasant.com/mt-pleasant-belle-hall-fuji-sushi-long-point-rd-events",
      "text": "Events Valentine's Day Saturday February 14th Join us on Valentine's Day for the perfect romantic evening! 11:00 AM - 10:00 PM Mardi Gras Tuesday February 17th Come celebrate Mardi Gras with us. 11:00 AM - 10:00 PM National Margarita Day Sunday February 22nd Come celebrate National Margarita day with us on February 22nd. 11:00 AM - 10:00 PM International Women's Day Sunday March 8th Come celebrate International Women's Day with us - March 8th 11:00 AM - 10:00 PM St. Patrick's Day Tuesday March 17th Grab your best green garb and join us for St. Patrick's Day! 11:00 AM - 10:00 PM Easter Sunday April 5th Come celebrate Easter with us! 11:00 AM - 10:00 PM",
      "hash": "69cd9ed3681e",
      "downloadedAt": "2026-01-18T16:56:21.417Z",
      "trimmedAt": "2026-01-18T17:08:05.102Z",
      "sizeReduction": "99.1%"
    }
  ],
  "sizeReduction": "99.0%"
}