{
  "venueId": "ChIJEyY9A7F5_ogR5o8JEDlGHG4",
  "venueName": "Paisano's Pizza Grill",
  "venueArea": "James Island",
  "website": "http://paisanospizzaji.com/",
  "scrapedAt": "2026-01-19T03:25:39.814Z",
  "trimmedAt": "2026-01-19T03:26:41.439Z",
  "pages": [
    {
      "url": "http://paisanospizzaji.com/charleston-paisano-s-pizza-grill-james-island-catering",
      "text": "[Page Title: Paisano's Pizza Grill - James Island - Catering]\n\nCatering Menu\n\nYour request has been sent to the restaurant. We will contact you soon.\n\n{{reservations.serverError}}",
      "hash": "0fface88844f",
      "downloadedAt": "2026-01-19T02:10:17.042Z",
      "trimmedAt": "2026-01-19T03:26:41.406Z",
      "sizeReduction": "99.8%"
    },
    {
      "url": "http://paisanospizzaji.com/",
      "text": "[Page Title: Paisano's Pizza Grill - James Island - Charleston, SC]\n\n× \nOrder your favorite dishes in seconds!\nOrder Online × \nDid you know we do catering?\n\nWhatever your occasion, however big or small, we have the perfect options to choose from.\n\nCater your birthday party, holiday party, corporate events, wedding festivities and more!\nCatering Packages × \nWe are taking online reservations!\n\nLet’s ensure you get a great table: Book today!\n\nWe recommend making a reservation ahead of time. Book your table today!\nBook Table × \nTurn moments into memories!\n\nChoose us for your next special occasion or get-together.\n\nGot a birthday party, rehearsal dinner, corporate or other event coming up? We're a great option for your gathering! Inquire today and let us know how we can make your special occasion perfect!\nBook your party \nJob Listings - We're hiring! Call, email or submit an inquiry today to learn more!\nJob Listings Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! \n1246 camp rd, Charleston, SC 29412\nmap marker pin \nORDER NOW\n\nPICK UP OR DELIVERY\nOrder Online Catering \nLet us cater your next event\n\nPaisano's Pizza Grill James Island would be honored to provide our services for your next event. Each event is bespoke to your tastes and needs, to provide the best experience possible for you and your guests.\nCatering Parties \nBook your next party with us!\n\nNeed the space for your event? Search no more, we have a perfect place for you!\nParties \nReservations\n\nJoin us today\n\nClick the button below to make a reservation\nReserve \nThe best dough + The best sauce + The best cheese = The best pizza\nOur Menu \nMade by friends, for friends\nCatering \nFull selection of Draft/Bottled beer and Italian Wines\nDrinks Dot slide navigation number 1 Dot slide navigation number 2 Dot slide navigation number 3 slideshow start stop playing \nSpecials\n\n2 Large 1 Topping Pizzas and a 2 Liter for $30.99\n\n11:00 AM - 12:00 AM\nALL SPECIALS \nReviews\n\nReview by - Yelp\n\nTaryn W.:\n\nCannot recommend Paisano's enough! We lived on James Island for 3 years and ordered from here at least once a month, and everything was always delicious. My favorite menu items are the chicken parm pizza and Italian hot sub. My husband loves the chicken parm sub and hot wings. But honestly, you can't go wrong with anything on the menu.\n\nReview by - Yelp\n\nCara H.:\n\nThis little pizza place was very delicious and quick. I ordered pizza Togo for me and my family and the pizza was a great price and the staff was very nice and got me my order and side sauces to go. Definitely recommend this pizza. They had other items that I would have loved to try but didn't have time while on vacation. Will definitely go back to try the wings.\n\nReview by - Yelp\n\nRemi Louise F.:\n\nI always tell my friends that they can only tell if I like the pizza if I ate the bone. This is surely one of the pizza where I ate the bone. It is fresh out of the oven. I love how it is not salty or overly oily. The toppings are perfect amount and spread out. Will surely be back! I'll edit this review once I tried their wings.\n\nReview by - Yelp\n\nGrace P.:\n\nThe BEST pizza on James Island for sure! This place does it right. Really affordable and can feed a lot of people. Every time I order, my food comes out perfectly. Placing a pickup order is simple and quick. I always go for a classic cheese pizza - the seasoning they use is fantastic!\n\nReview by - Yelp\n\nJesse J.:\n\nBest delivery I've had in along time. And we use Uber eats at the office all the time. Gyros are awesome, Taziki sauce is better than Athens was. Fries were great and still crispy even in the storm and their wings are always great. Best blue cheese maybe best in Charleston\nStop reviews carousel Play reviews carousel \nNewsletter\n\nLocation\n\n1246 camp rd\n\nCharleston, SC\n\n29412\n\nHours\n\nSun, Mon, Tue, Wed, Thur, Fri, Sat\n\n11:00 AM - 12:00 AM\n\nFind us on...\nFacebook page Instagram page Yelp page \nContact us\n(843)-762-1135 nvskover@yahoo.com \nPowered by:\nWebsite design, Social Media marketing and Email marketing provided by SpotHopper. × \nNewsletter",
      "hash": "1002b1f0dff2",
      "downloadedAt": "2026-01-19T02:10:15.110Z",
      "trimmedAt": "2026-01-19T03:26:41.426Z",
      "sizeReduction": "97.3%"
    },
    {
      "url": "http://paisanospizzaji.com/charleston-paisano-s-pizza-grill-james-island-drink-menu",
      "text": "[Page Title: Paisano's Pizza Grill - James Island - Drink Menu]\n\nOur Drinks\nBeverages",
      "hash": "69daae06f048",
      "downloadedAt": "2026-01-19T02:10:15.817Z",
      "trimmedAt": "2026-01-19T03:26:41.429Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "http://paisanospizzaji.com/charleston-paisano-s-pizza-grill-james-island-happy-hours-specials",
      "text": "[Page Title: Paisano's Pizza Grill - James Island - Specials]\n\nSpecials\n\nSunday January 18th\n\n2 Large 1 Topping Pizzas and a 2 Liter for $30.99\n\n11:00 AM - 12:00 AM\n\nMonday January 19th\n\nSupersize Monday!\n\n11:00 AM - 12:00 AM\n\nTuesday January 20th\n\n$9.00 Calzones (2 Meats and Two Veggies).\n\n11:00 AM - 12:00 AM\n\nWednesday January 21st\n\n$15.00 FatBoy (One Topping).\n\n11:00 AM - 12:00 AM\n\nSaturday January 24th\n\n1 Large 1 Topping Pizza and 10 Wings for $25.99\n\n11:00 AM - 12:00 AM",
      "hash": "911171f69b7d",
      "downloadedAt": "2026-01-19T02:10:16.429Z",
      "trimmedAt": "2026-01-19T03:26:41.433Z",
      "sizeReduction": "99.3%"
    },
    {
      "url": "http://paisanospizzaji.com/charleston-paisano-s-pizza-grill-james-island-food-menu",
      "text": "[Page Title: Paisano's Pizza Grill - James Island - Food Menu]\n\nOur Menu\nOrder Online Download Menu Menu Catering",
      "hash": "af34206646ab",
      "downloadedAt": "2026-01-19T02:10:15.205Z",
      "trimmedAt": "2026-01-19T03:26:41.439Z",
      "sizeReduction": "99.9%"
    }
  ],
  "sizeReduction": "99.0%"
}