{
  "venueId": "ChIJX3apPVFx_ogRvIZuDXmb6MY",
  "venueName": "Dunleavy's Pub",
  "venueArea": "Sullivan's Island",
  "website": "https://dunleavysonsullivans.com/",
  "scrapedAt": "2026-01-18T17:04:26.941Z",
  "trimmedAt": "2026-01-18T17:08:06.025Z",
  "pages": [
    {
      "url": "http://dunleavysonsullivans.com/menu/all/",
      "text": "Menu Soup of the Day Cup/$5.25 Bowl/$6.50 Grilled Mahi Mahi Sandwich $12.95 Classic Reuben $9.75 Corned beef, Swiss, kraut, and thousand island dressing on grilled rye. Grilled Chicken Sandwich $10.75 Hamburger $10.25 Served on a sesame seed bun with lettuce, tomato, onion and mayo. Cheeseburger $11.50 Choice of cheese: Swiss, provolone, or cheddar. Italian Sausage Dog $8.50 Served with beer sautéed onions. Chicken Salad Sandwich $9.50 Served on grilled rye with lettuce and tomato. Choice of sides: pasta salad or chips Dunleavy's Famous Grilled Wings: (6) for $8.75 (12) for $14.75 (Hot, Medium, BBQ, Teriyaki, Honey Mustard, Dry Ranch Rub, Lemon Pepper Rub) Served with ranch or blue cheese Ask about our Daily Special. CASH ONLY ATM AVAILABLE (843) 883-9646 2213 Middle St # A, Sullivan's Island, SC 29482 DUNLEAVY'S PUB Directions/Map Hours: Monday 3PM - 1AM Tuesday 3PM - 1AM Wednesday 11:30AM - 1AM Thursday 11:30AM - 1AM Friday 11:30AM - 2AM Saturday 11:30AM - 2AM Sunday 11:30AM - 1AM Phone:",
      "hash": "02484647121c",
      "downloadedAt": "2026-01-18T17:01:52.059Z",
      "trimmedAt": "2026-01-18T17:08:06.022Z",
      "sizeReduction": "97.4%"
    },
    {
      "url": "https://dunleavysonsullivans.com/",
      "text": "Welcome to Dunleavy’s Pub! 2019 marks our Twenty-Seventh Anniversary. We are not a chain restaurant. We are proud to be part of an endangered species, the family-owned and operated business. Please enjoy our hospitality and know that we are grateful for your patronage. Twenty-seven years ago, Patti and Bill fulfilled their Dad’s dream of owning a little Irish pub. The sister and brother team took a risk by bringing a little slice of New England to Sullivan’s Island. Boy, has that risk paid off! These twenty seven years have brought us more friends here in our adopted state of South Carolina than we could ever imagine. Our friends really get around, too. It always tickles us when someone reports seeing a Dunleavy’s t-shirt in Las Vegas, Ireland or at the Vatican (no joke!). Patti has retired and her son, Jamie, along with Bill now hold down the fort. We look forward to your visit soon! Slainté Bill & Jamie (843) 883-9646 2213 Middle St # A, Sullivan's Island, SC 29482 DUNLEAVY'S PUB Directions/Map Hours: Monday 3PM - 1AM Tuesday 3PM - 1AM Wednesday 11:30AM - 1AM Thursday 11:30AM - 1AM Friday 11:30AM - 2AM Saturday 11:30AM - 2AM Sunday 11:30AM - 1AM Phone:",
      "hash": "3fded49e1750",
      "downloadedAt": "2026-01-18T17:01:51.608Z",
      "trimmedAt": "2026-01-18T17:08:06.025Z",
      "sizeReduction": "96.6%"
    }
  ],
  "sizeReduction": "97.0%"
}