{
  "venueId": "ChIJK_IU5Gl6_ogRSRZ2slY7U48",
  "venueName": "Uptown Social",
  "venueArea": "Downtown Charleston",
  "website": "https://www.uptownsocialchs.com/",
  "scrapedAt": "2026-01-18T17:04:25.333Z",
  "trimmedAt": "2026-01-18T17:07:08.750Z",
  "pages": [
    {
      "url": "https://www.uptownsocialchs.com/",
      "text": "Home Main content starts here, tab to start navigating hero video paused, press to play video Playing hero video, press to pause video Welcome to Uptown Social A cornerstone of Charleston’s vibrant King Street scene and the flagship concept of the Uptown Hospitality Group. Since opening in 2018, we’ve been redefining the entertainment experience for both locals and visitors alike. Whether you’re snapping a photo in front of our iconic “Social Butterfly” mural, savoring a Thin & Crispy pizza from Brooklyn Legend, Anthony Falco, or enjoying live music from local bands and world-famous DJs, Uptown Social checks all the boxes for a great time. Menu elevated pub fare meets the perfect slice of Brooklyn! Our menu superstar is the bar pie—a mouthwatering creation by legendary pizza maker Anthony Falco. These signature 12\" pies are crafted to perfection, bringing a taste of Brooklyn to every bite. View Menus Join our Team We work hard & play hard! Apply Private Events Our private rooms and shareable menu make us the perfect setting for your next event. Book An Event Entertainment Live music every night of the week! View lineup Our mission is simple: Create a space where everyone feels welcome, and every experience is unforgettable. Reservations Skip the line Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Uptown Social | Bar in Charleston, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "1565b67a8018",
      "downloadedAt": "2026-01-18T16:55:10.405Z",
      "trimmedAt": "2026-01-18T17:07:08.516Z",
      "sizeReduction": "95.5%"
    },
    {
      "url": "https://www.uptownsocialchs.com/private-events",
      "text": "Main content starts here, tab to start navigating Private Events Slide 1 of 4 Slide 2 of 4 Slide 3 of 4 Slide 4 of 4 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Book an Event Looking for the perfect venue to host your next private event? Look no further! We offer an exquisite setting for all your special occasions. Whether you're planning a corporate gathering, a milestone celebration, or an intimate social event, our versatile spaces and exceptional service will make your event unforgettable. For all inquiries, please fill out the form below and we’ll be in touch soon. Inquire Now Reservations Skip the line Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Uptown Social | Bar in Charleston, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Private Event Software powered by Tripleseat",
      "hash": "4259020ac299",
      "downloadedAt": "2026-01-18T16:55:12.831Z",
      "trimmedAt": "2026-01-18T17:07:08.524Z",
      "sizeReduction": "96.3%"
    },
    {
      "url": "https://www.uptownsocialchs.com/menus/",
      "text": "Main content starts here, tab to start navigating Menus Slide 1 of 2 Slide 2 of 2 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides SIDELINE SPECIALS AVAILABLE DURING FOOTBALL Food Drinks SMOKED WINGS 6 for $12 | 12 for $22 HOUSE SMOKED WINGS, COATED IN SMOKY BROWN SUGAR DRY RUB OR MOP SAUCE - 22 12 $ $ BACON CHEESEBURGER SLIDERS 2 BACON CHEESEBURGER SLIDERS SERVED WITH FRIES 13 $ MEAT LOVERS PIZZA PEPPERONI, SAUSAGE, BACON, CAPICOLA, FRESH MOZZ 18 $ THE BLITZ PACKAGE 6 JALAPEÑO POPPERS, 6 MOZZARELLA STICKS, 8 BONELESS WINGS (comes with choice of one sauce) 10 PRETZEL BITES (comes with a side of queso, marinara and ranch) 25 $ Crafted by Brooklyn Legend: Anthony Falco Thin & Crispy Bar Pies The Falco Classic Fresh tomato sauce, fresh & aged mozz, Grana Padano, basil, oregano 15 $ Bleeker Fresh tomato sauce, aged mozz, pickled jalapeños, pepperoni, oregano, buttermilk ranch drizzle 18 $ Amsterdam Fresh tomato sauce, aged mozz, pickled jalapeños, pepperoni, mushroom, sausage, Grana Padano 18 $ The Village Fresh tomato sauce, aged mozz, Grana Padano, peppers, onions, mushroom, arugula 18 $ The Pesto’s Yet To Come Basil pesto sauce, tomato sauce, fresh mozz 15 $ Hot Honey Calabrian chili tomato sauce, cheddar jack, fried chicken, habañero honey jam, herbs 18 $ Wake N Bacon Black pepper cream, sausage, twice smoked bacon, cheddar jack cheese, fresh eggs, herbs Featured on “Food Paradise! 18 $ Buffalo CBR Ranch, mild buffalo sauce, cheddar jack, grilled chicken, twice smoked bacon, ranch & mild buffalo sauce drizzle, herbs 18 $ Hot Italiano Roasted garlic and herb oil base, fresh mozz, genoa salami, sun-dried tomatoes, hot honey drizzle 18 $ Social Sharing House Hummus Roasted garlic hummus, olive tapenade, crispy pita chips & fresh veggies 12 $ Chicken Fingers Hand breaded tenders, comes with side of any of our signature dipping sauces 12 $ Jalapeno Poppers Breaded and fried jalapeno stuffed with cream cheese and served with a side of ranch or marinara. 12 $ Mac n' Cheese Bites Deep fried and tossed in grated parmesan and herbs, served with a side of ranch. 10 $ Garlic Parmesan Beignets Fluffy and golden, roasted garlic butter, parmesan and herbs. Served with a side of marinara. 10 $ Crispy Brussels Sprouts Tossed in peanut sesame glaze, topped with wonton crisps and green onions. 11 $ Loaded Fries Queso, crispy bacon, house pickled jalapeños, scallions, ranch dressing 15 $ Buffalo Chicken Fry Platter Crispy chicken, buffalo sauce, ranch drizzle, cheddar jack cheese, topped with green onions. 17 $ Pulled Pork Fry Platter Slow smoked barbecue pulled pork, mop sauce drizzle, creamy smoked gouda sauce, caramelized onions. 17 $ Mozzarella Sticks Marinara dipping sauce 10 $ Chips and Queso House fried tortilla chips, rich creamy queso dip, with a touch of spice. 10 $ Pretzel Bites Queso, house mustard 10 $ Buff Chx Dip Served hot, melted cheddar jack cheese, celery, carrots, crispy pita chips 14 $ Salads Caesar Romaine, Grana Padano, garlic croutons 12 $ Socialite Seasonal mixed greens, red onion, tomato, cucumber 10 $ Spring Salad Seasonal mixed greens, candied walnuts, dried cherries, red onion, goat cheese, cherry tomatoes, lemon vinaigrette. 14 $ Add-Ons Chicken 5 $ Shrimp 8 $ Dressings Honey Balsamic Ranch Blue Cheese Caesar Lemon Vinaigrette $15 (Base Price) Comes with Aged Mozz, Grana Padano Create Your Own STEP ONE: Choose a Sauce Fresh Tomato Sauce • Black Pepper Cream • Calabrian Chili Tomato Sauce • Basil Pesto Sauce STEP TWO: Pick your Toppings (max of 3) Toppings Each 1 $ Veggies Arugula • Mushrooms • Spinach • Roasted Peppers • Onions • Pickled Jalapeños • Mixed Olives • Banana Peppers Meat Sausage • Pepperoni • Twice Smoked Bacon • Grilled Chicken • Fried Chicken • Shrimp (+$4) Cheese Cheddar Jack Cheese • Aged Mozz • Extra Mozz • Vegan Mozz (+$2) Traditional 6 for $12-- 12 for $22 Boneless 8 for $8-- 16 for $16-- 24 for $24 Wings Sauces Medium Hot Social Suicide (Good Luck) Sweet Chili Southern Honey Mustard Mop Sauce (BBQ) Garlic Parmesan Rubs Old Bay Ranch Caribbean Jerk Lemon Pepper Served with fries • Substitute gluten free bread +$2 Sammies & Wraps Oven Baked Chicken Parm Fresh mozz, crispy chicken breast, fresh basil, Grana Padano, ciabatta 17 $ Crispy Chicken Crispy chicken breast, shredded lettuce, dill pickles, garlic honey aioli 16 $ Buffalo Chicken Crispy chicken breast, buffalo sauce, cheddar, shredded lettuce, blue cheese dressing 16 $ US Smash Burger Choice of: Single or double, American cheese, Uptown sauce, shredded lettuce, tomato 13 $ 16 $ The Smoke Show Two smashed all beef patties, maple chili jam, smoked gouda sauce, garlic aioli, shredded lettuce, served on Texas toast. 17 $ The Lone Star Two smashed all beef patties, sharp cheddar, dill pickles, pickled jalapenos, shredded lettuce, southern honey mustard, served on Texas toast. 17 $ Pulled Pork Slow smoked mustard barbecue pulled pork, spicy pickled onions 16 $ Vegan Hummus Wrap Roasted garlic hummus, cashew tzatziki, mixed greens, assorted raw veggies, tortilla 15 $ Add Chicken 5 $ Add Shrimp 8 $ Buff Chicken Wrap Crispy chicken, buffalo sauce, blue cheese dressing, mixed greens, tortilla 15 $ Grilled Chicken Caesar Wrap Grilled chicken, romaine, Grana Padano, garlic croutons, house Caesar, tortilla 15 $ Sweets Fried Oreos Deep fried Oreos served with a dusting of powdered sugar. 10 $ Signature Cocktails Brew’d Awakening Tullamore D.E.W., Irish cream, Owen’s espresso mix Espresso Tini Hoodoo espresso vodka, Owen’s espresso mix The Barstool Transfusion Tito’s handmade vodka, Owen’s transfusion mix Strawberry Fields Forever Tito’s handmade vodka, strawberry simple, ginger beer, fresh lime Gone with The Gin Hendrick’s gin, cucumber, mint, fresh lime, soda, simple (Un)safe Haven Rumhaven, mint, fresh lime, soda simple Charleston Marg Proprietary mix made in charleston, casamigos blanco, served on the rocks Honey I’m Home Jack Daniel’s honey, simple, topped with soda water + lemonade Oh Spritz Aperol, bubbles, soda water, orange peel Palmetto Paloma Astral blanco, Grand Marnier, grapefruit, fresh lime Spicy Marg Los Sundays jalapeño tequila, Charleston mix proprietary mix made in Charleston Shipwreck’d Captain Morgan spiced rum seasonal juice blends Bodega Bloody Ketel one vodka, Charleston mix bold + spicy, pickle juice, candied bacon, old bay rim Uptown Old-Fashioned Elijah Craig bourbon, angostura, simple, orange wedge, bourbon cherries Social and Screwed Tito’s handmade vodka, triple sec, OJ Red Bull Vodka in a Souvenir U Up? Cup Frozen Cocktails Red Bull Vodka Frosé Frozen Margarita Main Squeeze Lemonade made with zest vodka Wine La Marca Prosecco Dark Horse Rosé 1/2 Bottles J Vineyard Pinot Noir Whitehaven Sauv Blanc Kendall Jackson Chardonnay N/A Bev Lemon Perfect Cold-pressed, lemon flavored water 5 $ Athletic N/A IPA Just the Haze IPA Red Bull Red Bull Energy Drink Red Bull Sugarfree Red Bull Red Edition (Watermelon) Red Bull Red Edition Sugarfree (Watermelon) 6 $ Draft Beer Pacifico Mazatlan, Mexico • 4.5% Mexican lager Guinness Dublin, Ireland • 4.2%, Irish stout Bud Light Anheuser-Busch • 4.2% light lager Trop Hop Kings calling brewing, Charleston, SC • 6.1% tropically infused American IPA Tropicalia Creature Comforts brewing, Athens, GA • 6.6% juicy IPA Hard Cider Angry Orchard, Walden, NY• 5% classic apple flavor, balanced and prosecco like Sam Adams Seasonal Samuel Adams brewing, Boston, MA • rotating seasonal brew Something Cold Edmund’s Oast brewing, Charleston, SC • 5% blonde ale Blue Moon Blue Moon Brewing, Golden, CO • 5.4% Belgian-Style Wheat Ale Bottles & Cans Westbrook White Thai (CHS) 5% Belgian wheat made with ginger and lemongrass Narragansett 16 oz Twisted Tea Island Coastal Lager (CHS) 4.2%, American lager Munkle Pilsner (CHS) 5.1%, crisp pilsner Kings Calling Trop Hop (CHS) 6.1%, Tropically infused American IPA Kings Calling Trop Hop Peachy Wheat (CHS) 5.2% American peach wheat Revelry Never Sunny (CHS) 7% hazy New England IPA Montucky Cold Snack Snackable light beer Magners Irish Cider All day, every day! Coors Banquet $5 Budweiser Bud Light Coors Light Coors Banquet Miller Lite Modelo Michelob Ultra Corona Corona Light Yuengling Seltzers & Canned Cocktails Truly Hard Seltzer White Claw Lone River Loverboy Stateside Vodka High Noon Sun Sips Tequila or vodka Nutrl Spritz Society Surfside Sun Cruiser Just Hard Squeezed Reservations Skip the line Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Uptown Social | Bar in Charleston, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "6fc2c972f45c",
      "downloadedAt": "2026-01-18T16:55:10.443Z",
      "trimmedAt": "2026-01-18T17:07:08.659Z",
      "sizeReduction": "92.1%"
    },
    {
      "url": "https://www.uptownsocialchs.com/private-events/",
      "text": "Main content starts here, tab to start navigating Private Events Slide 1 of 4 Slide 2 of 4 Slide 3 of 4 Slide 4 of 4 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Book an Event Looking for the perfect venue to host your next private event? Look no further! We offer an exquisite setting for all your special occasions. Whether you're planning a corporate gathering, a milestone celebration, or an intimate social event, our versatile spaces and exceptional service will make your event unforgettable. For all inquiries, please fill out the form below and we’ll be in touch soon. Inquire Now Reservations Skip the line Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Uptown Social | Bar in Charleston, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Private Event Software powered by Tripleseat",
      "hash": "a186f3221b06",
      "downloadedAt": "2026-01-18T16:55:11.499Z",
      "trimmedAt": "2026-01-18T17:07:08.679Z",
      "sizeReduction": "96.3%"
    },
    {
      "url": "https://www.uptownsocialchs.com/menus",
      "text": "Main content starts here, tab to start navigating Menus Slide 1 of 2 Slide 2 of 2 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides SIDELINE SPECIALS AVAILABLE DURING FOOTBALL Food Drinks SMOKED WINGS 6 for $12 | 12 for $22 HOUSE SMOKED WINGS, COATED IN SMOKY BROWN SUGAR DRY RUB OR MOP SAUCE - 22 12 $ $ BACON CHEESEBURGER SLIDERS 2 BACON CHEESEBURGER SLIDERS SERVED WITH FRIES 13 $ MEAT LOVERS PIZZA PEPPERONI, SAUSAGE, BACON, CAPICOLA, FRESH MOZZ 18 $ THE BLITZ PACKAGE 6 JALAPEÑO POPPERS, 6 MOZZARELLA STICKS, 8 BONELESS WINGS (comes with choice of one sauce) 10 PRETZEL BITES (comes with a side of queso, marinara and ranch) 25 $ Crafted by Brooklyn Legend: Anthony Falco Thin & Crispy Bar Pies The Falco Classic Fresh tomato sauce, fresh & aged mozz, Grana Padano, basil, oregano 15 $ Bleeker Fresh tomato sauce, aged mozz, pickled jalapeños, pepperoni, oregano, buttermilk ranch drizzle 18 $ Amsterdam Fresh tomato sauce, aged mozz, pickled jalapeños, pepperoni, mushroom, sausage, Grana Padano 18 $ The Village Fresh tomato sauce, aged mozz, Grana Padano, peppers, onions, mushroom, arugula 18 $ The Pesto’s Yet To Come Basil pesto sauce, tomato sauce, fresh mozz 15 $ Hot Honey Calabrian chili tomato sauce, cheddar jack, fried chicken, habañero honey jam, herbs 18 $ Wake N Bacon Black pepper cream, sausage, twice smoked bacon, cheddar jack cheese, fresh eggs, herbs Featured on “Food Paradise! 18 $ Buffalo CBR Ranch, mild buffalo sauce, cheddar jack, grilled chicken, twice smoked bacon, ranch & mild buffalo sauce drizzle, herbs 18 $ Hot Italiano Roasted garlic and herb oil base, fresh mozz, genoa salami, sun-dried tomatoes, hot honey drizzle 18 $ Social Sharing House Hummus Roasted garlic hummus, olive tapenade, crispy pita chips & fresh veggies 12 $ Chicken Fingers Hand breaded tenders, comes with side of any of our signature dipping sauces 12 $ Jalapeno Poppers Breaded and fried jalapeno stuffed with cream cheese and served with a side of ranch or marinara. 12 $ Mac n' Cheese Bites Deep fried and tossed in grated parmesan and herbs, served with a side of ranch. 10 $ Garlic Parmesan Beignets Fluffy and golden, roasted garlic butter, parmesan and herbs. Served with a side of marinara. 10 $ Crispy Brussels Sprouts Tossed in peanut sesame glaze, topped with wonton crisps and green onions. 11 $ Loaded Fries Queso, crispy bacon, house pickled jalapeños, scallions, ranch dressing 15 $ Buffalo Chicken Fry Platter Crispy chicken, buffalo sauce, ranch drizzle, cheddar jack cheese, topped with green onions. 17 $ Pulled Pork Fry Platter Slow smoked barbecue pulled pork, mop sauce drizzle, creamy smoked gouda sauce, caramelized onions. 17 $ Mozzarella Sticks Marinara dipping sauce 10 $ Chips and Queso House fried tortilla chips, rich creamy queso dip, with a touch of spice. 10 $ Pretzel Bites Queso, house mustard 10 $ Buff Chx Dip Served hot, melted cheddar jack cheese, celery, carrots, crispy pita chips 14 $ Salads Caesar Romaine, Grana Padano, garlic croutons 12 $ Socialite Seasonal mixed greens, red onion, tomato, cucumber 10 $ Spring Salad Seasonal mixed greens, candied walnuts, dried cherries, red onion, goat cheese, cherry tomatoes, lemon vinaigrette. 14 $ Add-Ons Chicken 5 $ Shrimp 8 $ Dressings Honey Balsamic Ranch Blue Cheese Caesar Lemon Vinaigrette $15 (Base Price) Comes with Aged Mozz, Grana Padano Create Your Own STEP ONE: Choose a Sauce Fresh Tomato Sauce • Black Pepper Cream • Calabrian Chili Tomato Sauce • Basil Pesto Sauce STEP TWO: Pick your Toppings (max of 3) Toppings Each 1 $ Veggies Arugula • Mushrooms • Spinach • Roasted Peppers • Onions • Pickled Jalapeños • Mixed Olives • Banana Peppers Meat Sausage • Pepperoni • Twice Smoked Bacon • Grilled Chicken • Fried Chicken • Shrimp (+$4) Cheese Cheddar Jack Cheese • Aged Mozz • Extra Mozz • Vegan Mozz (+$2) Traditional 6 for $12-- 12 for $22 Boneless 8 for $8-- 16 for $16-- 24 for $24 Wings Sauces Medium Hot Social Suicide (Good Luck) Sweet Chili Southern Honey Mustard Mop Sauce (BBQ) Garlic Parmesan Rubs Old Bay Ranch Caribbean Jerk Lemon Pepper Served with fries • Substitute gluten free bread +$2 Sammies & Wraps Oven Baked Chicken Parm Fresh mozz, crispy chicken breast, fresh basil, Grana Padano, ciabatta 17 $ Crispy Chicken Crispy chicken breast, shredded lettuce, dill pickles, garlic honey aioli 16 $ Buffalo Chicken Crispy chicken breast, buffalo sauce, cheddar, shredded lettuce, blue cheese dressing 16 $ US Smash Burger Choice of: Single or double, American cheese, Uptown sauce, shredded lettuce, tomato 13 $ 16 $ The Smoke Show Two smashed all beef patties, maple chili jam, smoked gouda sauce, garlic aioli, shredded lettuce, served on Texas toast. 17 $ The Lone Star Two smashed all beef patties, sharp cheddar, dill pickles, pickled jalapenos, shredded lettuce, southern honey mustard, served on Texas toast. 17 $ Pulled Pork Slow smoked mustard barbecue pulled pork, spicy pickled onions 16 $ Vegan Hummus Wrap Roasted garlic hummus, cashew tzatziki, mixed greens, assorted raw veggies, tortilla 15 $ Add Chicken 5 $ Add Shrimp 8 $ Buff Chicken Wrap Crispy chicken, buffalo sauce, blue cheese dressing, mixed greens, tortilla 15 $ Grilled Chicken Caesar Wrap Grilled chicken, romaine, Grana Padano, garlic croutons, house Caesar, tortilla 15 $ Sweets Fried Oreos Deep fried Oreos served with a dusting of powdered sugar. 10 $ Signature Cocktails Brew’d Awakening Tullamore D.E.W., Irish cream, Owen’s espresso mix Espresso Tini Hoodoo espresso vodka, Owen’s espresso mix The Barstool Transfusion Tito’s handmade vodka, Owen’s transfusion mix Strawberry Fields Forever Tito’s handmade vodka, strawberry simple, ginger beer, fresh lime Gone with The Gin Hendrick’s gin, cucumber, mint, fresh lime, soda, simple (Un)safe Haven Rumhaven, mint, fresh lime, soda simple Charleston Marg Proprietary mix made in charleston, casamigos blanco, served on the rocks Honey I’m Home Jack Daniel’s honey, simple, topped with soda water + lemonade Oh Spritz Aperol, bubbles, soda water, orange peel Palmetto Paloma Astral blanco, Grand Marnier, grapefruit, fresh lime Spicy Marg Los Sundays jalapeño tequila, Charleston mix proprietary mix made in Charleston Shipwreck’d Captain Morgan spiced rum seasonal juice blends Bodega Bloody Ketel one vodka, Charleston mix bold + spicy, pickle juice, candied bacon, old bay rim Uptown Old-Fashioned Elijah Craig bourbon, angostura, simple, orange wedge, bourbon cherries Social and Screwed Tito’s handmade vodka, triple sec, OJ Red Bull Vodka in a Souvenir U Up? Cup Frozen Cocktails Red Bull Vodka Frosé Frozen Margarita Main Squeeze Lemonade made with zest vodka Wine La Marca Prosecco Dark Horse Rosé 1/2 Bottles J Vineyard Pinot Noir Whitehaven Sauv Blanc Kendall Jackson Chardonnay N/A Bev Lemon Perfect Cold-pressed, lemon flavored water 5 $ Athletic N/A IPA Just the Haze IPA Red Bull Red Bull Energy Drink Red Bull Sugarfree Red Bull Red Edition (Watermelon) Red Bull Red Edition Sugarfree (Watermelon) 6 $ Draft Beer Pacifico Mazatlan, Mexico • 4.5% Mexican lager Guinness Dublin, Ireland • 4.2%, Irish stout Bud Light Anheuser-Busch • 4.2% light lager Trop Hop Kings calling brewing, Charleston, SC • 6.1% tropically infused American IPA Tropicalia Creature Comforts brewing, Athens, GA • 6.6% juicy IPA Hard Cider Angry Orchard, Walden, NY• 5% classic apple flavor, balanced and prosecco like Sam Adams Seasonal Samuel Adams brewing, Boston, MA • rotating seasonal brew Something Cold Edmund’s Oast brewing, Charleston, SC • 5% blonde ale Blue Moon Blue Moon Brewing, Golden, CO • 5.4% Belgian-Style Wheat Ale Bottles & Cans Westbrook White Thai (CHS) 5% Belgian wheat made with ginger and lemongrass Narragansett 16 oz Twisted Tea Island Coastal Lager (CHS) 4.2%, American lager Munkle Pilsner (CHS) 5.1%, crisp pilsner Kings Calling Trop Hop (CHS) 6.1%, Tropically infused American IPA Kings Calling Trop Hop Peachy Wheat (CHS) 5.2% American peach wheat Revelry Never Sunny (CHS) 7% hazy New England IPA Montucky Cold Snack Snackable light beer Magners Irish Cider All day, every day! Coors Banquet $5 Budweiser Bud Light Coors Light Coors Banquet Miller Lite Modelo Michelob Ultra Corona Corona Light Yuengling Seltzers & Canned Cocktails Truly Hard Seltzer White Claw Lone River Loverboy Stateside Vodka High Noon Sun Sips Tequila or vodka Nutrl Spritz Society Surfside Sun Cruiser Just Hard Squeezed Reservations Skip the line Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Uptown Social | Bar in Charleston, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "d19385c4f42a",
      "downloadedAt": "2026-01-18T16:55:12.187Z",
      "trimmedAt": "2026-01-18T17:07:08.743Z",
      "sizeReduction": "92.1%"
    },
    {
      "url": "https://www.uptownsocialchs.com/location/uptown-social/",
      "text": "Main content starts here, tab to start navigating Hours & Location 587 King Street, Charleston, SC 29403 (843) 793-1837 Hours: Monday - Thursday 12PM - 2AM Friday - Sunday 11:30AM - 2AM Get Directions Reservations Skip the line Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Uptown Social | Bar in Charleston, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "d93d3c5d0d5f",
      "downloadedAt": "2026-01-18T16:55:10.971Z",
      "trimmedAt": "2026-01-18T17:07:08.750Z",
      "sizeReduction": "96.6%"
    }
  ],
  "sizeReduction": "93.9%"
}