{
  "venueId": "ChIJ9xlmJ-Zk_ogRGst7T3-fsfY",
  "venueName": "Madra Rua Irish Pub",
  "venueArea": "North Charleston",
  "website": "http://www.madraruapub.com/",
  "scrapedAt": "2026-01-19T03:25:39.169Z",
  "trimmedAt": "2026-01-19T03:26:22.163Z",
  "pages": [
    {
      "url": "https://www.madraruapub.com/",
      "text": "[Page Title: Madra Rua Irish Pub | Best Irish Pub in the Lowcountry]\n\ntop of page RSVP EST. 2003 ABOUT Madra Rua The Irish Pub has always been the central meeting point and hub of neighborhood life in Ireland.  This is where family, friends and co-workers come on a daily basis to have a chat and a bit of \"craic.\" ​ Here at Madra Rua, our goal is to give you the best Irish Pub experience without having to fly across the Atlantic! ​ Whether you visit us for our Fish & Chips, our properly poured pints of Guinness or to watch your favorite soccer or rugby team, we hope you feel right at home in our little piece of Ireland here in the Lowcountry! MENUS AUTHENTIC IRISH FARE MADE FROM SCRATCH DAILY Pair a pint of Guinness with our authentic Fish & Chips, Irish Stew, Sheppard Pie, or Fisherman Pie. ​ And our Famous Burgers with Madra Rua Sauce! LAYERED DRAUGHTS AND UNIQUE COCKTAILS We are famous for our unique layered draughts, Bloody Marys, and creative cocktails. BEST OF CHARLESTON Voted Most Authentic Pub and Best North Charleston Bar! Thank you for your votes! LOCATIONS PARK CIRCLE 1034 East Montague Ave. North Charleston, SC 29405 | 843-554-2522 info@madraruapub.com SUMMERVILLE 2066 North Main Street Summerville, SC 29483 | 843-821-9434 info@madraruapub.com bottom of page",
      "hash": "14558bfed344",
      "downloadedAt": "2026-01-19T02:14:49.593Z",
      "trimmedAt": "2026-01-19T03:26:21.969Z",
      "sizeReduction": "99.8%"
    },
    {
      "url": "https://www.madraruapub.com/events",
      "text": "[Page Title: EVENTS | Madra Rua Irish Pub]\n\ntop of page LIVE EVENTS Watch Live Soccer & Rugby Matches Madra Rua is the destination to watch all your Soccer and Rugby in the Lowcountry! ​ PRIVATE EVENTS Book Your Next Event at Madra Rua! We can accommodate your next event, whether large or small, in a cozy pub atmosphere or on our outdoor patio. Email us with your event details, and we will help you through the planning process. Email us at for more information. info@madraruapub.com bottom of page",
      "hash": "5fb353b0020e",
      "downloadedAt": "2026-01-19T02:14:50.741Z",
      "trimmedAt": "2026-01-19T03:26:21.999Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "http://www.madraruapub.com/",
      "text": "[Page Title: Madra Rua Irish Pub | Best Irish Pub in the Lowcountry]\n\ntop of page RSVP EST. 2003 ABOUT Madra Rua The Irish Pub has always been the central meeting point and hub of neighborhood life in Ireland.  This is where family, friends and co-workers come on a daily basis to have a chat and a bit of \"craic.\" ​ Here at Madra Rua, our goal is to give you the best Irish Pub experience without having to fly across the Atlantic! ​ Whether you visit us for our Fish & Chips, our properly poured pints of Guinness or to watch your favorite soccer or rugby team, we hope you feel right at home in our little piece of Ireland here in the Lowcountry! MENUS AUTHENTIC IRISH FARE MADE FROM SCRATCH DAILY Pair a pint of Guinness with our authentic Fish & Chips, Irish Stew, Sheppard Pie, or Fisherman Pie. ​ And our Famous Burgers with Madra Rua Sauce! LAYERED DRAUGHTS AND UNIQUE COCKTAILS We are famous for our unique layered draughts, Bloody Marys, and creative cocktails. BEST OF CHARLESTON Voted Most Authentic Pub and Best North Charleston Bar! Thank you for your votes! LOCATIONS PARK CIRCLE 1034 East Montague Ave. North Charleston, SC 29405 | 843-554-2522 info@madraruapub.com SUMMERVILLE 2066 North Main Street Summerville, SC 29483 | 843-821-9434 info@madraruapub.com bottom of page",
      "hash": "ac8b38916516",
      "downloadedAt": "2026-01-19T02:14:49.454Z",
      "trimmedAt": "2026-01-19T03:26:22.054Z",
      "sizeReduction": "99.8%"
    },
    {
      "url": "https://www.madraruapub.com/menu-1",
      "text": "[Page Title: MENUS | Madra Rua Irish Pub]\n\ntop of page MENUS Lunch Menu (M-F 11am to 4pm)  / Dinner Menu (Daily 4pm -11pm) / Saturday & Sunday Brunch (10am -2pm) **Menu items and prices can vary at each location.** Download Drink Menu Download Lunch Menu Download Dinner Menu Download Brunch Menu Drinks Lunch Dinner Brunch Specialty Drinks - A Deliciously Dirty Martini made with Tito's Handmade Vodka Tito's-tini - Lunazul Blanco Tequila, Fresh Lime, Agave Madra Rua Margarita - An Irish Old Fashioned made with Bushmills Irish Whiskey Irish Old Fashioned - Wheatley Vodka, Fresh Lime, Ginger Beer​​ Wheatley Mule White Wine Alverdi Delle Venezia Pinot Grigio Italy The Seeker Sauvignon Blanc New Zealand Julia James Chardonnay California S.A. Prum Essence Riesling Germany d’Madeleine Rosé France Prosecco Rosé Italy Red Wine Substance Elemental Cabernet Washington Klinkerbrick Brick Mason Red California Highlands 41 Pinot Noir California Layered Draughts - Stella & Guinness DIRTY BLONDE - Guinness & Harp HALF & HALF - Guinness & Carlsberg GREAT DANE - Guinness & Magners Cider SNAKEBITE - Guinness & Fat Tire SKIDMARK - Guinness & Tennent’s GREAT SCOT - Guinness & Blue Moon BLACK AND BLUE - Guinness & Prosecco BLACK VELVET - Guinness & Smithwick’s BLACKSMITH - Guinness & Sam Adams SAMUEL JACKSON - Guinness & Yuengling DARKLING Draughts (Pints 16 oz.) Inquire about our rotating microbrew tap handles. Top any of our draught beers with Guinness. Stella Artois Carlsberg Pilsner Copenhagen, Denmark 5.0% Fat Tire Asheville, NC 5.2% Guinness Stout (Nitro) Dublin, Ireland 4.2% Harp Lager Dublin, Ireland 5.0% Holy City Seasonal North Charleston, SC Magners Irish Cider Clonmel, Ireland 4.5% Palmetto Seasonal Charleston, SC Sam Adams Seasonal Boston, MA Blue Moon Smithwick’s Irish Red Dublin, Ireland 4.5% Tennent’s Scottish Lager Glasgow, Scotland SC 4.0% Highland Gaelic Ale Irish Whiskey Paddy’s Bushmills Powers Tullamore D.E.W. Jameson Kinnity Castle ​ The Classics With two strips of bacon and sausage, grits or hash browns, and an English muffin. $13.00 TWO EGG BREAKFAST Three-egg omelet with choice of grits or hash browns and English Muffin. $10.00\nAdd the following ingredients:\nBacon • Sausage • Ham • Andouille Sausage $3 each\nMelty Mixed Cheese $1\nTomato, Onion, Bell Pepper, Mushrooms $1 each BUILD YOUR OWN OMELET Hash browns, scrambled eggs, and bacon, topped with sausage gravy and melted cheese.\nServed with an English muffin. $15.00 MADRA RUA BREAKFAST BOWL Corned beef hash, scrambled eggs, topped with sausage gravy, melted cheese, and cherry tomatoes.\nServed with an English muffin. $16.00 IRISH BREAKFAST BOWL $10.00 BISCUITS & SAUSAGE GRAVY With Andouille sausage and cheese. $15.00 SHRIMP & GRITS With maple syrup. $10.00 FRENCH TOAST Sides $4.00 GRITS $4.00 HASH BROWNS $4.00 BACON OR SAUSAGE $5.00 1/2 ORDER BISCUITS & GRAVY $7.00 CORNED BEEF HASH $4.00 FRESHLY BAKED SCONE $4.00\n(Substitute an English muffin for a scone $2) FRESHLY BAKED BISCUIT Benedicts Canadian bacon, poached eggs on an English muffin topped with hollandaise sauce. $15.00 CLASSIC EGGS BENEDICT Homemade corned beef hash, poached eggs on an English muffin topped with hollandaise sauce. $16.00 IRISH EGGS BENEDICT Fried green tomatoes, Canadian bacon, poached eggs on an English muffin topped with hollandaise sauce. $16.00 SOUTHERN EGGS BENEDICT Grilled 10 oz. steak, poached eggs on an English muffin topped with hollandaise sauce. $22.00 STEAK & EGGS BENEDICT Lunch Fare Battered Atlantic cod served with hand-cut fries. $16.00\nAvailable as a fish sandwich on a hoagie roll with lettuce, tomato, and Madra Rua's secret special sauce. $15.00 FISH & CHIPS Served with hashbrowns, grits, or hand-cut fries. $13.00 BLT SANDWICH Add an egg to your BLT. Served with hashbrowns, grits, or hand-cut fries. $16.00 BELT SANDWICH Fried green tomatoes, lettuce, and bacon on sourdough. Served with hashbrowns, grits, or hand-cut fries. $15.00\n(Add... Egg $1.00) FRIED GREEN TOMATO BLT SANDWICH 1/2 lb. burger topped with lettuce, tomato, and onion.\nServed with hand-cut fries and Madra Rua sauce. $15.00\n(Add... Cheese - $1.00 | Sautéed Mushrooms - $1.00\nBacon - $2.00 | Sautéed Onions - $1.00) MADRA RUA BEEF BURGER Note: We use peanut oil (no trans fat or cholesterol). The consumption of raw or undercooked foods such as meat, poultry, fish, shellfish, and eggs which contain harmful bacteria may cause serious illness or death. Traditional Irish Fare Traditional Irish stew with fresh Irish soda bread. $13.00 IRISH STEW Battered Atlantic cod served with hand-cut fries. $16.00\nAvailable as a fish sandwich on a hoagie roll with lettuce, tomato, and Madra Rua's secret special sauce. $18.00 FISH & CHIPS Angus beef, carrots, peas, onions, and traditional Irish gravy topped with mashed potatoes. Served with fresh Irish soda bread. $14.00\n(Add melty cheese for $1.00) SHEPHERD'S PIE Our corned beef and cabbage is cooked to perfection—the real Irish way, making it the best in the Southeast! Served with mashed potatoes or hand-cut fries and spicy Madra mustard. $17.00 CORNED BEEF & CABBAGE A classic dish from the west coast of Ireland. White fish and shrimp in a creamy sauce topped with mashed potatoes and melty cheese. Served with fresh Irish soda bread. $15.00 FISHERMAN'S PIE Sandwiches (Substitute hand-cut fries for soup or salad for $2.00) 1/2 lb. Angus beef burger topped with lettuce, tomato, and onion. Served with hand-cut fries and Madra Rua sauce. $16.00\nAdd... Cheese - $1.00 | Sautéed Mushrooms - $1.00\nBacon - $2.00 | Sautéed Onions - $1.00 MADRA RUA BEEF BURGER Our in-house corned beef topped with melty Swiss cheese, 1,000 Island dressing, and sauerkraut, sandwiched between buttered & grilled rye bread. Served with hand-cut fries. $16.00 RUA REUBEN Topped with lettuce and tomato, served with hand-cut fries and Madra Rua sauce. $14.00\nAdd... Cheese - $1.00 | Sautéed Mushrooms - $1.00\nBacon - $2.00 | Sautéed Onions - $1.00 GRILLED CHICKEN SANDWICH With Madra Rua sauce, au jus, and hand-cut fries. $17.50\nAdd... Cheese - $1.00 | Sautéed Mushrooms - $1.00\nBacon - $2.00 | Sautéed Onions - $1.00 PRIME RIB OF BEEF SANDWICH Pulled pork, house-made coleslaw, brioche bun. Served with hand-cut fries. $15.00 PULLED PORK SANDWICH Jumbo Wicklow Wings All wings include one wing sauce or dry rub, plus one ranch or bleu cheese dressing.\n$1.00 for each additional. $10.00 6 Wings $20.00 12 Wings Wing Sauce Flavors (mild, hot) Buffalo Dry Ranch Mango Habanero Lemon Pepper ​ ​ Note: We use peanut oil (no trans fat or cholesterol). The consumption of raw or undercooked foods such as meat, poultry, fish, shellfish, and eggs which contain harmful bacteria may cause serious illness or death. Traditional Irish Fare Traditional Irish stew with fresh Irish soda bread. $16.00 IRISH STEW Battered Atlantic cod served with hand-cut fries. $16.00\nAvailable as a fish sandwich on a hoagie roll with lettuce, tomato, and Madra Rua’s secret special sauce. $18.00 FISH & CHIPS Angus beef, carrots, peas, onions, and traditional Irish gravy topped with mashed potatoes.\nServed with fresh Irish soda bread. $18.00\n(Add melty cheese for $1.00) SHEPHERD'S PIE Our corned beef and cabbage is cooked to perfection—the real Irish way which makes it the best in the Southeast!\nServed with mashed potatoes or hand-cut fries and spicy Madra mustard. $20.00 CORNED BEEF & CABBAGE A classic dish direct from the west coast of Ireland.\nWhite fish and shrimp in a creamy sauce topped with mashed potatoes and melty cheese.\nServed with fresh Irish soda bread. $18.00 FISHERMAN'S PIE Sandwiches & More (Substitute hand-cut fries for soup or salad $2.00) 1/2 lb. Angus beef burger topped with lettuce, tomato, and onion.\nServed with hand-cut fries and Madra Rua sauce. $16.00\nAdd... Cheese - $1.00 | Sautéed Mushrooms - $1.00\nBacon - $2.00 | Sautéed Onions - $1.00 MADRA RUA BEEF BURGER 10 oz NY Strip over our signature gorgonzola mac and cheese. $Market Price NIGHTLY STEAK SPECIAL Our in-house corned beef topped with melty Swiss cheese, 1,000 Island dressing, and sauerkraut, sandwiched between buttered & grilled rye bread.\nServed with hand-cut fries. $16.00 RUA REUBEN Topped with lettuce and tomato and served with hand-cut fries and Madra Rua sauce. $14.00\nAdd... Cheese - $1.00 | Sautéed Mushrooms - $1.00\nBacon - $2.00 | Sautéed Onions - $1.00 GRILLED CHICKEN SANDWICH With Madra Rua sauce, au jus, and hand-cut fries. $17.50\nAdd... Cheese - $1.00 | Sautéed Mushrooms - $1.00\nBacon - $2.00 | Sautéed Onions - $1.00 PRIME RIB OF BEEF SANDWICH Pulled pork, house-made coleslaw, brioche bun. Served with hand-cut fries. $15.00 PULLED PORK SANDWICH Jumbo Wicklow Wings (All wings include one wing sauce or dry rub, plus one ranch or bleu cheese dressing. $1.00 for each additional.) $10.00 6 Wings $20.00 12 Wings Wing Sauce Flavors (mild, hot) Buffalo Dry Ranch Mango Habanero BBQ Lemon Pepper​ Note: We use peanut oil (no trans fat or cholesterol).\nThe consumption of raw or undercooked foods such as meat, poultry, fish, shellfish, and eggs which contain harmful bacteria may cause serious illness or death. bottom of page",
      "hash": "f1d45fad87e9",
      "downloadedAt": "2026-01-19T02:14:50.183Z",
      "trimmedAt": "2026-01-19T03:26:22.163Z",
      "sizeReduction": "98.5%"
    }
  ],
  "sizeReduction": "99.5%"
}