{
  "venueId": "ChIJO-77xst7_ogR5KmN-afPT_I",
  "venueName": "Bar Rollins",
  "venueArea": "Mount Pleasant",
  "website": "https://table22.com/bar-rollins",
  "scrapedAt": "2026-01-18T17:04:25.677Z",
  "trimmedAt": "2026-01-18T17:07:14.436Z",
  "pages": [
    {
      "url": "https://table22.com/bar-rollins",
      "text": "0 See where your business is leaving on the table new revenue , complete with a revenue forecast and branded storefront. Preview a membership concept for your restaurant or shop in under a minute See your concept No commitment. Free to try. Trusted by thousands of operators. Or talk to our growth experts → Trusted by thousands of top operators “Table22 is a rare win-win-win for the restaurant, the guest, and the platform. It has enabled us to drive 7 figures of new sales across subscriptions and retail, while helping us nurture guest relationships and extend our brand.” — , Rose’s Luxury (Washington, D.C.) Aaron Silverman “Working with Table22 has allowed us to focus on the fun parts of our wine club, while they handle the hard stuff. It doesn’t feel like you’re working with a 3rd party; they take the time to get to know your business, the people, and the needs.” — , Macchialina (Miami, FL) Jacqueline Pirolo “Partnering with Table22 was an excellent idea, and allowed us to increase revenue without the operational impact of regular take-out. Their team is very organized and very pleasant to work with — always a step ahead and ready to assist.” — , Sarma (Somerville, MA) Fernando Neves Reliable new revenue models for restaurants, wine shops, butchers, and more Table22 is the only system built for beyond-four-wall offerings like subscriptions, drops, and pre-orders Boston, MA Sarma Miami, FL Boia de Austin, TX Antonelli’s Cheese Brooklyn, NY WINNER Seattle, WA Musang New York, NY Il Buco Alimentari Learn more Grow your sales, not your workload Table22 powers your storefront, processes payments, does customer service, creates branded marketing, and handles fulfillment — all under your brand Automated marketing Launch campaigns, track conversions, and retain members using CRM tools built specifically for hospitality Unified commerce A customizable checkout built for subscriptions, memberships, and pre-orders White-glove logistics Our fulfillment network handles the complexities of in-person pickup, national shipping, and local delivery Getting started with Table22 is fast, easy, and free to try We'll design your program, build your storefront, and get you selling — all with no upfront cost Design your program We'll help you build the right subscription, membership, or pre-order program for your business — based on what's worked for thousands of operators like you We handle the hard parts Storefronts, payments, delivery logistics, customer support, and marketing – managed for you New revenue, from untapped customers 80% of subscribers haven't visited in the past year — we let you monetize patrons who love your brand but can't always walk through the door Made by you, powered by Table22 For busy operators, Table22 takes the headache out of subscription growth. Our platform unlocks predictable revenue, strengthens guest loyalty, and provides a creative canvas for sharing and discovery. Read how Montrose Cheese and Wine used Table22 to take their memberships to the next level. Read the case study → Learn why so many top restaurants and retailers trust Table22 From wine clubs to meal subscriptions, we help restaurants and retailers launch programs their customers love. See It For Yourself",
      "hash": "2f9fd520346b",
      "downloadedAt": "2026-01-18T16:55:44.453Z",
      "trimmedAt": "2026-01-18T17:07:14.436Z",
      "sizeReduction": "98.5%"
    }
  ],
  "sizeReduction": "98.5%"
}