{
  "venueId": "ChIJlc9md_pw_ogRizc0iCPByl0",
  "venueName": "Juanita Greenberg's Nacho Royale",
  "venueArea": "Mount Pleasant",
  "website": "http://www.juanitagreenbergs.com/",
  "scrapedAt": "2026-01-19T02:19:36.933Z",
  "trimmedAt": "2026-01-19T02:26:16.831Z",
  "pages": [
    {
      "url": "http://www.juanitagreenbergs.com/",
      "text": "[Page Title: Charleston's Top Mexican Restaurant | Juanita Greenburg's]\n\nSkip to main content \nTop Charleston Mexican Restaurant\nOrder Online: Take Out & Delivery \nWELCOME TO JUANITA GREENBERG’S\n\nAt Juanita Greenberg’s Nacho Royale we make real Mexican-ish food prepared fresh and fast. Over a decade ago, we first opened Juanita Greenberg’s Burrito Palace on Wentworth Street in Historic Charleston and featured original style nachos, quesadillas, and big fat healthy burritos. Now we have 2 locations – Upper King in downtown Charleston and Coleman Boulevard right near Shem Creek in Mt. Pleasant.\n\nBig Screen TV, 13 TVs and Pool Table in Mt. Pleasant\n\nMexican Food and a Whole Lot More\n\nJuanita’s has also grown from just awesome Mexican food to a whole lot more. Seating inside and outside at both locations, margaritas that will make you want to jump right into the glass, TV’s all around (so yeah we have that sports-bar thing going on too) and a casual, groovy, retro-cool atmosphere that’ll make you want to stick around long after your food’s gone!\n\nSo ANDELE ANDELE, ARIBA ARIBA! Get a group together and get to Juanita’s – the food’s cookin’ and the margaritas are waiting.We are dog friendly and smoking is allowed on the patio!",
      "hash": "0f7824034625",
      "downloadedAt": "2026-01-19T02:11:27.578Z",
      "trimmedAt": "2026-01-19T02:26:16.829Z",
      "sizeReduction": "97.8%"
    },
    {
      "url": "http://www.juanitagreenbergs.com/menu",
      "text": "[Page Title: Our Menu | Juanita Greenburg's]\n\nSkip to main content Our Menu",
      "hash": "6a08b1fd7029",
      "downloadedAt": "2026-01-19T02:11:27.931Z",
      "trimmedAt": "2026-01-19T02:26:16.831Z",
      "sizeReduction": "99.8%"
    }
  ],
  "sizeReduction": "98.7%"
}