{
  "venueId": "ChIJYTrmDWh7_ogRu2xztQY2jCI",
  "venueName": "Share House",
  "venueArea": "Downtown Charleston",
  "website": "https://www.sharehousechs.com/",
  "scrapedAt": "2026-01-18T17:04:27.790Z",
  "trimmedAt": "2026-01-18T17:11:07.052Z",
  "pages": [
    {
      "url": "https://www.sharehousechs.com/private-events",
      "text": "Main content starts here, tab to start navigating Private Events Book an Event Looking for the perfect venue to host your next private event? Look no further! We offer an exquisite setting for all your special occasions. Whether you're planning a corporate gathering, a milestone celebration, or an intimate social event, our versatile spaces and exceptional service will make your event unforgettable. For all inquiries, please fill out the form below, and we’ll be in touch soon. Inquire Now Reservations Email Signup Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Private Event Software powered by Tripleseat",
      "hash": "19748ed55004",
      "downloadedAt": "2026-01-18T16:54:50.700Z",
      "trimmedAt": "2026-01-18T17:11:06.863Z",
      "sizeReduction": "97.1%"
    },
    {
      "url": "https://www.sharehousechs.com/",
      "text": "Home Main content starts here, tab to start navigating hero video paused, press to play video Playing hero video, press to pause video Welcome to Share House Brought to you by Uptown Hospitality Group, Share House is a shore-inspired restaurant + bar located just off of lively King Street. Known for our legendary orange crushes, craveable food, and laid-back vibes, Share House is your ideal spot for daytime hangs, long lunches or late-night gatherings. What’s Cooking Shareable snacks, our legendary Bird Bucket featuring our house made crispy chicken tenders, inventive sandwiches, and our signature crush cocktails, all bringing a taste of nostalgia. Click below to see for yourself. View Menus Ready to Party? Whether you’re planning a birthday, milestone celebration, or casual get-together, Share House offers versatile spaces, great food and drinks, and a lively setting just off King Street. Submit an event inquiry today to start planning. Inquire Now Gift Cards & Merch Treat someone to a night of great food and drinks — or grab some merch. Share the Love Entertainment The absolute best live music, DJs, and events off King Street. Check out the lineup below. View Line Up Follow along @sharehousechs Reservations Email Signup Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "39aae90928f8",
      "downloadedAt": "2026-01-18T16:54:47.755Z",
      "trimmedAt": "2026-01-18T17:11:06.869Z",
      "sizeReduction": "95.3%"
    },
    {
      "url": "https://www.sharehousechs.com/location/share-house/",
      "text": "Main content starts here, tab to start navigating Hours & Location 23 Ann Street, Charleston, SC 29403 (843) 297-4806 info@sharehousechs.com Hour: Tuesday - Thursday 4pm - 2am Friday - Sunday 11am - 2am Get Directions Reservations Email Signup Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "4edcdcce1907",
      "downloadedAt": "2026-01-18T16:54:48.332Z",
      "trimmedAt": "2026-01-18T17:11:06.876Z",
      "sizeReduction": "97.9%"
    },
    {
      "url": "https://www.sharehousechs.com/weekly-specials/",
      "text": "Main content starts here, tab to start navigating Weekly Specials Slide 1 of 7 Slide 2 of 7 Slide 3 of 7 Slide 4 of 7 Slide 5 of 7 Slide 6 of 7 Slide 7 of 7 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Events We host a variety of events throughout the year that bring our community together and celebrate our shared interests. Check out our upcoming events and be sure to mark your calendar! Daily Happy Hour Trivia every Wednesday night at 6pm Live Band Karaoke every Thursday Load More Events Reservations Email Signup Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "52a713ce1c80",
      "downloadedAt": "2026-01-18T16:54:49.381Z",
      "trimmedAt": "2026-01-18T17:11:06.913Z",
      "sizeReduction": "98.0%"
    },
    {
      "url": "https://www.sharehousechs.com/menus/",
      "text": "Main content starts here, tab to start navigating Menus Slide 1 of 5 Slide 2 of 5 Slide 3 of 5 Slide 4 of 5 Slide 5 of 5 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Food Drinks Daily Specials Food Shareables Ball Park Jumbo Pretzel 8 $ honey mustard, chipotle cheese sauce Mozzarella Carozza 9 $ breaded mozz, parmesan, marinara sauce Fried Pickles 9 $ cornmeal breading, house party seasoning, black pepper ranch Chips & Queso 9 $ corn tortilla chips, chipotle cheese sauce Fried Shrimp 10 $ panko breading, lemon aioli, cocktail sauce Garlic & Herb Dip 8 $ red bell peppers, cucumber, carrots, potato chips Buffalo Chicken Quesadilla 11 $ buffalo tossed chicken tenders, takis, cheddar jack cheese, blue cheese dressing All Served on Waffle Fries Messy Fries Lobster 20 $ chipotle cheese sauce, lobster, bacon crumbles, scallions, smoked jalapeño honey ranch Girl Dinner 14 $ truffle tossed chicken tenders, parmesan, caesar salad Buffalo Chicken 16 $ chipotle cheese sauce, buffalo tossed chicken tenders, pickled jalapeños Chicken Parm 16 $ mozz, marinara, parmesan, chicken tenders Add grilled chicken + $5 | Add chicken fingers + $5 | Add fried shrimp + $5 Salads Caesar Salad 11 $ romaine, rosemary croutons, parmesaon cheese, caesar dressing Wedge Salad 11 $ iceberg, cherry tomato, crumbled bacon, rosemary croutons, scallions, blue cheese dressing Garden Salad 9 $ arugula, tomato, cucumber, carrots, red bell pepper, onion, balsamic vinaigrette $0.50 each Dipping Sauces House Party Sauce Smoked Jalapeño Honey Ranch Honey Mustard Orange Crush BBQ Lemon Aioli Buffalo Carolina Reaper Buffalo Sweet Chili Aioli Black Pepper Ranch Blue Cheese Dressing Chipotle Cheese Sauce Marinara Brined - Seasoned - Doubled Breaded - Crispy Fried Gluten Free Available! Chicken Tenders 3 Piece 6 $ 1 dipping sauce 3 Piece Combo 10 $ 1 dipping sauce & 1 side 5 Piece Combo 17 $ 2 dipping sauces & 2 sides Bird Bucket 22 $ 8 tenders served over waffle fries 4 dipping sauces & 2 sides served in our signature Bird Bucket All come with a choice of two sides Gluten free bun available Sammies + Dogs Smash Burger* 18 $ two beef patties*, cheddar cheese, pickles, house party sauce, potato bun Crush Puppy Dog 17 $ all beef hot dog, cheddar cheese, bbq short rib baked beans, sweet onion, poppy seeded bun Mack's Stoned Dog 17 $ all beef hot dog, bacon crumbles, chipotle mac n' cheese, scallions, smoked jalapeño honey ranch Chicken Caprese Sandwich* 18 $ grilled chicken breast, mozz, arugula, tomato, pesto, balsamic glaze, potato bun Chicken Caesar Salad Wrap 18 $ three chicken tenders, romaine lettuce, parmesan, tortilla Lobster Patty Melt* 24 $ beef patty*, lobster salad, white american cheese, potato bun Lobster Roll 32 $ creamy lobster salad, buttered brioche roll Sides Potato Chips 5 $ Waffle Fries 5 $ try them seasoned! Loaded Potato Salad 5 $ Chipotle Mac & Cheese 5 $ Lemon Poppy Cole Slaw 5 $ BBQ Short Rib Baked Beans 5 $ Cucumber Salad 5 $ Side Garden Salad 5 $ Clam Chowder 5 $ Desserts Soft Serve Ice Cream 6 $ vanilla, chocolate, or swirl! Fried Oreos 8 $ pancake batter, powdered sugar, chocolate sauce Make it a sundae! Donut Holes 8 $ cinnamon sugar, caramel sauce Make it a sundae! A 20% gratuity will be added to all parties of 6 or more. *Consuming raw or undercooked meats, poultry, seafood, shellfish or eggs may increase your risk of foodborne illness. Drinks Crushes Orange Crush Smirnoff Orange Vodka, triple sec, soda, fresh squeezed orange juice on top Key Lime Crush Sminoff Vanilla Vodka, triple sec, simple syrup, fresh squeeze lime juice, whipped cream, graham cracker crumbs Paloma Crush Don Julio Blanco, triple sec, lime juice, fresh squeezed grapefruit on top Watermelon Crush Smirnoff Watermelon, triple sec, lemon lime soda, fresh watermelon juice Cocktails Strawberry Basil Smash Titos Handmade Vodka, strawberry infused St. Germain, strawberry purée, basil, agave, fresh lemon juice, topped with soda Orange Mojito Tanqueray Gin, orange simple syrup, mint, fresh lime juice, topped with soda Habañero Margarita Habañero steeped Lunazul Blanco, Chinola, agave, fresh lime Pineapple Mezcalita Union Mezcal, Cointreau, agave, fresh lime, pineapple juice Serves 4 Large Format Citrus Bowl 40 $ Zest Lime, Zest Lemon, ginger beer, fresh lime, Jarritos grapefruit soda Ann Street Staples Bodega Bloody Ketel One Vodka, Charleston Mix Bold and Spicy, pickle juice, bacon, Old Bay rum Bodega Espresso Martini Ketel One Vodka, Counter Culture Brew, Black River Coffee Liqueur, chocolate bitters, cocoa powder Drafts PACIFICO | Pacifico Brewery, Mazatlán, México 4.5% Crisp and clean Mexican pilsner Tropicália | Creature Comforts Brewing Co., Athens, GA 6.6% Ripe and juicy IPA Holy City Pilsner | Holy City Brewery, Charleston, SC 5% Smooth drinking pilsner from the Lowcountry PARK Circle Pale | Commonhouse Aleworks, North Charleston, SC 5.5% Year round, hop-forward pale Perni-haze | Wicked Weed Brewing, Asheville, NC 6.9% Hazy IPA with effortless finish TROP HOP | Kings Calling Brewery, Charleston, SC 6.1% Tropical infused IPA from “the guy” on “that show” Sam Seasonal | Boston Beer Co., Boston, MA 5.3% Guinness Bud Light Angry Orchard Craft in a can Bottles & Cans Westbrook White Thai | Charleston, SC 5% Belgian wheat with ginger and lemongrass Dogfish Head SeaQuench Ale | Rehoboth, DE 4.9% Sour mash Revelry Never Sunny | Charleston, SC 7% Intentionally hazy IPA with juicy expression Sycamore IPA | Asheville, NC 7.5% Rotating, ask your server House staples Budweiser Bud Light Miller Lite Coors Light Corona Corona Premier Michelob Ultra Twisted Tea Modelo Red Stripe Guinness Montucky Cold Snacks Athletic Brewing Run Wild (NA) Sam Adams Just the Haze (NA) Seltzers, Ciders & Canned Cocktails Magners Cider Truly White Claw Twisted Tea Surfside Iced Tea & Vodka High Noon Sun Sips Tequila High Noon Sun Sips Long Drink Lone River Ranch Water Nütrl Spritz Society Stateside Vodka Soda Just Hard Squeezed Wine Dark Horse Pinot Noir Can Dark Horse Rosé Can Dark Horse Sauvignon Blanc La Marca Prosecco .187 Bottle 1/2 Bottle Amalaya Malbec J Vineyards Pinot Noir Line 39 Cabernet Sauvignon Kendall Jackson Chardonnay Whitehaven Sauvignon Blanc 5 Red Bull Red Bull Energy Drink Red Bull Sugar Free Red Bull Red Edition (Watermelon) Red Bull Red Edition Sugar Free (Watermelon) Daily Specials Monday - Sunday 4 PM - 8 PM Happy Hour 1/2 Off Entire Bar Chips & Salsa | Chips & Queso 3 $ Reservations Email Signup Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "96ded737b02d",
      "downloadedAt": "2026-01-18T16:54:47.796Z",
      "trimmedAt": "2026-01-18T17:11:06.985Z",
      "sizeReduction": "93.5%"
    },
    {
      "url": "https://www.sharehousechs.com/private-events/",
      "text": "Main content starts here, tab to start navigating Private Events Book an Event Looking for the perfect venue to host your next private event? Look no further! We offer an exquisite setting for all your special occasions. Whether you're planning a corporate gathering, a milestone celebration, or an intimate social event, our versatile spaces and exceptional service will make your event unforgettable. For all inquiries, please fill out the form below, and we’ll be in touch soon. Inquire Now Reservations Email Signup Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Private Event Software powered by Tripleseat",
      "hash": "e3e1d93f270d",
      "downloadedAt": "2026-01-18T16:54:48.853Z",
      "trimmedAt": "2026-01-18T17:11:06.988Z",
      "sizeReduction": "97.1%"
    },
    {
      "url": "https://www.sharehousechs.com/menus",
      "text": "Main content starts here, tab to start navigating Menus Slide 1 of 5 Slide 2 of 5 Slide 3 of 5 Slide 4 of 5 Slide 5 of 5 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Food Drinks Daily Specials Food Shareables Ball Park Jumbo Pretzel 8 $ honey mustard, chipotle cheese sauce Mozzarella Carozza 9 $ breaded mozz, parmesan, marinara sauce Fried Pickles 9 $ cornmeal breading, house party seasoning, black pepper ranch Chips & Queso 9 $ corn tortilla chips, chipotle cheese sauce Fried Shrimp 10 $ panko breading, lemon aioli, cocktail sauce Garlic & Herb Dip 8 $ red bell peppers, cucumber, carrots, potato chips Buffalo Chicken Quesadilla 11 $ buffalo tossed chicken tenders, takis, cheddar jack cheese, blue cheese dressing All Served on Waffle Fries Messy Fries Lobster 20 $ chipotle cheese sauce, lobster, bacon crumbles, scallions, smoked jalapeño honey ranch Girl Dinner 14 $ truffle tossed chicken tenders, parmesan, caesar salad Buffalo Chicken 16 $ chipotle cheese sauce, buffalo tossed chicken tenders, pickled jalapeños Chicken Parm 16 $ mozz, marinara, parmesan, chicken tenders Add grilled chicken + $5 | Add chicken fingers + $5 | Add fried shrimp + $5 Salads Caesar Salad 11 $ romaine, rosemary croutons, parmesaon cheese, caesar dressing Wedge Salad 11 $ iceberg, cherry tomato, crumbled bacon, rosemary croutons, scallions, blue cheese dressing Garden Salad 9 $ arugula, tomato, cucumber, carrots, red bell pepper, onion, balsamic vinaigrette $0.50 each Dipping Sauces House Party Sauce Smoked Jalapeño Honey Ranch Honey Mustard Orange Crush BBQ Lemon Aioli Buffalo Carolina Reaper Buffalo Sweet Chili Aioli Black Pepper Ranch Blue Cheese Dressing Chipotle Cheese Sauce Marinara Brined - Seasoned - Doubled Breaded - Crispy Fried Gluten Free Available! Chicken Tenders 3 Piece 6 $ 1 dipping sauce 3 Piece Combo 10 $ 1 dipping sauce & 1 side 5 Piece Combo 17 $ 2 dipping sauces & 2 sides Bird Bucket 22 $ 8 tenders served over waffle fries 4 dipping sauces & 2 sides served in our signature Bird Bucket All come with a choice of two sides Gluten free bun available Sammies + Dogs Smash Burger* 18 $ two beef patties*, cheddar cheese, pickles, house party sauce, potato bun Crush Puppy Dog 17 $ all beef hot dog, cheddar cheese, bbq short rib baked beans, sweet onion, poppy seeded bun Mack's Stoned Dog 17 $ all beef hot dog, bacon crumbles, chipotle mac n' cheese, scallions, smoked jalapeño honey ranch Chicken Caprese Sandwich* 18 $ grilled chicken breast, mozz, arugula, tomato, pesto, balsamic glaze, potato bun Chicken Caesar Salad Wrap 18 $ three chicken tenders, romaine lettuce, parmesan, tortilla Lobster Patty Melt* 24 $ beef patty*, lobster salad, white american cheese, potato bun Lobster Roll 32 $ creamy lobster salad, buttered brioche roll Sides Potato Chips 5 $ Waffle Fries 5 $ try them seasoned! Loaded Potato Salad 5 $ Chipotle Mac & Cheese 5 $ Lemon Poppy Cole Slaw 5 $ BBQ Short Rib Baked Beans 5 $ Cucumber Salad 5 $ Side Garden Salad 5 $ Clam Chowder 5 $ Desserts Soft Serve Ice Cream 6 $ vanilla, chocolate, or swirl! Fried Oreos 8 $ pancake batter, powdered sugar, chocolate sauce Make it a sundae! Donut Holes 8 $ cinnamon sugar, caramel sauce Make it a sundae! A 20% gratuity will be added to all parties of 6 or more. *Consuming raw or undercooked meats, poultry, seafood, shellfish or eggs may increase your risk of foodborne illness. Drinks Crushes Orange Crush Smirnoff Orange Vodka, triple sec, soda, fresh squeezed orange juice on top Key Lime Crush Sminoff Vanilla Vodka, triple sec, simple syrup, fresh squeeze lime juice, whipped cream, graham cracker crumbs Paloma Crush Don Julio Blanco, triple sec, lime juice, fresh squeezed grapefruit on top Watermelon Crush Smirnoff Watermelon, triple sec, lemon lime soda, fresh watermelon juice Cocktails Strawberry Basil Smash Titos Handmade Vodka, strawberry infused St. Germain, strawberry purée, basil, agave, fresh lemon juice, topped with soda Orange Mojito Tanqueray Gin, orange simple syrup, mint, fresh lime juice, topped with soda Habañero Margarita Habañero steeped Lunazul Blanco, Chinola, agave, fresh lime Pineapple Mezcalita Union Mezcal, Cointreau, agave, fresh lime, pineapple juice Serves 4 Large Format Citrus Bowl 40 $ Zest Lime, Zest Lemon, ginger beer, fresh lime, Jarritos grapefruit soda Ann Street Staples Bodega Bloody Ketel One Vodka, Charleston Mix Bold and Spicy, pickle juice, bacon, Old Bay rum Bodega Espresso Martini Ketel One Vodka, Counter Culture Brew, Black River Coffee Liqueur, chocolate bitters, cocoa powder Drafts PACIFICO | Pacifico Brewery, Mazatlán, México 4.5% Crisp and clean Mexican pilsner Tropicália | Creature Comforts Brewing Co., Athens, GA 6.6% Ripe and juicy IPA Holy City Pilsner | Holy City Brewery, Charleston, SC 5% Smooth drinking pilsner from the Lowcountry PARK Circle Pale | Commonhouse Aleworks, North Charleston, SC 5.5% Year round, hop-forward pale Perni-haze | Wicked Weed Brewing, Asheville, NC 6.9% Hazy IPA with effortless finish TROP HOP | Kings Calling Brewery, Charleston, SC 6.1% Tropical infused IPA from “the guy” on “that show” Sam Seasonal | Boston Beer Co., Boston, MA 5.3% Guinness Bud Light Angry Orchard Craft in a can Bottles & Cans Westbrook White Thai | Charleston, SC 5% Belgian wheat with ginger and lemongrass Dogfish Head SeaQuench Ale | Rehoboth, DE 4.9% Sour mash Revelry Never Sunny | Charleston, SC 7% Intentionally hazy IPA with juicy expression Sycamore IPA | Asheville, NC 7.5% Rotating, ask your server House staples Budweiser Bud Light Miller Lite Coors Light Corona Corona Premier Michelob Ultra Twisted Tea Modelo Red Stripe Guinness Montucky Cold Snacks Athletic Brewing Run Wild (NA) Sam Adams Just the Haze (NA) Seltzers, Ciders & Canned Cocktails Magners Cider Truly White Claw Twisted Tea Surfside Iced Tea & Vodka High Noon Sun Sips Tequila High Noon Sun Sips Long Drink Lone River Ranch Water Nütrl Spritz Society Stateside Vodka Soda Just Hard Squeezed Wine Dark Horse Pinot Noir Can Dark Horse Rosé Can Dark Horse Sauvignon Blanc La Marca Prosecco .187 Bottle 1/2 Bottle Amalaya Malbec J Vineyards Pinot Noir Line 39 Cabernet Sauvignon Kendall Jackson Chardonnay Whitehaven Sauvignon Blanc 5 Red Bull Red Bull Energy Drink Red Bull Sugar Free Red Bull Red Edition (Watermelon) Red Bull Red Edition Sugar Free (Watermelon) Daily Specials Monday - Sunday 4 PM - 8 PM Happy Hour 1/2 Off Entire Bar Chips & Salsa | Chips & Queso 3 $ Reservations Email Signup Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "f2de2f950111",
      "downloadedAt": "2026-01-18T16:54:50.068Z",
      "trimmedAt": "2026-01-18T17:11:07.044Z",
      "sizeReduction": "93.5%"
    },
    {
      "url": "https://www.sharehousechs.com/weekly-specials",
      "text": "Main content starts here, tab to start navigating Weekly Specials Slide 1 of 7 Slide 2 of 7 Slide 3 of 7 Slide 4 of 7 Slide 5 of 7 Slide 6 of 7 Slide 7 of 7 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Events We host a variety of events throughout the year that bring our community together and celebrate our shared interests. Check out our upcoming events and be sure to mark your calendar! Daily Happy Hour Trivia every Wednesday night at 6pm Live Band Karaoke every Thursday Load More Events Reservations Email Signup Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "ffd5fb2b3241",
      "downloadedAt": "2026-01-18T16:54:51.329Z",
      "trimmedAt": "2026-01-18T17:11:07.052Z",
      "sizeReduction": "98.0%"
    }
  ],
  "sizeReduction": "95.5%"
}