{
  "venueId": "ChIJK2aEHDt7_ogRTVyqBtnknyU",
  "venueName": "Madison Maison",
  "venueArea": "Downtown Charleston",
  "website": "https://www.madisonmaisonchs.com/",
  "scrapedAt": "2026-01-19T02:19:32.980Z",
  "trimmedAt": "2026-01-19T02:22:05.777Z",
  "pages": [
    {
      "url": "https://www.madisonmaisonchs.com/events",
      "text": "[Page Title: PRIVATE EVENTS | Madison Maison CHS]\n\ntop of page \nElevate your next private event with the unmatched luxury of Madison Maison, Charleston’s premier champagne and caviar lounge. Designed to embody the sophistication of New York City and the rich cultural allure of France, our exclusive venue offers an intimate yet lavish setting for your most memorable gatherings.\n\nBrought to life by Kenner Group Hospitality, Madison Maison provides a curated selection of prestigious champagnes, our exclusive ‘RG Caviar,’ gourmet delectable small bites, and artisanal craft cocktails. Whether you’re hosting a elegant soirée, a milestone celebration, or a corporate outing, a milestone celebration, our expert team will ensure a seamless and bespoke experience tailored to your vision.\n\nNestled on Calhoun Street, in the heart of historic Charleston, Madison Maison is the ultimate destination for those seeking a refined and opulent atmosphere for their private events. Raise a glass and toast to an evening of glamour, sophistication, and unparalleled hospitality.\n\nNow accepting private event inquiries—let us bring your extraordinary occasion to life.\nINQUIRE THE BLUE ROOM \nThe Blue Room offers a sophisticated, private experience with a dedicated bar, elegant bar seating, and curtains that can enclose the space for an intimate atmosphere, accommodating up to 30 guests. While it can be rented privately, the room remains accessible during regular hours, allowing you to enjoy your event while still being part of the energy of the space. \n\nA unique feature is its elevated position, providing a prime view over the Red Room, so you can be seen by those below while enjoying the lively atmosphere. Perfect for bachelorette and bachelor parties, birthdays, and upscale gatherings, the Blue Room offers the ideal setting for celebrating in style while staying connected to the DJ and the vibrant crowd in the Red Room. \n\nFor a true VIP experience, the curtains can be adjusted for a balance of privacy and visibility, giving you the best of both worlds.\nINQURE HERE \nThe Red Room is a stunning, eclectic space that combines modern luxury with bold design. With a capacity for up to 250 guests, it offers a spacious and open environment perfect for a variety of events, from lively celebrations to intimate gatherings. \n\nThe room features a private bar, comfortable lounge, and bar seating, creating an atmosphere where style and comfort meet. The DJ booth enhances the vibrant energy, making it the ideal setting for a range of social events and unforgettable parties.\n\nWith its striking design and expansive layout, the Red Room provides an unparalleled backdrop for guests to enjoy a sophisticated, yet dynamic atmosphere. Whether you're hosting a glamorous cocktail party, an elegant soirée, or an immersive event, the Red Room’s luxurious ambiance promises to leave a lasting impression.\nTHE RED ROOM INQURE HERE bottom of page",
      "hash": "70a8223b5b78",
      "downloadedAt": "2026-01-19T02:09:05.531Z",
      "trimmedAt": "2026-01-19T02:22:05.575Z",
      "sizeReduction": "99.6%"
    },
    {
      "url": "https://www.madisonmaisonchs.com/",
      "text": "[Page Title: Madison Maison CHS]\n\ntop of page \n873C2DCA-855B-499C-ADC1-9BE9B1F1F103\n\nmaison_opening_352_jwb\n\n1/14\n\" IT'S GIVING C*** \" - CLAYNE SLAYIN From the guy that brought you Milk Bar, Ritual, Hive, MOFU Shoppe, Social Club, NOMAD, Dogwood and many more here is the brains behind the company, his wife. Charleston's newest and most anticipated champagne & caviar bar. Located on Calhoun Street, experience the epitome of luxury. F ashioned after the essence of NYC, the birthplace of the owner, and the rich cultural tapestry of France, this establishment is a seamless blend of sophistication that welcomes ALL. Our lounge offers a curated selection of exquisite champagnes, exclusive 'KILO Caviar,' delectable small bites, and artisanal craft cocktails. Kenner Group Hospitality AGE 23+ EAT ME DRINK ME LICK ME \"COU COU!\" RESERVATIONS \" Absolutely loved this place! The ambiance is chic and inviting, the champagne selection is top-notch, and the staff made the whole experience feel special. A perfect spot for date night or celebrating with friends. Can't wait to come back! \" CHS TODAY Read More Watch Here Read More CALL ME Contact us CONTACT US 843-974-3995 LOCATION! FOR PRIVATE\nEVENTS vip ​ ​ Please Click Below For Vip/Private Event Inquiries 145 Calhoun St, Unit 201, Charleston, SC, 29401 CLICK ME OPENING HOURS ​ ​ Wednesday & Thursday 5pm- LATE ​ Friday & Saturday 5pm-2am Sunday- CLOSED ​ ​ ​ For Press & Media Requests Please Email marketing@kennergrp.com AGES 23+ bottom of page",
      "hash": "8dbbb117b8b4",
      "downloadedAt": "2026-01-19T02:09:04.885Z",
      "trimmedAt": "2026-01-19T02:22:05.638Z",
      "sizeReduction": "99.8%"
    },
    {
      "url": "https://www.madisonmaisonchs.com/menu",
      "text": "[Page Title: MENU | MADISON MAISON]\n\ntop of page OUR MENU Our Menu \nBITES\n\nMénage à trois\nA trio of Snacks, Including Crisps, Castelvetrano Olives, and Seasoned Nuts $15 \nCharcuterie\nSelection of Artisan Cheeses and Cured Meats, Served with\nClassic Accoutrements $26 \nChicken Nuggets (5)\nCreme Fraiche, Caviar \nHouse Made “Tater Tots” (5)\nCreme Fraiche, Caviar $45 \nOyster on the Half Shell (1)\nCreme Fraiche, Caviar, Lemon Oil $40 \nTruffle Frites\nRoasted Garlic Aioli \nCAVIAR SERVICE\n\nCRÈME FRAICHE, POTATO CHIPS\n\nGOLDEN KALUGA\n30g $80 \nSIBERIAN OSETRA\n30g $95 \nGOLDEN KALUGA\n125g $230 \nCOCKTAILS\n\nChai Se Bon\nA blend of Westland and Angel’s Envy, Chai Orgeat (almonds), St. George Spiced Pear Liqueur, Lemon Juice \nEau De Vie\nGrey Goose Vodka, Pomegranate Liqueur, Earl Grey Tea, Lemon Juice, and a splash of Club Soda \nLemon Vanilla Bean Martini\nLimoncello, Ketel One Infused Vanilla Vodka, Lemon Juice \nSleepless Siren\nGrey Goose Vodka, Faretti Espresso Liquor, Espresso \nFilthy Fix\nKetel One Vodka, House Olive Brine, Blue Cheese Stuffed Olives \nL'Inferno Margarita\nPatron Silver Tequila, Lime, Jalapeño and Honey Infused Liquor \nFoam and Fortune*\nCazadores Tequila, Lemon, Aperol, Strawberry Cordial, Egg\nWhite, Angostura Bitters \nMon Chéri Biscotti\nCherry Vodka, Orgeat, Luxardo Cherries, Faretti Biscotti, Lemon Juice \nFoufune*\nVodka, Passionfruit, Lime, Egg White \nBUBBLES\n\nLOUIS PERDRIER BRUT\n750ML $120 \nLALLIER BRUT 750ML\n\nPOL ROGER BRUT\n750 ML $300 \nLOUIS ROEDERER BRUT\n\nVEUVE CLICQUOT LA GRAND DAME\n\nPERRIER JOUET “LA BELLE EPOQUE” BRUT\n\nPERRIER JOUET “LA BELLE EPOQUE” ROSE\n\nDOM PERIGNON\n750 ML $750 \nARMAND DE BRUGNAC ACE OF SPADES\n750ML $800 \nWINES\n\nHugel Pinot Gris\n$16 \nJolivet \"Attitude\" Sauvignon Blanc\n$15 \nLatour Macon Lugny Les Genievres Chardonay\n$17 \nMinuty Prestige Rose'\n$16 \nChez Les Trois Bordeaux\n$22 \nHeresie Red Blend\n$15 \nLallier Brut Champagne\n$25 \nCave de Lugny Cremant de Bourgogne Rose' (SPARKLING)\n$14 \nBEERS\n\nMichelob Ultra\n$6 \nStella Artois\n$7 \nPernicious IPA\n$8 \nMiller Highlife Pony\n\nZERO PROOF COCKTAILS\n\nSmooth Talker\nLime, Jalapeño, Honey, Club Soda, Tajin Rim \nChilled and Chai\nChai Tea, Lemon, Seasonal Simple \nViva La Punch\nOrgeat, Lemon, Cranberry, Orange, Mint \nDESSERT COCKTAILS\n\nMon Chéri Biscotti\nCherry Vodka, Orgeat, Luxardo Cherries, Faretti Biscotti, Lemon Juice \nLemon Vanilla Bean Martini\nLimoncello, Ketel One Infused Vanilla Vodka, Lemon Juice \nDESSERT\n\nMadeleines (3)\n\nVanilla Bean Gelato\nXVO, Flaked Sea Salt, Finger Lime \"Caviar\" \nDIGESTIFS\n\nFERNET BRANCA & MENTA\n\nMONTENEGRO\n\nCYNAR\n\nBRAULIO\n\nBECHEROVKA\nBITES CAVIAR DRINK bottom of page",
      "hash": "99c4eb9a8b39",
      "downloadedAt": "2026-01-19T02:09:04.978Z",
      "trimmedAt": "2026-01-19T02:22:05.777Z",
      "sizeReduction": "99.8%"
    }
  ],
  "sizeReduction": "99.7%"
}