{
  "venueId": "ChIJyUgfhuhk_ogR-v2Ca01_6Us",
  "venueName": "DIG In The Park",
  "venueArea": "North Charleston",
  "website": "http://diginthepark.com/",
  "scrapedAt": "2026-01-18T17:04:32.103Z",
  "trimmedAt": "2026-01-18T17:13:06.009Z",
  "pages": [
    {
      "url": "http://diginthepark.com/all-day-menu",
      "text": "All Day Menu Download our complete All Day Menu menu (PDF). APPETIZERS LOADED NACHOS Tortilla chips topped with queso, shredded lettuce, black beans, jalapeños, fresh pico & sour cream Price: 10.99 Price: Add Chicken 6 Price: Add Chili 5 Price: Add Pork 5 Price: Add Steak 7 Price: Add Shrimp 7 BING BANG BOOM SHRIMP Breaded, lightly fried & served with a sweet & spicy chili sauce Price: 10.99 CHEESE CURDS Fried garlic herb cheese curds, served with marinara Price: 9.99 QUESO DIP House-made cheese sauce with diced peppers, onions, & tomatoes, served with tortilla chips Price: 8.99 SOUTHWEST SPRING ROLLS House-made spring rolls with chicken, black beans, corn, bell peppers, & cheese. Served with sweet & spicy chili sauce Price: 11.99 JUMBO PRETZEL Jumbo sized, sweet bavarian pretzel, baked & served with queso or spicy mustard Price: 10.99 CHEESE QUESADILLA Melted mozzarella & cheddar cheese, served with fresh pico & sour cream Price: 8.99 Price: Add Chicken 6 Price: Add Shrimp 7 Price: Add Steak 7 BUFFALO CAULIFLOWER Breaded, lightly fried & tossed in buffalo sauce Price: 9.99 FRIED PICKLES Breaded pickle chips, fried & served with a spicy ranch dipping sauce Price: 8.99 LOADED TOTCHOS Tater tots topped with queso, bacon bits, shredded lettuce, & ranch dressing Price: 10.99 CHICKEN TENDERS Hand breaded tenders served with honey mustard & a choice of side Price: 13.99 SALADS DRESSINGS Ranch - Blue Cheese - Caesar - Balsamic Vinaigrette - Honey Mustard - Spicy Ranch - Itailan - Cucumber Wasabi SOUTHWEST SALAD Blackened chicken, iceberg lettuce, diced onions, black beans, jalapeños, fresh pico, shredded cheddar cheese & sour cream Price: 14.99 CHEF SALAD Mixed greens, tomatoes, bacon bits, hard-boiled egg, ham, turkey & swiss cheese Price: 15.99 AHI TUNA SALAD Seared tuna, edamame, shredded carrots, roasted tomatoes, & pickled onion. Topped with sesame seeds & a wasabi aioli dressing Price: 17.99 HOUSE SALAD Mixed greens, shredded carrots, tomatoes, red onions, cucumbers & croutons Price: 8.99 CAESAR SALAD Chopped romain lettuce tossed in caesar dressing & parmesan cheese, topped with croutons Price: 8.99 SALAD ADDITIONS ADD: CHICKEN 6 - SHRIMP 7 BOWLS SANTA FE CHICKEN BOWL Grilled chicken, rice, black bean corn salsa, avocado, fresh cilantro & chipotle sour cream Price: 14.99 CHIPOTLE SHRIMP BOWL Grilled shrimp, rice, black beans, red onion, fresh pico, shredded lettuce, green onions & chipotle sour cream Price: 15.99 TERIYAKI STEAK BOWL* Double shaved steak, glazed in teriyaki sauce, cilantro lime rice, shredded cheddar cheese, tomatoes, onion, bell peppers, & fresh cilantro Price: 15.99 AHI TUNA BOWL Seared tuna, cilantro lime rice, edamame, shredded carrotts, roasted tomatoes, & pickled onion. Topped with sesame seeds & a cucumber wasabi dressing Price: 17.99 TACOS Served on corn or flour tortilla, Two Tacos & a Choice of Side BUFFALO SHRIMP TACOS Grilled or fried shrimp tossed in buffalo sauce, blue cheese crumbles, coleslaw, tomatoes & red onions Price: 15.99 AHI TUNA TACOS Seared tuna, edamame, shredded carrots, roasted tomatoes, & pickled onion. Topped with sesame seed & a wasabi aioli dressing Price: 17.99 STEAK TACOS* Double shaved steak, shredded cheddar, lettuce, tomatoes, onions, fresh cilantro & sour cream Price: 15.99 CHICKEN TACOS Blackened chicken, black bean corn salsa, shredded lettuce, fresh cilantro, & chipotle sour cream Price: 14.99 HAWAIIAN PORK TACOS Pulled pork, house-made BBQ, pineapple salsa, shredded lettuce & cilantro Price: 14.99 BURGERS *All burgers can be made with grilled chicken, fried chicken or as a black bean patty. Served on a brioche bun with lettuce, tomato, & onion.* BRUNCH BURGER* American cheese, applewood smoked bacon, & a sunny side up egg Price: 16.99 PIMENTO BURGER* Pimento cheese & applewood smoked bacon Price: 15.99 HAWAIIAN BURGER* Pineapple salsa, sliced ham, swiss cheese & teryiaki glaze Price: 15.99 MUSHROOM & SWISS BURGER* Sautéed mushrooms, caramelized onions & swiss cheese Price: 15.99 DIG SCHOLAR BURGER* House-made bbq sauce, applewood smoked bacon, american cheese & fried onion tanglers. $1 goes to the DIG annual scholarship program. Price: 15.99 SMASHBURGER Two smash patties, topped with honey srircha, & american cheese Price: 14.99 BLACKENED BLUE BURGER* Blackened beef patty, blue cheese crumbles, & fried onion tanglers Price: 15.99 CALI BURGER* Cheddar cheese, applewood smoked bacon, jalapeños & avocado Price: 16.99 CLASSIC BURGER* Plain hamburger cooked to temperature Price: 13.99 Price: Add Cheese .99 Price: Add Bacon 1.99 SIDES Fries - Tater Tots - Kettle Chips - Coleslaw For 1.99: Sweet Potato Fries - Mixed Vegetable - Side Salad SANDWICHES TURKEY AVOCADO WRAP Turkey, swiss cheese, avocado, lettuce, tomato & ranch dressing. Served in a tomato basil wrap Price: 15.99 PULLED PORK SANDWICH Pulled pork slow roasted in house, topped with our house-made bbq sauce & a side of slaw Price: 13.99 BUFFALO CHICKEN WRAP Hand-breaded chicken, served in a tomato basil wrap with lettuce, tomato, onion, buffalo sauce, & a choice of either ranch or blue cheese dressing Price: 14.99 CLUB SANDWICH Ham, turkey, swiss cheese & applewood smoked bacon layered between two thick slices of challah bread with lettuce, tomato, onion&dijonaise Price: 15.99 CUBAN SANDWICH Pulled pork, ham, Swiss cheese, pickles & spicy mustard on a grilled hoagie roll Price: 14.99 PHILLY CHEESE STEAK Double shaved steak, onions & peppers served on a hoagie roll & topped with our house-made queso cheese Price: 15.99 GYRO Choose lamb or grilled chicken, served on warm pita bread with shredded lettuce, diced tomatoes, onions, feta cheese & house-made tzatziki sauce Price: 14.99 SHRIMP PO BOY Poached shrimp, roasted tomatoes, & green onion. Served on a new england style roll, topped with a lemon aioli dressing Price: 15.99 SIDES Fries - Tater Tots - Kettle Chips - Coleslaw For 1.99: Sweet Potato Fries - Mixed Vegetable - Side Salad WINGS Served with ranch or blue cheese dressing & celery TRADITIONAL JUMBO WINGS Mild - Medium - Hot - Reaper - Bbq Teriyaki - Spicy Garlic - Sweet & Spicy Garlic Parmesan - Mango Habanaro. Dry Rubs: Smokey Paprika - Mesquite - Lemon Pepper Price: 6 Wings 11.99 Price: 12 Wings 22.99 SIDES FRIES 3.99 TATER TOTS 3.99SLAW 3.99KETTLE CHIPS 3.99 SWEET POTATO FRIES 5.99 MIXED VEGETABLE 3.99DIG CHILI - CUP 5.99 / BOWL 6.99 HOT DOGS 1 Hot dog and choice of side Add an additional dog for $3 GRILLED RIVERDOG Plain Hot Dog Price: 7.99 CHILI CHEESE DOG House-made chili, shredded cheddar & raw onions Price: 9.99 BRONX BOMBER Grilled onions, sauerkraut & spicy mustard Price: 8.99 CHARLESTON CHEW Topped with slaw Price: 8.99 *Consuming raw or undercooked meats, poultry, seafood, shellfish, or eggs may increase your risk of food borne illness* Select another Menu... All Day Menu Brunch Private Events We'd love to host your special event. Contact us to arrange the details of your gathering. Dig Catering Easy and delicious catering for any size gathering. Explore Our Menus Open daily for lunch, happy hour, dinner, and Sunday brunch Technical documentation for search engines, AI, and other automated tools Schema.org Restaurant structured data via JSON-LD (located in script tag before page closing) stray and includes address, phone, and hours Schema.org Menu structured data via JSON-LD lists all available menus on pages with menu items Schema.org Event structured data via JSON-LD lists dates, times, and descriptions for individual events on the events' page Open Graph meta tags in page head Complete site structure available in sitemap at /site-map",
      "hash": "32bb6a9d51b4",
      "downloadedAt": "2026-01-18T16:59:00.051Z",
      "trimmedAt": "2026-01-18T17:13:05.977Z",
      "sizeReduction": "88.7%"
    },
    {
      "url": "http://diginthepark.com/events-specials",
      "text": "Events / Specials Events This Week! Sunday Brunch Every Sunday , to 10:00 AM 2:00 PM Grab a friend and join us on Sunday for a delicious brunch. Daily Happy Hour Every Monday, Tuesday, Wednesday, Thursday and Friday , to 4:00 PM 7:00 PM Join us for Happy Hour from 4pm-7pm every Monday through Friday. Includes $1 off appetizers & $1 off house liquor, domestic drafts, and house wine. Monday Night Bingo! Every Monday , to 6:00 PM 8:00 PM Join us every Monday night for Bingo! Trivia Wednesday's Every Wednesday , to 6:00 PM 9:00 PM Bring your friends and join us weekly on Wednesday's for Trivia! Live Music Every Tuesday and Friday , to 7:00 PM 10:00 PM Live music on the patio every Tuesday & Friday night! Private Events We'd love to host your special event. Contact us to arrange the details of your gathering. Dig Catering Easy and delicious catering for any size gathering. Explore Our Menus Open daily for lunch, happy hour, dinner, and Sunday brunch Technical documentation for search engines, AI, and other automated tools Schema.org Restaurant structured data via JSON-LD (located in script tag before page closing) stray and includes address, phone, and hours Schema.org Menu structured data via JSON-LD lists all available menus on pages with menu items Schema.org Event structured data via JSON-LD lists dates, times, and descriptions for individual events on the events' page Open Graph meta tags in page head Complete site structure available in sitemap at /site-map",
      "hash": "520ee92fe3d0",
      "downloadedAt": "2026-01-18T16:59:00.787Z",
      "trimmedAt": "2026-01-18T17:13:05.984Z",
      "sizeReduction": "93.8%"
    },
    {
      "url": "http://diginthepark.com/",
      "text": "A neighborhood pub and sports bar in the heart of Olde Towne Park Circle, North Charleston Once an old gas station, the space has been transformed into an awesome sports bar, with the BEST outdoor patio in town! DIG in the Park is a comfortable place to have a cold beer, chat with friends, or just watch the game. DIG’s North Charleston location is in the heart of Olde Towne Park Circle. Private Events We'd love to host your special event. Contact us to arrange the details of your gathering. Dig Catering Easy and delicious catering for any size gathering. Explore Our Menus Open daily for lunch, happy hour, dinner, and Sunday brunch Technical documentation for search engines, AI, and other automated tools Schema.org Restaurant structured data via JSON-LD (located in script tag before page closing) stray and includes address, phone, and hours Schema.org Menu structured data via JSON-LD lists all available menus on pages with menu items Schema.org Event structured data via JSON-LD lists dates, times, and descriptions for individual events on the events' page Open Graph meta tags in page head Complete site structure available in sitemap at /site-map",
      "hash": "5841a6b9cb82",
      "downloadedAt": "2026-01-18T16:58:58.221Z",
      "trimmedAt": "2026-01-18T17:13:05.989Z",
      "sizeReduction": "94.1%"
    },
    {
      "url": "http://diginthepark.com/hours-locations",
      "text": "Hours & Locations Address , DIG In the Park 1049 East Montague Ave N. Charleston SC 29405 843-225-5201 Find Us Hours of Operation Monday to Thursday to 11:00 AM 12:00 AM Friday to Saturday to 11:00 AM 2:00 AM Sunday to 10:00 AM 12:00 AM Contact Forms Email Us Catering Inquiry Private Party Inquiry Job Application Feedback Private Events We'd love to host your special event. Contact us to arrange the details of your gathering. Dig Catering Easy and delicious catering for any size gathering. Explore Our Menus Open daily for lunch, happy hour, dinner, and Sunday brunch Technical documentation for search engines, AI, and other automated tools Schema.org Restaurant structured data via JSON-LD (located in script tag before page closing) stray and includes address, phone, and hours Schema.org Menu structured data via JSON-LD lists all available menus on pages with menu items Schema.org Event structured data via JSON-LD lists dates, times, and descriptions for individual events on the events' page Open Graph meta tags in page head Complete site structure available in sitemap at /site-map",
      "hash": "ad728fd3e2fb",
      "downloadedAt": "2026-01-18T16:59:01.476Z",
      "trimmedAt": "2026-01-18T17:13:05.996Z",
      "sizeReduction": "94.4%"
    },
    {
      "url": "http://diginthepark.com/parties",
      "text": "Parties Host your next event at Dig in the Park! Gather with friends, family and co-workers to enjoy a relaxing, delicious and fun get together at Dig. Our team is available to assist in arranging all the details. Please contact us using the form below. Private Event Inquiry Private Events We'd love to host your special event. Contact us to arrange the details of your gathering. Dig Catering Easy and delicious catering for any size gathering. Explore Our Menus Open daily for lunch, happy hour, dinner, and Sunday brunch Technical documentation for search engines, AI, and other automated tools Schema.org Restaurant structured data via JSON-LD (located in script tag before page closing) stray and includes address, phone, and hours Schema.org Menu structured data via JSON-LD lists all available menus on pages with menu items Schema.org Event structured data via JSON-LD lists dates, times, and descriptions for individual events on the events' page Open Graph meta tags in page head Complete site structure available in sitemap at /site-map",
      "hash": "c1ebdc2dc432",
      "downloadedAt": "2026-01-18T16:59:02.239Z",
      "trimmedAt": "2026-01-18T17:13:06.001Z",
      "sizeReduction": "95.1%"
    },
    {
      "url": "http://diginthepark.com/our-menus-list",
      "text": "Our Menus Welcome to DIG In the Park. Please choose a menu below. All Day Menu Brunch Private Events We'd love to host your special event. Contact us to arrange the details of your gathering. Dig Catering Easy and delicious catering for any size gathering. Explore Our Menus Open daily for lunch, happy hour, dinner, and Sunday brunch Technical documentation for search engines, AI, and other automated tools Schema.org Restaurant structured data via JSON-LD (located in script tag before page closing) stray and includes address, phone, and hours Schema.org Menu structured data via JSON-LD lists all available menus on pages with menu items Schema.org Event structured data via JSON-LD lists dates, times, and descriptions for individual events on the events' page Open Graph meta tags in page head Complete site structure available in sitemap at /site-map",
      "hash": "d24d60ce424c",
      "downloadedAt": "2026-01-18T16:58:58.500Z",
      "trimmedAt": "2026-01-18T17:13:06.004Z",
      "sizeReduction": "95.1%"
    },
    {
      "url": "http://diginthepark.com/hours-locations#hours-of-operation",
      "text": "Hours & Locations Address , DIG In the Park 1049 East Montague Ave N. Charleston SC 29405 843-225-5201 Find Us Hours of Operation Monday to Thursday to 11:00 AM 12:00 AM Friday to Saturday to 11:00 AM 2:00 AM Sunday to 10:00 AM 12:00 AM Contact Forms Email Us Catering Inquiry Private Party Inquiry Job Application Feedback Private Events We'd love to host your special event. Contact us to arrange the details of your gathering. Dig Catering Easy and delicious catering for any size gathering. Explore Our Menus Open daily for lunch, happy hour, dinner, and Sunday brunch Technical documentation for search engines, AI, and other automated tools Schema.org Restaurant structured data via JSON-LD (located in script tag before page closing) stray and includes address, phone, and hours Schema.org Menu structured data via JSON-LD lists all available menus on pages with menu items Schema.org Event structured data via JSON-LD lists dates, times, and descriptions for individual events on the events' page Open Graph meta tags in page head Complete site structure available in sitemap at /site-map",
      "hash": "f4f18ce12eab",
      "downloadedAt": "2026-01-18T16:58:59.314Z",
      "trimmedAt": "2026-01-18T17:13:06.009Z",
      "sizeReduction": "94.4%"
    }
  ],
  "sizeReduction": "92.4%"
}