{
  "venueId": "ChIJY5dR91tj_ogR_Wmf9kfe1ho",
  "venueName": "Crowne Plaza Charleston Airport - Conv Ctr, an IHG Hotel",
  "venueArea": "North Charleston",
  "website": "https://www.ihg.com/crowneplaza/hotels/us/en/north-charleston/chssc/hoteldetail?cm_mmc=GoogleMaps-_-CP-_-US-_-CHSSC",
  "scrapedAt": "2026-01-18T17:04:27.770Z",
  "trimmedAt": "2026-01-18T17:11:06.454Z",
  "pages": [
    {
      "url": "https://www.ihg.com/crowneplaza/hotels/us/en/north-charleston/chssc/hoteldetail/events-facilities",
      "text": "Skip To main content View prices View all Crowne Plaza Charleston Airport - Conv Ctr Meetings & events Planning a meeting in Charleston, SC? The events facility boasts 5 distinct spaces and over 4500 sq. ft. of space well suited for groups of up to 300. Outdoor function space is also available, and you're guaranteed a response to your RFP within two hours. Download brochure Download catering menu Request a proposal Come Together Collaborative Studio Come Together Crowne Plaza is the place to meet! Whether it's an important corporate meeting, social event or wedding, Crowne Plaza offers the perfect combination of Southern Hospitality and dynamic modern amenities. With our Crowne Meetings Director as your personal planner for your event, you take ease in knowing everything is covered. Learn More Collaborative Studio Connect to a comfortable yet refined meeting space suitable for a maximum of six guests. This room is equipped with a whiteboard and seamless TV connectivity to fulfill your business needs. Learn More Plantation Ballroom - The Drayton The Drayton room is the ideal setting for leisure and business events, with multiple Audio/Visual capabilities. The Drayton Room's beautiful, contemporary and uniquely Charleston setting will provide a comfortable and engaging atmosphere for any group. Ground Floor 100 Guests Plantation Ballroom - The Middleton Room The Middleton room is the ideal setting for a business events, with multiple Audio/Visual capabilities. The Middleton Rooms beautiful, contemporary and uniquely Charleston setting will provide a comfortable and engaging atmosphere for any group. Ground Floor 100 Guests Plantation Ballroom - The Magnolia Room The Magnolia Room is approximatley 1400 square feet. 35 X 42. The Magnolia provides the ideal meeting space for a small group with leisure or business in mind. connections, all within a beautiful, clean and comfortable setting Ground Floor 100 Guests Plantation Ballroom The ideal setting for leisure and business events, with multiple Audio/Visual capabilities. The Plantation Ballroom is beautiful, contemporary in an uniquely Charleston setting providing a comfortable and engaging atmosphere for any group. Ground Floor 320 Guests The Studio Connect in a comfortable yet refined meeting space suitable for a maximum of 6 guests. This room is equipped with a whiteboard and seamless TV connectivity to fulfill your business needs. Ground Floor 12 Guests Plantation Boardroom The Plantation Boardroom offers a luxurious experience with a conference table featuring electrical connectivity, complimentary Wi-Fi, Television Monitor connectivity and more. Ground Floor 18 Guests We've got you covered Comprehensive multimedia + audio visual support Office supplies available for meeting rooms Shipping available Meeting registration services Printing services Creative meeting and event concept consultation Scanner Fax services Printer Dry cleaning pickup or laundry valet Same-day dry cleaning Wi-Fi access throughout the hotel Event planning available Catering available Event Offers Have more questions? Contact us View in other languages English English (GB) 日本語 Deutsch 繁體中文 Español 中文 Français Español (España) Italiano Nederlands Русский Português 한국어 ไทย العربية Português (BR) Bahasa Indonesia Türkçe Polski Tiếng Việt",
      "hash": "26e627d8d642",
      "downloadedAt": "2026-01-18T16:58:36.937Z",
      "trimmedAt": "2026-01-18T17:11:05.831Z",
      "sizeReduction": "97.9%"
    },
    {
      "url": "https://www.ihg.com/crowneplaza/content/us/en/deals/hotel-offers",
      "text": "Skip To main content Book now Offers Holiday Inn Resort Samui Bophut Beach Pay for your stay with Points + Cash Stretch your points further when you book with Points + Cash. Use your existing points and purchase the remaining points required with cash to redeem your Reward Night. Learn more Buy points and get there faster With two ways to buy points, you can reach what you want faster. Buy points to stock up for future travel or add Elite Qualifying points to a booking. Learn More Find A Perfect Gift From gift cards to unique travel destinations, our new rewards catalog is full of ideas and experiences for you to enjoy. Shop Our Catalog Great rates are just a click away With IHG One Rewards, you can get access to our exclusive Member Rate. Book now Buy, gift, or transfer points Enjoy endless possibilities with Points Purchase. Buy points InterContinental ANA Manza Beach Resort Treat yourself to a Reward Night Redeem your IHG One Rewards points for a Reward Night at our 6,600+ hotels and resorts around the world, starting at just 10,000 points. Book now Rewards are just a tap away Download the IHG One Rewards app today. Enjoy fast booking and Rewards on the go – however and wherever you travel. Learn More Travel like you mean it Explore our collections to find the perfect spot for your next vacation, meeting or bucket-list escape. Discover more with our 20 brands and 6,600+ destinations. Explore Now Stay at IHG and earn towards flights IHG One Rewards Members can earn miles for their stays Learn More",
      "hash": "288b994cbf12",
      "downloadedAt": "2026-01-18T16:58:35.113Z",
      "trimmedAt": "2026-01-18T17:11:05.895Z",
      "sizeReduction": "99.0%"
    },
    {
      "url": "https://www.ihg.com/crowneplaza/hotels/us/en/north-charleston/chssc/hoteldetail/hotel-offers",
      "text": "Skip To main content View prices Crowne Plaza Charleston Airport - Conv Ctr Offers Save on your hotel stay with these exclusive Crowne Plaza Charleston Airport - Conv Ctr deals. Hotel packages available Prices shown reflect an average per night stay from VIEW ALL PACKAGES View in other languages English English (GB) 日本語 Deutsch 繁體中文 Español 中文 Français Español (España) Italiano Nederlands Русский Português 한국어 ไทย العربية Português (BR) Bahasa Indonesia Türkçe Polski Tiếng Việt",
      "hash": "3472cf106022",
      "downloadedAt": "2026-01-18T16:58:36.311Z",
      "trimmedAt": "2026-01-18T17:11:05.938Z",
      "sizeReduction": "99.6%"
    },
    {
      "url": "https://www.ihg.com/crowneplaza/hotels/us/en/north-charleston/chssc/hoteldetail?cm_mmc=GoogleMaps-_-CP-_-US-_-CHSSC",
      "text": "Skip To main content View prices Crowne Plaza Charleston Airport - Conv Ctr Important Announcements Experience Genuine Southern Hospitality at the Crowne Plaza® hotel in North Charleston, ideally located near Boeing, the Charleston International Airport (CHS), Joint Base Charleston, and around the corner from the Convention Center and Performing Arts Center. We offer complimentary shuttle service to the airport and within a 3-mile radius, including the Tanger Outlet Mall. You can also visit historic downtown Charleston, just 10 minutes away. The Crowne Plaza hotel is convenient to I-26 and I-526, making it easy access to Charleston’s rich history and tours or visits to one of South Carolina’s finest beaches: Folly Beach, Isle of Palms or Sullivan’s Island. Whether putting for par on the world-renowned golf courses in. Charleston or fishing and sailing, unforgettable experiences await every guest. The Crowne Plaza welcomes you to experience the ambiance of our upscale, modern lobby bar and lounge, offering comfortable conversation areas and a 52\" HDTV. Mingle over to our outdoor patio and pool, and be sure to visit our Sweetgrass Restaurant. Airport shuttle Fitness center On-site parking Pet-Friendly Pool 1 On-site restaurant Smoke-free hotel Wi-fi Area shuttle Airport shuttle Fitness center On-site parking Pet-Friendly Pool 1 On-site restaurant Smoke-free hotel Wi-fi Area shuttle View all amenities Accommodations Junior Suite Book Now Standard Rooms Book Now Junior Suite Book Now Standard Rooms Book Now View all Reservations: Front desk: 1-843-7444422 Email: frontdesk@charlestoncp.com 4831 Tanger Outlet Boulevard North Charleston, South Carolina 29418 United States Parking and transportation details : 3:00 PM Check-in : 11:00 AM Check-out : 21 Minimum check-in age The highlights Explore Charleston with your furry friend! Create an unforgettable family vacation! Come Together Fitness Center & Outdoor Pool Collaborative Studio Explore Charleston with your furry friend! When traveling to Charleston with your pet and needing to find a pet-friendly hotel, feel confident we have you covered! Designated pet friendly rooms & great walking/play areas available. Don't forget to visit our Market Shop for items you may need for your furry friend during your stay! Book our \"Pet Getaway Package”! Just a small nightly fee. Call +1-843-7444422 Call +1-843-7444422 Create an unforgettable family vacation! Venture out to the World's Largest Inclusive Playground or even stop to visit many of Charleston’s kid friendly educational journeys like the H.L. Hunley Submarine, American LaFrance Fire Museum, The International African American Museum and Children’s Museum of the Lowcountry. You can also enjoy the outdoors at our lovely beaches and waterparks! Come Together Crowne Plaza is the place to meet! Whether it's an important corporate meeting, social event or wedding, Crowne Plaza offers the perfect combination of Southern Hospitality and dynamic modern amenities. With our Crowne Meetings Director as your personal planner for your event, you take ease in knowing everything is covered. Learn More Fitness Center & Outdoor Pool Start your day with an energizing workout in our fitness studio, featuring cardio and training equipment, including a stair stepper, treadmills, and elliptical machines. Take a refreshing dip in our outdoor pool after a day of sightseeing, shopping, or meetings. We make it easy to enjoy work-life balance and flow between work and play. Collaborative Studio Connect to a comfortable yet refined meeting space suitable for a maximum of six guests. This room is equipped with a whiteboard and seamless TV connectivity to fulfill your business needs. Learn More Explore Charleston Airport - Conv Ctr Sleep well, rest easy View rooms Make the most of your stay View amenities Take a look View photos Sleep well, rest easy View rooms Make the most of your stay View amenities Take a look View photos Hotel packages available Prices shown reflect an average per night stay from View all offers View All Offers FAQs for Charleston Airport - Conv Ctr Does Crowne Plaza Charleston Airport - Conv Ctr have a pool? Yes, Crowne Plaza Charleston Airport - Conv Ctr has an outdoor pool. How much is parking at Crowne Plaza Charleston Airport - Conv Ctr? Complimentary parking is available at Crowne Plaza Charleston Airport - Conv Ctr for hotel guests. Can I bring my pet to Crowne Plaza Charleston Airport - Conv Ctr? Pets are welcome at Crowne Plaza Charleston Airport - Conv Ctr. Our Pet Policy: Up to 2 dogs per room. There is a 30 dollar nonrefundable pet fee per night per pet. Does Crowne Plaza Charleston Airport - Conv Ctr offer free airport shuttle service? Crowne Plaza Charleston Airport - Conv Ctr offers free shuttle service from Charleston International Airport (CHS). Taxi Limo pickup area. How far is Crowne Plaza Charleston Airport - Conv Ctr from the airport? Crowne Plaza Charleston Airport - Conv Ctr is 2 mi from Charleston International Airport (CHS). Can I cancel my booking at Crowne Plaza Charleston Airport - Conv Ctr for a full refund? Always check the hotel's cancellation policy before booking a rate. Room cancellation is subject to rate booked at time of reservation and cancellation policy varies by rate. Does Crowne Plaza Charleston Airport - Conv Ctr have a restaurant on site? Crowne Plaza Charleston Airport - Conv Ctr has 1 restaurant. When is breakfast at Crowne Plaza Charleston Airport - Conv Ctr? On weekends, breakfast is available from 6:30 AM to 11:00 AM. Is there a complimentary shuttle available at Crowne Plaza Charleston Airport - Conv Ctr? Yes, Crowne Plaza Charleston Airport - Conv Ctr offers a complimentary local area shuttle. Check our for more details. Transportation page What are the check-in and check-out times for Crowne Plaza Charleston Airport - Conv Ctr? Check-in at Crowne Plaza Charleston Airport - Conv Ctr is from 3:00 PM, and check-out time is 11:00 AM. Contact the hotel directly for options available for early check-in or late check-out. Does Crowne Plaza Charleston Airport - Conv Ctr offer free Wi-Fi? Yes, the Crowne Plaza Charleston Airport - Conv Ctr offers free WiFi! Read more FAQs View in other languages English English (GB) 日本語 Deutsch 繁體中文 Español 中文 Français Español (España) Italiano Nederlands Русский Português 한국어 ไทย العربية Português (BR) Bahasa Indonesia Türkçe Polski Tiếng Việt",
      "hash": "579cd7ec42cd",
      "downloadedAt": "2026-01-18T16:58:34.161Z",
      "trimmedAt": "2026-01-18T17:11:06.364Z",
      "sizeReduction": "97.2%"
    },
    {
      "url": "https://www.ihg.com/crowneplaza/content/us/en/support/meetings",
      "text": "Skip To main content Book now Groups & Events From board meetings to conventions, birthdays to wedding days, we create stays and events with the blended traveller in mind. Email: 1800meeting@ihg.com Call us: 1-800-MEETING REQUEST A QUOTE Inventive ways to connect and collaborate Our Meetings & Events experts ensure are here to understand the purpose of your gathering and deliver the service and spaces to optimize it. Whether coming together for business, leisure, or a blend of both, you can celebrate and collaborate, and create connections, memories, and moments of growth knowing that the individual needs of your guests, and their guests, are taken care of. Your partner in progress From boardrooms to ballrooms, on-demand studios to unique outdoor venues, across more than 5 million square feet of versatile spaces worldwide we have the perfect space to suit you. We craft banquets and catering experiences which are customized to your gathering; inspiring connections, collaboration, and well-being. Daily budget debriefs listing out expenses will ensure you stay on target.",
      "hash": "5aa429bc5275",
      "downloadedAt": "2026-01-18T16:58:35.695Z",
      "trimmedAt": "2026-01-18T17:11:06.380Z",
      "sizeReduction": "98.9%"
    },
    {
      "url": "https://www.ihg.com/crowneplaza/content/us/en/locations",
      "text": "Skip To main content Find a Crowne Plaza Hotel Popular Crowne Plaza Destinations New York City There's always a great reason to visit NYC. Los Angeles Work, rest, and be restored during your stay in Los Angeles. Atlanta Dig Into the hidden hot spots of the urban hub of Atlanta Houston Get in on great shopping and rodeos in Houston London Plan your trip to London Seattle Plan your trip to the Emerald City New Orleans The French Quarter awaits Singapore Plan your trip to Singapore Hotels by Country / Region US & Canada United States Alaska Hotels Arizona Hotels California Hotels Colorado Hotels Florida Hotels Georgia Hotels Illinois Hotels Indiana Hotels Kentucky Hotels Louisiana Hotels Maryland Hotels Massachusetts Hotels Michigan Hotels Minnesota Hotels Missouri Hotels Nebraska Hotels New Jersey Hotels New Mexico Hotels New York Hotels North Carolina Hotels Ohio Hotels Oregon Hotels Pennsylvania Hotels Rhode Island Hotels South Carolina Hotels Tennessee Hotels Texas Hotels Virginia Hotels Washington Hotels Wisconsin Hotels Canada New Brunswick Hotels Ontario Hotels Caribbean Dominican Republic Hotels Mexico and Central America Mexico Leon Hotels Metepec Hotels Monterrey Hotels Tlalnepantla Hotels Torreon Hotels Villahermosa Hotels Central America Costa Rica Hotels El Salvador Hotels Nicaragua Hotels Panama Hotels South America Colombia Hotels Paraguay Hotels Peru Hotels Europe Belarus Hotels Belgium Hotels Bulgaria Hotels Cyprus Hotels Denmark Hotels Finland Hotels France Hotels Georgia Hotels Germany Hotels Greece Hotels Hungary Hotels Ireland Hotels Italy Hotels Netherlands Hotels Poland Hotels Portugal Hotels Romania Hotels Serbia Hotels Slovakia Hotels Spain Hotels Switzerland Hotels Türki̇ye Hotels United Kingdom Hotels Middle East Bahrain Hotels Israel Hotels Jordan Hotels Kuwait Hotels Lebanon Hotels Oman Hotels Qatar Hotels Saudi Arabia Hotels United Arab Emirates Hotels Africa Egypt Hotels Kenya Hotels Tanzania, United Republic Of Hotels Asia Bangladesh Hotels Hong Kong SAR Hotels India Hotels Indonesia Hotels Japan Hotels Lao People's Democratic Republic Hotels Macau SAR Hotels Mainland China Hotels Malaysia Hotels Philippines Hotels Singapore Hotels Taiwan Hotels Thailand Hotels Uzbekistan Hotels Vietnam Hotels Australia and Pacific Islands Australia Hotels Fiji Hotels Guam Hotels New Zealand Hotels Northern Mariana Islands Hotels Papua New Guinea Hotels Explore More by Interest 2024’s Trending Destinations: Explore our top-searched vacation destinations | | | | | | Hotels with Pools Romantic Hotels New Hotels Ski Resorts Europe Hotels Airport Hotels Last Minute Hotel Deals Dive Into IHG’s Best Beach Escapes | | | | | | Beach Hotels Caribbean Resorts All-Inclusive Resorts Cancun All-Inclusive Resorts Cozumel All-Inclusive Resorts Jamaica All-Inclusive Resorts Punta Cana All-Inclusive Resorts IHG’s Top Picks for Unforgettable Family Destinations | | | Family-Friendly Hotels Hotels near US National Parks Hotels near US Theme Parks Hotels near Disney World Discover IHG: From Cozy Stays to Luxurious Retreats | | | | Top Vacation Destinations Hotels near Me Pet Friendly Hotels Luxury Hotels Top Award Winning Luxury Hotels",
      "hash": "603c201f3ea8",
      "downloadedAt": "2026-01-18T16:58:34.504Z",
      "trimmedAt": "2026-01-18T17:11:06.454Z",
      "sizeReduction": "98.1%"
    }
  ],
  "sizeReduction": "98.3%"
}