{
  "venueId": "ChIJpWPHPBN6_ogRMbprUqPDwng",
  "venueName": "The Barksdale House Inn",
  "venueArea": "Downtown Charleston",
  "website": "https://www.barksdalehouse.com/",
  "scrapedAt": "2026-01-19T02:19:37.550Z",
  "trimmedAt": "2026-01-19T02:26:44.945Z",
  "pages": [
    {
      "url": "https://www.barksdalehouse.com/location/barksdale-house/",
      "text": "[Page Title: Hours + Location | Barksdale House]\n\nMain content starts here, tab to start navigating \nHours & Location\n27 George Street, Charleston, SC 29401 (843)-577-4800 Get Directions Call (843)-577-4800 Homegrown Hospitality Group \nEmail Signup\nPlease, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google\n and\n apply. Privacy Policy Terms of Service",
      "hash": "1ed96fe3d233",
      "downloadedAt": "2026-01-19T02:09:27.772Z",
      "trimmedAt": "2026-01-19T02:26:44.939Z",
      "sizeReduction": "98.1%"
    },
    {
      "url": "https://www.barksdalehouse.com/",
      "text": "[Page Title: Barksdale House]\n\nHome\nMain content starts here, tab to start navigating Slide 1 of 3 Slide 2 of 3 Slide 3 of 3 \nWelcome\n\nThe Barksdale House Inn, built in 1778, is your home away from home while exploring the City of Charleston. We are located within the historic downtown district and are walking distance to shopping, dining, tourist attractions and the famed Market Street. This Inn offers 14 rooms with private baths, complimentary breakfast, newspaper, wireless internet access. Parking is guaranteed for one car per room and is $12.50 per night. Rates are based on single or double occupancy. All rooms are MAX 2 person occupancy with the exception of Room 9 (Double Queen Beds, 4 person MAX)\n\nPlease keep in mind, The Barksdale House Inn have an elevator. All second and third floor rooms are accessible by stairs .\ndoes not only \nOur knowledgeable staff is happy to assist you with suggestions on where to begin exploring our beautiful city and its magnificent homes, gardens and parks. Please be sure to join us each afternoon for Iced Tea and refreshing delicate bites. Our porch overlooking the garden is a perfect setting for relaxing in the evenings after a long day of sightseeing!\nBook Now \nOur History\n\nThe Barksdale House Inn, built in 1778, is your home away from home while exploring the City of Charleston.\nLearn More \nAttractions\n\nOur suggestions  on where to begin exploring our beautiful city and its magnificent homes, gardens, and parks.\nLearn More Call (843)-577-4800 Homegrown Hospitality Group \nEmail Signup\nPlease, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google\n and\n apply. Privacy Policy Terms of Service",
      "hash": "a4efd49645fe",
      "downloadedAt": "2026-01-19T02:09:27.742Z",
      "trimmedAt": "2026-01-19T02:26:44.945Z",
      "sizeReduction": "94.8%"
    }
  ],
  "sizeReduction": "96.3%"
}