{
  "venueId": "ChIJy0Ms_ZZw_ogRkcOd9ryIMrk",
  "venueName": "Charleston Harbor Resort & Marina",
  "venueArea": "Mount Pleasant",
  "website": "https://www.charlestonharborresort.com/",
  "scrapedAt": "2026-01-18T17:04:32.089Z",
  "trimmedAt": "2026-01-18T17:13:05.818Z",
  "pages": [
    {
      "url": "https://www.charlestonharborresort.com/weddings--events.htm#anchorOutdoorVenues",
      "text": "Begin Your Happily Ever After at our Beautiful Charleston Wedding Venue Blending southern charm with breathtaking waterfront views, Charleston Harbor Resort & Marina is the wedding destination of your dreams. Beyond weddings, many of life’s most precious moments are celebrated with us. Our surroundings and stellar service ensure beautiful and lasting memories of your special anniversary, birthday, graduation, or any event you'll hold dear forever. Stylish Venues for Events of Distinction Choose from 9 inspired venues, including our private beach that capture the essence of the Lowcountry and the beauty of the downtown Charleston skyline. No matter which venue you choose, you can trust that our experienced, knowledgeable team will make the planning process effortless by assisting with everything from event space setup and design, to guidance in making the perfect menu selection. Our wedding and event venues offer everything needed for creating cherished memories and entertaining guests with luxury and style. Link to Indoor Venues Our Indoor Venues The Yacht Club & Bridge Bar The Yacht Club features 2,100 square feet of beautiful space, made almost entirely of windows that offer views of the Charleston Harbor Marina and downtown skyline. The nautical feel of the space is ideal for any celebration, with reclaimed wood plank floors and drop ceilings with stained wood beams. The built-in sound system ensures a flawless presentation or night of dancing. Bridge Bar is an open- air space connected to the Yacht Club overlooking the USS Yorktown and historic Charleston skyline Details & Capacities: 2,100 sq. ft. | U-Shape/Board – 65/70 | Theater – 175 | Classroom – 100 | Rounds of 10 – 120 | Crescent Rounds – 90 | Reception – 80 Sunrise Terrace & Deck This 2,400 SQFT, climate-controlled space boasts a stunning view of the Charleston harbor, marina, and downtown skyline through picture windows. The Sunrise Terrace can be enjoyed as is with a simple, yet classic indoor setting or can be transformed to an indoor/outdoor dream with windows that open in full accordion style. Whether the windows are open or not, this space offers unobstructed 180° views for a wedding reception of up to 150 guests or up to 250 for a standing reception with heavy hors d’oeuvres. Details & Capacities: 2,400 SQFT. | Theater – 250 | Rounds of 10 – 150 | Reception – 180 Charleston Harbor Fish House Porch The Porch at our on-site restaurant offers 1,340 square feet of private dining space, complete with climate control and large screen doors that can be opened seasonally to let the fresh harbor breeze flow through. Existing seating can accommodate up to 72 people, or we can arrange the space in a reception-style layout for up to 100. The Harbor Room at Charleston Harbor Fish House The USS Yorktown and Ravenel Bridge are your backdrops when you choose the Harbor Room at Charleston Harbor Fish House. This semi-private dining space is located off the main dining room and can accommodate up to 44 guests. Atlantic Ballroom Our 1,700-square-foot ballroom opens onto the Harbor Terrace and looks out over the pool, beach, and harbor. It provides an intimate atmosphere for up to 80 guests for served lunches and dinners or 150 guests for standing receptions. Details & Capacities: 1,700 sq. ft. | U-Shape/Board – 45/48 | Theater – 165 | Classroom – 88 | Rounds of 10 – 120 | Crescent Rounds – 72 | Reception –150 Link to Outdoor Venues Our Outdoor Venues Harborside Beach Whether you’re planning a casual or elegant affair, Harborside Beach is the perfect setting. Enjoy breathtaking views of the Charleston Harbor and historic downtown skyline while celebrating a wedding ceremony or reception, themed party, concert, or other social soiree. Details & Capacities: 21,600 sq. ft. | Theater – 650 | Rounds of 10 – 500 | Reception – 1,900 Lookout Pavilion Our premier outdoor venue, the Lookout Pavilion and its adjacent lawn are perfect for wedding ceremonies, receptions, concerts, carnivals, teambuilding events and more. The Pavilion features a wood-burning fireplace and its own private restrooms, and can comfortably host up to 350 for a seated meal or 550 for a standing reception. If you book the covered area and lawn, events can grow to more than 1,000 guests. Details & Capacities: 4,900 sq. ft. | Theater – 560 | Classroom – 280 | Rounds of 10 – 350 | Crescent Rounds – 210 | Reception – 1,000 Beach Club Events Lawn Our newest ceremony space features a manicured lawn and garden and views of the marina, Cooper River, and USS Yorktown. It’s perfect for sunset weddings or photo shoots. Details & Capacities: 1,685 sq. ft. | Theater – 165 | Rounds of 10 – 120 | Reception –150 Contact us to begin planning your wedding or special event at Charleston Harbor Resort & Marina. Choose Your Stay Link for CTA-Item1 The Beach Club Check Availability Link for CTA-Item2 Harborside Check Availability",
      "hash": "00a346661c28",
      "downloadedAt": "2026-01-18T16:55:52.282Z",
      "trimmedAt": "2026-01-18T17:13:05.648Z",
      "sizeReduction": "96.0%"
    },
    {
      "url": "https://www.charlestonharborresort.com/cuisine--cocktails.htm#anchorTikiBar",
      "text": "Enjoy Fabulous Cuisine & Cocktails at Our Charleston Resort Whether you are staying at Charleston Harbor Resort & Marina or are just out for a relaxing dinner by the water, we have all your dining needs covered. Sip on a cocktail by the pool from our Tiki Bar. Enjoy a casual meal and some conversation with the locals at the Reel Bar. Or take in unparalleled views while trying some of the freshest seafood in town at the Charleston Harbor Fish House. Link to Charleston Harbor Fish House Charleston Harbor Fish House Fresh Seafood. Fresh Drinks. Fresh Air. Voted one of the “Top 25 Restaurants in Charleston” by , the Fish House is Charleston’s premier location for waterfront dining. The menu, which changes seasonally, offers a variety of options from both land and sea, with a focus on featuring the freshest catches of the day and locally sourced ingredients whenever possible. This on-resort restaurant is open daily for breakfast, lunch, and dinner. Charleston Living Magazine WEBSITE Hours of Operation: Breakfast Buffet Hours: 7am- 10:30am Lunch Hours: 11:30am - 3pm* Dinner Hours: 4:30pm - 9pm Sunday - Thursday | 4:30pm - 10pm Friday & Saturday Reservations Strongly Recommended for Dinner *Limited menu from 3:00 PM to 4:30 PM Please click to view Fish House Menu. HERE Bridge Bar The Bridge Bar is the only rooftop bar overlooking the entire Charleston skyline, as well as the Ravenel Bridge and USS Yorktown. This view, combined with great cocktails and flavorful appetizers, makes our open-air bar the place to be. Stop in with family and friends for a memorable night in the friendliest city in the U.S. Open 5pm-9pm Monday- Thursday Open 4pm - 10pm Saturday-Sunday *excluding days of event rental & weather permitting please call 843-284-7019 to inquire Reel Bar Whether you’re hungry for a quick bite or thirsty for a refreshing cocktail, a visit to the Reel Bar is sure to please. Complete with an impressive display of antique tackle gear, the Reel Bar offers the ideal locale to relax and unwind while dipping your toes in the sand. Hours of Operation: | Monday - Thursday (Food available: 5pm - 10pm) 4pm - 10pm | Friday (Food available: 5pm-10pm) 4pm - 12am |Saturday (Food available: 5pm-10pm) 12pm - 12am | Sunday (Food available: 12pm-10pm) 12pm - 10pm Live music is Thursday & Friday 6-9pm and Sundays 2-6pm at Reel bar Please view the Reel Bar Menu below! APPETIZERS Cajun Baked Shrimp Dip $13 trinity vegetables, andouille sausage, three cheeses, creole spice, ritz crackers Reel Jumbo Chicken Wings 6 for $10 or 12 for $18 served w/celery and carrot sticks, blue cheese or ranch, tossed in choice of house dry rub, buffalo, mustard BBQ, teriyaki, ranch dry rub Pretzel Bites $11 sea salt, pickled jalapenos, beer cheese sauce Crispy Brussel Sprouts $12 sweet chili sauce, citrus, sesame seeds, green onion SANDWICHES & BASKETS Hand Breaded Chicken Tender Basket $17 honey mustard, bbq or buttermilk ranch Buttermilk Fried Shrimp Basket $18 cocktail & tartar sauce, coleslaw The Beach Club $18 roast beef, turkey, applewood smoked bacon, lettuce, vine ripened tomato, swiss, honey mustard, toasted sourdough Grilled Chicken Wrap $16 green goddess dressing, bacon, cheddar, vine ripened tomato, shredded lettuce The Harbor Burger $19 ½ lb Schweid and Sons patty, smoked gouda, LTOP, Comeback Sauce (add applewood smoked bacon $2) Buttermilk Fried Grouper Sandwich $21 brioche bun, creole remoulade, shredded lettuce, vine ripened tomato ** All sandwiches & Baskets Served with Kettle Chips or Substitute French Fries for $2** TACOS, SALADS, & BOWLS Classic Cobb Salad $18 mixed greens, grilled chicken, hardboiled egg, smoked bacon, charred sweet corn, tomato, sharp cheddar, avocado, buttermilk ranch Mediterranean Power Bowl $17 grilled shrimp, orzo, chickpeas, roasted peppers, feta cheese, baby spinach, cucumbers, tomatoes, lemon vinaigrette Grilled Mahi Tacos $16 warm flour tortillas, shredded lettuce, pico de gallo, cilantro crema, kettle chips Carne Asada Tacos $16 flank steak, salsa, shredded cabbage, pickled onions, cotija cheese, kettle chips Reel Quesadilla $14 shredded colby jack, pico de gallo, black beans, side of salsa and sour cream *add spiced beef, grilled chicken or shrimp $7* PIZZA 12 INCH Cheese $15 Pepperoni $16 Chicken Bacon Ranch $18 ranch base, bacon, bell pepper, red onion, grilled chicken **Substitute Gluten Free Crust $1** SWEET TREATS Brownie Sundae $10 vanilla ice cream, roasted peanuts, chocolate sauce Key Lime Pie $10 graham cracker crust, raspberry sauce Link to Beach Club Tiki Bar Beach Club Tiki Bar Located pool side at The Beach Club, the Tiki Bar is the perfect spot to soak in harbor views and the South Carolina sunshine. The menu offers a variety of light fare, sandwiches, and salads. Open 7 days a week beginning at 11:00 AM until Sunset , we will be offering a limited food menu (11:00 AM – 3:00 PM) Monday – Wednesday we will offer the full food menu (11:00 AM – 3:00 PM) Thursday – Sunday, Weather Permitting Please view the Tiki Bar Menu below: Starters |$13 Caprese Dip Whipped Mozzarella, Balsamic Roasted Tomatoes, Pesto, Grilled Bread, Crudité | $14 Tiki Quesadilla Shredded Colby Jack, Pico de Gallo, Black Beans, Side of Salsa and Sour Cream **add spiced beef, grilled chicken or shrimp $7** French Bread Pizza | Hand Crushed Tomato Sauce, Fresh Mozzarella, Baguette, Pepperoni $16 | $14 Loaded Nachos Queso, Black Beans, Pico de Gallo, Sour Cream, Guacamole, Pickled Jalapeños **add spiced beef, grilled chicken or shrimp $7** Mains Mahi Tacos $16 Kettle Chips Warm Flour Tortillas, Shredded Lettuce, Pico de Gallo, Cilantro Crema , *Classic Cobb Salad $18 Mixed Greens, Grilled Chicken, Sharp Cheddar, Smoked Bacon, Tomato, Charred Sweet Corn, Hard Boiled Egg, Avocado, Buttermilk Ranch *Mediterranean Power Bowl $17 Grilled Shrimp, Orzo, Baby Spinach, Feta, Roasted Peppers, Chickpeas, Cucumbers, Tomatoes, Lemon Vinaigrette Harbor Burger $19 ½ lb Prime Beef Patty, Smoked Gouda, LTOP, Comeback Sauce, Brioche Bun, Kettle Chips **add bacon $2** *Grilled Chicken Wrap $16 Green Goddess, Bacon, Cheddar, Lettuce, Tomato, Kettle Chips The Beach Club $18 Roast Beef, Turkey, Bacon, Lettuce, Tomato, Swiss, Toasted Sourdough, Honey Mustard, Kettle Chips Cocktails, Daiquiris and Beers Botanical Spritzers Ketel One Botanical + Soda & Citrus | cucumber & mint / grapefruit & rose / peach & orange blossom $12 Frozen Cocktails Caribbean Colada | captain morgan white rum, pina colada, mango $15 Mud Slide | smirnoff vanilla vodka, kahlua chocolate sauce, ice cream $16 Daiquiri |strawberry, pina colada, peach, mango or banana made with captain morgan white rum $15 Frosé All Day | rosé wine, strawberry puree, smirnoff berry vodka $15 Tiki Drinks Dark & Stormy | Gosling’s Black Seal Rum, Ginger Beer, Lime $12 Salty Dog | Ketel One Vodka, Grapefruit Juice, Prosecco, Salt Rim $15 Beach Club Beach Comber | Captain Morgan White & Coconut Rum, Dry Curacao, Pineapple, Orange Juice $14 Lone Ranger | Don Julio Blanco, Lime Juice, Agave Syrup, Sparkling Rose $15 Rum Runner | Captain Morgan White Rum, Banana and Blackberry Liquor Sweet & Sour, Grenadine $14 Beer Domestic Beer $7 Imported Beer $8 Local Beer $8 Seasonal Rotating Draft $9 **Please ask staff for our Wine Selections** Kids Plates add Bacon - $2 Cheeseburger $12 Mini Hot Dogs $12 Choice of Chicken or Spiced Beef Tacos $12 Choice of Chicken or Spiced Beef or Black Bean Quesadilla $12 Sweet Treats Sweets Homemade Mini Oreo Cheesecakes 2/$8 4/$15 Link to Private Dining & Events Private Dining & Events at Charleston Harbor Fish House Charleston waterways are the perfect backdrop for any special event. Host a birthday, corporate event, anniversary, or other special occasion in our Mount Pleasant restaurant and treat your guests to a delicious meal, tasty cocktails, and stunning views. We have four distinct areas available for private parties of up to 150 guests. Contact our Group Sales Coordinator at or for more details. (843) 284-7026 sales@charlestonharborresort.com *Consuming raw or undercooked meats, poultry, seafood, shellfish or eggs may increase your risk of foodborne illness, especially if you have certain medical conditions. Notice: For your convenience, a 19% gratuity will be added to parties of 6 or more. To expedite service, no separate checks for parties of 6 or more. Choose Your Stay Link for CTA-Item1 The Beach Club Check Availability Link for CTA-Item2 Harborside Check Availability",
      "hash": "4a3d2a17aa9f",
      "downloadedAt": "2026-01-18T16:55:50.176Z",
      "trimmedAt": "2026-01-18T17:13:05.669Z",
      "sizeReduction": "90.1%"
    },
    {
      "url": "https://www.charlestonharborresort.com/weddings--events.htm",
      "text": "Begin Your Happily Ever After at our Beautiful Charleston Wedding Venue Blending southern charm with breathtaking waterfront views, Charleston Harbor Resort & Marina is the wedding destination of your dreams. Beyond weddings, many of life’s most precious moments are celebrated with us. Our surroundings and stellar service ensure beautiful and lasting memories of your special anniversary, birthday, graduation, or any event you'll hold dear forever. Stylish Venues for Events of Distinction Choose from 9 inspired venues, including our private beach that capture the essence of the Lowcountry and the beauty of the downtown Charleston skyline. No matter which venue you choose, you can trust that our experienced, knowledgeable team will make the planning process effortless by assisting with everything from event space setup and design, to guidance in making the perfect menu selection. Our wedding and event venues offer everything needed for creating cherished memories and entertaining guests with luxury and style. Link to Indoor Venues Our Indoor Venues The Yacht Club & Bridge Bar The Yacht Club features 2,100 square feet of beautiful space, made almost entirely of windows that offer views of the Charleston Harbor Marina and downtown skyline. The nautical feel of the space is ideal for any celebration, with reclaimed wood plank floors and drop ceilings with stained wood beams. The built-in sound system ensures a flawless presentation or night of dancing. Bridge Bar is an open- air space connected to the Yacht Club overlooking the USS Yorktown and historic Charleston skyline Details & Capacities: 2,100 sq. ft. | U-Shape/Board – 65/70 | Theater – 175 | Classroom – 100 | Rounds of 10 – 120 | Crescent Rounds – 90 | Reception – 80 Sunrise Terrace & Deck This 2,400 SQFT, climate-controlled space boasts a stunning view of the Charleston harbor, marina, and downtown skyline through picture windows. The Sunrise Terrace can be enjoyed as is with a simple, yet classic indoor setting or can be transformed to an indoor/outdoor dream with windows that open in full accordion style. Whether the windows are open or not, this space offers unobstructed 180° views for a wedding reception of up to 150 guests or up to 250 for a standing reception with heavy hors d’oeuvres. Details & Capacities: 2,400 SQFT. | Theater – 250 | Rounds of 10 – 150 | Reception – 180 Charleston Harbor Fish House Porch The Porch at our on-site restaurant offers 1,340 square feet of private dining space, complete with climate control and large screen doors that can be opened seasonally to let the fresh harbor breeze flow through. Existing seating can accommodate up to 72 people, or we can arrange the space in a reception-style layout for up to 100. The Harbor Room at Charleston Harbor Fish House The USS Yorktown and Ravenel Bridge are your backdrops when you choose the Harbor Room at Charleston Harbor Fish House. This semi-private dining space is located off the main dining room and can accommodate up to 44 guests. Atlantic Ballroom Our 1,700-square-foot ballroom opens onto the Harbor Terrace and looks out over the pool, beach, and harbor. It provides an intimate atmosphere for up to 80 guests for served lunches and dinners or 150 guests for standing receptions. Details & Capacities: 1,700 sq. ft. | U-Shape/Board – 45/48 | Theater – 165 | Classroom – 88 | Rounds of 10 – 120 | Crescent Rounds – 72 | Reception –150 Link to Outdoor Venues Our Outdoor Venues Harborside Beach Whether you’re planning a casual or elegant affair, Harborside Beach is the perfect setting. Enjoy breathtaking views of the Charleston Harbor and historic downtown skyline while celebrating a wedding ceremony or reception, themed party, concert, or other social soiree. Details & Capacities: 21,600 sq. ft. | Theater – 650 | Rounds of 10 – 500 | Reception – 1,900 Lookout Pavilion Our premier outdoor venue, the Lookout Pavilion and its adjacent lawn are perfect for wedding ceremonies, receptions, concerts, carnivals, teambuilding events and more. The Pavilion features a wood-burning fireplace and its own private restrooms, and can comfortably host up to 350 for a seated meal or 550 for a standing reception. If you book the covered area and lawn, events can grow to more than 1,000 guests. Details & Capacities: 4,900 sq. ft. | Theater – 560 | Classroom – 280 | Rounds of 10 – 350 | Crescent Rounds – 210 | Reception – 1,000 Beach Club Events Lawn Our newest ceremony space features a manicured lawn and garden and views of the marina, Cooper River, and USS Yorktown. It’s perfect for sunset weddings or photo shoots. Details & Capacities: 1,685 sq. ft. | Theater – 165 | Rounds of 10 – 120 | Reception –150 Contact us to begin planning your wedding or special event at Charleston Harbor Resort & Marina. Choose Your Stay Link for CTA-Item1 The Beach Club Check Availability Link for CTA-Item2 Harborside Check Availability",
      "hash": "55fed05b3519",
      "downloadedAt": "2026-01-18T16:55:51.226Z",
      "trimmedAt": "2026-01-18T17:13:05.685Z",
      "sizeReduction": "96.0%"
    },
    {
      "url": "https://www.charlestonharborresort.com/cuisine--cocktails.htm#anchorBridgeBar",
      "text": "Enjoy Fabulous Cuisine & Cocktails at Our Charleston Resort Whether you are staying at Charleston Harbor Resort & Marina or are just out for a relaxing dinner by the water, we have all your dining needs covered. Sip on a cocktail by the pool from our Tiki Bar. Enjoy a casual meal and some conversation with the locals at the Reel Bar. Or take in unparalleled views while trying some of the freshest seafood in town at the Charleston Harbor Fish House. Link to Charleston Harbor Fish House Charleston Harbor Fish House Fresh Seafood. Fresh Drinks. Fresh Air. Voted one of the “Top 25 Restaurants in Charleston” by , the Fish House is Charleston’s premier location for waterfront dining. The menu, which changes seasonally, offers a variety of options from both land and sea, with a focus on featuring the freshest catches of the day and locally sourced ingredients whenever possible. This on-resort restaurant is open daily for breakfast, lunch, and dinner. Charleston Living Magazine WEBSITE Hours of Operation: Breakfast Buffet Hours: 7am- 10:30am Lunch Hours: 11:30am - 3pm* Dinner Hours: 4:30pm - 9pm Sunday - Thursday | 4:30pm - 10pm Friday & Saturday Reservations Strongly Recommended for Dinner *Limited menu from 3:00 PM to 4:30 PM Please click to view Fish House Menu. HERE Bridge Bar The Bridge Bar is the only rooftop bar overlooking the entire Charleston skyline, as well as the Ravenel Bridge and USS Yorktown. This view, combined with great cocktails and flavorful appetizers, makes our open-air bar the place to be. Stop in with family and friends for a memorable night in the friendliest city in the U.S. Open 5pm-9pm Monday- Thursday Open 4pm - 10pm Saturday-Sunday *excluding days of event rental & weather permitting please call 843-284-7019 to inquire Reel Bar Whether you’re hungry for a quick bite or thirsty for a refreshing cocktail, a visit to the Reel Bar is sure to please. Complete with an impressive display of antique tackle gear, the Reel Bar offers the ideal locale to relax and unwind while dipping your toes in the sand. Hours of Operation: | Monday - Thursday (Food available: 5pm - 10pm) 4pm - 10pm | Friday (Food available: 5pm-10pm) 4pm - 12am |Saturday (Food available: 5pm-10pm) 12pm - 12am | Sunday (Food available: 12pm-10pm) 12pm - 10pm Live music is Thursday & Friday 6-9pm and Sundays 2-6pm at Reel bar Please view the Reel Bar Menu below! APPETIZERS Cajun Baked Shrimp Dip $13 trinity vegetables, andouille sausage, three cheeses, creole spice, ritz crackers Reel Jumbo Chicken Wings 6 for $10 or 12 for $18 served w/celery and carrot sticks, blue cheese or ranch, tossed in choice of house dry rub, buffalo, mustard BBQ, teriyaki, ranch dry rub Pretzel Bites $11 sea salt, pickled jalapenos, beer cheese sauce Crispy Brussel Sprouts $12 sweet chili sauce, citrus, sesame seeds, green onion SANDWICHES & BASKETS Hand Breaded Chicken Tender Basket $17 honey mustard, bbq or buttermilk ranch Buttermilk Fried Shrimp Basket $18 cocktail & tartar sauce, coleslaw The Beach Club $18 roast beef, turkey, applewood smoked bacon, lettuce, vine ripened tomato, swiss, honey mustard, toasted sourdough Grilled Chicken Wrap $16 green goddess dressing, bacon, cheddar, vine ripened tomato, shredded lettuce The Harbor Burger $19 ½ lb Schweid and Sons patty, smoked gouda, LTOP, Comeback Sauce (add applewood smoked bacon $2) Buttermilk Fried Grouper Sandwich $21 brioche bun, creole remoulade, shredded lettuce, vine ripened tomato ** All sandwiches & Baskets Served with Kettle Chips or Substitute French Fries for $2** TACOS, SALADS, & BOWLS Classic Cobb Salad $18 mixed greens, grilled chicken, hardboiled egg, smoked bacon, charred sweet corn, tomato, sharp cheddar, avocado, buttermilk ranch Mediterranean Power Bowl $17 grilled shrimp, orzo, chickpeas, roasted peppers, feta cheese, baby spinach, cucumbers, tomatoes, lemon vinaigrette Grilled Mahi Tacos $16 warm flour tortillas, shredded lettuce, pico de gallo, cilantro crema, kettle chips Carne Asada Tacos $16 flank steak, salsa, shredded cabbage, pickled onions, cotija cheese, kettle chips Reel Quesadilla $14 shredded colby jack, pico de gallo, black beans, side of salsa and sour cream *add spiced beef, grilled chicken or shrimp $7* PIZZA 12 INCH Cheese $15 Pepperoni $16 Chicken Bacon Ranch $18 ranch base, bacon, bell pepper, red onion, grilled chicken **Substitute Gluten Free Crust $1** SWEET TREATS Brownie Sundae $10 vanilla ice cream, roasted peanuts, chocolate sauce Key Lime Pie $10 graham cracker crust, raspberry sauce Link to Beach Club Tiki Bar Beach Club Tiki Bar Located pool side at The Beach Club, the Tiki Bar is the perfect spot to soak in harbor views and the South Carolina sunshine. The menu offers a variety of light fare, sandwiches, and salads. Open 7 days a week beginning at 11:00 AM until Sunset , we will be offering a limited food menu (11:00 AM – 3:00 PM) Monday – Wednesday we will offer the full food menu (11:00 AM – 3:00 PM) Thursday – Sunday, Weather Permitting Please view the Tiki Bar Menu below: Starters |$13 Caprese Dip Whipped Mozzarella, Balsamic Roasted Tomatoes, Pesto, Grilled Bread, Crudité | $14 Tiki Quesadilla Shredded Colby Jack, Pico de Gallo, Black Beans, Side of Salsa and Sour Cream **add spiced beef, grilled chicken or shrimp $7** French Bread Pizza | Hand Crushed Tomato Sauce, Fresh Mozzarella, Baguette, Pepperoni $16 | $14 Loaded Nachos Queso, Black Beans, Pico de Gallo, Sour Cream, Guacamole, Pickled Jalapeños **add spiced beef, grilled chicken or shrimp $7** Mains Mahi Tacos $16 Kettle Chips Warm Flour Tortillas, Shredded Lettuce, Pico de Gallo, Cilantro Crema , *Classic Cobb Salad $18 Mixed Greens, Grilled Chicken, Sharp Cheddar, Smoked Bacon, Tomato, Charred Sweet Corn, Hard Boiled Egg, Avocado, Buttermilk Ranch *Mediterranean Power Bowl $17 Grilled Shrimp, Orzo, Baby Spinach, Feta, Roasted Peppers, Chickpeas, Cucumbers, Tomatoes, Lemon Vinaigrette Harbor Burger $19 ½ lb Prime Beef Patty, Smoked Gouda, LTOP, Comeback Sauce, Brioche Bun, Kettle Chips **add bacon $2** *Grilled Chicken Wrap $16 Green Goddess, Bacon, Cheddar, Lettuce, Tomato, Kettle Chips The Beach Club $18 Roast Beef, Turkey, Bacon, Lettuce, Tomato, Swiss, Toasted Sourdough, Honey Mustard, Kettle Chips Cocktails, Daiquiris and Beers Botanical Spritzers Ketel One Botanical + Soda & Citrus | cucumber & mint / grapefruit & rose / peach & orange blossom $12 Frozen Cocktails Caribbean Colada | captain morgan white rum, pina colada, mango $15 Mud Slide | smirnoff vanilla vodka, kahlua chocolate sauce, ice cream $16 Daiquiri |strawberry, pina colada, peach, mango or banana made with captain morgan white rum $15 Frosé All Day | rosé wine, strawberry puree, smirnoff berry vodka $15 Tiki Drinks Dark & Stormy | Gosling’s Black Seal Rum, Ginger Beer, Lime $12 Salty Dog | Ketel One Vodka, Grapefruit Juice, Prosecco, Salt Rim $15 Beach Club Beach Comber | Captain Morgan White & Coconut Rum, Dry Curacao, Pineapple, Orange Juice $14 Lone Ranger | Don Julio Blanco, Lime Juice, Agave Syrup, Sparkling Rose $15 Rum Runner | Captain Morgan White Rum, Banana and Blackberry Liquor Sweet & Sour, Grenadine $14 Beer Domestic Beer $7 Imported Beer $8 Local Beer $8 Seasonal Rotating Draft $9 **Please ask staff for our Wine Selections** Kids Plates add Bacon - $2 Cheeseburger $12 Mini Hot Dogs $12 Choice of Chicken or Spiced Beef Tacos $12 Choice of Chicken or Spiced Beef or Black Bean Quesadilla $12 Sweet Treats Sweets Homemade Mini Oreo Cheesecakes 2/$8 4/$15 Link to Private Dining & Events Private Dining & Events at Charleston Harbor Fish House Charleston waterways are the perfect backdrop for any special event. Host a birthday, corporate event, anniversary, or other special occasion in our Mount Pleasant restaurant and treat your guests to a delicious meal, tasty cocktails, and stunning views. We have four distinct areas available for private parties of up to 150 guests. Contact our Group Sales Coordinator at or for more details. (843) 284-7026 sales@charlestonharborresort.com *Consuming raw or undercooked meats, poultry, seafood, shellfish or eggs may increase your risk of foodborne illness, especially if you have certain medical conditions. Notice: For your convenience, a 19% gratuity will be added to parties of 6 or more. To expedite service, no separate checks for parties of 6 or more. Choose Your Stay Link for CTA-Item1 The Beach Club Check Availability Link for CTA-Item2 Harborside Check Availability",
      "hash": "61c203922a55",
      "downloadedAt": "2026-01-18T16:55:49.111Z",
      "trimmedAt": "2026-01-18T17:13:05.704Z",
      "sizeReduction": "90.1%"
    },
    {
      "url": "https://www.charlestonharborresort.com/weddings--events.htm#anchorIndoorVenues",
      "text": "Begin Your Happily Ever After at our Beautiful Charleston Wedding Venue Blending southern charm with breathtaking waterfront views, Charleston Harbor Resort & Marina is the wedding destination of your dreams. Beyond weddings, many of life’s most precious moments are celebrated with us. Our surroundings and stellar service ensure beautiful and lasting memories of your special anniversary, birthday, graduation, or any event you'll hold dear forever. Stylish Venues for Events of Distinction Choose from 9 inspired venues, including our private beach that capture the essence of the Lowcountry and the beauty of the downtown Charleston skyline. No matter which venue you choose, you can trust that our experienced, knowledgeable team will make the planning process effortless by assisting with everything from event space setup and design, to guidance in making the perfect menu selection. Our wedding and event venues offer everything needed for creating cherished memories and entertaining guests with luxury and style. Link to Indoor Venues Our Indoor Venues The Yacht Club & Bridge Bar The Yacht Club features 2,100 square feet of beautiful space, made almost entirely of windows that offer views of the Charleston Harbor Marina and downtown skyline. The nautical feel of the space is ideal for any celebration, with reclaimed wood plank floors and drop ceilings with stained wood beams. The built-in sound system ensures a flawless presentation or night of dancing. Bridge Bar is an open- air space connected to the Yacht Club overlooking the USS Yorktown and historic Charleston skyline Details & Capacities: 2,100 sq. ft. | U-Shape/Board – 65/70 | Theater – 175 | Classroom – 100 | Rounds of 10 – 120 | Crescent Rounds – 90 | Reception – 80 Sunrise Terrace & Deck This 2,400 SQFT, climate-controlled space boasts a stunning view of the Charleston harbor, marina, and downtown skyline through picture windows. The Sunrise Terrace can be enjoyed as is with a simple, yet classic indoor setting or can be transformed to an indoor/outdoor dream with windows that open in full accordion style. Whether the windows are open or not, this space offers unobstructed 180° views for a wedding reception of up to 150 guests or up to 250 for a standing reception with heavy hors d’oeuvres. Details & Capacities: 2,400 SQFT. | Theater – 250 | Rounds of 10 – 150 | Reception – 180 Charleston Harbor Fish House Porch The Porch at our on-site restaurant offers 1,340 square feet of private dining space, complete with climate control and large screen doors that can be opened seasonally to let the fresh harbor breeze flow through. Existing seating can accommodate up to 72 people, or we can arrange the space in a reception-style layout for up to 100. The Harbor Room at Charleston Harbor Fish House The USS Yorktown and Ravenel Bridge are your backdrops when you choose the Harbor Room at Charleston Harbor Fish House. This semi-private dining space is located off the main dining room and can accommodate up to 44 guests. Atlantic Ballroom Our 1,700-square-foot ballroom opens onto the Harbor Terrace and looks out over the pool, beach, and harbor. It provides an intimate atmosphere for up to 80 guests for served lunches and dinners or 150 guests for standing receptions. Details & Capacities: 1,700 sq. ft. | U-Shape/Board – 45/48 | Theater – 165 | Classroom – 88 | Rounds of 10 – 120 | Crescent Rounds – 72 | Reception –150 Link to Outdoor Venues Our Outdoor Venues Harborside Beach Whether you’re planning a casual or elegant affair, Harborside Beach is the perfect setting. Enjoy breathtaking views of the Charleston Harbor and historic downtown skyline while celebrating a wedding ceremony or reception, themed party, concert, or other social soiree. Details & Capacities: 21,600 sq. ft. | Theater – 650 | Rounds of 10 – 500 | Reception – 1,900 Lookout Pavilion Our premier outdoor venue, the Lookout Pavilion and its adjacent lawn are perfect for wedding ceremonies, receptions, concerts, carnivals, teambuilding events and more. The Pavilion features a wood-burning fireplace and its own private restrooms, and can comfortably host up to 350 for a seated meal or 550 for a standing reception. If you book the covered area and lawn, events can grow to more than 1,000 guests. Details & Capacities: 4,900 sq. ft. | Theater – 560 | Classroom – 280 | Rounds of 10 – 350 | Crescent Rounds – 210 | Reception – 1,000 Beach Club Events Lawn Our newest ceremony space features a manicured lawn and garden and views of the marina, Cooper River, and USS Yorktown. It’s perfect for sunset weddings or photo shoots. Details & Capacities: 1,685 sq. ft. | Theater – 165 | Rounds of 10 – 120 | Reception –150 Contact us to begin planning your wedding or special event at Charleston Harbor Resort & Marina. Choose Your Stay Link for CTA-Item1 The Beach Club Check Availability Link for CTA-Item2 Harborside Check Availability",
      "hash": "84675b454581",
      "downloadedAt": "2026-01-18T16:55:51.756Z",
      "trimmedAt": "2026-01-18T17:13:05.720Z",
      "sizeReduction": "96.0%"
    },
    {
      "url": "https://www.charlestonharborresort.com/cuisine--cocktails.htm",
      "text": "Enjoy Fabulous Cuisine & Cocktails at Our Charleston Resort Whether you are staying at Charleston Harbor Resort & Marina or are just out for a relaxing dinner by the water, we have all your dining needs covered. Sip on a cocktail by the pool from our Tiki Bar. Enjoy a casual meal and some conversation with the locals at the Reel Bar. Or take in unparalleled views while trying some of the freshest seafood in town at the Charleston Harbor Fish House. Link to Charleston Harbor Fish House Charleston Harbor Fish House Fresh Seafood. Fresh Drinks. Fresh Air. Voted one of the “Top 25 Restaurants in Charleston” by , the Fish House is Charleston’s premier location for waterfront dining. The menu, which changes seasonally, offers a variety of options from both land and sea, with a focus on featuring the freshest catches of the day and locally sourced ingredients whenever possible. This on-resort restaurant is open daily for breakfast, lunch, and dinner. Charleston Living Magazine WEBSITE Hours of Operation: Breakfast Buffet Hours: 7am- 10:30am Lunch Hours: 11:30am - 3pm* Dinner Hours: 4:30pm - 9pm Sunday - Thursday | 4:30pm - 10pm Friday & Saturday Reservations Strongly Recommended for Dinner *Limited menu from 3:00 PM to 4:30 PM Please click to view Fish House Menu. HERE Bridge Bar The Bridge Bar is the only rooftop bar overlooking the entire Charleston skyline, as well as the Ravenel Bridge and USS Yorktown. This view, combined with great cocktails and flavorful appetizers, makes our open-air bar the place to be. Stop in with family and friends for a memorable night in the friendliest city in the U.S. Open 5pm-9pm Monday- Thursday Open 4pm - 10pm Saturday-Sunday *excluding days of event rental & weather permitting please call 843-284-7019 to inquire Reel Bar Whether you’re hungry for a quick bite or thirsty for a refreshing cocktail, a visit to the Reel Bar is sure to please. Complete with an impressive display of antique tackle gear, the Reel Bar offers the ideal locale to relax and unwind while dipping your toes in the sand. Hours of Operation: | Monday - Thursday (Food available: 5pm - 10pm) 4pm - 10pm | Friday (Food available: 5pm-10pm) 4pm - 12am |Saturday (Food available: 5pm-10pm) 12pm - 12am | Sunday (Food available: 12pm-10pm) 12pm - 10pm Live music is Thursday & Friday 6-9pm and Sundays 2-6pm at Reel bar Please view the Reel Bar Menu below! APPETIZERS Cajun Baked Shrimp Dip $13 trinity vegetables, andouille sausage, three cheeses, creole spice, ritz crackers Reel Jumbo Chicken Wings 6 for $10 or 12 for $18 served w/celery and carrot sticks, blue cheese or ranch, tossed in choice of house dry rub, buffalo, mustard BBQ, teriyaki, ranch dry rub Pretzel Bites $11 sea salt, pickled jalapenos, beer cheese sauce Crispy Brussel Sprouts $12 sweet chili sauce, citrus, sesame seeds, green onion SANDWICHES & BASKETS Hand Breaded Chicken Tender Basket $17 honey mustard, bbq or buttermilk ranch Buttermilk Fried Shrimp Basket $18 cocktail & tartar sauce, coleslaw The Beach Club $18 roast beef, turkey, applewood smoked bacon, lettuce, vine ripened tomato, swiss, honey mustard, toasted sourdough Grilled Chicken Wrap $16 green goddess dressing, bacon, cheddar, vine ripened tomato, shredded lettuce The Harbor Burger $19 ½ lb Schweid and Sons patty, smoked gouda, LTOP, Comeback Sauce (add applewood smoked bacon $2) Buttermilk Fried Grouper Sandwich $21 brioche bun, creole remoulade, shredded lettuce, vine ripened tomato ** All sandwiches & Baskets Served with Kettle Chips or Substitute French Fries for $2** TACOS, SALADS, & BOWLS Classic Cobb Salad $18 mixed greens, grilled chicken, hardboiled egg, smoked bacon, charred sweet corn, tomato, sharp cheddar, avocado, buttermilk ranch Mediterranean Power Bowl $17 grilled shrimp, orzo, chickpeas, roasted peppers, feta cheese, baby spinach, cucumbers, tomatoes, lemon vinaigrette Grilled Mahi Tacos $16 warm flour tortillas, shredded lettuce, pico de gallo, cilantro crema, kettle chips Carne Asada Tacos $16 flank steak, salsa, shredded cabbage, pickled onions, cotija cheese, kettle chips Reel Quesadilla $14 shredded colby jack, pico de gallo, black beans, side of salsa and sour cream *add spiced beef, grilled chicken or shrimp $7* PIZZA 12 INCH Cheese $15 Pepperoni $16 Chicken Bacon Ranch $18 ranch base, bacon, bell pepper, red onion, grilled chicken **Substitute Gluten Free Crust $1** SWEET TREATS Brownie Sundae $10 vanilla ice cream, roasted peanuts, chocolate sauce Key Lime Pie $10 graham cracker crust, raspberry sauce Link to Beach Club Tiki Bar Beach Club Tiki Bar Located pool side at The Beach Club, the Tiki Bar is the perfect spot to soak in harbor views and the South Carolina sunshine. The menu offers a variety of light fare, sandwiches, and salads. Open 7 days a week beginning at 11:00 AM until Sunset , we will be offering a limited food menu (11:00 AM – 3:00 PM) Monday – Wednesday we will offer the full food menu (11:00 AM – 3:00 PM) Thursday – Sunday, Weather Permitting Please view the Tiki Bar Menu below: Starters |$13 Caprese Dip Whipped Mozzarella, Balsamic Roasted Tomatoes, Pesto, Grilled Bread, Crudité | $14 Tiki Quesadilla Shredded Colby Jack, Pico de Gallo, Black Beans, Side of Salsa and Sour Cream **add spiced beef, grilled chicken or shrimp $7** French Bread Pizza | Hand Crushed Tomato Sauce, Fresh Mozzarella, Baguette, Pepperoni $16 | $14 Loaded Nachos Queso, Black Beans, Pico de Gallo, Sour Cream, Guacamole, Pickled Jalapeños **add spiced beef, grilled chicken or shrimp $7** Mains Mahi Tacos $16 Kettle Chips Warm Flour Tortillas, Shredded Lettuce, Pico de Gallo, Cilantro Crema , *Classic Cobb Salad $18 Mixed Greens, Grilled Chicken, Sharp Cheddar, Smoked Bacon, Tomato, Charred Sweet Corn, Hard Boiled Egg, Avocado, Buttermilk Ranch *Mediterranean Power Bowl $17 Grilled Shrimp, Orzo, Baby Spinach, Feta, Roasted Peppers, Chickpeas, Cucumbers, Tomatoes, Lemon Vinaigrette Harbor Burger $19 ½ lb Prime Beef Patty, Smoked Gouda, LTOP, Comeback Sauce, Brioche Bun, Kettle Chips **add bacon $2** *Grilled Chicken Wrap $16 Green Goddess, Bacon, Cheddar, Lettuce, Tomato, Kettle Chips The Beach Club $18 Roast Beef, Turkey, Bacon, Lettuce, Tomato, Swiss, Toasted Sourdough, Honey Mustard, Kettle Chips Cocktails, Daiquiris and Beers Botanical Spritzers Ketel One Botanical + Soda & Citrus | cucumber & mint / grapefruit & rose / peach & orange blossom $12 Frozen Cocktails Caribbean Colada | captain morgan white rum, pina colada, mango $15 Mud Slide | smirnoff vanilla vodka, kahlua chocolate sauce, ice cream $16 Daiquiri |strawberry, pina colada, peach, mango or banana made with captain morgan white rum $15 Frosé All Day | rosé wine, strawberry puree, smirnoff berry vodka $15 Tiki Drinks Dark & Stormy | Gosling’s Black Seal Rum, Ginger Beer, Lime $12 Salty Dog | Ketel One Vodka, Grapefruit Juice, Prosecco, Salt Rim $15 Beach Club Beach Comber | Captain Morgan White & Coconut Rum, Dry Curacao, Pineapple, Orange Juice $14 Lone Ranger | Don Julio Blanco, Lime Juice, Agave Syrup, Sparkling Rose $15 Rum Runner | Captain Morgan White Rum, Banana and Blackberry Liquor Sweet & Sour, Grenadine $14 Beer Domestic Beer $7 Imported Beer $8 Local Beer $8 Seasonal Rotating Draft $9 **Please ask staff for our Wine Selections** Kids Plates add Bacon - $2 Cheeseburger $12 Mini Hot Dogs $12 Choice of Chicken or Spiced Beef Tacos $12 Choice of Chicken or Spiced Beef or Black Bean Quesadilla $12 Sweet Treats Sweets Homemade Mini Oreo Cheesecakes 2/$8 4/$15 Link to Private Dining & Events Private Dining & Events at Charleston Harbor Fish House Charleston waterways are the perfect backdrop for any special event. Host a birthday, corporate event, anniversary, or other special occasion in our Mount Pleasant restaurant and treat your guests to a delicious meal, tasty cocktails, and stunning views. We have four distinct areas available for private parties of up to 150 guests. Contact our Group Sales Coordinator at or for more details. (843) 284-7026 sales@charlestonharborresort.com *Consuming raw or undercooked meats, poultry, seafood, shellfish or eggs may increase your risk of foodborne illness, especially if you have certain medical conditions. Notice: For your convenience, a 19% gratuity will be added to parties of 6 or more. To expedite service, no separate checks for parties of 6 or more. Choose Your Stay Link for CTA-Item1 The Beach Club Check Availability Link for CTA-Item2 Harborside Check Availability",
      "hash": "85f614fec56e",
      "downloadedAt": "2026-01-18T16:55:48.061Z",
      "trimmedAt": "2026-01-18T17:13:05.740Z",
      "sizeReduction": "90.1%"
    },
    {
      "url": "https://www.charlestonharborresort.com/weddings-events-request-information.htm",
      "text": "Request Information About Weddings & Events Are you ready to begin planning an unforgettable event at Charleston Harbor Resort & Marina? Whether it’s a wedding, anniversary, graduation, or birthday, we can’t wait to celebrate with you! To get started, fill out and submit the form below with details about your event, and we’ll be in touch to discuss all the details. Choose Your Stay Link for CTA-Item1 The Beach Club Check Availability Link for CTA-Item2 Harborside Check Availability",
      "hash": "b77508ea2fdf",
      "downloadedAt": "2026-01-18T16:55:52.808Z",
      "trimmedAt": "2026-01-18T17:13:05.745Z",
      "sizeReduction": "99.0%"
    },
    {
      "url": "https://www.charlestonharborresort.com/cuisine--cocktails.htm#anchorFishHouse",
      "text": "Enjoy Fabulous Cuisine & Cocktails at Our Charleston Resort Whether you are staying at Charleston Harbor Resort & Marina or are just out for a relaxing dinner by the water, we have all your dining needs covered. Sip on a cocktail by the pool from our Tiki Bar. Enjoy a casual meal and some conversation with the locals at the Reel Bar. Or take in unparalleled views while trying some of the freshest seafood in town at the Charleston Harbor Fish House. Link to Charleston Harbor Fish House Charleston Harbor Fish House Fresh Seafood. Fresh Drinks. Fresh Air. Voted one of the “Top 25 Restaurants in Charleston” by , the Fish House is Charleston’s premier location for waterfront dining. The menu, which changes seasonally, offers a variety of options from both land and sea, with a focus on featuring the freshest catches of the day and locally sourced ingredients whenever possible. This on-resort restaurant is open daily for breakfast, lunch, and dinner. Charleston Living Magazine WEBSITE Hours of Operation: Breakfast Buffet Hours: 7am- 10:30am Lunch Hours: 11:30am - 3pm* Dinner Hours: 4:30pm - 9pm Sunday - Thursday | 4:30pm - 10pm Friday & Saturday Reservations Strongly Recommended for Dinner *Limited menu from 3:00 PM to 4:30 PM Please click to view Fish House Menu. HERE Bridge Bar The Bridge Bar is the only rooftop bar overlooking the entire Charleston skyline, as well as the Ravenel Bridge and USS Yorktown. This view, combined with great cocktails and flavorful appetizers, makes our open-air bar the place to be. Stop in with family and friends for a memorable night in the friendliest city in the U.S. Open 5pm-9pm Monday- Thursday Open 4pm - 10pm Saturday-Sunday *excluding days of event rental & weather permitting please call 843-284-7019 to inquire Reel Bar Whether you’re hungry for a quick bite or thirsty for a refreshing cocktail, a visit to the Reel Bar is sure to please. Complete with an impressive display of antique tackle gear, the Reel Bar offers the ideal locale to relax and unwind while dipping your toes in the sand. Hours of Operation: | Monday - Thursday (Food available: 5pm - 10pm) 4pm - 10pm | Friday (Food available: 5pm-10pm) 4pm - 12am |Saturday (Food available: 5pm-10pm) 12pm - 12am | Sunday (Food available: 12pm-10pm) 12pm - 10pm Live music is Thursday & Friday 6-9pm and Sundays 2-6pm at Reel bar Please view the Reel Bar Menu below! APPETIZERS Cajun Baked Shrimp Dip $13 trinity vegetables, andouille sausage, three cheeses, creole spice, ritz crackers Reel Jumbo Chicken Wings 6 for $10 or 12 for $18 served w/celery and carrot sticks, blue cheese or ranch, tossed in choice of house dry rub, buffalo, mustard BBQ, teriyaki, ranch dry rub Pretzel Bites $11 sea salt, pickled jalapenos, beer cheese sauce Crispy Brussel Sprouts $12 sweet chili sauce, citrus, sesame seeds, green onion SANDWICHES & BASKETS Hand Breaded Chicken Tender Basket $17 honey mustard, bbq or buttermilk ranch Buttermilk Fried Shrimp Basket $18 cocktail & tartar sauce, coleslaw The Beach Club $18 roast beef, turkey, applewood smoked bacon, lettuce, vine ripened tomato, swiss, honey mustard, toasted sourdough Grilled Chicken Wrap $16 green goddess dressing, bacon, cheddar, vine ripened tomato, shredded lettuce The Harbor Burger $19 ½ lb Schweid and Sons patty, smoked gouda, LTOP, Comeback Sauce (add applewood smoked bacon $2) Buttermilk Fried Grouper Sandwich $21 brioche bun, creole remoulade, shredded lettuce, vine ripened tomato ** All sandwiches & Baskets Served with Kettle Chips or Substitute French Fries for $2** TACOS, SALADS, & BOWLS Classic Cobb Salad $18 mixed greens, grilled chicken, hardboiled egg, smoked bacon, charred sweet corn, tomato, sharp cheddar, avocado, buttermilk ranch Mediterranean Power Bowl $17 grilled shrimp, orzo, chickpeas, roasted peppers, feta cheese, baby spinach, cucumbers, tomatoes, lemon vinaigrette Grilled Mahi Tacos $16 warm flour tortillas, shredded lettuce, pico de gallo, cilantro crema, kettle chips Carne Asada Tacos $16 flank steak, salsa, shredded cabbage, pickled onions, cotija cheese, kettle chips Reel Quesadilla $14 shredded colby jack, pico de gallo, black beans, side of salsa and sour cream *add spiced beef, grilled chicken or shrimp $7* PIZZA 12 INCH Cheese $15 Pepperoni $16 Chicken Bacon Ranch $18 ranch base, bacon, bell pepper, red onion, grilled chicken **Substitute Gluten Free Crust $1** SWEET TREATS Brownie Sundae $10 vanilla ice cream, roasted peanuts, chocolate sauce Key Lime Pie $10 graham cracker crust, raspberry sauce Link to Beach Club Tiki Bar Beach Club Tiki Bar Located pool side at The Beach Club, the Tiki Bar is the perfect spot to soak in harbor views and the South Carolina sunshine. The menu offers a variety of light fare, sandwiches, and salads. Open 7 days a week beginning at 11:00 AM until Sunset , we will be offering a limited food menu (11:00 AM – 3:00 PM) Monday – Wednesday we will offer the full food menu (11:00 AM – 3:00 PM) Thursday – Sunday, Weather Permitting Please view the Tiki Bar Menu below: Starters |$13 Caprese Dip Whipped Mozzarella, Balsamic Roasted Tomatoes, Pesto, Grilled Bread, Crudité | $14 Tiki Quesadilla Shredded Colby Jack, Pico de Gallo, Black Beans, Side of Salsa and Sour Cream **add spiced beef, grilled chicken or shrimp $7** French Bread Pizza | Hand Crushed Tomato Sauce, Fresh Mozzarella, Baguette, Pepperoni $16 | $14 Loaded Nachos Queso, Black Beans, Pico de Gallo, Sour Cream, Guacamole, Pickled Jalapeños **add spiced beef, grilled chicken or shrimp $7** Mains Mahi Tacos $16 Kettle Chips Warm Flour Tortillas, Shredded Lettuce, Pico de Gallo, Cilantro Crema , *Classic Cobb Salad $18 Mixed Greens, Grilled Chicken, Sharp Cheddar, Smoked Bacon, Tomato, Charred Sweet Corn, Hard Boiled Egg, Avocado, Buttermilk Ranch *Mediterranean Power Bowl $17 Grilled Shrimp, Orzo, Baby Spinach, Feta, Roasted Peppers, Chickpeas, Cucumbers, Tomatoes, Lemon Vinaigrette Harbor Burger $19 ½ lb Prime Beef Patty, Smoked Gouda, LTOP, Comeback Sauce, Brioche Bun, Kettle Chips **add bacon $2** *Grilled Chicken Wrap $16 Green Goddess, Bacon, Cheddar, Lettuce, Tomato, Kettle Chips The Beach Club $18 Roast Beef, Turkey, Bacon, Lettuce, Tomato, Swiss, Toasted Sourdough, Honey Mustard, Kettle Chips Cocktails, Daiquiris and Beers Botanical Spritzers Ketel One Botanical + Soda & Citrus | cucumber & mint / grapefruit & rose / peach & orange blossom $12 Frozen Cocktails Caribbean Colada | captain morgan white rum, pina colada, mango $15 Mud Slide | smirnoff vanilla vodka, kahlua chocolate sauce, ice cream $16 Daiquiri |strawberry, pina colada, peach, mango or banana made with captain morgan white rum $15 Frosé All Day | rosé wine, strawberry puree, smirnoff berry vodka $15 Tiki Drinks Dark & Stormy | Gosling’s Black Seal Rum, Ginger Beer, Lime $12 Salty Dog | Ketel One Vodka, Grapefruit Juice, Prosecco, Salt Rim $15 Beach Club Beach Comber | Captain Morgan White & Coconut Rum, Dry Curacao, Pineapple, Orange Juice $14 Lone Ranger | Don Julio Blanco, Lime Juice, Agave Syrup, Sparkling Rose $15 Rum Runner | Captain Morgan White Rum, Banana and Blackberry Liquor Sweet & Sour, Grenadine $14 Beer Domestic Beer $7 Imported Beer $8 Local Beer $8 Seasonal Rotating Draft $9 **Please ask staff for our Wine Selections** Kids Plates add Bacon - $2 Cheeseburger $12 Mini Hot Dogs $12 Choice of Chicken or Spiced Beef Tacos $12 Choice of Chicken or Spiced Beef or Black Bean Quesadilla $12 Sweet Treats Sweets Homemade Mini Oreo Cheesecakes 2/$8 4/$15 Link to Private Dining & Events Private Dining & Events at Charleston Harbor Fish House Charleston waterways are the perfect backdrop for any special event. Host a birthday, corporate event, anniversary, or other special occasion in our Mount Pleasant restaurant and treat your guests to a delicious meal, tasty cocktails, and stunning views. We have four distinct areas available for private parties of up to 150 guests. Contact our Group Sales Coordinator at or for more details. (843) 284-7026 sales@charlestonharborresort.com *Consuming raw or undercooked meats, poultry, seafood, shellfish or eggs may increase your risk of foodborne illness, especially if you have certain medical conditions. Notice: For your convenience, a 19% gratuity will be added to parties of 6 or more. To expedite service, no separate checks for parties of 6 or more. Choose Your Stay Link for CTA-Item1 The Beach Club Check Availability Link for CTA-Item2 Harborside Check Availability",
      "hash": "c425c43f4690",
      "downloadedAt": "2026-01-18T16:55:48.583Z",
      "trimmedAt": "2026-01-18T17:13:05.765Z",
      "sizeReduction": "90.1%"
    },
    {
      "url": "https://www.charlestonharborresort.com/",
      "text": "Welcome to Charleston Harbor Resort & Marina in Charleston, SC Welcome to Charleston Harbor Resort & Marina, an unparalleled waterfront destination nestled in the heart of Condé Nast Traveler’s #1 city in the U.S. Here, we invite you to indulge in coastal chic accommodations, embrace unparalleled amenities, and immerse yourself in a world of activities set against the breathtaking backdrop of our stunning waterfront location. Our award-winning resort is more than just a retreat; it's a haven where Southern hospitality meets coastal inspiration. Join us in experiencing the perfect blend of luxury, relaxation, and adventure, where every moment becomes a cherished memory. Explore the extraordinary at Charleston Harbor Resort & Marina. The Beach Club Conde` Nast Reader's Choice ® The Beach Club provides an authentic Charleston experience complemented by gracious, personalized service, high-end accommodations, and a relaxed coastal setting. Not only are we Charleston's only LEED certified hotel, but the Condé Nast Readers' Choice Awards 2023, we were named #4 Resort in the South and named the #5 resort in South Carolina by Travel + Leisure for the fourth year in a row. Learn More Harborside A Waterfront Retreat The nautically inspired décor of Harborside blends perfectly with the lush, private beachfront that is perfect for enjoying captivating sunsets over the Charleston Harbor and soaking in the picturesque views of the Holy City. This seaside retreat is ideal for family vacations or relaxing weekend getaways. Learn More Charleston, SC Resort Amenities Amenities Charleston Harbor Resort is a true one-stop destination resort, offering a 30,000-square-foot tropical pool deck, Charleston's only waterfront Tiki Bar, an educational and interactive children's program, and an array of water activities for the entire family directly from our marina docks. Learn More see more content Explore Our Charleston Resort Indulge in a variety of on-site amenities, from local, sustainable cuisine at Charleston Harbor Fish House to rejuvenating treatments at Estuary Spa, voted the best spa in Mount Pleasant since 2016 on TripAdvisor. Cuisine & Cocktails Charleston Harbor Resort offers five waterfront dining options with a variety of culinary creations and refreshing libations—all guaranteeing a breathtaking view from any seat! Learn More Estuary Spa Rejuvenate your mind, body, and spirit with services and treatments from the Estuary Spa, including facials, massages, body scrubs, and more. Learn More Explore Boone Hall Plantation, the South Carolina Aquarium, Fort Sumter, Sullivan’s Island Beach—these attractions and more await you in beautiful, historic Charleston. Learn More Weddings & Events Our indoor and outdoor venues are the perfect backdrop for your wedding or special event. Say “I do” on our wedding pier, or celebrate a special milestone in the Yacht Club. Learn More Meetings Our distinctive meeting spaces evoke creativity, from our state-of-the art executive boardroom overlooking the marina to your own private theater, we have what you need to make your next meeting exceptional. Learn More Marina Store The Marina Store carries resort wear for the whole family, nautical and chic home décor, and provisions for a day on the water, plus a spectacular view overlooking Charleston Harbor. Learn More Website Open Modal Button × RESORT NOTICE UPDATE: HURRICANE DORIAN We are happy to report that both of our hotels at the Charleston Harbor Resort & Marina, along with the Fish House did not sustain any damage through the recent storms. We are working diligently to prepare for reopening for business on Saturday, September 7 at NOON. Please check social media for updates throughout the day as our providers work to restore power as well as our phone lines. Thank you for your patience during this unpredictable situation. Choose Your Stay Link for CTA-Item1 The Beach Club Check Availability Link for CTA-Item2 Harborside Check Availability",
      "hash": "e3925944e1cb",
      "downloadedAt": "2026-01-18T16:55:47.935Z",
      "trimmedAt": "2026-01-18T17:13:05.777Z",
      "sizeReduction": "96.0%"
    },
    {
      "url": "https://www.charlestonharborresort.com/cuisine--cocktails.htm#anchorReelBar",
      "text": "Enjoy Fabulous Cuisine & Cocktails at Our Charleston Resort Whether you are staying at Charleston Harbor Resort & Marina or are just out for a relaxing dinner by the water, we have all your dining needs covered. Sip on a cocktail by the pool from our Tiki Bar. Enjoy a casual meal and some conversation with the locals at the Reel Bar. Or take in unparalleled views while trying some of the freshest seafood in town at the Charleston Harbor Fish House. Link to Charleston Harbor Fish House Charleston Harbor Fish House Fresh Seafood. Fresh Drinks. Fresh Air. Voted one of the “Top 25 Restaurants in Charleston” by , the Fish House is Charleston’s premier location for waterfront dining. The menu, which changes seasonally, offers a variety of options from both land and sea, with a focus on featuring the freshest catches of the day and locally sourced ingredients whenever possible. This on-resort restaurant is open daily for breakfast, lunch, and dinner. Charleston Living Magazine WEBSITE Hours of Operation: Breakfast Buffet Hours: 7am- 10:30am Lunch Hours: 11:30am - 3pm* Dinner Hours: 4:30pm - 9pm Sunday - Thursday | 4:30pm - 10pm Friday & Saturday Reservations Strongly Recommended for Dinner *Limited menu from 3:00 PM to 4:30 PM Please click to view Fish House Menu. HERE Bridge Bar The Bridge Bar is the only rooftop bar overlooking the entire Charleston skyline, as well as the Ravenel Bridge and USS Yorktown. This view, combined with great cocktails and flavorful appetizers, makes our open-air bar the place to be. Stop in with family and friends for a memorable night in the friendliest city in the U.S. Open 5pm-9pm Monday- Thursday Open 4pm - 10pm Saturday-Sunday *excluding days of event rental & weather permitting please call 843-284-7019 to inquire Reel Bar Whether you’re hungry for a quick bite or thirsty for a refreshing cocktail, a visit to the Reel Bar is sure to please. Complete with an impressive display of antique tackle gear, the Reel Bar offers the ideal locale to relax and unwind while dipping your toes in the sand. Hours of Operation: | Monday - Thursday (Food available: 5pm - 10pm) 4pm - 10pm | Friday (Food available: 5pm-10pm) 4pm - 12am |Saturday (Food available: 5pm-10pm) 12pm - 12am | Sunday (Food available: 12pm-10pm) 12pm - 10pm Live music is Thursday & Friday 6-9pm and Sundays 2-6pm at Reel bar Please view the Reel Bar Menu below! APPETIZERS Cajun Baked Shrimp Dip $13 trinity vegetables, andouille sausage, three cheeses, creole spice, ritz crackers Reel Jumbo Chicken Wings 6 for $10 or 12 for $18 served w/celery and carrot sticks, blue cheese or ranch, tossed in choice of house dry rub, buffalo, mustard BBQ, teriyaki, ranch dry rub Pretzel Bites $11 sea salt, pickled jalapenos, beer cheese sauce Crispy Brussel Sprouts $12 sweet chili sauce, citrus, sesame seeds, green onion SANDWICHES & BASKETS Hand Breaded Chicken Tender Basket $17 honey mustard, bbq or buttermilk ranch Buttermilk Fried Shrimp Basket $18 cocktail & tartar sauce, coleslaw The Beach Club $18 roast beef, turkey, applewood smoked bacon, lettuce, vine ripened tomato, swiss, honey mustard, toasted sourdough Grilled Chicken Wrap $16 green goddess dressing, bacon, cheddar, vine ripened tomato, shredded lettuce The Harbor Burger $19 ½ lb Schweid and Sons patty, smoked gouda, LTOP, Comeback Sauce (add applewood smoked bacon $2) Buttermilk Fried Grouper Sandwich $21 brioche bun, creole remoulade, shredded lettuce, vine ripened tomato ** All sandwiches & Baskets Served with Kettle Chips or Substitute French Fries for $2** TACOS, SALADS, & BOWLS Classic Cobb Salad $18 mixed greens, grilled chicken, hardboiled egg, smoked bacon, charred sweet corn, tomato, sharp cheddar, avocado, buttermilk ranch Mediterranean Power Bowl $17 grilled shrimp, orzo, chickpeas, roasted peppers, feta cheese, baby spinach, cucumbers, tomatoes, lemon vinaigrette Grilled Mahi Tacos $16 warm flour tortillas, shredded lettuce, pico de gallo, cilantro crema, kettle chips Carne Asada Tacos $16 flank steak, salsa, shredded cabbage, pickled onions, cotija cheese, kettle chips Reel Quesadilla $14 shredded colby jack, pico de gallo, black beans, side of salsa and sour cream *add spiced beef, grilled chicken or shrimp $7* PIZZA 12 INCH Cheese $15 Pepperoni $16 Chicken Bacon Ranch $18 ranch base, bacon, bell pepper, red onion, grilled chicken **Substitute Gluten Free Crust $1** SWEET TREATS Brownie Sundae $10 vanilla ice cream, roasted peanuts, chocolate sauce Key Lime Pie $10 graham cracker crust, raspberry sauce Link to Beach Club Tiki Bar Beach Club Tiki Bar Located pool side at The Beach Club, the Tiki Bar is the perfect spot to soak in harbor views and the South Carolina sunshine. The menu offers a variety of light fare, sandwiches, and salads. Open 7 days a week beginning at 11:00 AM until Sunset , we will be offering a limited food menu (11:00 AM – 3:00 PM) Monday – Wednesday we will offer the full food menu (11:00 AM – 3:00 PM) Thursday – Sunday, Weather Permitting Please view the Tiki Bar Menu below: Starters |$13 Caprese Dip Whipped Mozzarella, Balsamic Roasted Tomatoes, Pesto, Grilled Bread, Crudité | $14 Tiki Quesadilla Shredded Colby Jack, Pico de Gallo, Black Beans, Side of Salsa and Sour Cream **add spiced beef, grilled chicken or shrimp $7** French Bread Pizza | Hand Crushed Tomato Sauce, Fresh Mozzarella, Baguette, Pepperoni $16 | $14 Loaded Nachos Queso, Black Beans, Pico de Gallo, Sour Cream, Guacamole, Pickled Jalapeños **add spiced beef, grilled chicken or shrimp $7** Mains Mahi Tacos $16 Kettle Chips Warm Flour Tortillas, Shredded Lettuce, Pico de Gallo, Cilantro Crema , *Classic Cobb Salad $18 Mixed Greens, Grilled Chicken, Sharp Cheddar, Smoked Bacon, Tomato, Charred Sweet Corn, Hard Boiled Egg, Avocado, Buttermilk Ranch *Mediterranean Power Bowl $17 Grilled Shrimp, Orzo, Baby Spinach, Feta, Roasted Peppers, Chickpeas, Cucumbers, Tomatoes, Lemon Vinaigrette Harbor Burger $19 ½ lb Prime Beef Patty, Smoked Gouda, LTOP, Comeback Sauce, Brioche Bun, Kettle Chips **add bacon $2** *Grilled Chicken Wrap $16 Green Goddess, Bacon, Cheddar, Lettuce, Tomato, Kettle Chips The Beach Club $18 Roast Beef, Turkey, Bacon, Lettuce, Tomato, Swiss, Toasted Sourdough, Honey Mustard, Kettle Chips Cocktails, Daiquiris and Beers Botanical Spritzers Ketel One Botanical + Soda & Citrus | cucumber & mint / grapefruit & rose / peach & orange blossom $12 Frozen Cocktails Caribbean Colada | captain morgan white rum, pina colada, mango $15 Mud Slide | smirnoff vanilla vodka, kahlua chocolate sauce, ice cream $16 Daiquiri |strawberry, pina colada, peach, mango or banana made with captain morgan white rum $15 Frosé All Day | rosé wine, strawberry puree, smirnoff berry vodka $15 Tiki Drinks Dark & Stormy | Gosling’s Black Seal Rum, Ginger Beer, Lime $12 Salty Dog | Ketel One Vodka, Grapefruit Juice, Prosecco, Salt Rim $15 Beach Club Beach Comber | Captain Morgan White & Coconut Rum, Dry Curacao, Pineapple, Orange Juice $14 Lone Ranger | Don Julio Blanco, Lime Juice, Agave Syrup, Sparkling Rose $15 Rum Runner | Captain Morgan White Rum, Banana and Blackberry Liquor Sweet & Sour, Grenadine $14 Beer Domestic Beer $7 Imported Beer $8 Local Beer $8 Seasonal Rotating Draft $9 **Please ask staff for our Wine Selections** Kids Plates add Bacon - $2 Cheeseburger $12 Mini Hot Dogs $12 Choice of Chicken or Spiced Beef Tacos $12 Choice of Chicken or Spiced Beef or Black Bean Quesadilla $12 Sweet Treats Sweets Homemade Mini Oreo Cheesecakes 2/$8 4/$15 Link to Private Dining & Events Private Dining & Events at Charleston Harbor Fish House Charleston waterways are the perfect backdrop for any special event. Host a birthday, corporate event, anniversary, or other special occasion in our Mount Pleasant restaurant and treat your guests to a delicious meal, tasty cocktails, and stunning views. We have four distinct areas available for private parties of up to 150 guests. Contact our Group Sales Coordinator at or for more details. (843) 284-7026 sales@charlestonharborresort.com *Consuming raw or undercooked meats, poultry, seafood, shellfish or eggs may increase your risk of foodborne illness, especially if you have certain medical conditions. Notice: For your convenience, a 19% gratuity will be added to parties of 6 or more. To expedite service, no separate checks for parties of 6 or more. Choose Your Stay Link for CTA-Item1 The Beach Club Check Availability Link for CTA-Item2 Harborside Check Availability",
      "hash": "ed21b177b887",
      "downloadedAt": "2026-01-18T16:55:49.653Z",
      "trimmedAt": "2026-01-18T17:13:05.797Z",
      "sizeReduction": "90.1%"
    },
    {
      "url": "https://www.charlestonharborresort.com/cuisine--cocktails.htm#anchorPrivateDining",
      "text": "Enjoy Fabulous Cuisine & Cocktails at Our Charleston Resort Whether you are staying at Charleston Harbor Resort & Marina or are just out for a relaxing dinner by the water, we have all your dining needs covered. Sip on a cocktail by the pool from our Tiki Bar. Enjoy a casual meal and some conversation with the locals at the Reel Bar. Or take in unparalleled views while trying some of the freshest seafood in town at the Charleston Harbor Fish House. Link to Charleston Harbor Fish House Charleston Harbor Fish House Fresh Seafood. Fresh Drinks. Fresh Air. Voted one of the “Top 25 Restaurants in Charleston” by , the Fish House is Charleston’s premier location for waterfront dining. The menu, which changes seasonally, offers a variety of options from both land and sea, with a focus on featuring the freshest catches of the day and locally sourced ingredients whenever possible. This on-resort restaurant is open daily for breakfast, lunch, and dinner. Charleston Living Magazine WEBSITE Hours of Operation: Breakfast Buffet Hours: 7am- 10:30am Lunch Hours: 11:30am - 3pm* Dinner Hours: 4:30pm - 9pm Sunday - Thursday | 4:30pm - 10pm Friday & Saturday Reservations Strongly Recommended for Dinner *Limited menu from 3:00 PM to 4:30 PM Please click to view Fish House Menu. HERE Bridge Bar The Bridge Bar is the only rooftop bar overlooking the entire Charleston skyline, as well as the Ravenel Bridge and USS Yorktown. This view, combined with great cocktails and flavorful appetizers, makes our open-air bar the place to be. Stop in with family and friends for a memorable night in the friendliest city in the U.S. Open 5pm-9pm Monday- Thursday Open 4pm - 10pm Saturday-Sunday *excluding days of event rental & weather permitting please call 843-284-7019 to inquire Reel Bar Whether you’re hungry for a quick bite or thirsty for a refreshing cocktail, a visit to the Reel Bar is sure to please. Complete with an impressive display of antique tackle gear, the Reel Bar offers the ideal locale to relax and unwind while dipping your toes in the sand. Hours of Operation: | Monday - Thursday (Food available: 5pm - 10pm) 4pm - 10pm | Friday (Food available: 5pm-10pm) 4pm - 12am |Saturday (Food available: 5pm-10pm) 12pm - 12am | Sunday (Food available: 12pm-10pm) 12pm - 10pm Live music is Thursday & Friday 6-9pm and Sundays 2-6pm at Reel bar Please view the Reel Bar Menu below! APPETIZERS Cajun Baked Shrimp Dip $13 trinity vegetables, andouille sausage, three cheeses, creole spice, ritz crackers Reel Jumbo Chicken Wings 6 for $10 or 12 for $18 served w/celery and carrot sticks, blue cheese or ranch, tossed in choice of house dry rub, buffalo, mustard BBQ, teriyaki, ranch dry rub Pretzel Bites $11 sea salt, pickled jalapenos, beer cheese sauce Crispy Brussel Sprouts $12 sweet chili sauce, citrus, sesame seeds, green onion SANDWICHES & BASKETS Hand Breaded Chicken Tender Basket $17 honey mustard, bbq or buttermilk ranch Buttermilk Fried Shrimp Basket $18 cocktail & tartar sauce, coleslaw The Beach Club $18 roast beef, turkey, applewood smoked bacon, lettuce, vine ripened tomato, swiss, honey mustard, toasted sourdough Grilled Chicken Wrap $16 green goddess dressing, bacon, cheddar, vine ripened tomato, shredded lettuce The Harbor Burger $19 ½ lb Schweid and Sons patty, smoked gouda, LTOP, Comeback Sauce (add applewood smoked bacon $2) Buttermilk Fried Grouper Sandwich $21 brioche bun, creole remoulade, shredded lettuce, vine ripened tomato ** All sandwiches & Baskets Served with Kettle Chips or Substitute French Fries for $2** TACOS, SALADS, & BOWLS Classic Cobb Salad $18 mixed greens, grilled chicken, hardboiled egg, smoked bacon, charred sweet corn, tomato, sharp cheddar, avocado, buttermilk ranch Mediterranean Power Bowl $17 grilled shrimp, orzo, chickpeas, roasted peppers, feta cheese, baby spinach, cucumbers, tomatoes, lemon vinaigrette Grilled Mahi Tacos $16 warm flour tortillas, shredded lettuce, pico de gallo, cilantro crema, kettle chips Carne Asada Tacos $16 flank steak, salsa, shredded cabbage, pickled onions, cotija cheese, kettle chips Reel Quesadilla $14 shredded colby jack, pico de gallo, black beans, side of salsa and sour cream *add spiced beef, grilled chicken or shrimp $7* PIZZA 12 INCH Cheese $15 Pepperoni $16 Chicken Bacon Ranch $18 ranch base, bacon, bell pepper, red onion, grilled chicken **Substitute Gluten Free Crust $1** SWEET TREATS Brownie Sundae $10 vanilla ice cream, roasted peanuts, chocolate sauce Key Lime Pie $10 graham cracker crust, raspberry sauce Link to Beach Club Tiki Bar Beach Club Tiki Bar Located pool side at The Beach Club, the Tiki Bar is the perfect spot to soak in harbor views and the South Carolina sunshine. The menu offers a variety of light fare, sandwiches, and salads. Open 7 days a week beginning at 11:00 AM until Sunset , we will be offering a limited food menu (11:00 AM – 3:00 PM) Monday – Wednesday we will offer the full food menu (11:00 AM – 3:00 PM) Thursday – Sunday, Weather Permitting Please view the Tiki Bar Menu below: Starters |$13 Caprese Dip Whipped Mozzarella, Balsamic Roasted Tomatoes, Pesto, Grilled Bread, Crudité | $14 Tiki Quesadilla Shredded Colby Jack, Pico de Gallo, Black Beans, Side of Salsa and Sour Cream **add spiced beef, grilled chicken or shrimp $7** French Bread Pizza | Hand Crushed Tomato Sauce, Fresh Mozzarella, Baguette, Pepperoni $16 | $14 Loaded Nachos Queso, Black Beans, Pico de Gallo, Sour Cream, Guacamole, Pickled Jalapeños **add spiced beef, grilled chicken or shrimp $7** Mains Mahi Tacos $16 Kettle Chips Warm Flour Tortillas, Shredded Lettuce, Pico de Gallo, Cilantro Crema , *Classic Cobb Salad $18 Mixed Greens, Grilled Chicken, Sharp Cheddar, Smoked Bacon, Tomato, Charred Sweet Corn, Hard Boiled Egg, Avocado, Buttermilk Ranch *Mediterranean Power Bowl $17 Grilled Shrimp, Orzo, Baby Spinach, Feta, Roasted Peppers, Chickpeas, Cucumbers, Tomatoes, Lemon Vinaigrette Harbor Burger $19 ½ lb Prime Beef Patty, Smoked Gouda, LTOP, Comeback Sauce, Brioche Bun, Kettle Chips **add bacon $2** *Grilled Chicken Wrap $16 Green Goddess, Bacon, Cheddar, Lettuce, Tomato, Kettle Chips The Beach Club $18 Roast Beef, Turkey, Bacon, Lettuce, Tomato, Swiss, Toasted Sourdough, Honey Mustard, Kettle Chips Cocktails, Daiquiris and Beers Botanical Spritzers Ketel One Botanical + Soda & Citrus | cucumber & mint / grapefruit & rose / peach & orange blossom $12 Frozen Cocktails Caribbean Colada | captain morgan white rum, pina colada, mango $15 Mud Slide | smirnoff vanilla vodka, kahlua chocolate sauce, ice cream $16 Daiquiri |strawberry, pina colada, peach, mango or banana made with captain morgan white rum $15 Frosé All Day | rosé wine, strawberry puree, smirnoff berry vodka $15 Tiki Drinks Dark & Stormy | Gosling’s Black Seal Rum, Ginger Beer, Lime $12 Salty Dog | Ketel One Vodka, Grapefruit Juice, Prosecco, Salt Rim $15 Beach Club Beach Comber | Captain Morgan White & Coconut Rum, Dry Curacao, Pineapple, Orange Juice $14 Lone Ranger | Don Julio Blanco, Lime Juice, Agave Syrup, Sparkling Rose $15 Rum Runner | Captain Morgan White Rum, Banana and Blackberry Liquor Sweet & Sour, Grenadine $14 Beer Domestic Beer $7 Imported Beer $8 Local Beer $8 Seasonal Rotating Draft $9 **Please ask staff for our Wine Selections** Kids Plates add Bacon - $2 Cheeseburger $12 Mini Hot Dogs $12 Choice of Chicken or Spiced Beef Tacos $12 Choice of Chicken or Spiced Beef or Black Bean Quesadilla $12 Sweet Treats Sweets Homemade Mini Oreo Cheesecakes 2/$8 4/$15 Link to Private Dining & Events Private Dining & Events at Charleston Harbor Fish House Charleston waterways are the perfect backdrop for any special event. Host a birthday, corporate event, anniversary, or other special occasion in our Mount Pleasant restaurant and treat your guests to a delicious meal, tasty cocktails, and stunning views. We have four distinct areas available for private parties of up to 150 guests. Contact our Group Sales Coordinator at or for more details. (843) 284-7026 sales@charlestonharborresort.com *Consuming raw or undercooked meats, poultry, seafood, shellfish or eggs may increase your risk of foodborne illness, especially if you have certain medical conditions. Notice: For your convenience, a 19% gratuity will be added to parties of 6 or more. To expedite service, no separate checks for parties of 6 or more. Choose Your Stay Link for CTA-Item1 The Beach Club Check Availability Link for CTA-Item2 Harborside Check Availability",
      "hash": "f274a13bb6b0",
      "downloadedAt": "2026-01-18T16:55:50.702Z",
      "trimmedAt": "2026-01-18T17:13:05.818Z",
      "sizeReduction": "90.1%"
    }
  ],
  "sizeReduction": "93.2%"
}