{
  "venueId": "ChIJNyK8oT98_ogRdrVjyLDLcgs",
  "venueName": "Hachiya Japanese Steakhouse and Sushi Bar",
  "venueArea": "West Ashley",
  "website": "http://hachiyakyoto.com/",
  "scrapedAt": "2026-01-18T17:04:25.669Z",
  "trimmedAt": "2026-01-18T17:07:14.383Z",
  "pages": [
    {
      "url": "http://hachiyakyoto.com/menus",
      "text": "Skip to content Charleston Menu Early Bird: 4 pm - 5 pm *Dine-In Only (Tuesday - Sunday) View Menu Scroll To Top",
      "hash": "0fce05a4952c",
      "downloadedAt": "2026-01-18T17:02:27.951Z",
      "trimmedAt": "2026-01-18T17:07:14.231Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "http://hachiyakyoto.com/hibachi",
      "text": "Skip to content APPETIZERS EARLY BIRD SPECIALS ENTRÉES ENTRÉE COMPLIMENTS KIDS MENU \"We take pride in every dish we put out and are devoted to delivering the best dining experience possible to each of our diners.\" EARLY BIRD HOURS 4 pm to 5 pm *Dine In Only *Everyone needs to be seated before the early bird end time to qualify* Reservations (at least One Hour in Advance) APPETIZERS — Vegetable Spring Roll — A Blend of Mixed Vegetables with a Hint of Seasoning, Wrapped in a Flaky & Crispy Wrap Served with a Sweet and Savory Sauce - $7.50 — Beginner Sushi — 1 Piece of Shrimp, 1 Piece of Crab, & 4 Pieces of California Roll - $8.00 — California Roll — Kani Kama, Avocado, & Sesame Mayonnaise - $7.95 — Chicken Kushi Katsu — Breaded and Deep Fried Chicken in Skewers Served with a Sweet and Tangy Japanese Sauce - $10.00 — Shrimp Tempura — Battered-Dipped & Deep-Fried Shrimp and Vegetables Served with Our Special Tempura Dipping Sauce - $11.00 — *Spicy Tuna Roll — Fresh Tuna & Hachiya Hotsauce - $7.95 — Karrage — Marinated Japanese Style Fried Chicken that is Drizzled with our Special Sauce - $8.00 — Edamame — Steamed to Order and Tossed in Salt - $6.00 — Gyoza — Steamed and pan fried to a crisp bottom filled with pork, onion & cabbage. Served with gyoza and Yuzu sauce Small (5 pcs) - $7.00 Large (8 pcs) - $9.00 EARLY BIRD SPECIALS FILET MIGNON SPECIAL — Filet Mignon Dinner — 5 oz of the most tender cut of steak - $26.00 ADD ONS (only with Early Bird Filet Mignon Special) Teriyaki Chicken +6.50Hibachi Chicken +7.00Hibachi Shrimp +7.50Appetizer Shrimp +8.50 MORE SPECIALS — Teriyaki Chicken — 8 oz of Chicken cooked with our special Hachiya Teriyaki - $21.00 — Hibachi Chicken — 8 oz of Chicken Breast Cooked with soy sauce and lemon - $22.00 — *Ribeye Steak & Shrimp — 5 oz of Ribeye Steak & 5 oz Hibachi Shrimp - $28.00 — *Ribeye Steak & Teriyaki Chicken** — 5 oz of Ribeye Steak & 6 oz of Chicken - $27.50 — Teriyaki Chicken & Shrimp — 6 oz of Chicken & 5 oz Hibachi Shrimp - $24.00 *No Sharing on Early Bird Specials. ALL WHITE-MEAT CHICKEN AVAILABLE UPON REQUEST FOR +2.00 DINNER () all dinners served with onion soup, house salad, hibachi appetizer shrimp, fried rice, zucchini and onions HOUSE SPECIALS — *Hachiya Dinner** — 6 oz of Ribeye Steak, 5 oz of Shrimp, & 6 oz Teriyaki Chicken - $39.00 — *Kyoto Dinner — 5 oz of Filet Mignon, 5 oz of Shrimp, & 6oz Teriyaki Chicken - $40.00 — Shrimp & Teriyaki Chicken** — 5 oz of Shrimp & 6 oz of Teriyaki Chicken - $33.00 ENTRÉES — Vegetable Dinner — A Large Assortment of Vegetables Including Mushrooms, Onions, Peppers, Carrots, & Broccoli Grilled to Perfection - $21.00 — Teriyaki Chicken Dinner** — 8 oz of Chicken Prepared with Onions, Peppers, with Hachiya Special Teriyaki Sauce - $27.00 — Hibachi Shrimp — 18 oz of Hibachi Shrimp - $30.00 — *Ribeye Steak — A Tempting 8 oz Full Flavored Ribeye Steak with a Generous Marbling Cooked to Your Liking - $38.00 — *Filet Mignon — Mouth Watering 8 oz of the Most Tender of Steaks Filet Mignon - $39.00 — Hibachi Chicken — White Meat Chicken Cooked with Soy Sauce and Lemon - $29.00 COMBINATION DINNERS — *Ribeye Steak & Shrimp — 6 oz of Ribeye Steak & 5 oz of Shrimp - $36.00 — Shrimp & Scallops — 5 oz of Shrimp & 6 oz of Scallops - $38.00 — Teriyaki Chicken & Shrimp — 6 oz of Chicken & 5 oz Hibachi Shrimp - $33.00 — *Steak & Scallops — 6 oz of Ribeye Steak & 6 oz of Scallops - $41.00 — *Ribeye Steak & Teriyaki Chicken — 6 oz of Ribeye Steak & 6 oz of Chicken - $36.00 — *Ribeye Steak & Fish — 6 oz of Ribeye Steak & 8 oz of Fish - $35.00 — *Filet Mignon & Shrimp — 5 oz of Filet Mignon & 5oz Shrimp - $38.00 — *Filet Mignon & Jumbo Shrimp — 5 oz of Filet Mignon & 4 pc Jumbo Shrimp - $43.00 — *Filet Mignon & Teriyaki Chicken** — 5 oz of Filet Mignon & 6 oz of Teriyaki Chicken - $37.00 — *Filet Mignon & 8 oz Lobster — 5 oz of Filet Mignon & 8 oz Lobster - $49.00 — *Shogun Dinner — 5 oz of Filet Mignon, 4 pc Jumbo Shrimp & 6 oz of Teriyaki Chicken - $49.00 — *Seafood Dinner — 8 oz of Lobster, 4 pc Jumbo Shrimp & 6 oz of Scallop - $54.00 — Fish & Scallops — 8 oz of Fish, 6oz scallops - $39.00 **ALL WHITE-MEAT CHICKEN AVAILABLE UPON REQUEST FOR ADDITIONAL $2.00 UPGRADE YOUR SHRIMP TO 8 PIECE APPETIZER SHRIMP FOR AN ADDITIONAL $2.00 All dinners include our homemade Japanese onion soup, house salad, hibachi appetizers shrimp, zucchini and onions. Eachdinner is prepared at your Teppanyaki table in the finest Japanese tradition by our specially trained chefs. Entrée Compliments (served with s only) entrée — Teriyaki Chicken (6 oz) — +$7.50 — Lobster (8 oz) — +$25.00 — Jumbo Shrimp (4 pc) — +$12.00 — Hibachi Chicken (6 oz) — +$8.00 — Hibachi Shrimp (5 oz) — +$8.50 — Fried Rice — +$5.00 — Fish (8 oz) — +$10.00 — Appetizer Shrimp (8pc) — +$9.50 — Hibachi Scallop (6 oz) — +$13.00 — Zucchini & Onion — +$5.00 CHILDREN'S MENU For children 8 and under — Teriyaki Chicken — 6 oz of Chicken - $15.00 — Hibachi Chicken — 5 oz of White Meat Chicken with Soy Sauce and Lemon - $17.00 — Hibachi Shrimp— 5 oz of Shrimp - $19.00 — Chicken Kushi Katsu — Breaded & Deep Fried Chicken in Skewers Chicken Served with a Sweet and Tangy Japanese Sauce - $14.00 — Hibachi Ribeye — 6 oz of Ribeye Steak (upgrade to 5 oz of Filet Mignon for an additional $3.00) - $21.00 — Filet Mignon — 5 oz of Filet Mignon - 24.00 $5 SHARE CHARGE FOR 8 & UNDERPLEASE LIMIT ONE PER SHARE SEAFOOD WARNING: *If you have an allergy to seafood, you should not eat any of the foods prepared in this restaurant. We cannot guarantee that our food will be free from all traces of seafood. ADVISORY: Before placing your order please inform your server if anyone in your party has any food allergies. *The consumption of raw or undercooked foods such as meat, poultry, fish, shellfish, or eggs which may contain harmful bacteria, may cause serious illness. 18 years & under: Steak must be cooked to 155oF or more in the middle. Celebration (Let us help you celebrate birthdays, anniversaries, and otherspecial occasions with our celebrations package.) — Birthday Package — SONG | CUPCAKE | PICTURE $5.00 SUBSCRIBE to our email list! For special offers, promotions and happenings. Email Address Please enter a valid email address. Please check the captcha to verify you are not a robot. Subscribe! Thanks for subscribing! Please check your email for further instructions. Something went wrong. Please check your entries and try again. Scroll To Top",
      "hash": "1a256c09c099",
      "downloadedAt": "2026-01-18T17:02:30.457Z",
      "trimmedAt": "2026-01-18T17:07:14.296Z",
      "sizeReduction": "96.7%"
    },
    {
      "url": "http://hachiyakyoto.com/sushi",
      "text": "Skip to content APPETIZERS SOUP AND SALAD SIGNATURE ROLLS SUSHI/SASHIMI COMBOS DONBURI (BOWL) \"We take pride in every dish we put out and are devoted to delivering the best dining experience possible to each of our diners.\" HOURS 4 pm - 9 pm Reservations (at least One Hour in Advance) APPETIZERS — Edamame* — Steamed to order and tossed in salt - $6.00 — Beef Negamaki* — Thinly sliced ribeye wrapped around scallions and sautéed in teriyaki sauce - $14.00 — Beef Tataki* — Seared filet mignon, sliced thinly with a house made ponzu sauce - $15.95 — Tuna Carpaccio* — Sliced tuna served with our special carpaccio sauce - $15.95 — Salmon Carpaccio* — Sliced salmon served with our special carpaccio sauce - $15 .95 — Shrimp Tempura* — Battered dipped and deep fried shrimp and vegetables - $11.00 — All Shrimp Tempura* — Six pieces of battered dipped and deep fried shrimp - $12.00 — Baked Mussels* — Fresh green mussels baked with sliced onions in a special mayo sauce - $9.00 — Karaage* — Marinated Japanese Style Fried Chicken that is Drizzled with our Special Sauce - $8.00 — Chicken Kushi Katsu* — Chicken breaded in panko and deep fried in skewers served with a sweet and tangy Japanese sauce - $10.00 — Spicy Tuna Sashimi* — Pieces of tuna mixed with sesame oil and Japanese red pepper - $10.95 — Wasabi Dumpling — Steamed spicy wasabi pork dumplings served with wasabi and ponzu - $9.00 — Seafood Dynamite* — Chopped shrimp, crab, scallops, and sliced onions baked in a special mayo sauce topped with smelt eggs - $11.00 — Sushi Tostado* — Deep fried sushi rice and seaweed, topped with fresh chopped tuna, shrimp, tomatoes, and onions mixed with a special hot sauce, with thin slices of jalapeno on top -Spicy - $11.00 — Yellowtail Jaw* — Fresh yellow tail jaw seasoned with just simply salt and baked to perfection - $13.00 — Fresh Spring Roll* — Cucumber, fresh leafy greens, salmon, tuna, and crab wrapped in a rice paper topped with our carpaccio sauce - $12.95 — Fried Spring Roll — 6 pieces of deep fried vegetable spring roll - $8.00 — Tuna Tataki* — Seared and sliced red tuna served on an organic salad topped with house made ponzu sauce - $15.95 — Tuna Tartare* — Marinated tuna topped with quail egg with slices of toasted garlic bread - $12.50 — Mix Sunomono* — 3pc octopus, 2pc surf clam, 2 piece of mackerel, one each of conch, shrimp, and crab on a seaweed and sliced cucumber in a sweet vinegar sauce - $10.95 — Tako Sunomono* — Slices of steamed octopus over sliced cucumber and wakame seaweed with a sweet vinegar sauce - $10.95 — Ika Geso — Deep fried squid legs served with our original white sauce - $10.00 — Shrimp Dumpling — Shrimp dumplings served with a ponzu sauce - $9.00 — Vegetable Tempura — Battered dipped and deep fried mixed vegetables - $10.00 — Soft Shell Crab — Deep fried and served with our homemade ponzu sauce - $17.00 SOUP AND SALAD — Avocado Salad* — A bed of organic arcadian harvest salad with avocado and a choice of tuna or shrimp, topped with a creamy wasabi dressing - $13.95 — Grilled Tuna Salad* — A bed of organic arcadian harvest salad with with sliced seared tuna and avocado with soy dressing and sesame mayo sauce - $13.95 SALAD — House Salad — $4.00 — Seaweed Salad — $7.95 — Squid Salad — $8.25 SOUP — Miso Soup — $4.00 — Clear Soup — $4.00 SIGNATURE ROLLS — California Roll (8 pc) — Crab, avocado and mayo$7.95 — California Sunrise (8 pc)* — California roll topped with tuna in spicy mayo sauce$11.95 — Crunch Crab Roll (8 pc) — Crab, spicy mayo topped with tempura flakes$8.50 — Crunch Roll (8 pc)* — Shrimp tempura, mayo and smelt eggs outside$8.95 — Cucumber Roll (8 pc) — Cucumber and sesame seeds$4.95 — Dragon Roll (8 pc) — California Roll with cream cheese topped with eel$12.95 — Dynamite California Roll (8 pc) — California Roll baked with crab and special mayo on top$11.50 — Eel Roll (8 pc) — Eel and cucumber$10.95 — Golden Dragon Roll (8 pc)* — Shrimp tempura, topped with eel, smelt eggs and avocado$13.95 — Kamikaze Roll (8 pc)* — Fresh salmon and avocado rolled in soy paper and deep fried, served with special sauce and scallions$9.95 — Kentucky Roll (8 pc) — Deep fried chicken, mayo and lettuce, served with sweet chili sauce$8.95 — King Roll (10 pc) — Egg custard, crab, cucumber, sweet squash and sweet fish flakes$13.95 — Lobster Crunch Roll (12 pc)* — Deep fried 8 oz lobster tail with smelt eggs outside$23.50 — London Roll (8 pc)* — Fresh tuna, avocado and more fresh tuna on top$12.95 — Marbled Roll (8 pc)* — Eel and cucumber with fresh tuna and fresh salmon on top, served with garden and seaweed salad$13.95 — Mexican Roll (8 pc)* — Tuna, avocado, tempura flakes with spicy mayo sauce$9.95 — Philly Roll (8 pc)* — Smoked salmon, cucumber, cream cheese and smelt eggs$9.95 — Rainbow Roll (8 pc)* — California Roll topped with tuna, whitefish, yellowtail, fresh and smoked salmon and avocado$13.95 — Salad Roll (no rice) (5 pc) — Crab and avocado rolled in cucumber, served with mayo$8.95 — Spicy Tuna Roll (6 pc)* — Fresh tuna and hot sauce$7.95 — Salmon Roll (8 pc) — Fresh salmon$7.95 — Garden Roll (6 pc) — Tomato, avocado, spinach, cucumber and cream cheese$8.95 — Vegetable Roll (8 pc) — Avocado, tomato, cucumber, spinach $7.95 — Spider Roll (6 pc) — Deep fried soft-shell crab and cucumber, topped with eel sauce$15.95 — Surf n' Turf Roll ( 8 pc)* — Shrimp tempura, topped with seared beef and served with sweet ponzu, hot sauce and wasabi mayo$15.95 — Surf & Turf Roll ( 8 pc)* — Shrimp tempura, topped with seared beef and served with sweet ponzu, hot sauce and wasabi mayo$15.95 — TNT Roll (no rice) (5 pc)* — Tuna, crab and cream cheese in soy wrap, deep fried, served with ponzu and hot sauce$9.95 — Tuna Roll (6 pc)* — Fresh tuna$7.95 — Tuna Tar Tare Roll (8 pc)* — California Roll, topped with marinated tuna$11.95 — Volcano Roll (8 pc) — California roll in soy wrap, baked withcrab, shrimp and spicy mayo$12.95 COMBINATIONS All combinations are served with a choice of two sides: Miso soup • Clear soup • House salad (Ginger or Ranch) • Steamed rice — Sushi Deluxe* — 2 pieces of tuna, one piece of fresh salmon, yellowtail, whitefish, shrimp, eel, salmon egg, and 8 pieces of California roll$29.95 — Sashimi Deluxe* — 3 pieces of tuna, fresh salmon, yellowtail, whitefish, octopus, and one piece of shrimp and crab$34.00 — Tuna Tartare Don* — Chopped tuna over rice$15.95 — Eel Bowl* — Eight pieces of eel over a bowl of sushi rice$29.95 — Chirashi* — Three pieces of tuna, one piece of yellowtail, fresh salmon, white fish, shrimp, eel, salmon egg, crab, and egg custard over a bowl of sushi rice$29.95 Scroll To Top",
      "hash": "f2948eaa979f",
      "downloadedAt": "2026-01-18T17:02:32.950Z",
      "trimmedAt": "2026-01-18T17:07:14.358Z",
      "sizeReduction": "96.5%"
    },
    {
      "url": "http://hachiyakyoto.com/",
      "text": "Skip to content STEAKHOUSE & SUSHI BAR Sharing traditional Japanese hibachi-style cooking with the low country for over 30 years. *Limited Capacity - Reservations Highly Recommended *No outside food or drinks permitted* Charleston OPEN Tuesday - Sunday 4-9PM Curbside Pickup, Dine-In ORDER ONLINE Our Story We opened our family-owned restaurant with the intention of sharing traditional Japanese hibachi-style cooking with the low country and it was one of the first of its kind. Learn More Over our 30 years in business we have changed our name, moved and expanded but our dedication to traditional cooking techniques and serving the freshest ingredients available has remained the same. Our Story 1988 Kyoto Japanese Steakhouse 1998 Miyabi Kyoto Japanese Steakhouse 2019 Hachiya Kyoto Japanese Steakhouse HIBACHI Our main dining room features state of the art smokeless hibachi tables each accommodating parties as large as ten. View Menu SUSHI Our seafood is sourced from suppliers who purchase directly from the highest quality of sashimi-grade seafood. View Menu Our Hours Tuesday - Sunday: 4 pm - 9 pm Curbside Pickup, Dine-In Tues-Sun: 4 pm to 5 pm Early Bird Hours *Dine In Only *Everyone needs to be seated before the early bird end time to qualify* *Limited Capacity - Reservations Highly Recommended* Reservations (at least One Hour in Advance) View Full Gallery SUBSCRIBE to our email list! For special offers, promotions and happenings. Email Address Please enter a valid email address. Please check the captcha to verify you are not a robot. Subscribe! Thanks for subscribing! Please check your email for further instructions. Something went wrong. Please check your entries and try again. Scroll To Top",
      "hash": "fa75d7e8e667",
      "downloadedAt": "2026-01-18T17:02:26.129Z",
      "trimmedAt": "2026-01-18T17:07:14.383Z",
      "sizeReduction": "98.9%"
    }
  ],
  "sizeReduction": "97.8%"
}