{
  "venueId": "ChIJ3RxP8hR6_ogRsj-Yrk2CGUo",
  "venueName": "Charleston Jazz Initiative",
  "venueArea": "Downtown Charleston",
  "website": "http://charlestonjazz.net/",
  "scrapedAt": "2026-01-19T02:19:30.953Z",
  "trimmedAt": "2026-01-19T02:19:59.444Z",
  "pages": [
    {
      "url": "http://charlestonjazz.net/events/",
      "text": "[Page Title: Events – The Charleston Jazz Initiative]\n\nHome About Musicians Collections Events News Events Shop Contact \nCJI EVENTS\n\nOver the years, the Charleston Jazz Initiative has produced a variety of events including concerts, symposia and conferences. Use the archives to the left to explore our past events.  Current events are listed below.\nRhythm Is My Beat by Alfred Green, August 27-29, 2015 \nThe Charleston Jazz Initiative (CJI), a project of the College of Charleston’s (C of C) School of the Arts, Arts Management Program, in partnership with the Jazz Studies Program, Department of Music, Avery Research Center for African American History and Culture, and other sponsors, announce a series of events, August 27-29, 2015 to kick off [...]\nlearn more » Jack Arthur McCray, 1947-2011 \nWith a tendency toward self-effacement, McCray was an untiring advocate of jazz and helped create a “scene” in which local musicians could thrive. In recent years, he played a key role in establishing the Charleston Jazz Initiative, in partnership with College of Charleston arts management professor Karen Chandler.\nlearn more » Charleston Jazz Initiative Legends Band – CD Release \nLegends, CJI’s first recording, features music from the early 20th century to 2010 that documents Charleston’s influence in the jazz performance traditions of many of this country’s big bandleaders, sidemen, and soloists. It marks the first CD recording of tunes composed, arranged or performed by musicians of  Charleston and South Carolina’s rich jazz legacy.\nIn June [...]\nlearn more » \nfor additional archived events, use the menu on the upper left side of this page\nPAST EVENTS 2015 2011 2010 2009 2008 2007 2006 2005 2004 2003 \nConnect with us:\n\n| | | | | | | |       \n\nCharleston Jazz Initiative\nc/o Arts Management Program\nSchool of the Arts, College of Charleston\n66 George Street, Charleston, SC 29424\n843-953-5474 (phone)\n843-953-7068 (fax)\nHOME ABOUT MUSICIANS COLLECTION EVENTS NEWS PROJECTS SHOP CONTACT all images © CJI /CofC unless noted email »",
      "hash": "0a6f533fbe2b",
      "downloadedAt": "2026-01-19T02:06:50.361Z",
      "trimmedAt": "2026-01-19T02:19:59.437Z",
      "sizeReduction": "82.4%"
    },
    {
      "url": "http://charlestonjazz.net/projects/",
      "text": "[Page Title: Projects – The Charleston Jazz Initiative]\n\nHome About Musicians Collections Events News Events Shop Contact \nCJI PROJECTS\n\nHilton Head Island School for the Creative Arts staged an original musical titled “The Charleston.”\n\nFebruary 26, 2009\n\n180 3rd graders at the Hilton Head Island School for the Creative Arts staged an original musical titled “The Charleston.”  The musical was conceived and written by dance teacher, Patti Maurer, who was inspired to write the musical after hearing CJI’s Dr. Karen Chandler’s presentation on Charleston’s jazz legacy at the South Carolina Alliance for Arts Education Conference in September.  Mrs. Maurer consulted with Dr. Chandler over five months incorporating CJI research on the Jenkins Orphanage Bands and Charleston’s jazz history in her original musical.  Dr. Chandler was a special guest at the production and was joined by CJI’s Jack McCray and Tony Bell who documented the musical.\n\nSong of Pumpkin Brown\n\nwas produced, written, and directed by Charleston-based independent filmmaker Brad Jayne in collaboration with Osprey Production Group.  It was shot over seven days on-location in Charleston and on Edisto Island. Funded by a $100,000 grant from the South Carolina Film Office, photography on this independent short film project was completed in December 2006.  The film’s unique combination of jazz music, stunning cinematography, uniquely structured script, and powerful performances, has created a momentum within the international film community even prior to its premiere.\nSong of Pumpkin Brown \nincorporates source material and photographs from the Charleston Jazz Initiative’s (CJI) archival collection as a base for its script and cinematography.  CJI is a jazz history and research project – an academic and community partnership — with the College of Charleston’s Arts Management Program, Avery Research Center, and several Charleston-based community leaders and organizations.\nSong of Pumpkin Brown read more PAST \n(1)\n2009 \n(1)\n2007 \nConnect with us:\n\n| | | | | | | |       \n\nCharleston Jazz Initiative\nc/o Arts Management Program\nSchool of the Arts, College of Charleston\n66 George Street, Charleston, SC 29424\n843-953-5474 (phone)\n843-953-7068 (fax)\nHOME ABOUT MUSICIANS COLLECTION EVENTS NEWS PROJECTS SHOP CONTACT all images © CJI /CofC unless noted email »",
      "hash": "a2c3b92caf54",
      "downloadedAt": "2026-01-19T02:06:51.192Z",
      "trimmedAt": "2026-01-19T02:19:59.440Z",
      "sizeReduction": "77.5%"
    },
    {
      "url": "http://charlestonjazz.net/",
      "text": "[Page Title: The Charleston Jazz Initiative]\n\nHome About Musicians Collections Events News Events Shop Contact \"Look carefully at the careers of the boys and girls who were raised in the Old Marine Hospital on Franklin Street, Charleston [Jenkins Orphanage]. I am convinced you will be surprised... there is a Charleston contribution to the arts of America that traditional views on jazz, and other music, have overlooked.\" \nJeffrey Green, British historian; author of\nEdmund Thornton Jenkins:The Life and Times of An American Black Composer, 1894-1926 \nThe Charleston Jazz Initiative (CJI) is a multi-year research project that documents the African American jazz tradition in Charleston, the South Carolina Lowcountry, and its diasporic movement throughout the United States and Europe between the late 19th century through today.\nLEARN MORE \n← This video is presented courtesy of the Fox Movietone News Collection at the University of South Carolina’s Newsfilm Library. To learn more about this video, and many other historic videos, be sure to visit their website:\nsc.edu/library/newsfilm Jack Arthur McCray, 1947-2011 Learn more about the Life\nAnd Legacy of . Jack McCray EXPLORE Explore our collections // descriptions images oral histories LEARN \nLearn about our musicians\n\nOver 50 musicians are profiled with bios, images, videos and more\nmusicians home » \nConnect with us:\n\n| | | | | | | |       \n\nCharleston Jazz Initiative\nc/o Arts Management Program\nSchool of the Arts, College of Charleston\n66 George Street, Charleston, SC 29424\n843-953-5474 (phone)\n843-953-7068 (fax)\nHOME ABOUT MUSICIANS COLLECTION EVENTS NEWS PROJECTS SHOP CONTACT all images © CJI /CofC unless noted email »",
      "hash": "f500e9aa3f6f",
      "downloadedAt": "2026-01-19T02:06:49.933Z",
      "trimmedAt": "2026-01-19T02:19:59.444Z",
      "sizeReduction": "87.1%"
    }
  ],
  "sizeReduction": "82.7%"
}