{
  "venueId": "ChIJyajrMp5l_ogR6WR4RRbfMcg",
  "venueName": "Bar on the Ave",
  "venueArea": "North Charleston",
  "website": "https://www.barontheave.com/",
  "scrapedAt": "2026-01-18T17:04:32.119Z",
  "trimmedAt": "2026-01-18T17:13:06.455Z",
  "pages": [
    {
      "url": "https://www.barontheave.com/order-online",
      "text": "top of page Check out our new ordering page Ordering from this page is no longer available Go to New Ordering Page bottom of page",
      "hash": "202f863bbc26",
      "downloadedAt": "2026-01-18T16:58:13.502Z",
      "trimmedAt": "2026-01-18T17:13:06.127Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "https://www.barontheave.com/contact",
      "text": "top of page Contact Us bottom of page",
      "hash": "2c9436537cee",
      "downloadedAt": "2026-01-18T16:58:12.923Z",
      "trimmedAt": "2026-01-18T17:13:06.223Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "https://www.barontheave.com/book-online",
      "text": "top of page VIP Packages 2 Person Table Indoor 2 hr Reserve 4 Person Table Indoor 2 hr Reserve 4 Person Booth Indoor 2 hr Reserve 8 Person Section Indoor 2 hr Reserve 4 Person Outside Table 2 hr Reserve 7 Person Outdoor Cabana 2 hr Reserve Reservation Policies Parties of 7 - 8 guests MUST book a 7 or 8 Person VIP Package. All VIP Reservations require a non-refundable deposit at the time of booking which is applied towards the total cost of the package. ​ A Bar Representative will contact you on the day of your scheduled reservation for fulfillment of remaining balance. Arrivals for VIP Reservations begin at 8pm each night with all members of the party arriving by 1030pm, and expire at the time of closing of the bar [NO EXCEPTIONS] ​ Absolutely NO standing on furniture. bottom of page",
      "hash": "c46ceee83cfc",
      "downloadedAt": "2026-01-18T16:58:12.319Z",
      "trimmedAt": "2026-01-18T17:13:06.311Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "https://www.barontheave.com/services-5",
      "text": "top of page Menus On The Ave Hungry Already? Order Online bottom of page",
      "hash": "f9a509c17677",
      "downloadedAt": "2026-01-18T16:58:10.059Z",
      "trimmedAt": "2026-01-18T17:13:06.356Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "https://www.barontheave.com/",
      "text": "top of page BAR On The Ave Discover the epitome of vibe dining at Bar on the Ave, the premier lounge that raises the bar for nightlife experiences. ORDER ONLINE PREMIUM COCKTAILS & HOOHAK COME FOR THE EXPERIENCE, STAY FOR THE VIBE The Ultimate Dining and Experience - Indoors and Outdoors ORDER ONLINE VIP RESERVATIONS Indulge in the ultimate outdoor relaxation with BAR's Cabana and service. Unwind in style and enjoy the fresh air. RESERVE A CABANA bottom of page",
      "hash": "fe7e5a96a317",
      "downloadedAt": "2026-01-18T16:58:09.908Z",
      "trimmedAt": "2026-01-18T17:13:06.455Z",
      "sizeReduction": "100.0%"
    }
  ],
  "sizeReduction": "100.0%"
}