{
  "venueId": "ChIJy2kwCWh6_ogR4z08DDetfQk",
  "venueName": "The Commodore",
  "venueArea": "North Charleston",
  "website": "http://thecommodorechs.com/?utm_source=GMBlisting&utm_medium=organic",
  "scrapedAt": "2026-01-18T17:04:32.096Z",
  "trimmedAt": "2026-01-18T17:13:05.843Z",
  "pages": [
    {
      "url": "http://thecommodorechs.com/?utm_source=GMBlisting&utm_medium=organic",
      "text": "Eastside Music Club Welcome to The Commodore The Commodore is a vintage jazz club, started in the early 80's as a “Touch of Class.” A staple in the jazz circuit as indicated by the classic photos on the wall, the club still hosts jazz and funk acts from across the country. Today, The Commodore has reincarnated the space to be one of Charleston’s true gems with an unparalleled live music and bar scene. Locals and visitors alike enjoy an equally throwback and modern atmosphere with patrons from every walk of life. We welcome you to drop in, and continue the tradition enjoying live music, the fantastic dance floor, and delicious craft cocktails. Read More Live Music The Commodore offers LIVE MUSIC up to 5 nights a week featuring house bands such as Lady & The Brass, The Majestics, The Funktastics and Future Funk. Excellent local and regional acts are continually scheduled. Check our calendar for dates and times. View Schedule Get Social With Us Connect with us online. 504 Meeting StreetCharleston, SC 29403 Sunday - Wednesday7:30pm - 1am Thursday - Saturday7:30pm - 2am Ages 23 & Up Good Vibes Only",
      "hash": "1c8805d6f6a8",
      "downloadedAt": "2026-01-18T17:01:37.789Z",
      "trimmedAt": "2026-01-18T17:13:05.840Z",
      "sizeReduction": "94.0%"
    },
    {
      "url": "http://thecommodorechs.com/bar.php",
      "text": "Eastside Music Club Drinks at The Commodore View Drink Menu Get Social With Us Connect with us online. 504 Meeting StreetCharleston, SC 29403 Sunday - Wednesday7:30pm - 1am Thursday - Saturday7:30pm - 2am Ages 23 & Up Good Vibes Only",
      "hash": "bf229a5c18cd",
      "downloadedAt": "2026-01-18T17:01:37.953Z",
      "trimmedAt": "2026-01-18T17:13:05.843Z",
      "sizeReduction": "98.8%"
    }
  ],
  "sizeReduction": "96.4%"
}