{
  "venueId": "ChIJs43LHhd5_ogROL4AEoUoAOY",
  "venueName": "Cottages At James Island County Park",
  "venueArea": "West Ashley",
  "website": "http://ccprc.com/1435/The-Cottages",
  "scrapedAt": "2026-01-18T17:04:31.440Z",
  "trimmedAt": "2026-01-18T17:12:49.421Z",
  "pages": [
    {
      "url": "http://ccprc.com/1810/Festivals-Events",
      "text": "Skip to Main Content Home Festivals & Events Festivals & Events Slip on your favorite dancing shoes and get ready for fun! Treat your taste buds, celebrate your heritage, and make the most of your weekends. From magical starry nights at summer reggae concerts to lively bluegrass jams, crawfish-eating contests, family camping trips, and scenic 5K trail runs, there’s something for everyone. With a year packed full of festivals and events in your county parks, the possibilities for fun are endless. Come out and explore all the ways you can live life to the fullest! Sat, Jan 24 Fairy House Day Sat, Feb 7 Save the Light Half Marathon & 5K Run/Walk Sat, Feb 21 Senior Sneaker Dance Sat, Feb 28 Senior Sneaker Dance Sat, Mar 7 Where the Wild Things Run Sun, Mar 8 Palmetto Park Jam Thu, Mar 12 Toast Under the Oaks Sat, Mar 14 - Sun, Mar 15 Family Camp Jam Sat, Mar 21 Birds of a Feather Thu, Apr 2 Toast Under the Oaks Mon, Apr 13 Golf Tournament Fundraiser Sat, Apr 18 Lowcountry Cajun Festival Fri, Apr 24 Dancing on the Cooper Wed, Apr 29 Yappy Hour Fri, May 1 Moonlight Mixer Fri, May 15 Dancing on the Cooper Fri, Jun 5 Moonlight Mixer Fri, Jun 12 Dancing on the Cooper Thu, Jun 18 Yoga Fest Fri, Jul 24 Dancing on the Cooper Fri, Jul 31 Moonlight Mixer Fri, Aug 21 Moonlight Mixer Fri, Sep 11 Dancing on the Cooper Fri, Sep 18 Moonlight Mixer Sat, Sep 26 Birds of a Feather Sun, Oct 4 Latin American Festival Sat, Nov 7 Harvest Festival View All Upcoming Events /Calendar.aspx We reserve the right to use photos or videos taken of visitors at our facilities or during our events and programs for publicity purposes. Always lock your vehicles and remove valuables from view, we are not responsible for lost, damaged or stolen property. Fees and hours are subject to change. Government Websites by CivicPlus® Loading Loading Do Not Show Again Close []",
      "hash": "324c25ae1e3a",
      "downloadedAt": "2026-01-18T17:02:15.433Z",
      "trimmedAt": "2026-01-18T17:12:49.399Z",
      "sizeReduction": "98.7%"
    },
    {
      "url": "http://ccprc.com/1435/The-Cottages",
      "text": "Skip to Main Content 871 Riverland Dr.Charleston, SC 29412 843-795-4386 Email Directions Make Your Reservation Now Rules & Regulations Cottages Photo Gallery Home Our Parks Camping & Lodging The Cottages The Cottages at James Island County Park Enjoy the natural beauty of James Island County Park, with year-round fun for the entire family. Just a short drive from downtown Charleston, the 643-acre park offers an abundance of exceptional recreation offerings and natural beauty. Check availability and make reservations now... Rates & Reservations Cottage Features Park Amenities Cottage Rates There is a two-night minimum stay any other time. There is a six-night minimum stay between Memorial Day and Labor Day, Tuesday to Monday. Standard Rate $219 Sunday-Thursday $269 Friday & Saturday During Holiday Festival of Lights is held two Fridays before Thanksgiving - December 31. Holiday Festival of Lights $229 Sunday-Thursday $279 Friday & Saturday Add 14% Accommodations Tax to all rates. Add $5 non-refundable transaction/reservation fee. Limit of eight people per cottage overnight, no more than 15 people allowed. Cottage Reservations or call 843-795-4386. Reservations cannot be made through email. Reservations are recommended and may be made up to one year prior to your arrival date. Full payment is due at the time the reservation is made. For more information, . Make your reservation online view all cottage guidelines Cancellations Cancellations made 15 or more days in advance will incur a one-night cancellation fee. Cancellations made 14 or less days in advance will incur a 50% cancellation fee. Can I view photos of the camp sites? What does full hook-up include? Is cable available in the campground or cottages? Are golf carts allowed in the park? How late can I check-in? View All /FAQ.aspx We reserve the right to use photos or videos taken of visitors at our facilities or during our events and programs for publicity purposes. Always lock your vehicles and remove valuables from view, we are not responsible for lost, damaged or stolen property. Fees and hours are subject to change. Government Websites by CivicPlus® Loading Loading Do Not Show Again Close []",
      "hash": "32a3ad33cd82",
      "downloadedAt": "2026-01-18T17:02:14.592Z",
      "trimmedAt": "2026-01-18T17:12:49.421Z",
      "sizeReduction": "98.2%"
    }
  ],
  "sizeReduction": "98.5%"
}