{
  "venueId": "ChIJZzeCNgx6_ogR7paG1YgifmU",
  "venueName": "The Brick",
  "venueArea": "Mount Pleasant",
  "website": "https://thebrickcharleston.com/",
  "scrapedAt": "2026-01-18T17:04:28.014Z",
  "trimmedAt": "2026-01-18T17:11:14.083Z",
  "pages": [
    {
      "url": "https://thebrickcharleston.com/charleston-the-brick-events",
      "text": "Events $5 Happy Hour Monday January 19th Every Weekday (Mon - Fri) Clock out and enjoy the best deal of the week. Every Monday through Friday from 4–7 p.m., grab $5 select drinks and bar snacks like Fried Pickles, Mac ‘n Cheese Bites, and Loaded Fries. It’s the easiest win of the day. 04:00 PM - 07:00 PM Tacos. Tequila. Tuesday. Tuesday January 20th Every Tuesday Tuesdays aren’t so bad when they come with $3 tacos and $5 Cazadores tequila. You know what to do. 04:00 PM - 10:00 PM",
      "hash": "16f5f41bc285",
      "downloadedAt": "2026-01-18T16:57:26.666Z",
      "trimmedAt": "2026-01-18T17:11:14.055Z",
      "sizeReduction": "99.3%"
    },
    {
      "url": "https://thebrickcharleston.com/charleston-the-brick-happy-hours-specials",
      "text": "Specials Tuesday January 20th Happy Hour 04:00 PM - 07:00 PM Wednesday January 21st Happy Hour 04:00 PM - 07:00 PM Thursday January 22nd Happy Hour 04:00 PM - 07:00 PM Friday January 23rd Happy Hour 04:00 PM - 07:00 PM",
      "hash": "46f73a6ac6a0",
      "downloadedAt": "2026-01-18T16:57:27.260Z",
      "trimmedAt": "2026-01-18T17:11:14.058Z",
      "sizeReduction": "99.7%"
    },
    {
      "url": "https://thebrickcharleston.com/",
      "text": "× Let us host your special event! Whether a birthday party, office function or any other special occasion - we take care of all the fine details, bringing your event to life, just as you imagined. Host your next party or get together Book your party × Did you know we do catering? Whatever your occasion, however big or small, we have the perfect options to choose from. Cater your birthday party, holiday party, corporate events, wedding festivities and more! Catering Packages 24 Ann St Suite A, Charleston, SC 29403 map marker pin View 24 Ann St Suite A, Charleston, SC 29403 on Google maps - opens in a new tab order & enjoy good food done right Whether you're short on time or just prefer convenience, online ordering is a great way to get your food from our restaurant. It's quick and easy, and your order will be ready for pick-up or delivery in no time. To Go Order Delivery Order Groups & Parties celebrate with us Impress guests with our exceptional dining experience. From customized menus to table settings, we'll handle all the details so you can focus on enjoying the occasion. Parties Charleston's Favorite Tavern welcome to the brick, enjoy yourself! all specials To Go Order Delivery Order book a party Gift Cards Dot slide navigation number 1 slideshow start stop playing diverse menu something for everyone Fresh ingredients and expert preparation come together in our delicious menu options. Discover new flavors and satisfying bites at The Brick. Come see for yourself why we're known for our exceptional cuisine view menu Turkey Avocado Wrap, with BLT, onion, sriracha mayo, and a side of... Chef Salad, with lettuce, ham, turkey, cheddar, cucumber, tomato, and... Soft pretzels, with brick cheese, and mustard Shrimp Po’ Boy and fries Fried Green Tomatoes, with dipping sauce Assorted beer taps Caesar Salad, with romaine, parmesan, croutons, and Caesar dressing Chef Salad Cheeseburger Egg Rolls, with dipping sauce Burger with pimento cheese, bacon, fried green tomato, and fries A glass of beer Crowded dining area Shredded Wedge Salad, top view Loaded Fries what people say Review by - Google Nathan P: Great spot for lunch, good food and drinks, Low Country Burger was awesome!!! Review by - Google Susan P: This was the best restaurant we went to during our time in Charleston. Went on Thursday evening for drinks and then took food back to the hotel... Review by - Google Kaitlyn A: Wonderful restaurant and bar. Laid back, affordable, excellent service! Boyfriend had Texan Burger and said it was amazing... Review by - Google Kayla D: Very relaxed chill atmosphere. The food was great bar food. We got 1 of almost every appetizer, a meal each, plus drinks... Review by - Google Spencer L: Great experience! Cheese bites and the wings are so good! Great atmosphere for kids thru the day as well adults. Definitely a must check it out. Stop reviews carousel Play reviews carousel Let's connect Location 24 Ann St Suite A Charleston, SC 29403 Hours Sun, Mon, Tue, Wed, Thur, Fri, Sat 11:00 AM - 2:00 AM Find us on... Facebook page Instagram page Google page Contact us (843)-998-6828 matt@thebrickcharleston.com Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × LET'S CONNECT",
      "hash": "a6089e78a7a4",
      "downloadedAt": "2026-01-18T16:57:25.418Z",
      "trimmedAt": "2026-01-18T17:11:14.074Z",
      "sizeReduction": "97.7%"
    },
    {
      "url": "https://thebrickcharleston.com/charleston-the-brick-food-menu",
      "text": "Our Menu Main Menu Limited-Time-Only Menu Happy Hour Menu Game Day Menu To Go Catering Menu",
      "hash": "abf3391fc184",
      "downloadedAt": "2026-01-18T16:57:25.485Z",
      "trimmedAt": "2026-01-18T17:11:14.079Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "https://thebrickcharleston.com/charleston-the-brick-drink-menu",
      "text": "Our Drinks Wine Beer Cocktails Brown Water",
      "hash": "b4c5f1e3dffd",
      "downloadedAt": "2026-01-18T16:57:26.072Z",
      "trimmedAt": "2026-01-18T17:11:14.083Z",
      "sizeReduction": "100.0%"
    }
  ],
  "sizeReduction": "99.2%"
}