{
  "venueId": "ChIJAXMzTGl7_ogRmAtyILhV2uI",
  "venueName": "Costa Charleston",
  "venueArea": "Downtown Charleston",
  "website": "https://www.costacharleston.com/",
  "scrapedAt": "2026-01-19T02:19:31.741Z",
  "trimmedAt": "2026-01-19T02:20:12.956Z",
  "pages": [
    {
      "url": "https://www.costacharleston.com/menu",
      "text": "[Page Title: Menu | Costa Charleston]\n\ntop of page Sample Dinner Menu Crafted with seasonal ingredients, subject to change. COSTA CAVIAR EXPERIENCE  $45 Regiis Ova Ossetra Caviar FEATURING OUR SIGNATURE CHILLED COSTA GIN ​ ​ ​ ​ ​ ​ HAMACHI CRUDO* Blood Orange, Fennel, Cranberry, Mint ​ TUNA CRUDO* Buttermilk Vinaigrette, Squash, Burgundy Truffle OCTOPACCIO Marcona Almonds, Preserved Lemon, Bomba Di Calabria ​​ ​ BLACK ANGUS TARTARE* Giardiniera, Egg Yolk, Provolone, Fried Pizzetta ​ BURRATA Fennel, Pistachio, Pepperoncini, Rainbow Carrot ​ TUSCAN SALAD Finocchiona, Ricotta Salata, Pistachio, Citrus CAESAR SALAD Anchovy, Miso, Olive Oil Croutons, Pecorino ​ ​ ​ ​ ​ PECORINO RAVIOLI Pomodoro, Torn Basil CANDELE Anchovy, Lemon, Parmesan BEEF CHEEK AGNOLOTTI Braised Octopus, Bone Marrow Gremolata ​ CAVATELLI Italian Sausage, Pumpkin Pomodoro, Walnut Pesto GNUDI Chive, Lemon, Potato, Ossetra Caviar ​ ​ ​ EGGPLANT PARMIGIANA GRILLED CHERRY POINT SWORDFISH Citrus, Caper, White Acre Peas CATCH OF THE DAY Brussel Sprouts, Winter Pickles, Brown Butter, Vadouvan CHICKEN PORCHETTATO Fennel, Jus Gras ​ STOREY FARMS PORK MILANESE Dijon, Pecorino, Bitter Green Salad ​ BISTECCA* Wagyu, Salsa Verde ​ ​ ​ ​ CONTORNI ​ FOCACCIA Olive Nostre EVOO ​ BROCCOLINI Prosciutto, Taleggio ​ ​ FINGERLING POTATOES Olive Tapenade, Feta DELICATA SQUASH Butternut Puree, Pickled Leeks, Candied Pepitas ​ ​ Wine List Dessert Menu Beverage Menu We permit a maximum of two bottles per table, with each bottle limited to 750ml. Magnums are considered equivalent to two bottles. Our corkage fee is $45 per bottle. We kindly request that the selected bottle is not currently listed on our wine list. bottom of page",
      "hash": "50af1f0d1221",
      "downloadedAt": "2026-01-19T02:06:49.990Z",
      "trimmedAt": "2026-01-19T02:20:12.800Z",
      "sizeReduction": "99.8%"
    },
    {
      "url": "https://www.costacharleston.com/",
      "text": "[Page Title: Home | Costa Charleston]\n\ntop of page Big, Unexpected Flavors From Around The World Encompassing coastal Italian fare from Liguria to Amalfi and down to Sicily, you can expect to share and savor handmade Italian pasta, the freshest seafood, classic beef dishes, and other culinary odes to the Mediterranean. Encapsulating the convivial spirit of Italy, Costa* is a space where culinary artistry converges with the joy of companionship. ​ Our culinary expertise extends across our Charleston properties, Zero George, Wild Common, Alcove Market, and Cannon Green, where each team brings a distinctive approach to flavor, presentation, and hospitality. VIEW OUR MENU Fresh and Seasonal Ingredients At Costa*, we believe in using only the freshest and highest quality ingredients to create our dishes and specialty cocktails. Our menu is constantly evolving to showcase the best of what each season has to offer including a daily rotating raw menu and beverages comprised of curated Italian aperitivi and digestivi, all carefully designed to transport you to the Mediterranean shores. BOOK NOW In the news. Costa has been making waves in the media! From glowing reviews to exclusive features, we’re thrilled to share what the press is saying about us . here VOGUE Vogue’s Guide to Charleston, South Carolina: Where to Stay, Eat, and Shop Vogue featured two of EPG’s properties, Costa and Zero George Hotel, in a Charleston travel guide to experience the best of this quintessential Southern town. Learn More POST & COURIER Costa in Charleston champions coastal Italian cuisine. What does that entail? “When it seems like I might be breaking rules, what are the rules? I just didn’t want to have another regular Italian restaurant,” Petrillo said. Learn More GIVE THE GIFT OF COSTA * An epic treat for your favorite foodie –\nsurprise and delight with a gift card from Costa*. BUY GIFT CARD Question? Private event? Whether you're wondering where to park or are interested in hosting a celebration with us, our dedicated management and culinary teams are here to help! Please select from the two options below. We look forward to connecting soon! GENERAL INQUIRY PRIVATE EVENT Reservation LET'S GET SOCIAL. bottom of page",
      "hash": "9ade677fe995",
      "downloadedAt": "2026-01-19T02:06:49.871Z",
      "trimmedAt": "2026-01-19T02:20:12.855Z",
      "sizeReduction": "99.7%"
    },
    {
      "url": "https://www.costacharleston.com/events",
      "text": "[Page Title: Events | Costa Charleston]\n\ntop of page Events Costa* at Join us throughout the month for thoughtfully curated dining experiences, from monthly wine dinners to hands on classes and seasonal specialty meals. January 2026 February 2026 Passport: Across the Peninsula,\nA Night of Italian Icons Thursday, January 22, 2026 he inaugural dinner in Costa’s Passport: Wine & Pasta Series, celebrating Italian wine, cuisine, and storytelling one region at a time. This opening chapter sets the stage for future dinners and pasta classes focused on specific places, grapes, and techniques. T Reserve Your Seat Passport: Handcut Pappardelle, An Intro To Pasta Making Saturday, January 24, 2026 Start the new year by learning something timeless. This January, join us for the very first pasta class at Costa. An intimate, hands-on experience at the pass of our open kitchen, led by our Chef de Cuisine and in-house pasta master. Reserve Your Seat Passport: Tuscan Icons\nWine Dinner Thursday, February 12, 2026 Join us the week of Valentine’s Day for a Tuscan-inspired evening in Costa’s Passport: Wine & Pasta Series. This guided dining experience pairs classic and Super Tuscan wines with a thoughtfully crafted menu celebrating the rich flavors and traditions of the region. Reserve Your Seat Couples Pasta Making Class\nat Costa Saturday, February 14, 2026 Celebrate Valentine’s Day with an intimate, hands-on pasta experience in our open kitchen. Guests will make handmade tortellini from scratch, followed by a plated lunch with a welcome cocktail and a celebratory glass of champagne. Reserve Your Seat Valentine's Day Celebration\nat Costa* Saturday, February 14, 2026 Indulge this Valentine’s Day in elevated classics from shareable Wagyu to caviar and fresh truffles paired with expertly selected wines. This intimate, romantic experience invites you to savor each course and toast to an unforgettable evening. Reserve Your Seat bottom of page",
      "hash": "bcb6620ef7ee",
      "downloadedAt": "2026-01-19T02:06:50.549Z",
      "trimmedAt": "2026-01-19T02:20:12.900Z",
      "sizeReduction": "99.7%"
    },
    {
      "url": "https://www.costacharleston.com/privateevents",
      "text": "[Page Title: Private Dining | Costa Charleston]\n\ntop of page Costa* provides a range of private dining and special event options, nestled in the charming Harleston Village neighborhood of Downtown Charleston. The Loft offers an intimate setting for up to 20 guests, featuring a cozy nautical ambiance, while the entire venue can accommodate up to 100 guests. At Costa*, we offer a curated dining journey through the Italian coast, infused with global and seasonal influences. Your dining experience will be presented in a four-course, shared format featuring a diverse selection of dishes from our menu, expertly curated by our team for your evening. Our experienced management and culinary teams will handle every detail, allowing you to relax and enjoy your celebration. The Loft Costa at Exclusive Use of our Semi-Private Dining Loft (Accommodates up to 20 guests) Prix-Fixe Shared Dining Experience Menu starting at $105 per person AV available with Frame TV INQUIRE NOW Get Inspired bottom of page",
      "hash": "d1dd970744f3",
      "downloadedAt": "2026-01-19T02:06:51.102Z",
      "trimmedAt": "2026-01-19T02:20:12.956Z",
      "sizeReduction": "99.9%"
    }
  ],
  "sizeReduction": "99.8%"
}