{
  "venueId": "ChIJu1AjHF55_ogRJxqL6Y7C25M",
  "venueName": "Maybank Public House",
  "venueArea": "West Ashley",
  "website": "https://maybankpublichouse.com/",
  "scrapedAt": "2026-01-18T17:04:31.566Z",
  "trimmedAt": "2026-01-18T17:12:50.885Z",
  "pages": [
    {
      "url": "https://maybankpublichouse.com/food/",
      "text": "Starters Mojo Pork Tacos | $13.50 Pulled Pork, Pickled Onions, Cabbage, Cilantro, Crumbled Queso, Flour Tortilla Aloha Fries | $9.50 House Cut Fries, Spicy Aioli, Sweet Soy Glaze, Furikake, Scallion Asian Glazed Baby Back Ribs | $16.50 Sweet & Spicy Glazed Pork Ribs, Scallion, Sesame Seed Fried Shrimp | $14.50 9 Fried Shrimp, Spicy Remoulade Mac ‘N Cheese | $14 Smoked Gouda, Parmesan, Pecan Smoked Bacon, White Truffle Oil Public House Calamari | $15.50 Crispy, Fried Calamari, Fried Jalapenos Mini Lamb Burgers* | $14.50 Ground Lamb, Spices, Onion Chutney, Pickles Tzatziki Sauce Crab & Corn Fritters | $12.50 Blue Crab, Corn, Pecan Smoked Bacon, Hatch Green Chile, Cilantro, Spicy Remoulade Fried Green Tomato Napoleon | $12.50 Fried Green, Vine Ripe, Goat Cheese, Pesto, Balsamic Reduction. House Cut French Fries | $8.50 Add Truffle & Parmesan OR Garlic | $1 Spinach And Artichoke Dip | $12.50 Artichoke, Spinach, Creamy Parmesan, Sliced Warm Pita Pimento Cheese Dip | $9.50 House Made Pimento Cheese, Celery Sticks, Sliced Warm Pita * Consuming raw or undercooked meats, poultry, seafood, shellfish, eggs, or unpasteurized milk may increase your risk of foodborne illness. Soups & Salads Creamy Tomato Basil Soup | $6 / $8 Mixed Green Salad | $12 Mixed Field Greens, Cucumber, Tomato, Red Onion, Balsamic Vinaigrette Caesar Salad | $13.50 Romaine Lettuce, Parmesan, Roasted Garlic Croutons, Caesar Dressing Greek Salad | $14.50 Romaine Lettuce, Feta Cheese, Tomato, Red Onion, Kalamata Olive, Cucumber, Banana Peppers, Greek Dressing Beet Salad | $14.50 Fresh Roasted Beets, Warm Pecan Encrusted Goat Cheese, Arugula, Green Beans Maple Vinaigrette Wedge Salad | $14.50 Iceburg Wedge, Pecan Smoked Bacon, Tomato, Blue Cheese Crumbles, Scallions, Blue Cheese Dressing Cobb Salad | $15.50 Mixed Field Greens, Diced Chicken, Pecan Smoked Bacon, Blue Cheese, Egg, Avocado, Tomato, Scallions, Dijon Vinaigrette Southwest Salad | $14.50 Mixed Field Greens, Pepperjack Cheese, Fire Roasted Corn, Black Beans, Avocado, Red Onion, Tomato, Fresh Cilantro, Cilantro Lime Vinaigrette Add Grilled or Blackened Chicken or Lamb Gyro Meat to any Salad | $7 Add Shrimp or Blackened Shrimp | $8 Add Salmon or Blackened Salmon | $9 Burgers* 8oz. 100% Angus* Sub a Grilled Chicken Breast upon request OR Impossible Burger (VEGAN FRIENDLY) Public House Burger | $17 Cheddar, Lettuce, Tomato, Onion California Burger | $18 Monterey Jack, Pecan Smoked Bacon, Avocado, Tomato, Alfalfa Sprouts, Creamy Dijon Blackened Blue Burger | $17.50 Blue Cheese, Crispy Onion Strings, Lettuce, Tomato, Cajun Spices Caprese Burger | $17.50 Mozzarella, Pesto, Tomato, Balsamic Reduction Barnyard Burger | $17.50 Roasted Tomato, Spinach, Caramelized Onion, Goat Cheese Southern Burger | $17.50 Pepperjack, Fried Green Tomato, Lettuce, Spicy Remoulade Fungi Burger | $17.50 Gruyere, Roasted Mushrooms, Caramelized Onions, White Truffle Oil Hatch Green Chile Burger | $17.50 Monterey Jack, Hatch Green Chile, Lettuce, Tomato, Onion Barbeque Burger | $18 Cheddar Cheese, Pecan Smoked Bacon, Barbeque Sauce, Crispy Onion Rings, Lettuce, Tomato Pimento Cheese Burger | $17.50 Pimento Cheese, Lettuce, Tomato, All Burgers are served with French Fries. Upgrade to Parmesan Truffle OR Garlic Fries | $1 Upgrade to Aloha Fries | $2 Substitute a Mixed Green, Greek, or Caesar Salad | $3 * Consuming raw or undercooked meats, poultry, seafood, shellfish, eggs, or unpasteurized milk may increase your risk of foodborne illness. Sandwiches Gyro | $16.50 Choice of Lamb or Chicken, Warm Pita, Shredded Lettuce, Vine Ripe Tomato, Red Onion, Feta, Tzatziki Cuban | $16.50 Roasted Pork, Smoked Ham, Gruyere, Dill Pickle, Whole Grain Mustard, Mojo Sauce Grilled Cheese & Tomato Basil Soup | $14.50 Monterey Jack, Cheddar, & Goat Cheese on Toasted Sourdough Fried Chicken Sandwich | $16.50 Fried Chicken Breast, Tabasco Honey Mayonnaise, Lettuce, Tomato, Onion, Pickles Pimento Cheese BLT | $15.50 Pimento Cheese, Pecan Smoked Bacon, Romaine, Vine Ripe Tomato, Toasted Sourdough Philly Cheesesteak | $16.50 Shaved Ribeye, White American Cheese, Onion, Amoroso Roll Classic Club | $16.50 Turkey, Ham, Pecan Smoked Bacon, Swiss, Cheddar, Lettuce, Tomato, Mayonnaise, Toasted Pullman Bread Shrimp Burger | $17 Shrimp, Red Pepper Aioli, Lettuce, Tomato, Onion, Toasted Brioche Bun Rueben | $17.50 Corned Beef Brisket, Swiss Cheese, Thousand Island, Sauerkraut, Toasted Rye All Sandwiches (excluding Grilled Cheese) are served with French Fries. Upgrade to Parmesan Truffle OR Garlic Fries | $1 Upgrade to Aloha Fries | $2 Substitute a Mixed Green, Greek, or Caesar Salad | $3 Features Fried Shrimp Platter | $21 10 Fried Shrimp, Fries, Tartar Sauce, Cocktail Shrimp ‘N Grits | $25 Local Yellow Stone Ground Grits, Andouille Sausage, Bell Peppers, Garlic, Onion, Bourbon Cream Sauce Fish ‘N Chips | $21 Beer Battered Haddock, Fries, Tartar Sauce, Malt Vinegar Encrusted Tuna* | $26 Yellow Fin Tuna, Basil & Cilantro, in Thin Pastry, Daikon Sprouts, Carrot, Sticky Rice, Sweet Soy Glaze, Spicy Aioli Steak Frites* | $28.50 9oz. Sirloin, Green Peppercorn au Poivre Sauce, House Cut Fries, Grilled Asparagus Seafood Linguini | $26 Shrimp, Scallops, Pecan-Smoked Bacon, Garlic, Onion, Bell Pepper, Parmesan, White Wine Red Curry Salmon* | $25 Jasmine Rice, Asparagus, Coconut Red Curry Broth * Consuming raw or undercooked meats, poultry, seafood, shellfish, eggs, or unpasteurized milk may increase your risk of foodborne illness. Desserts Key Lime Pie Chocolate Cake Carrot Cake Brunch Saturdays & Sundays | 11:30am – 4pm Chicken Biscuits | $15.50 Two Warm Buttermilk Biscuits, Crispy Fried Chicken, Choice of Side Biscuits and Gravy | $14 Two Warm Buttermilk Biscuits, Sausage Gravy, Choice of Side Huevos Rancheros | $15.50 Two Over-Easy Eggs, Monterey Jack, Flour Tortillas, Refried Black BeansHatch Green Chile Sauce, Sour Cream, Choice of Side Fried Green Tomato Benedict* | $17 Two Poached Eggs, Smoked Ham, Fried Green Tomatoes, English Muffin, Hollandaise, Choice of Side Rustic Scramble | $15.50 Three Scrambled Eggs, Gruyere, Smoked Ham, Mushrooms, Caramelized Onions, Choice of Side Avocado Toast | $14.50 Over Medium Egg, Tomato, Avocado, Olive Oil, Served On Sourdough, Choice of Side Mediterranean Scramble | $15.50 Three Scrambled Eggs, Feta, Spinach, Red Pepper, Choice of SideAdd Lamb Gyro Meat | $2 Southwestern Scramble | $15.50 Three Scrambled Eggs, Chorizo, Pepperjack, Avocado, Red Onion, Choice of Side Steak and Eggs | $28.50 8 oz. Filet, 2 Eggs Any Style, Choice of Side No Frills* | $13.50 2 Eggs Any Style, Choice of Two Sides Breakfast Sandwich | $15.50 Scrambled Eggs, American Cheese, Brioche, Garlic AioliChoice of Bacon or Sausage Pancake Stack | $13.50 Three Pancakes, Maple Syrup, Choice of SideAdd Strawberries, Blueberries | $2Add Chocolate Chips | $1 Kid Pancake | $8 One Pancake, Maple Syrup, Choice of SideAdd Strawberries, Blueberries | $2Add Chocolate Chips | $1 * Consuming raw or undercooked meats, poultry, seafood, shellfish, eggs, or unpasteurized milk may increase your risk of foodborne illness. Sides Bacon Home Fries Sourdough Sausage Grits Fresh Fruit Kids Chicken Fingers & Fries | $8.50 Grilled Cheese & Fries | $8.50 Mini Burgers & Fries | $8.50 Butter Noodles | $6 1970 Maybank HwyCharleston SC 29412 maybankpublichouse@gmail.com 843-203-6461 Hours Monday Closed Tuesday 11:30am – 11:00pm Wednesday 11:30am – 11:00pm Thursday 11:30am – 11:00pm Friday 11:30am – 12:00am Saturday 11:30am – 12:00am Sunday 11:30am – 11:00pm",
      "hash": "3c5f9953ad12",
      "downloadedAt": "2026-01-18T17:02:59.571Z",
      "trimmedAt": "2026-01-18T17:12:50.834Z",
      "sizeReduction": "95.5%"
    },
    {
      "url": "https://maybankpublichouse.com/",
      "text": "Maybank Public House Restaurant & Tap Room 843-203-6461 1970 Maybank Hwy, Charleston SC 29412 Open Today From 11:30am – 12:00am Order Online Food Menu Drink Menu Order Online Maybank Public House Our gift cards are perfect for any occasion! Order a gift card online and we will mail it to the recipient. Gift cards are also available for purchase and can be redeemed at both Maybank and Coleman Public House. Purchase Gift Card Reservations Reservations for parties of 5 or more are encouraged. Please contact the restaurant and we will be happy to make the proper accommodations. For smaller parties, we recommend taking advantage of our call-ahead seating option. Simply call the restaurant 15-20 minutes prior to your anticipated arrival time. Our host will be happy to add your name to our wait list in advance in order to reduce your wait time. 1970 Maybank HwyCharleston SC 29412 maybankpublichouse@gmail.com 843-203-6461 Contact Us Hours Monday Closed Tuesday 11:30am – 11:00pm Wednesday 11:30am – 11:00pm Thursday 11:30am – 11:00pm Friday 11:30am – 12:00am Saturday 11:30am – 12:00am Sunday 11:30am – 11:00pm",
      "hash": "4c4a898d92ce",
      "downloadedAt": "2026-01-18T17:02:58.400Z",
      "trimmedAt": "2026-01-18T17:12:50.851Z",
      "sizeReduction": "99.5%"
    },
    {
      "url": "https://maybankpublichouse.com/#location",
      "text": "Maybank Public House Restaurant & Tap Room 843-203-6461 1970 Maybank Hwy, Charleston SC 29412 Open Today From 11:30am – 12:00am Order Online Food Menu Drink Menu Order Online Maybank Public House Our gift cards are perfect for any occasion! Order a gift card online and we will mail it to the recipient. Gift cards are also available for purchase and can be redeemed at both Maybank and Coleman Public House. Purchase Gift Card Reservations Reservations for parties of 5 or more are encouraged. Please contact the restaurant and we will be happy to make the proper accommodations. For smaller parties, we recommend taking advantage of our call-ahead seating option. Simply call the restaurant 15-20 minutes prior to your anticipated arrival time. Our host will be happy to add your name to our wait list in advance in order to reduce your wait time. 1970 Maybank HwyCharleston SC 29412 maybankpublichouse@gmail.com 843-203-6461 Contact Us Hours Monday Closed Tuesday 11:30am – 11:00pm Wednesday 11:30am – 11:00pm Thursday 11:30am – 11:00pm Friday 11:30am – 12:00am Saturday 11:30am – 12:00am Sunday 11:30am – 11:00pm",
      "hash": "8a21b0c93e9b",
      "downloadedAt": "2026-01-18T17:02:59.016Z",
      "trimmedAt": "2026-01-18T17:12:50.865Z",
      "sizeReduction": "99.5%"
    },
    {
      "url": "https://maybankpublichouse.com/drinks/",
      "text": "On Tap 1. Weihenstephan Hefeweizen (5.4%) | $8.25 Germany 2. Delirium Tremens (8.5%) | $10.25 Belgium 3. Sierra Nevada Narwhal North Carolina (10.2%) | $9 4. Allagash White (5.2%) | $7.50 Maine 5. Gaffel Kolsch (4.8%) | $8 Germany 6. Coast Hop Art (7.7%) | $7.75 Charleston 7. Narragansett Lager (5.0%) | $6 Rhode Island 8. Bell’s Two Hearted Michigan (7%) | $7.75 9. Resident Culture Lightning Drops Hazy IPA (6.5%) | $8 Charleston 10. St. Bernardus Abt 12 (9.5%) | $10.25 Belgium 11. Smithwick’s Red Ale (4.5%) | $7.25 Ireland 12. Radeberger Pilsner (4.8%) | $7.25 Germany 13. Westbrook A Very Fine Brown (4.8%) | $7.25 Charleston 14. Hop Fly Camp Fire Amber (5%) | $7.50 North Carolina 15. Low Tide Tura Lu Irish Red(4.5%) | $7.25 Charleston 16. Creature Comfort Oatmeal Stout (4.8%) | $7.50 Georgia 17. Edmonds Oast Blackberry Raspberry Sour (5.5%) | $7.50 Charleston 18. Maine Mean Old Tom Stout (Nitro) (6.5%) | $7.75 Colorado 19.Guinness (Nitro) (4.2%) | $7.25 Ireland Bottles & Cans Modelo | $5Wicked Weed Strawberry Kiwi Burst Sour | $6Kronenbourg 1664 Lager | $7Doc’s Hard Cider | $8Sunboy Spiked Coconut Water (Passionfruit) | $8 Specialty BudweiserBud LightMiller LiteCoors BanquetMichelob Ultra Domestics | $4 Guinness 0.0 | $6.50Heineken 0.0 | $6Sierra Trail Pass IPA Non-Alcoholic Options Delta 9 (Contains THC) | $8Blueberry or Blood Orange High Rise Seltzers MangoBlack Cherry White Claw | $5 Red Wine House Red | $8 / $32 Charles Smith Velvet Devil Merlot | $10 / $40 Bonanza Cabernet | $10 / $40 Benzinger Pinot Noir | $12 / $48 Tamari Malbec | $12 / $48 Prisoner Wine Co. Unshackled Red Blend| $12 / $48 White Wine House White | $8 / $32 Kung Fu Girl Riesling | $9 / $36 Ruffino Pinot Grigio | $10 / $40 Bieler Pere et Fils Rose | $10 / $40 Aveleda Vino Verde | $10 / $40 Simi Chardonnay |$12 / $48 Cave De Lugny Unoaked Chardonnay | $12 / $48 13 Celsius Sauvignon | $12 / $48 Avissi Prosecco Split | $10 Featured Cocktails | $11 Hoodoo Espresso Vodka, Créme De Cacao, Smirnoff Whipped Vodka. Served Up Espresso Martini Smirnoff Whipped Vodka, Harvest Pure Pumpkin Liqueur, Baileys. Served Up With A Dash Of Nutmeg. Predictable Pumpkin Martini William Wolfe Bourbon/Pecan Bourbon, Crème De Cacao, Walnut Bitters. Served Up Or On The Rocks. Pecan Pie Scraper Dell Magueuy Vida Mezcal, Pineapple Juice, Ginger Beer. Served On The Rocks With A Lime & Tajin Rim Pineapple Express MULES ON TAP Moscow (Vodka) | $9 Kentucky (Bourbon) | $9 Mexican (Tequila) | $9 Fresh Squeezed Cocktails $10 Screwdriver | Titos & Orange Juice Salty Dog | Titos & Grapefruit, Salt Paloma | Espolon, Grapefruit, & Lime Margarita | Espolon, Triple Sec, Lemon, Lime, Agave, Salt Pineapple Margarita | Pineapple & Vanilla Bean Infused Tequila, Triple Sec, Fresh Squeezed Sour Mix, Salt Non-Alcoholic/D9 Cocktails HIGH RISE D9 COCKTAILS (CONTAINS THC) | $10 D9 Blueberry Mule D9 Blood Orange Paloma D9 Lavender Blueberry Lemonade NON-ALCOHOLIC COCKTAILS | $6 Amethyst Blueberry Ginger Mint, House Made Ginger Beer Amethyst Blueberry Mule Amethyst Lemon Cucumber Serrano, House Made Sour, Jalapeno Simple, Served On The Rocks With A Tajin Rim Amethyst Spicy Cucumber Margarita Fresh Lemon Juice, Lavender Simple Syrup, Soda Lavender Lemonade House Made Ginger Beer | $5 1970 Maybank HwyCharleston SC 29412 maybankpublichouse@gmail.com 843-203-6461 Hours Monday Closed Tuesday 11:30am – 11:00pm Wednesday 11:30am – 11:00pm Thursday 11:30am – 11:00pm Friday 11:30am – 12:00am Saturday 11:30am – 12:00am Sunday 11:30am – 11:00pm",
      "hash": "97f97ef4ac0b",
      "downloadedAt": "2026-01-18T17:02:58.456Z",
      "trimmedAt": "2026-01-18T17:12:50.885Z",
      "sizeReduction": "97.8%"
    }
  ],
  "sizeReduction": "98.3%"
}