{
  "venueId": "ChIJpeswiDJ6_ogRTnDdkKSCQ1s",
  "venueName": "California Dreaming",
  "venueArea": "West Ashley",
  "website": "https://californiadreaming.rest/location/Charleston-SC/",
  "scrapedAt": "2026-01-18T17:04:30.459Z",
  "trimmedAt": "2026-01-18T17:12:04.843Z",
  "pages": [
    {
      "url": "https://californiadreaming.rest/location/Charleston-SC/#dropdown",
      "text": "Locations + Menus Alabama Spanish Fort Georgia Augusta South Carolina Charleston Columbia Greenville Surside Beach Reserve Menu Order Online Order Online Home Happenings Gift Cards Order Online Contact Locations + Menus Alabama Spanish Fort Georgia Augusta South Carolina Charleston Columbia Greenville Surside Beach Reserve Menu Order Online Order Online Home Happenings Gift Cards Order Online Contact Charleston, SC Since 1987, California Dreaming has been a proud part of the Charleston, SC community. Our spacious, open setting features floor-to-ceiling windows that offer stunning views of the Ashley River, creating the perfect backdrop for a lively night out. You can also enjoy these panoramic views from our wrap-around deck, complete with a bar and easily accessible by boat. Whether you're craving low country favorites or our famous prime rib, California Dreaming is a favorite among both locals and tourists. Please note that we provide Advance Priority Seating to reduce wait times and expedite the seating process when your entire party arrives. To ensure the best experience for all guests, we seat groups of up to 6. While larger groups are seated separately, this arrangement is flexible during quieter hours. 1 Ashley Point Dr Charleston, SC 29407 Directions 843.766.1644 Order Now Reserve Hours Open Today Sunday 11am-9pm Open Today - Sunday 11am-9pm Monday 4pm-9pm Tuesday 4pm-9pm Wednesday 4pm-9pm Thursday 4pm-9pm Friday 4pm-10pm Saturday 11am-10pm | Catering Curbside to-go facebook instagram DINE DINE | DRINK | WINE | KIDS | DESSERT | ASHLEY PATIO DINE Apps She Crab Soup 9.95 A rich and creamy Charleston classic Steamed Peel & Eat Shrimp Old Bay boil, served with cocktail sauce 1/2lb 13.95 Fried Crab Claws 17.95 Served with spicy cocktail sauce. Limited availability Seafood Nachos 18.95 Spicy shrimp, salmon, red onions, house-made chips, cheese sauce and lobster cream sauce with dill Creamed Spinach Nachos 13.95 with house-made chips Calamari 16.95 Lightly breaded, with marinara Oysters Rockefeller (4) 17.95 Spinach, romano, bacon Nashville Hot Wings 15.95 Marinated in hot pepper sauce, fried crispy, with bleu cheese dip Chicken Tenders 13.95 Served with house-made honey BBQ sauce. cheese dip Our Famous Croissants (5) 7.95 Topped with honey-butter Baked Potato Soup 8.95 Creamy soup topped with scallions, cheese, ham and bacon Entrees The Ashley 24.95 Broiled chicken breast, blackened shrimp, lobster cream sauce, served with a side Roasted Salmon 27.95 Encrusted with rosemary and thyme, served with mashed potatoes and seasonal veggie Blackened Chicken Pasta 19.95 Alfredo, scallions, tomatoes, with romano cheese Chicken Tenders Platter 19.95 Fried chicken tenderloins, served with house-made honey BBQ sauce and french fries Crispy Shrimp Tacos (3) 17.95 Jicama slaw, chipotle mayo, tomatoes, pickled onions, scallions, queso fresco Low Country Favorites Add a house or caesar salad +$5.95 Firecracker Tuna* 32.95 Thai glaze, served with mashed potatoes and seasonal veggie Crab Cakes 34.95 Jumbo lump, mustard sauce, served with mashed potatoes and seasonal veggie Featured Fish Served with a side item A.Q. Charleston Seafood Pasta 24.95 Sautéed shrimp, mussels, garlic cream, white wine, romano Shrimp + Grits 23.95 Jumbo shrimp, andouille sausage, Adluh Mills grits Fried Seafood Platters Fried Seafood Platters Served with french fries Shrimp 21.95 Oysters 25.95 Flounder 23.95 All Three 28.95 Salads California Dreaming 15.95 Mixed greens, ham and turkey, cheddar and monterey jack cheeses, egg, tomatoes, almonds topped with warm ham and bacon, house dressing Roasted Salmon or Chicken Mixed greens, bacon, egg, avocado, tomatoes, balsamic vinaigrette Roasted Salmon 18.95 Chicken 16.95 Caesar Crisp romaine with grated romano cheese and croutons Chicken or Fried Shrimp 15.95 Fried Oysters 17.95 Steaks, Chops + Ribs Aged USDA Choice | Served with a house or caesar salad and side item. Add broiled or fried shrimp to any steak +$7.95 Pork Chop 26.95 16oz. double bone, frenched chop, peach jalapeno jam New York Strip* 39.95 14oz. center cut, garlic butter Surf + Turf* 34.95 10oz. ribeye topped with grilled garlic shrimp Ribeye* 39.95 14oz. hand cut with cajun butter Filet Mignon* 40.95 8oz. barrel cut Marinated Sirloin* 28.95 10oz. sirloin marinated in fruit juices, garlic, soy sauce and spices Baby Back Ribs Danish full-flavored ribs, grilled with a charred exterior, basted with BBQ sauce, with side item One Rack 23.95 Two Racks 31.95 Sandwiches & Burgers Served with french fries Spicy Chicken Sandwich 16.95 Crispy fried chicken, american cheese, jicama slaw, pickles, chipotle mayo New Orleans Po'boy Lettuce, tomato and tartar sauce on french bread Fried Shrimp 16.95 Fried Oysters 18.95 Steak Burger* 17.95 10 oz., shredded lettuce, pickles, red onion, tomato, cheddar cheese, our signature sauce Blackened Mahi Sandwich 17.95 Toasted brioche, lemon, arugula, ripe tomato, curry mayonnaise, homemade pickles Sides French Fries 5.95 Seasonal Veggie 5.95 Cole Slaw 5.95 Mashed Potatoes 5.95 Creamed Spinach 5.95 Baked Potato 6.95 after 4pm Desserts Chocolate Brownie 9.95 Apple Walnut Cobbler 9.95 Croissant Bread Pudding 9.95 Cheesecake 9.95 Seasonal Topping Gluten free - prepared in a fryer with wheat ingredients. *Denotes cooked to order | consuming raw or undercooked meats, poultry, seafood, shellfish or eggs may increase your risk of foodbourne illness especially if you have certain medical conditions Disclaimer: Pricing and availability subject to change. DRINK Cocktails Barrel-Aged Old Fashioned 14.95 Maker's Mark 'Living the Dream,' bitters, sugar Dreamsicle #3 10.95 Evan Williams bourbon, Licor 43, vanilla, orange juice Spritz-Mas 9.95 Aperol, cranberry, lemon, prosecco Harvest Ember 10.95 Evan Williams bourbon, apple butter, lemon, spiced honey, apple wood smoke Margaritas Pouring: Jose Cuervo Tradicional Classic 10.95 Agave, lime Spiced Cranberry 10.95 White cranberry, cinnamon, lime, Cointreau Smoky Peach 10.95 Ilegal mezcal, peach, agave, lime Pineapple Jalapeño 10.95 Pineapple, jalapeño, lime, triple sec Martinis Toasted Marshmallow 11.95 Hoodoo Espresso vodka, toasted marshmallow infusion Sugar Cookie 11.95 Baileys, Absolut Vanilla vodka, di Amore amaretto Strawberry Rose 12.95 Tito's vodka, rose essence, Chambord, strawberry Dirty 13.95 Grey Goose vodka, olive brine, Dolin dry vermouth Frozen Drinks Cali Crush 10.95 Parrot Bay Coconut rum, blue curacao, pineapple, house sour Irish Coffee 10.95 Jameson whiskey, Kahlua, cream, whipped cream Zero Proof Coconut Faux-Jito 9.95 Non-Alcoholic, Seedlip Spice 94, Coco Lopez, pineapple, lime, mint Pineapple Spritz 9.95 Non-Alcoholic, Seedlip Grove 42, pineapple, lime, grenadine, cherry Spirits Bourbon / Whiskey Ben Holladay 13.95 Bib & Tucker 10yr 15.95 High West High Country 16.95 Blanton's 18.95 Buffalo Trace 9.95 Bulleit Rye 8.95 Eagle Rare 10yr 15.95 Maker's Mark 'Living the Dream' 16.95 Michter's Rye 13.95 Old Forrester 1924 25.95 Old Pepper 11.95 Old Soul Tintype Series #1 19.95 Peerless Rye 19.95 Peg Leg Porker 9.95 Redwood Empire 12.95 Smoke Wagon 16.95 Traveller 13.95 Tequila 400 Conejos Mezcal 11.95 Casamigos Reposado 14.95 Don Julio Primavera 29.95 El Tesoro Añejo 13.95 Espolon Blanco 10.95 G4 Blanco 15.95 Herradura Legend 29.95 Lalo Blanco 12.95 Partida Añejo 15.95 Patron Roca Anejo 29.95 Tequila Ocho Plata 12.95 Beer On Tap Blue Moon 6.25 Creature Comforts 6.95 Edmund's Oast 7.95 Michelob Ultra 5.95 Miller Lite 5.95 Modelo Especial 6.25 Southern Hops Blackwater Porter 6.95 Bottles / Cans Austin Eastciders 6.95 Bud Light 5.25 Coors Light 5.25 Corona 5.25 Heineken 6.95 High Rise Pineapple THC Seltzer 9.95 PBR 3.95 Yuengling 5.95 White Claw 6.95 NA Athletic Upside Dawn 7.95 Disclaimer: Pricing and availability subject to change. WINE Whites Chardonnay, EOS, California 7.95 Chardonnay, Diora, Monterey 9.95 Chardonnay, Buehler, Russian River 11.95 Chardonnay, Frank Family, Carneros, California 55.00 Moscato, Seven Daughters, Italy 8.95 Moscato Rosé, Risata, Italy 7.95 Pinot Grigio, Lunardi, Italy 7.95 Prosecco, Riondo, Italy 8.95 Riesling, Loosen Bros. \"Dr L\" Mosel, Germany 7.95 Sauvignon Blanc, Wairau River, New Zealand 8.95 Sauvignon Blanc, Jax, California 10.95 Sparkling Wine, Poema, Cava 7.95 Reds Cabernet Sauvignon, Firestone, Paso Robles 7.95 Cabernet Sauvignon, Leese-Fitch, California 8.95 Cabernet Sauvignon, The Federalist, California 11.95 Cabernet Sauvignon, Lake Sonoma, California 49.00 Malbec, Alta Vista \"Vive\", Argentina 7.95 Merlot, Spellbound, California 8.95 Pinot Noir, Elouan, Oregon 9.95 Pinot Noir, Fowles Wine, Australia 11.95 Pinot Noir Rosé, Villa Wolf, Pfalz, Germany 7.95 Red Blend, Clos de los Siete, Argentina 9.95 Red Blend, Conundrum, California 42.00 Red Zinfandel, Seghesio Family Vineyards, California 10.95 Disclaimer: Pricing and availability subject to change. KIDS Kids Menu Served with fries and a beverage. Chicken Strips 6.95 Cheeseburger 6.95 Fried Shrimp 6.95 Chicken Wings 6.95 Grilled Cheese 6.95 Fettuccine Alfredo 6.95 (no side) Disclaimer: Pricing and availability subject to change. DESSERT Desserts $9.95 Chocolate Brownie Apple Walnut Cobbler Croissant Bread Pudding Cheesecake Disclaimer: Pricing and availability subject to change. ASHLEY PATIO Apps She Crab Soup 9.95 A rich and creamy Charleston classic Steamed Peel & Eat Shrimp Old Bay boil, served with cocktail sauce. GF 1/2 lb 13.95 Fried Crab Claws 17.95 Served with spicy cocktail sauce. Limited availability Calamari 16.95 Lightly breaded, with marinara Oysters Rockefeller (4) 17.95 Spinach, romano, bacon Nashville Hot Wings 15.95 Marinated in hot pepper sauce, fried crispy, with bleu cheese dip Our Famous Croissants (5) 7.95 Topped with honey-butter Baked Potato Soup 8.95 Creamy soup topped with scallions, cheese, ham and bacon Entrees Chicken Tenders Platter 19.95 Fried chicken tenderloins, served with house-made honey BBQ sauce and french fries Crispy Shrimp Tacos (3) 17.95 Jicama slaw, chipotle mayo, tomatoes, pickled onions, scallions, queso fresco Shrimp + Grits 23.95 Jumbo shrimp, andouille sausage, Adluh Mills grits Fried Seafood Platter 28.95 Shrimp, oysters, and flounder, served with french fries. Salads California Dreaming 15.95 Mixed greens, ham and turkey, cheddar and monterey jack cheeses, egg, tomatoes, almonds topped with warm ham and bacon, house dressing Roasted Salmon or Chicken Mixed greens, bacon, egg, avocado, tomatoes, balsamic vinaigrette Roasted Salmon 18.95 Chicken 16.95 Caesar Crisp romaine with grated romano cheese and croutons Chicken or Fried Shrimp 15.95 Fried Oysters 17.95 Steaks + Ribs Aged USDA Choice | Served with a house or caesar salad and side item. Rare - cold red center | Medium Rare - warm red center | Medium - hot red center | Medium Well - hot pink center | Well Done - brown center. Add broiled or fried shrimp to any steak +$7.95 Ribeye 39.95 14oz. hand cut with cajun butter. GF Filet Mignon 40.95 8oz. barrel cut. GF Marinated Sirloin 28.95 10oz. sirloin marinated in fruit juices, garlic, soy sauce and spices. GF Baby Back Ribs Danish full-flavored ribs, grilled with a charred exterior, basted with BBQ sauce, with side item. GF One Rack 23.95 Two Racks 31.95 Sandwiches & Burgers Served with french fries Spicy Chicken Sandwich 16.95 Crispy fried chicken, american cheese, jicama slaw, pickles, chipotle mayo Steak Burger* 17.95 10 oz., shredded lettuce, pickles, red onion, tomato, cheddar cheese, our signature sauce Blackened Mahi Sandwich 17.95 Toasted brioche, lemon, arugula, ripe tomato, curry mayonnaise, homemade pickles Sides French Fries 5.95 Seasonal Veggie 5.95 Mashed Potatoes 5.95 Creamy Cole Slaw 5.95 Baked Potato 6.95 (after 4pm) Desserts $9.95 Chocolate Brownie Apple Walnut Cobbler Croissant Bread Pudding Cheesecake Cocktails Cocktails Barrel-Aged Old Fashioned 13.95 Wild Turkey 101 Blueberry Gin Smash 11.95 Hat Trick gin, fresh blueberries, lemon, sugar Cider Rules 12.95 Skyy vodka, all spice, lemon, apple cider, spiced apple bitters Margaritas Pouring: Lunazul tequila Classic 10.95 Agave, lime Smoky Peach 10.95 Ilegal mezcal, peach, agave, lime Pineapple Jalapeño 10.95 Pineapple, jalapeño, lime, triple sec Frozen Drinks Cali Crush 10.95 Parrot Bay Coconut rum, blue curacao, pineapple, house sour Mojito 10.95 Bacardi rum, mint, lime, sugar Zero Proof Coconut Faux-Jito 9.95 Non-Alcoholic, Seedlip Spice 94, Coco Lopez, pineapple, lime, mint Pineapple Spritz 9.95 Non-Alcoholic, Seedlip Grove 42, pineapple, lime, grenadine, cherry Wine Whites Chardonnay, EOS, California 7.95 Pinot Grigio, Lunardi, Italy 7.95 Sauvignon Blanc, Wairau River, New Zealand 8.95 Reds Cabernet Sauvignon, Firestone, Paso Robles 7.95 Malbec, Alta Vista \"Vive\", Argentina 7.95 Pinot Noir, Elouan, Oregon 9.95 Beer On Tap Blue Moon 6.25 Creature Comforts 6.95 Michelob Ultra 5.95 Modelo Especial 6.25 Bottles / Cans Austin Eastciders 4.95 Bud Light 5.25 Coors Banquet 5.95 Coors Light 5.25 Corona 5.25 Miller High Life Pony 3.95 PBR 3.95 White Claw 6.95 NA Athletic Upside Dawn 4.95 Disclaimer: Pricing and availability subject to change. See More Menus Menu | Reserve Augusta, GA Charleston, SC Columbia, SC Greenville, SC Spanish Fort, AL Surfside Beach, SC Sign Up For Mailing List Select your favorite location Contact Contact Catering CentraArchy Restaurants Join Our Team Gift Cards Sitemap © 2026 CentraArchy Restaurants. All Rights Reserved.",
      "hash": "27cda8354608",
      "downloadedAt": "2026-01-18T17:02:12.891Z",
      "trimmedAt": "2026-01-18T17:12:04.287Z",
      "sizeReduction": "89.9%"
    },
    {
      "url": "https://californiadreaming.rest/locations/",
      "text": "Locations + Menus Alabama Spanish Fort Georgia Augusta South Carolina Charleston Columbia Greenville Surside Beach Reserve Menu Order Online Order Online Home Happenings Gift Cards Order Online Contact Locations + Menus Alabama Spanish Fort Georgia Augusta South Carolina Charleston Columbia Greenville Surside Beach Reserve Menu Order Online Order Online Home Happenings Gift Cards Order Online Contact Order Now Alabama Spanish Fort 30500 State Hwy 181 Spanish Fort, AL 36527 30500 State Hwy 181 Spanish Fort, AL 36527 | 251.626.9942 Menus Reservations Order Now Catering Georgia Augusta 3241 Washington Rd. Augusta, GA 30907 3241 Washington Rd. Augusta, GA 30907 | 706.860.6206 Menus Reservations Order Now Catering South Carolina Charleston 1 Ashley Point Dr Charleston, SC 29407 1 Ashley Point Dr Charleston, SC 29407 | 843.766.1644 Menus Reservations Order Now Catering Columbia 401 South Main St. Columbia, SC 29201 401 South Main St. Columbia, SC 29201 | 803.254.6767 Menus Reservations Order Now Catering Greenville 40 Beacon Dr. Greenville, SC 29615 40 Beacon Dr. Greenville, SC 29615 | 864.234.9000 Menus Reservations Order Now Catering Surfside Beach 2657 Beaver Run Blvd Surfside Beach, SC 29575 2657 Beaver Run Blvd Surfside Beach, SC 29575 | 843.215.5255 Menus Reservations Order Now Catering Open Open Open Open Open Open Open Open Open Open Menu | Reserve Augusta, GA Charleston, SC Columbia, SC Greenville, SC Spanish Fort, AL Surfside Beach, SC Sign Up For Mailing List Select your favorite location Contact Contact Catering CentraArchy Restaurants Join Our Team Gift Cards Sitemap © 2026 CentraArchy Restaurants. All Rights Reserved.",
      "hash": "3c1ca1898e25",
      "downloadedAt": "2026-01-18T17:02:06.199Z",
      "trimmedAt": "2026-01-18T17:12:04.322Z",
      "sizeReduction": "98.8%"
    },
    {
      "url": "https://californiadreaming.rest/location/Augusta-GA/",
      "text": "Locations + Menus Alabama Spanish Fort Georgia Augusta South Carolina Charleston Columbia Greenville Surside Beach Reserve Menu Order Online Order Online Home Happenings Gift Cards Order Online Contact Locations + Menus Alabama Spanish Fort Georgia Augusta South Carolina Charleston Columbia Greenville Surside Beach Reserve Menu Order Online Order Online Home Happenings Gift Cards Order Online Contact Augusta, GA Since 1997, the well-liked, locally appreciated neighborhood place in Augusta, GA has been California Dreaming. The warm and inviting atmosphere with comfortable booth seating and open kitchen is great for families and date-nights alike. Specializing in high-quality, fresh ingredients like thick-cut steaks, tavern-style sandwiches, and of course, its namesake salad. Open for lunch and dinner, featuring patio dining and online ordering with curbside pickup. To ensure the best experience for all guests, we seat groups of up to 6. 3241 Washington Rd. Augusta, GA 30907 Directions 706.860.6206 Order Now Reserve Hours Open Today Sunday 11am-9pm Open Today - Sunday 11am-9pm Monday 11am-9pm Tuesday 11am-9pm Wednesday 11am-9pm Thursday 11am-9pm Friday 11am-10pm Saturday 11am-10pm | Catering Curbside to-go facebook instagram DINE DINE | DRINK | WINE | DESSERT | KIDS DINE Apps She Crab Soup 8.95 A rich and creamy Charleston classic Steamed Peel & Eat Shrimp 10.95 (9) Old Bay boil, served with cocktail sauce Traditional Nachos 13.95 Chili, cheese, tomatoes, jalapenos, sour cream, house-made chips Seafood Nachos 17.95 Spicy shrimp, salmon, red onions, house-made chips, cheese sauce and lobster cream sauce with dill Chicken Tenders 12.95 Served with house-made honey BBQ sauce Tijuana or Nashville Hot Wings 15.95 Marinated in hot pepper sauce, fried crispy, with bleu cheese dip Southwest Chicken Quesadilla 13.95 With bacon & ham, mixed cheese, scallions, sour cream, and pico de gallo Chili 8.95 Topped with cheese, scallions and sour cream, served with corn tortilla chips Baked Potato Soup 7.95 Creamy soup, scallions, cheese, ham, bacon Our Famous Croissants (5) 6.95 Topped with honey-butter Entrees Add a house or caesar salad +$4.95 Cali Bowl Warm sushi rice, avocado, jalapenos, sesame seeds, mango, scallions, jicama slaw, pickled red onions, chipotle mayo. Choice of: Tuna Poke 17.95 Miso Salmon 18.95 Steak 18.95 Fried Chicken 15.95 Chicken Tenders Platter 16.95 Fried chicken tenderloins, served with house-made honey BBQ sauce and french fries Blackened Chicken Pasta 17.95 Alfredo, scallions, tomatoes, with romano cheese Knob Hill Chicken 17.95 Topped with ham and monterey jack cheese, with side item Seafood Favorites Add a house or caesar salad +$4.95 Shrimp San Francisco 17.95 Mushrooms, garlic cream, white wine, served over pasta, topped with romano cheese Miso Salmon 25.95 Miso glazed, sweet soy, with side Carolina Trout 24.95 Grilled with arugula and lemon Crab Cakes 31.95 Jumbo lump, mustard sauce, served with mashed potatoes and seasonal veggie Fried Seafood Platters All Three $26.95. Served with french fries Shrimp 20.95 Oysters 24.95 Flounder 20.95 Salads California Dreaming 13.95 Mixed greens, ham and turkey, cheddar and monterey jack cheeses, egg, tomatoes, almonds topped with warm ham and bacon, house dressing Roasted Salmon or Chicken Mixed greens, bacon, egg, avocado, tomatoes, balsamic vinaigrette Salmon 17.95 Chicken 15.95 Caesar Crisp romaine, grated romano cheese, croutons Chicken or Fried Shrimp 14.95 Fried Oysters 17.95 Chicken Club 15.95 Mixed greens, fried chicken strips, avocado, bacon, egg, tomatoes, house-made ranch dressing Steaks, Chops + Ribs Aged USDA Choice | Served with a house or caesar salad and side item Pork Chop 26.95 16oz. double bone, frenched chop, peach jalapeno jam Marinated Sirloin 25.95 10oz. sirloin marinated in fruit juices, garlic, soy sauce and spices Steak + Shrimp 25.95 Two 3oz. filet medallions, crispy fried shrimp Ribeye 35.95 14oz. hand cut Filet Mignon 37.95 8oz. barrel cut Baby Back Ribs Danish full-flavored ribs, grilled with a charred exterior, basted with BBQ sauce, with side item One Rack 21.95 Two Racks 29.95 Tacos (3) Served with side item Chicken 15.95 Shredded lettuce, chipotle & cilantro mayo, pico de gallo, monterey cheese Steak 17.95 Cilantro cabbage slaw, chipotle mayo, pickled onions, queso fresco Crispy Shrimp 16.95 Jicama slaw, chipotle mayo, tomatoes, pickled onions, scallions, queso fresco Sandwiches Served with french fries American Burger 12.95 Lettuce, tomato, red onions, pickles and Duke's® mayo Veggie Burger 13.95 House-made, with pepper jack cheese, avocado, lettuce, tomato, BBQ molasses sauce, mayo and mustard Spicy Chicken 14.95 Crispy fried chicken, american cheese, jicama slaw, pickles, chipotle mayo Club 14.95 Thinly sliced turkey, ham, bacon, cheddar and monterey jack cheeses, lettuce, tomato and mayo on toasted sourdough Blackened Mahi 16.95 Toasted brioche, lemon arugula, ripe tomato, curry mayonnaise, homemade pickles Sides French Fries 5.95 Seasonal Veggie 5.95 Cole Slaw 5.95 Mashed Potatoes 5.95 Baked Potato 6.95 after 4pm Desserts Chocolate Brownie 8.95 Apple Walnut Cobbler 8.95 Croissant Bread Pudding 8.95 Cheesecake 9.95 seasonal topping Disclaimer: Pricing and availability subject to change. DRINK Cocktails Barrel-Aged Old Fashioned 13.95 Elijah Craig Small Batch bourbon Dreamsicle #3 10.95 Edmond's Honor whiskey, Licor 43, vanilla, orange juice Spritz-Mas 9.95 Aperol, cranberry, lemon, prosecco Harvest Ember 10.95 Evan Williams bourbon, apple butter, lemon, spiced honey, apple wood smoke Margaritas Pouring: Lunazul tequila Classic 10.95 Agave, lime Spiced Cranberry 10.95 White cranberry, cinnamon, lime, Cointreau Smoky Peach 10.95 Ilegal mezcal, peach, agave, lime Pineapple Jalapeño 10.95 Pineapple, jalapeño, lime, triple sec Martinis Toasted Marshmallow 11.95 Hoodoo Espresso vodka, toasted marshmallow infusion Sugar Cookie 11.95 Baileys, Absolut Vanilla vodka, di Amore amaretto Strawberry Rose 12.95 Tito's vodka, rose essence, Chambord, strawberry Dirty 13.95 Grey Goose vodka, olive brine, Dolin dry vermouth Frozen Drinks $10.95 Cali Crush Parrot Bay Coconut rum, blue curacao, pineapple, house sour Irish Coffee Jameson whiskey, Kahlua, cream, whipped cream Zero Proof Coconut Faux-Jito 9.95 Non-Alcoholic, Seedlip Spice 94, Coco Lopez, pineapple, lime, mint Pineapple Spritz 9.95 Non-Alcoholic, Seedlip Grove 42, pineapple, lime, grenadine, cherry Spirits Bourbon / Whiskey 2XO American Oak 14.95 Baby Jane 12.95 Buffalo Trace 10.95 Bulleit Rye 11.95 Jack Daniel's Single Barrel 11.95 Knob Creek 10.95 Maker's Mark 9.95 Old Soul 10.95 Peg Leg Porker 10.95 Redemption Rye 9.95 Redwood Empire Pipe Dream 14.95 Thirteenth Colony Southern Rye 11.95 WhistlePig 10yr Rye 21.95 Wild Turkey Special Reserve Rye 14.95 Woodford Reserve Double Oaked 15.95 Tequila Casamigos Reposado 13.95 Clase Azul Reposado 28.95 Don Fulano Blanco 13.95 Don Julio Blanco 9.95 Don Julio Primavera Reposado 29.95 Espolon Blanco 9.95 G4 Blanco 14.95 Herradura Double Reposado 14.95 Lalo Blanco 13.95 Patron Silver 11.95 Beer On Tap Blue Moon 6.25 Coors Light 5.95 Savannah River 6.25 Good Googly Moogly IPA 6.95 Bottles / Cans Amberbock 4.95 Athletic N/A 5.95 Bud Light 4.95 Budweiser 4.95 Corona 5.25 Guinness 5.95 Heineken 5.25 Michelob Ultra 5.25 Miller Lite 4.95 Nutrl Seltzer 6.25 Sweetwater 420 5.25 Yuengling 5.25 Disclaimer: Pricing and availability subject to change. WINE Whites Chardonnay, EOS, California 7.95 Chardonnay, Diora, Monterey 9.95 Chardonnay, Buehler, Russian River 11.95 Chardonnay, Frank Family, Carneros, California 55.00 Moscato, Seven Daughters, Italy 8.95 Moscato Rosé, Risata, Italy 7.95 Pinot Grigio, Lunardi, Italy 7.95 Prosecco, Riondo, Italy 8.95 Riesling, Loosen Bros. \"Dr L\" Mosel, Germany 7.95 Sauvignon Blanc, Wairau River, New Zealand 8.95 Sauvignon Blanc, Jax, California 10.95 Sparkling Wine, Poema, Cava 7.95 Reds Cabernet Sauvignon, Firestone, Paso Robles 7.95 Cabernet Sauvignon, Leese-Fitch, California 8.95 Cabernet Sauvignon, The Federalist, California 11.95 Cabernet Sauvignon, Lake Sonoma, California 49.00 Malbec, Alta Vista \"Vive\", Argentina 7.95 Merlot, Spellbound, California 8.95 Pinot Noir, Elouan, Oregon 9.95 Pinot Noir, Fowles Wine, Australia 11.95 Pinot Noir Rosé, Villa Wolf, Pfalz, Germany 7.95 Red Blend, Clos de los Siete, Argentina 9.95 Red Blend, Conundrum, California 42.00 Red Zinfandel, Seghesio Family Vineyards, California 10.95 Disclaimer: Pricing and availability subject to change. DESSERT Desserts Chocolate Brownie 8.95 Topped with a Hershey's bar, served with vanilla ice cream. Apple Walnut Cobbler 8.95 Served hot with vanilla ice cream. Croissant Bread Pudding 8.95 Warm croissants, raisins and creme anglaise, with vanilla ice cream and rum sauce. New York Cheesecake 9.95 seasonal topping Disclaimer: Pricing and availability subject to change. KIDS Kids Menu Served with fries and a beverage. Chicken Strips 6.95 Cheeseburger 6.95 Fried Shrimp 6.95 Chicken Wings 6.95 Grilled Cheese 6.95 Fettuccine Alfredo 6.95 (no side) Disclaimer: Pricing and availability subject to change. See More Menus Menu | Reserve Augusta, GA Charleston, SC Columbia, SC Greenville, SC Spanish Fort, AL Surfside Beach, SC Sign Up For Mailing List Select your favorite location Contact Contact Catering CentraArchy Restaurants Join Our Team Gift Cards Sitemap © 2026 CentraArchy Restaurants. All Rights Reserved.",
      "hash": "8d02dca0cef7",
      "downloadedAt": "2026-01-18T17:02:07.726Z",
      "trimmedAt": "2026-01-18T17:12:04.409Z",
      "sizeReduction": "91.7%"
    },
    {
      "url": "https://californiadreaming.rest/location/Spanish-Fort-AL/",
      "text": "Locations + Menus Alabama Spanish Fort Georgia Augusta South Carolina Charleston Columbia Greenville Surside Beach Reserve Menu Order Online Order Online Home Happenings Gift Cards Order Online Contact Locations + Menus Alabama Spanish Fort Georgia Augusta South Carolina Charleston Columbia Greenville Surside Beach Reserve Menu Order Online Order Online Home Happenings Gift Cards Order Online Contact Spanish Fort, AL Universally admired, California Dreaming in Spanish Fort, AL, located in the Eastern Shore outdoor shopping center, has been serving much-loved American classics since 2007. The consistent, hearty menu, lively bar-area – including tv’s for sports fans, and spacious patio, creates a welcoming atmosphere for everyone. Open for lunch and dinner with happy hour daily from 3PM and online ordering & curbside pickup. To ensure the best experience for all guests, we seat groups of up to 8. While larger groups are seated separately, this arrangement is flexible during quieter hours. 30500 State Hwy 181 Spanish Fort, AL 36527 Directions 251.626.9942 Order Now Reserve Hours Open Today Sunday 11am-9pm Open Today - Sunday 11am-9pm Monday 11am-9pm Tuesday 11am-9pm Wednesday 11am-9pm Thursday 11am-9pm Friday 11am-10pm Saturday 11am-10pm facebook instagram DINE DINE | DRINK | WINE | KIDS | DESSERT DINE Apps She Crab Soup 8.95 A rich and creamy Charleston classic Steamed Peel & Eat Shrimp 12.95 (9) Seasoned and served with cocktail sauce Fried Crab Claws 16.95 Served with spicy cocktail sauce. (Limited availability) Nashville Hot Wings 14.95 Marinated in hot pepper sauce, fried crispy, with bleu cheese dip Chicken Tenders 12.95 Served with house-made honey BBQ sauce Baked Potato Soup 7.95 Creamy soup topped with scallions, cheese, ham and bacon Our Famous Croissants (5) 6.95 Topped with honey-butter Nachos house-made chips Traditional 12.95 Chili, cheese, tomatoes, jalapenos, sour cream BBQ Chicken 15.95 Smoky BBQ sauce, red onions, cheese sauce Seafood 16.95 Spicy shrimp, salmon, red onions, cheese sauce and lobster cream sauce with dill Cali Bowl Cali Bowl Warm sushi rice, avocado, jalapenos, sesame seeds, mango, scallions, jicama slaw, pickled red onions, chipotle mayo. Choice of: Tuna Poke* 17.95 Miso Salmon 17.95 Steak 18.95 Fried Chicken 15.95 Entrees Add a house or caesar salad +$4.95 Chicken Tenders Platter 17.95 Fried chicken tenderloins, served with house-made honey BBQ sauce and french fries Blackened Chicken Pasta 18.95 Alfredo, scallions, tomatoes, with romano cheese Knob Hill Chicken 18.95 Topped with ham and monterey jack cheese, with side item Seafood Favorites Add a house or caesar salad +$4.95 Shrimp San Francisco 18.95 Mushrooms, garlic cream, white wine, served over pasta, topped with romano cheese Miso Salmon 24.95 Miso glazed, sweet soy, with side Featured Fish Served with a side item A.Q. Fried Seafood Platters All Three $25.95. Served with french fries Shrimp 20.95 Oysters 24.95 Flounder 21.95 Salads California Dreaming 13.95 Mixed greens, ham and turkey, cheddar and monterey jack cheeses, egg, tomatoes, almonds topped with warm ham and bacon, house dressing Roasted Salmon or Chicken Mixed greens, bacon, egg, avocado, tomatoes, balsamic vinaigrette Salmon 17.95 Chicken 14.95 Caesar Crisp romaine, grated romano cheese, croutons Chicken or Fried Shrimp 14.95 Fried Oysters 16.95 Chicken Club 14.95 Mixed greens, fried chicken strips, avocado, bacon, egg, tomatoes, house-made ranch dressing Steaks, Chops + Ribs Aged USDA Choice | Served with a house or caesar salad and side item Country Fried Pork Chops 21.95 Two pork chops fried crispy Marinated Sirloin* 25.95 10oz. sirloin marinated in fruit juices, garlic, soy sauce and spices Steak + Shrimp* 26.95 Two 3oz. filet medallions, crispy fried shrimp Ribeye* 36.95 14oz. hand cut New York Strip* 36.95 14oz. center cut Filet Mignon* 37.95 8oz. barrel cut Baby Back Ribs Danish full-flavored ribs, grilled with a charred exterior, basted with BBQ sauce, with side item One Rack 21.95 Two Racks 28.95 Tacos Served with side item Chicken 15.95 Shredded lettuce, chipotle & cilantro mayo, pico de gallo, Monterey cheese Steak 17.95 Cilantro cabbage slaw, chipotle mayo, pickled onions, queso fresco Crispy Shrimp 16.95 Jicama slaw, chipotle mayo, tomatoes, pickled onions, scallions, queso fresco Sandwiches Served with french fries American Burger* 12.95 Lettuce, tomato, red onions, pickles and Duke's® mayo Veggie Burger 13.95 Beyond Burger,® sweet soy, Duke's® mayo, monterey jack cheese, lettuce, pickle, tomato and red onions Spicy Chicken 14.95 Crispy fried chicken, american cheese, jicama slaw, pickles, chipotle mayo Chicken 13.95 Broiled, topped with jack cheese, bacon, arugula, tomato and honey mustard Club 13.95 Thinly sliced turkey, ham, bacon, cheddar and monterey jack cheeses, lettuce, tomato and mayo on toasted sourdough Crispy Atlantic Flounder 15.95 Texas toast, dill and fried caper mayonnaise, pickles, shredded lettuce and red onion Sides French Fries 4.95 Seasonal Veggie 4.95 Mashed Potatoes 4.95 Creamy Cole Slaw 4.95 Baked Potato 5.95 after 4pm Desserts Chocolate Brownie 8.95 Apple Walnut Cobbler 8.95 Croissant Bread Pudding 8.95 Cheesecake 8.95 seasonal topping *Denotes Cooked to Order | Consuming Raw or Undercooked Meats, Poultry, Seafood, Shellfish or Eggs May Increase Your Risk of Foodbourne Illness Especially if You Have Certain Medical Conditions. Gluten Free / Prepared in A Fryer with Wheat Ingredients Disclaimer: Pricing and availability subject to change. DRINK Margaritas Pouring: Lunazul tequila Classic 10.95 Agave, lime Spiced Cranberry 10.95 White cranberry, cinnamon, lime, Cointreau Smoky Peach 10.95 Ilegal mezcal, peach, agave, lime Pineapple Jalapeño 10.95 Pineapple, jalapeño, lime, triple sec Cocktails Barrel-Aged Old Fashioned 13.95 Elijah Craig Small Batch bourbon Dreamsicle #3 10.95 Evan Williams bourbon, Licor 43, vanilla, orange juice Spritz-Mas 9.95 Aperol, cranberry, lemon, prosecco Harvest Ember 10.95 Evan Williams bourbon, apple butter, lemon, spiced honey, apple wood smoke Martinis Toasted Marshmallow 11.95 Hoodoo Espresso vodka, toasted marshmallow infusion Sugar Cookie 11.95 Baileys, Absolut Vanilla vodka, di Amore amaretto Strawberry Rose 12.95 Tito's vodka, rose essence, Chambord, strawberry Dirty 13.95 Grey Goose vodka, olive brine, Dolin dry vermouth Frozen Drinks $10.95 Cali Crush Parrot Bay Coconut rum, blue curacao, pineapple, house sour Irish Coffee Jameson whiskey, Kahlua, cream, whipped cream Zero Proof Coconut Faux-Jito 9.95 Non-Alcoholic, Seedlip Spice 94, Coco Lopez, pineapple, lime, mint Pineapple Spritz 9.95 Non-Alcoholic, Seedlip Grove 42, pineapple, lime, grenadine, cherry Spirits Bourbon / Whiskey Angel Envy 13.95 Basil Hayden 12.95 Blade and Bow 12.95 Blanton's 18.95 Buffalo Trace 10.95 Eagle Rare 16.95 George Dickle 10.95 Jack Daniel's Single Barrel 10.95 Knob Creek 10.95 Makers Mark 10.95 Old Forrester 10.95 WhistlePig 6 Yr 13.95 Wild Turkey 101 10.95 Woodford Reserve Double Oaked 13.95 Tequila Casamigos Anejo 14.95 Casamigos Blanco 12.95 Don Fulano Blanco 14.95 Don Julio Blanco 9.95 Espolon Blanco 9.95 Lalo Blanco 13.95 Mi Campo Reposado 12.95 Patron Silver 12.95 Beer On Tap Blue Moon 6.95 Fairhope 6.95 Miller Lite 5.95 Modelo Draft 6.95 Yuengling 6.25 Bottles / Cans Angry Orchard 5.95 Athletic N/A 5.95 Braided River Coastal Stout 6.95 Bud Light 4.95 Budweiser 4.95 Coors Light 4.95 Corona 5.95 Guinness 5.95 Heineken 5.95 Michelob Ultra 5.25 Miller Lite 4.95 Modelo Especial 5.95 New Castle 5.95 Nutrl Seltzer 5.95 Stella Artois 5.95 Disclaimer: Pricing and availability subject to change. WINE Whites Champagne, Moet & Chandon Imperial, France 90.00 Chardonnay, EOS, California 9.95 Moscato, Seven Daughters, Italy 7.95 Pinot Grigio, Lunardi, Italy 7.95 Prosecco, Riondo Prego Nero, Italy 9.95 Riesling, Loosen Bros. \"Dr L\" Mosel, Germany 7.95 Rosé, Charles Smith Band of Roses, California 7.95 Sauvignon Blanc, Jax, California 10.95 Sparkling Wine, Poema, Cava 7.95 Reds Cabernet Sauvignon, Firestone, Paso Robles 9.95 Cabernet Sauvignon, Oberon, Napa Valley 55.00 Cabernet Sauvignon, Quilt, Napa Valley 65.00 Merlot, Leese-Fitch, California 8.95 Pinot Noir, Elouan, Oregon 8.95 Pinot Noir, Fowles Wines, Australia 11.95 Pinot Noir, Belle Glos, Santa Lucia 65.00 Pinot Noir Rosé, Villa Wolf, Pfalz, Germany 7.95 Red Blend, Daou 'Pessimist', Paso Robles 11.95 Red Blend, Fess Parker, Santa Barbara 65.00 Red Zinfandel, Freakshow, Lodi 9.95 Disclaimer: Pricing and availability subject to change. KIDS Kids Menu Served with fries and a beverage. Chicken Strips 6.95 Cheeseburger 6.95 Fried Shrimp 6.95 Chicken Wings 6.95 Grilled Cheese 6.95 Fettuccine Alfredo 6.95 (no side) Disclaimer: Pricing and availability subject to change. DESSERT Desserts Chocolate Brownie 8.95 Apple Walnut Cobbler 8.95 Croissant Bread Pudding 8.95 Cheesecake 9.95 seasonal topping Disclaimer: Pricing and availability subject to change. See More Menus Menu | Reserve Augusta, GA Charleston, SC Columbia, SC Greenville, SC Spanish Fort, AL Surfside Beach, SC Sign Up For Mailing List Select your favorite location Contact Contact Catering CentraArchy Restaurants Join Our Team Gift Cards Sitemap © 2026 CentraArchy Restaurants. All Rights Reserved.",
      "hash": "8fa27ce32765",
      "downloadedAt": "2026-01-18T17:02:06.962Z",
      "trimmedAt": "2026-01-18T17:12:04.474Z",
      "sizeReduction": "91.8%"
    },
    {
      "url": "https://californiadreaming.rest/location/Surfside-Beach-SC/",
      "text": "Locations + Menus Alabama Spanish Fort Georgia Augusta South Carolina Charleston Columbia Greenville Surside Beach Reserve Menu Order Online Order Online Home Happenings Gift Cards Order Online Contact Locations + Menus Alabama Spanish Fort Georgia Augusta South Carolina Charleston Columbia Greenville Surside Beach Reserve Menu Order Online Order Online Home Happenings Gift Cards Order Online Contact Surfside Beach, SC Joining the Myrtle Beach-area food scene in 2004, California Dreaming’s spacious, wide-open eatery in Surfside, SC has that winning combination of spirited, seaside atmosphere and comforting, hearty food. The American classics influenced menu – with fresh ingredients, is the restaurant anyone could love, from a family vacation spot to cozy date-night. Open for lunch and dinner with patio dining and convenient online ordering. To ensure the best experience for all guests, we seat groups of up to 8. While larger groups are seated separately, this arrangement is flexible during quieter hours. 2657 Beaver Run Blvd Surfside Beach, SC 29575 Directions 843.215.5255 Order Now Reserve Hours Open Today Sunday 11am-9pm Open Today - Sunday 11am-9pm Monday 11am-9pm Tuesday 11am-9pm Wednesday 11am-9pm Thursday 11am-9pm Friday 11am-9pm Saturday 11am-9pm | Catering Curbside to-go facebook instagram DINE DINE | DRINK | WINE | DESSERT | KIDS DINE Apps She Crab Soup 8.95 A rich and creamy Charleston classic Steamed Peel & Eat Shrimp 11.95 (9) Old Bay boil, served with cocktail sauce Nashville Hot Wings 14.95 Marinated in hot pepper sauce, fried crispy, with bleu cheese dip Chicken Tenders 12.95 Served with house-made honey BBQ sauce Baked Potato Soup 7.95 Creamy soup, scallions, cheese, ham, bacon Chili 8.95 Topped with cheese, scallions and sour cream, served with corn tortilla chips Our Famous Croissants (5) 6.95 Topped with honey-butter Nachos house-made chips Traditional 11.95 Chili, cheese, tomatoes, jalapenos, sour cream BBQ Chicken 14.95 Smoky BBQ sauce, red onions, cheese sauce Seafood 16.95 Spicy shrimp, salmon, red onions, cheese sauce and lobster cream sauce with dill Entrees Add a house or caesar salad +$4.95 Cali Bowl Warm sushi rice, avocado, jalapenos, sesame seeds, mango, scallions, jicama slaw, pickled red onions, chipotle mayo. Choice of: Tuna Poke* 16.95 Miso Salmon 17.95 Steak 17.95 Fried Chicken 14.95 Chicken Tenders Platter 17.95 Fried chicken tenderloins, served with house-made honey BBQ sauce and french fries Blackened Chicken Pasta 17.95 Alfredo, scallions, tomatoes, with romano cheese Knob Hill Chicken 19.95 Topped with ham and monterey jack cheese, with side item Seafood Favorites Add a house or caesar salad +$4.95 Shrimp San Francisco 17.95 Mushrooms, garlic cream, white wine, served over pasta, topped with romano cheese Roasted Salmon 24.95 Encrusted with rosemary and thyme, with side item Featured Fish Served with a side item A.Q. Fried Seafood Platters Fried Seafood Platters Served with french fries Shrimp 22.95 Oysters 24.95 Flounder 22.95 All Three 27.95 Salads California Dreaming 14.95 Mixed greens, ham and turkey, cheddar and monterey jack cheeses, egg, tomatoes, almonds topped with warm ham and bacon, house dressing Roasted Salmon or Chicken Mixed greens, bacon, egg, avocado, tomatoes, balsamic vinaigrette Salmon 16.95 Chicken 14.95 Caesar Crisp romaine, grated romano cheese, croutons Chicken or Fried Shrimp 14.95 Fried Oysters 16.95 Chicken Club 15.95 Mixed greens, fried chicken strips, avocado, bacon, egg, tomatoes, house-made ranch dressing Steaks, Chops + Ribs Aged USDA Choice | Served with a house or caesar salad and side item. Add broiled or fried shrimp to any steak +$6.95 Country Fried Pork Chops 20.95 Two pork chops fried crispy Marinated Sirloin* 26.95 10oz. sirloin marinated in fruit juices, garlic, soy sauce and spices Steak + Shrimp* 26.95 Two 3oz. filet medallions, crispy fried shrimp Ribeye* 36.95 14oz. hand cut Filet Mignon* 38.95 8oz. barrel cut Baby Back Ribs Danish full-flavored ribs, grilled with a charred exterior, basted with BBQ sauce, with side item One Rack 20.95 Two Racks 28.95 Tacos (3) Served with side item Chicken 14.95 Shredded lettuce, chipotle & cilantro mayo, pico de gallo, Monterey cheese Steak 17.95 Cilantro cabbage slaw, chipotle mayo, pickled onions, queso fresco Crispy Shrimp 15.95 Jicama slaw, chipotle mayo, tomatoes, pickled onions, scallions, queso fresco Sandwiches Served with french fries American Burger* 12.95 Lettuce, tomato, red onions, pickles and Duke's® mayo Veggie Burger 13.95 House-made, with pepper jack cheese, avocado, lettuce, tomato, BBQ molasses sauce, mayo and mustard Spicy Chicken 14.95 Crispy fried chicken, american cheese, jicama slaw, pickles, chipotle mayo Club 12.95 Thinly sliced turkey, ham, bacon, cheddar and monterey jack cheeses, lettuce, tomato and mayo on toasted sourdough Chicken 13.95 Broiled, topped with jack cheese, bacon, shredded lettuce, tomato and honey mustard Sides French Fries 4.95 Seasonal Veggie 4.95 Cole Slaw 4.95 Mashed Potatoes 4.95 Baked Potato 5.95 after 4pm Desserts Chocolate Brownie 8.95 Apple Walnut Cobbler 8.95 Croissant Bread Pudding 8.95 Cheesecake 9.95 seasonal topping *Denotes cooked to order | Gluten Free/Prepared in a fryer with wheat ingredients | Consuming raw or undercooked meats, poultry, seafood, shellfish or eggs may increase your risk of foodbourne illness especially if you have certain medical conditions Disclaimer: Pricing and availability subject to change. DRINK Cocktails Barrel-Aged Old Fashioned 13.95 Elijah Craig Small Batch bourbon Dreamsicle #3 10.95 Evan Williams bourbon, Licor 43, vanilla, orange juice Spritz-Mas 9.95 Aperol, cranberry, lemon, prosecco Harvest Ember 10.95 Evan Williams bourbon, apple butter, lemon, spiced honey, apple wood smoke Margaritas Pouring: Lunazul tequila Classic 10.95 Agave, lime Spiced Cranberry 10.95 White cranberry, cinnamon, lime, Cointreau Smoky Peach 10.95 Ilegal mezcal, peach, agave, lime Pineapple Jalapeño 10.95 Pineapple, jalapeño, lime, triple sec Martinis Toasted Marshmallow 11.95 Hoodoo Espresso vodka, toasted marshmallow infusion Sugar Cookie 11.95 Baileys, Absolut Vanilla vodka, di Amore amaretto Strawberry Rose 12.95 Tito's vodka, rose essence, Chambord, strawberry Dirty 13.95 Grey Goose vodka, olive brine, Dolin dry vermouth Frozen Drinks $10.95 Cali Crush Parrot Bay Coconut rum, blue curacao, pineapple, house sour Irish Coffee Jameson whiskey, Kahlua, cream, whipped cream Zero Proof Coconut Faux-Jito 9.95 Non-Alcoholic, Seedlip Spice 94, Coco Lopez, pineapple, lime, mint Pineapple Spritz 9.95 Non-Alcoholic, Seedlip Grove 42, pineapple, lime, grenadine, cherry Spirits Bourbon / Whiskey Baby Jane 14.95 Buffalo Trace 9.95 Bulleit Rye 8.95 Eagle Rare 10yr 15.95 Elijah Craig Toasted Barrel 8.95 Four Roses 8.95 Henry Mckenna 12.95 High West Double Rye 12.95 Jefferson's Ocean 15.95 Michter's Rye 12.95 Penelope Architect 15.95 Redwood Empire Emerald Giant Rye 12.95 Whistlepig Piggyback 16.95 Woodford Reserve 9.95 Tequila Casamigos Reposado 13.95 Don Julio 1942 Añejo 26.95 Don Julio Blanco 9.95 Espolon Blanco 9.95 G4 Blanco 14.95 Herradura Reposado 12.95 Lalo Blanco 13.95 Partida Añejo 14.95 Beer On Tap Blue Moon 6.95 Grand Strand Brewing Co 6.95 Michelob Ultra 5.95 Miller Light 5.95 Tidal Creek Brewhouse 6.95 Stella Artois 6.95 Bottles / Cans Austin Eastciders 5.95 Bud / Bud Light 4.95 Coors Light 4.95 Corona 5.95 Corona Premier 5.95 New South Nut Brown Ale 5.95 New South White Ale 5.95 Voodoo Ranger IPA 5.95 Disclaimer: Pricing and availability subject to change. WINE Whites Chardonnay, EOS, California 7.95 Chardonnay, Diora, Monterey 9.95 Chardonnay, Buehler, Russian River 11.95 Chardonnay, Frank Family, Carneros, California 55.00 Moscato, Seven Daughters, Italy 8.95 Moscato Rosé, Risata, Italy 7.95 Pinot Grigio, Lunardi, Italy 7.95 Prosecco, Riondo, Italy 8.95 Riesling, Loosen Bros. \"Dr L\" Mosel, Germany 7.95 Sauvignon Blanc, Wairau River, New Zealand 8.95 Sauvignon Blanc, Jax, California 10.95 Sparkling Wine, Poema, Cava 7.95 Reds Cabernet Sauvignon, Firestone, Paso Robles 7.95 Cabernet Sauvignon, Leese-Fitch, California 8.95 Cabernet Sauvignon, The Federalist, California 11.95 Cabernet Sauvignon, Lake Sonoma, California 49.00 Malbec, Alta Vista \"Vive\", Argentina 7.95 Merlot, Spellbound, California 8.95 Pinot Noir, Elouan, Oregon 9.95 Pinot Noir, Fowles Wine, Australia 11.95 Pinot Noir Rosé, Villa Wolf, Pfalz, Germany 7.95 Red Blend, Clos de los Siete, Argentina 9.95 Red Blend, Conundrum, California 42.00 Red Zinfandel, Seghesio Family Vineyards, California 10.95 Disclaimer: Pricing and availability subject to change. DESSERT Desserts Chocolate Brownie 8.95 Topped with a Hershey's bar, served with vanilla ice cream. Apple Walnut Cobbler 8.95 Served hot with vanilla ice cream. Croissant Bread Pudding 8.95 Warm croissants, raisins and creme anglaise, with vanilla ice cream and rum sauce. New York Cheesecake 9.95 seasonal topping Disclaimer: Pricing and availability subject to change. KIDS Kids Menu Served with fries and a beverage. Chicken Strips 6.95 Cheeseburger 6.95 Fried Shrimp 6.95 Chicken Wings 6.95 Grilled Cheese 6.95 Fettuccine Alfredo 6.95 (no side) Disclaimer: Pricing and availability subject to change. See More Menus Menu | Reserve Augusta, GA Charleston, SC Columbia, SC Greenville, SC Spanish Fort, AL Surfside Beach, SC Sign Up For Mailing List Select your favorite location Contact Contact Catering CentraArchy Restaurants Join Our Team Gift Cards Sitemap © 2026 CentraArchy Restaurants. All Rights Reserved.",
      "hash": "a8d6dbd72ff2",
      "downloadedAt": "2026-01-18T17:02:10.035Z",
      "trimmedAt": "2026-01-18T17:12:04.538Z",
      "sizeReduction": "91.5%"
    },
    {
      "url": "https://californiadreaming.rest/location/Columbia-SC/",
      "text": "Locations + Menus Alabama Spanish Fort Georgia Augusta South Carolina Charleston Columbia Greenville Surside Beach Reserve Menu Order Online Order Online Home Happenings Gift Cards Order Online Contact Locations + Menus Alabama Spanish Fort Georgia Augusta South Carolina Charleston Columbia Greenville Surside Beach Reserve Menu Order Online Order Online Home Happenings Gift Cards Order Online Contact Columbia, SC Located in downtown Columbia, SC, inside the historic 1902 Union Station, California Dreaming welcomes guests with its vibrant and inviting atmosphere. The restaurant's floor-to-ceiling windows offer a picturesque view of the rail tracks, stretching from the inactive platform to the main terminal. Paired with our hearty, made-from-scratch menu, it's no wonder California Dreaming has been a beloved local institution since 1984. Open for lunch and dinner daily, including online ordering with curbside pickup. Celebrating 40 years, California Dreaming has been a valued part of the Columbia community. Union Station, its historic home, was added to the National Register of Historic Places in 1973. Please note that we provide Advance Priority Seating to reduce wait times and expedite the seating process when your entire party arrives. To ensure the best experience for all guests, we seat groups of up to 8. While larger groups are seated separately, this arrangement is flexible during quieter hours. 401 South Main St. Columbia, SC 29201 Directions 803.254.6767 Order Now Reserve Hours Open Today Sunday 11am-9pm Open Today - Sunday 11am-9pm Monday 11am-9pm Tuesday 11am-9pm Wednesday 11am-9pm Thursday 11am-9pm Friday 11am-10pm Saturday 11am-10pm | Catering Curbside to-go facebook instagram DINE DINE | DRINK | WINE | KIDS | DESSERT DINE Apps She Crab Soup 9.95 A rich and creamy Charleston classic Steamed Peel & Eat Shrimp 10.95 (9) Old Bay boil, served with cocktail sauce Fried Crab Claws 16.95 Served with spicy cocktail sauce. Llimited availability BBQ Chicken Nachos 15.95 Smoky BBQ sauce, red onions, house-made chips, cheese sauce Seafood Nachos 17.95 Spicy shrimp, salmon, red onions, house-made chips, cheese sauce and lobster cream sauce with dill Nashville Hot Wings 15.95 Marinated in hot pepper sauce, fried crispy, with bleu cheese dip Our Famous Croissants (5) 6.95 Topped with honey-butter Baked Potato Soup 7.95 Creamy soup, scallions, cheese, ham, bacon Entrees Cali Bowl Warm sushi rice, avocado, jalapenos, sesame seeds, mango, scallions, jicama slaw, pickled red onions, chipotle mayo. Choice of: Tuna Poke 17.95 Miso Salmon 18.95 Steak 18.95 Fried Chicken 15.95 Chicken Tenders Platter 17.95 Fried chicken tenderloins, served with house-made honey BBQ sauce and french fries Blackened Chicken Pasta 17.95 Alfredo, scallions, tomatoes, with romano cheese Knob Hill Chicken 18.95 Topped with ham and monterey jack cheese, with side item Seafood Favorites Miso Salmon 24.95 Miso glazed, sweet soy, with side Shrimp San Francisco 17.95 Mushrooms, garlic cream, white wine, served over pasta, topped with romano cheese Carolina Trout 24.95 Grilled with arugula and lemon Fried Seafood Platters Shrimp 20.95 Oysters 24.95 Flounder 20.95 All Three 26.95 Served with french fries Salads California Dreaming 14.95 Mixed greens, ham and turkey, cheddar and monterey jack cheeses, egg, tomatoes, almonds topped with warm ham and bacon, house dressing Roasted Salmon or Chicken Mixed greens, bacon, egg, avocado, tomatoes, balsamic vinaigrette Salmon 16.95 Chicken 15.95 Caesar Crisp romaine, grated romano cheese, croutons Chicken or Fried Shrimp 14.95 Fried Oysters 17.95 Chicken Club 15.95 Mixed greens, fried chicken strips, avocado, bacon, egg, tomatoes, house-made ranch dressing Steaks, Chops + Ribs Aged USDA Choice | Served with a house or caesar salad and side item Pork Chop 26.95 16oz. double bone, frenched chop, peach jalapeno jam Marinated Sirloin 26.95 10oz. sirloin marinated in fruit juices, garlic, soy sauce and spices Steak + Shrimp 26.95 Two 3oz. filet medallions, crispy fried shrimp Ribeye 37.95 14oz. hand cut Filet Mignon 39.95 8oz. barrel cut Baby Back Ribs Danish full-flavored ribs, grilled with a charred exterior, basted with BBQ sauce, with side item One Rack 21.95 Two Racks 29.95 Tacos (3) Served with side item Chicken 15.95 Shredded lettuce, chipotle & cilantro mayo, pico de gallo, Monterey cheese Steak 17.95 Cilantro cabbage slaw, chipotle mayo, pickled onions, queso fresco Crispy Shrimp 16.95 Jicama slaw, chipotle mayo, tomatoes, pickled onions, scallions, queso fresco Sandwiches Served with french fries American Burger 12.95 Lettuce, tomato, red onions, pickles and Duke's® mayo Veggie Burger 13.95 House-made, pepper jack, avocado, lettuce, tomato, BBQ molasses sauce, mayo and mustard Club 13.95 Thinly sliced turkey, ham, bacon, cheddar and monterey jack cheeses, lettuce, tomato and mayo on toasted sourdough Spicy Chicken 14.95 Crispy fried chicken, american cheese, jicama slaw, pickles, chipotle mayo Chicken 14.95 Broiled, topped with jack cheese, bacon, arugula, tomato and honey mustard Sides French Fries 5.95 Seasonal Veggie 5.95 Mashed Potatoes 5.95 Creamy Cole Slaw 5.95 Baked Potato 6.95 after 4pm Desserts Chocolate Brownie 8.95 Apple Walnut Cobbler 8.95 Croissant Bread Pudding 9.95 Cheesecake 9.95 seasonal topping Disclaimer: Pricing and availability subject to change. DRINK Margaritas Pouring: Lunazul tequila Classic 10.95 Agave, lime Spiced Cranberry 10.95 White cranberry, cinnamon, lime, Cointreau Smoky Peach 10.95 Ilegal mezcal, peach, agave, lime Pineapple Jalapeño 10.95 Pineapple, jalapeño, lime, triple sec Cocktails Barrel-Aged Old Fashioned 13.95 Elijah Craig Small Batch bourbon Dreamsicle #3 10.95 Evan Williams bourbon, Licor 43, vanilla, orange juice Spritz-mas 9.95 Aperol, cranberry, lemon, prosecco Harvest Ember 10.95 Evan Williams bourbon, apple butter, lemon, spiced honey, apple wood smoke Martinis Toasted Marshmallow 11.95 Hoodoo Espresso vodka, toasted marshmallow infusion Sugar Cookie 11.95 Baileys, Absolut Vanilla vodka, di Amore amaretto Strawberry Rose 12.95 Tito's vodka, rose essence, Chambord, strawberry Dirty 13.95 Grey Goose vodka, olive brine, Dolin dry vermouth Frozen Drinks $10.95 Cali Crush Parrot Bay Coconut rum, blue curacao, pineapple, house sour Irish Coffee Jameson whiskey, Kahlua, cream, whipped cream Zero Proof Coconut Faux-Jito 9.95 Non-Alcoholic, Seedlip Spice 94, Coco Lopez, pineapple, lime, mint Pineapple Spritz 9.95 Non-Alcoholic, Seedlip Grove 42, pineapple, lime, grenadine, cherry Spirits Bourbon / Whiskey Booker's Rye 18.95 Buffalo Trace 11.95 Bulleit Rye 10.95 Elijah Craig Toasted Barrel 10.95 Four Roses Small Batch 9.95 Henry McKenna 11.95 Jack Daniel's Bonded 11.95 Jefferson's Ocean 15.95 Knob Creek 10.95 Michter's Rye 10.95 Old Forester 1920 15.95 Penelope Toasted 14.95 Pikesville Rye 14.95 WhistlePig 10 Yr 21.95 Wild Turkey Longbranch 11.95 Woodford Reserve Double Oaked 12.95 Tequila Casamigos Blanco 13.95 Don Julio Silver 10.95 El Tesoro Anejo 14.95 Espolon Blanco 10.95 Gran Centenario Cristalino 24.95 Herradura Reposado 13.95 Lalo Blanco 11.95 Ocho Plata Reposado 13.95 Beer On Tap Blue Moon 6.25 Columbia Craft 6.25 Coors Banquet 5.95 Highland 6.95 Leinenkugel 6.25 Michelob Ultra 5.95 Sierra Nevada 6.95 Terrapin 6.25 Wicked Weed 6.25 Yuengling 6.25 Bottles / Cans Athletic N/A 5.95 Austin Eastciders 6.95 Bud Light 4.95 Coors Light 4.95 Corona 4.95 Heineken 5.95 High Noon 7.25 High Rise Pineapple THC Seltzer 8.95 Miller Lite 4.95 Modelo 5.95 Not Beer Sparkling Water 5.95 Disclaimer: Pricing and availability subject to change. WINE Whites Chardonnay, EOS, California 7.95 Chardonnay, Diora, Monterey 9.95 Chardonnay, Buehler, Russian River 11.95 Chardonnay, Frank Family, Carneros, California 55.00 Moscato, Seven Daughters, Italy 8.95 Moscato Rosé, Risata, Italy 7.95 Pinot Grigio, Lunardi, Italy 7.95 Prosecco, Riondo, Italy 8.95 Riesling, Loosen Bros. \"Dr L\" Mosel, Germany 7.95 Sauvignon Blanc, Wairau River, New Zealand 8.95 Sauvignon Blanc, Jax, California 10.95 Sparkling Wine, Poema, Cava 7.95 Reds Cabernet Sauvignon, Firestone, Paso Robles 7.95 Cabernet Sauvignon, Leese-Fitch, California 8.95 Cabernet Sauvignon, The Federalist, California 11.95 Cabernet Sauvignon, Lake Sonoma, California 49.00 Malbec, Alta Vista \"Vive\", Argentina 7.95 Merlot, Spellbound, California 8.95 Pinot Noir, Elouan, Oregon 9.95 Pinot Noir, Fowles Wine, Australia 11.95 Pinot Noir Rosé, Villa Wolf, Pfalz, Germany 7.95 Red Blend, Clos de los Siete, Argentina 9.95 Red Blend, Conundrum, California 42.00 Red Zinfandel, Seghesio Family Vineyards, California 10.95 Disclaimer: Pricing and availability subject to change. KIDS Kids Menu Served with fries and a beverage. Chicken Strips 6.95 Cheeseburger 6.95 Fried Shrimp 6.95 Chicken Wings 6.95 Grilled Cheese 6.95 Fettuccine Alfredo 6.95 (no side) Disclaimer: Pricing and availability subject to change. DESSERT Desserts Chocolate Brownie 8.95 Apple Walnut Cobbler 8.95 Croissant Bread Pudding 9.95 Cheesecake 9.95 seasonal topping Disclaimer: Pricing and availability subject to change. See More Menus Menu | Reserve Augusta, GA Charleston, SC Columbia, SC Greenville, SC Spanish Fort, AL Surfside Beach, SC Sign Up For Mailing List Select your favorite location Contact Contact Catering CentraArchy Restaurants Join Our Team Gift Cards Sitemap © 2026 CentraArchy Restaurants. All Rights Reserved.",
      "hash": "cbc449480466",
      "downloadedAt": "2026-01-18T17:02:08.497Z",
      "trimmedAt": "2026-01-18T17:12:04.603Z",
      "sizeReduction": "91.7%"
    },
    {
      "url": "https://californiadreaming.rest/location/Charleston-SC/",
      "text": "Locations + Menus Alabama Spanish Fort Georgia Augusta South Carolina Charleston Columbia Greenville Surside Beach Reserve Menu Order Online Order Online Home Happenings Gift Cards Order Online Contact Locations + Menus Alabama Spanish Fort Georgia Augusta South Carolina Charleston Columbia Greenville Surside Beach Reserve Menu Order Online Order Online Home Happenings Gift Cards Order Online Contact Charleston, SC Since 1987, California Dreaming has been a proud part of the Charleston, SC community. Our spacious, open setting features floor-to-ceiling windows that offer stunning views of the Ashley River, creating the perfect backdrop for a lively night out. You can also enjoy these panoramic views from our wrap-around deck, complete with a bar and easily accessible by boat. Whether you're craving low country favorites or our famous prime rib, California Dreaming is a favorite among both locals and tourists. Please note that we provide Advance Priority Seating to reduce wait times and expedite the seating process when your entire party arrives. To ensure the best experience for all guests, we seat groups of up to 6. While larger groups are seated separately, this arrangement is flexible during quieter hours. 1 Ashley Point Dr Charleston, SC 29407 Directions 843.766.1644 Order Now Reserve Hours Open Today Sunday 11am-9pm Open Today - Sunday 11am-9pm Monday 4pm-9pm Tuesday 4pm-9pm Wednesday 4pm-9pm Thursday 4pm-9pm Friday 4pm-10pm Saturday 11am-10pm | Catering Curbside to-go facebook instagram DINE DINE | DRINK | WINE | KIDS | DESSERT | ASHLEY PATIO DINE Apps She Crab Soup 9.95 A rich and creamy Charleston classic Steamed Peel & Eat Shrimp Old Bay boil, served with cocktail sauce 1/2lb 13.95 Fried Crab Claws 17.95 Served with spicy cocktail sauce. Limited availability Seafood Nachos 18.95 Spicy shrimp, salmon, red onions, house-made chips, cheese sauce and lobster cream sauce with dill Creamed Spinach Nachos 13.95 with house-made chips Calamari 16.95 Lightly breaded, with marinara Oysters Rockefeller (4) 17.95 Spinach, romano, bacon Nashville Hot Wings 15.95 Marinated in hot pepper sauce, fried crispy, with bleu cheese dip Chicken Tenders 13.95 Served with house-made honey BBQ sauce. cheese dip Our Famous Croissants (5) 7.95 Topped with honey-butter Baked Potato Soup 8.95 Creamy soup topped with scallions, cheese, ham and bacon Entrees The Ashley 24.95 Broiled chicken breast, blackened shrimp, lobster cream sauce, served with a side Roasted Salmon 27.95 Encrusted with rosemary and thyme, served with mashed potatoes and seasonal veggie Blackened Chicken Pasta 19.95 Alfredo, scallions, tomatoes, with romano cheese Chicken Tenders Platter 19.95 Fried chicken tenderloins, served with house-made honey BBQ sauce and french fries Crispy Shrimp Tacos (3) 17.95 Jicama slaw, chipotle mayo, tomatoes, pickled onions, scallions, queso fresco Low Country Favorites Add a house or caesar salad +$5.95 Firecracker Tuna* 32.95 Thai glaze, served with mashed potatoes and seasonal veggie Crab Cakes 34.95 Jumbo lump, mustard sauce, served with mashed potatoes and seasonal veggie Featured Fish Served with a side item A.Q. Charleston Seafood Pasta 24.95 Sautéed shrimp, mussels, garlic cream, white wine, romano Shrimp + Grits 23.95 Jumbo shrimp, andouille sausage, Adluh Mills grits Fried Seafood Platters Fried Seafood Platters Served with french fries Shrimp 21.95 Oysters 25.95 Flounder 23.95 All Three 28.95 Salads California Dreaming 15.95 Mixed greens, ham and turkey, cheddar and monterey jack cheeses, egg, tomatoes, almonds topped with warm ham and bacon, house dressing Roasted Salmon or Chicken Mixed greens, bacon, egg, avocado, tomatoes, balsamic vinaigrette Roasted Salmon 18.95 Chicken 16.95 Caesar Crisp romaine with grated romano cheese and croutons Chicken or Fried Shrimp 15.95 Fried Oysters 17.95 Steaks, Chops + Ribs Aged USDA Choice | Served with a house or caesar salad and side item. Add broiled or fried shrimp to any steak +$7.95 Pork Chop 26.95 16oz. double bone, frenched chop, peach jalapeno jam New York Strip* 39.95 14oz. center cut, garlic butter Surf + Turf* 34.95 10oz. ribeye topped with grilled garlic shrimp Ribeye* 39.95 14oz. hand cut with cajun butter Filet Mignon* 40.95 8oz. barrel cut Marinated Sirloin* 28.95 10oz. sirloin marinated in fruit juices, garlic, soy sauce and spices Baby Back Ribs Danish full-flavored ribs, grilled with a charred exterior, basted with BBQ sauce, with side item One Rack 23.95 Two Racks 31.95 Sandwiches & Burgers Served with french fries Spicy Chicken Sandwich 16.95 Crispy fried chicken, american cheese, jicama slaw, pickles, chipotle mayo New Orleans Po'boy Lettuce, tomato and tartar sauce on french bread Fried Shrimp 16.95 Fried Oysters 18.95 Steak Burger* 17.95 10 oz., shredded lettuce, pickles, red onion, tomato, cheddar cheese, our signature sauce Blackened Mahi Sandwich 17.95 Toasted brioche, lemon, arugula, ripe tomato, curry mayonnaise, homemade pickles Sides French Fries 5.95 Seasonal Veggie 5.95 Cole Slaw 5.95 Mashed Potatoes 5.95 Creamed Spinach 5.95 Baked Potato 6.95 after 4pm Desserts Chocolate Brownie 9.95 Apple Walnut Cobbler 9.95 Croissant Bread Pudding 9.95 Cheesecake 9.95 Seasonal Topping Gluten free - prepared in a fryer with wheat ingredients. *Denotes cooked to order | consuming raw or undercooked meats, poultry, seafood, shellfish or eggs may increase your risk of foodbourne illness especially if you have certain medical conditions Disclaimer: Pricing and availability subject to change. DRINK Cocktails Barrel-Aged Old Fashioned 14.95 Maker's Mark 'Living the Dream,' bitters, sugar Dreamsicle #3 10.95 Evan Williams bourbon, Licor 43, vanilla, orange juice Spritz-Mas 9.95 Aperol, cranberry, lemon, prosecco Harvest Ember 10.95 Evan Williams bourbon, apple butter, lemon, spiced honey, apple wood smoke Margaritas Pouring: Jose Cuervo Tradicional Classic 10.95 Agave, lime Spiced Cranberry 10.95 White cranberry, cinnamon, lime, Cointreau Smoky Peach 10.95 Ilegal mezcal, peach, agave, lime Pineapple Jalapeño 10.95 Pineapple, jalapeño, lime, triple sec Martinis Toasted Marshmallow 11.95 Hoodoo Espresso vodka, toasted marshmallow infusion Sugar Cookie 11.95 Baileys, Absolut Vanilla vodka, di Amore amaretto Strawberry Rose 12.95 Tito's vodka, rose essence, Chambord, strawberry Dirty 13.95 Grey Goose vodka, olive brine, Dolin dry vermouth Frozen Drinks Cali Crush 10.95 Parrot Bay Coconut rum, blue curacao, pineapple, house sour Irish Coffee 10.95 Jameson whiskey, Kahlua, cream, whipped cream Zero Proof Coconut Faux-Jito 9.95 Non-Alcoholic, Seedlip Spice 94, Coco Lopez, pineapple, lime, mint Pineapple Spritz 9.95 Non-Alcoholic, Seedlip Grove 42, pineapple, lime, grenadine, cherry Spirits Bourbon / Whiskey Ben Holladay 13.95 Bib & Tucker 10yr 15.95 High West High Country 16.95 Blanton's 18.95 Buffalo Trace 9.95 Bulleit Rye 8.95 Eagle Rare 10yr 15.95 Maker's Mark 'Living the Dream' 16.95 Michter's Rye 13.95 Old Forrester 1924 25.95 Old Pepper 11.95 Old Soul Tintype Series #1 19.95 Peerless Rye 19.95 Peg Leg Porker 9.95 Redwood Empire 12.95 Smoke Wagon 16.95 Traveller 13.95 Tequila 400 Conejos Mezcal 11.95 Casamigos Reposado 14.95 Don Julio Primavera 29.95 El Tesoro Añejo 13.95 Espolon Blanco 10.95 G4 Blanco 15.95 Herradura Legend 29.95 Lalo Blanco 12.95 Partida Añejo 15.95 Patron Roca Anejo 29.95 Tequila Ocho Plata 12.95 Beer On Tap Blue Moon 6.25 Creature Comforts 6.95 Edmund's Oast 7.95 Michelob Ultra 5.95 Miller Lite 5.95 Modelo Especial 6.25 Southern Hops Blackwater Porter 6.95 Bottles / Cans Austin Eastciders 6.95 Bud Light 5.25 Coors Light 5.25 Corona 5.25 Heineken 6.95 High Rise Pineapple THC Seltzer 9.95 PBR 3.95 Yuengling 5.95 White Claw 6.95 NA Athletic Upside Dawn 7.95 Disclaimer: Pricing and availability subject to change. WINE Whites Chardonnay, EOS, California 7.95 Chardonnay, Diora, Monterey 9.95 Chardonnay, Buehler, Russian River 11.95 Chardonnay, Frank Family, Carneros, California 55.00 Moscato, Seven Daughters, Italy 8.95 Moscato Rosé, Risata, Italy 7.95 Pinot Grigio, Lunardi, Italy 7.95 Prosecco, Riondo, Italy 8.95 Riesling, Loosen Bros. \"Dr L\" Mosel, Germany 7.95 Sauvignon Blanc, Wairau River, New Zealand 8.95 Sauvignon Blanc, Jax, California 10.95 Sparkling Wine, Poema, Cava 7.95 Reds Cabernet Sauvignon, Firestone, Paso Robles 7.95 Cabernet Sauvignon, Leese-Fitch, California 8.95 Cabernet Sauvignon, The Federalist, California 11.95 Cabernet Sauvignon, Lake Sonoma, California 49.00 Malbec, Alta Vista \"Vive\", Argentina 7.95 Merlot, Spellbound, California 8.95 Pinot Noir, Elouan, Oregon 9.95 Pinot Noir, Fowles Wine, Australia 11.95 Pinot Noir Rosé, Villa Wolf, Pfalz, Germany 7.95 Red Blend, Clos de los Siete, Argentina 9.95 Red Blend, Conundrum, California 42.00 Red Zinfandel, Seghesio Family Vineyards, California 10.95 Disclaimer: Pricing and availability subject to change. KIDS Kids Menu Served with fries and a beverage. Chicken Strips 6.95 Cheeseburger 6.95 Fried Shrimp 6.95 Chicken Wings 6.95 Grilled Cheese 6.95 Fettuccine Alfredo 6.95 (no side) Disclaimer: Pricing and availability subject to change. DESSERT Desserts $9.95 Chocolate Brownie Apple Walnut Cobbler Croissant Bread Pudding Cheesecake Disclaimer: Pricing and availability subject to change. ASHLEY PATIO Apps She Crab Soup 9.95 A rich and creamy Charleston classic Steamed Peel & Eat Shrimp Old Bay boil, served with cocktail sauce. GF 1/2 lb 13.95 Fried Crab Claws 17.95 Served with spicy cocktail sauce. Limited availability Calamari 16.95 Lightly breaded, with marinara Oysters Rockefeller (4) 17.95 Spinach, romano, bacon Nashville Hot Wings 15.95 Marinated in hot pepper sauce, fried crispy, with bleu cheese dip Our Famous Croissants (5) 7.95 Topped with honey-butter Baked Potato Soup 8.95 Creamy soup topped with scallions, cheese, ham and bacon Entrees Chicken Tenders Platter 19.95 Fried chicken tenderloins, served with house-made honey BBQ sauce and french fries Crispy Shrimp Tacos (3) 17.95 Jicama slaw, chipotle mayo, tomatoes, pickled onions, scallions, queso fresco Shrimp + Grits 23.95 Jumbo shrimp, andouille sausage, Adluh Mills grits Fried Seafood Platter 28.95 Shrimp, oysters, and flounder, served with french fries. Salads California Dreaming 15.95 Mixed greens, ham and turkey, cheddar and monterey jack cheeses, egg, tomatoes, almonds topped with warm ham and bacon, house dressing Roasted Salmon or Chicken Mixed greens, bacon, egg, avocado, tomatoes, balsamic vinaigrette Roasted Salmon 18.95 Chicken 16.95 Caesar Crisp romaine with grated romano cheese and croutons Chicken or Fried Shrimp 15.95 Fried Oysters 17.95 Steaks + Ribs Aged USDA Choice | Served with a house or caesar salad and side item. Rare - cold red center | Medium Rare - warm red center | Medium - hot red center | Medium Well - hot pink center | Well Done - brown center. Add broiled or fried shrimp to any steak +$7.95 Ribeye 39.95 14oz. hand cut with cajun butter. GF Filet Mignon 40.95 8oz. barrel cut. GF Marinated Sirloin 28.95 10oz. sirloin marinated in fruit juices, garlic, soy sauce and spices. GF Baby Back Ribs Danish full-flavored ribs, grilled with a charred exterior, basted with BBQ sauce, with side item. GF One Rack 23.95 Two Racks 31.95 Sandwiches & Burgers Served with french fries Spicy Chicken Sandwich 16.95 Crispy fried chicken, american cheese, jicama slaw, pickles, chipotle mayo Steak Burger* 17.95 10 oz., shredded lettuce, pickles, red onion, tomato, cheddar cheese, our signature sauce Blackened Mahi Sandwich 17.95 Toasted brioche, lemon, arugula, ripe tomato, curry mayonnaise, homemade pickles Sides French Fries 5.95 Seasonal Veggie 5.95 Mashed Potatoes 5.95 Creamy Cole Slaw 5.95 Baked Potato 6.95 (after 4pm) Desserts $9.95 Chocolate Brownie Apple Walnut Cobbler Croissant Bread Pudding Cheesecake Cocktails Cocktails Barrel-Aged Old Fashioned 13.95 Wild Turkey 101 Blueberry Gin Smash 11.95 Hat Trick gin, fresh blueberries, lemon, sugar Cider Rules 12.95 Skyy vodka, all spice, lemon, apple cider, spiced apple bitters Margaritas Pouring: Lunazul tequila Classic 10.95 Agave, lime Smoky Peach 10.95 Ilegal mezcal, peach, agave, lime Pineapple Jalapeño 10.95 Pineapple, jalapeño, lime, triple sec Frozen Drinks Cali Crush 10.95 Parrot Bay Coconut rum, blue curacao, pineapple, house sour Mojito 10.95 Bacardi rum, mint, lime, sugar Zero Proof Coconut Faux-Jito 9.95 Non-Alcoholic, Seedlip Spice 94, Coco Lopez, pineapple, lime, mint Pineapple Spritz 9.95 Non-Alcoholic, Seedlip Grove 42, pineapple, lime, grenadine, cherry Wine Whites Chardonnay, EOS, California 7.95 Pinot Grigio, Lunardi, Italy 7.95 Sauvignon Blanc, Wairau River, New Zealand 8.95 Reds Cabernet Sauvignon, Firestone, Paso Robles 7.95 Malbec, Alta Vista \"Vive\", Argentina 7.95 Pinot Noir, Elouan, Oregon 9.95 Beer On Tap Blue Moon 6.25 Creature Comforts 6.95 Michelob Ultra 5.95 Modelo Especial 6.25 Bottles / Cans Austin Eastciders 4.95 Bud Light 5.25 Coors Banquet 5.95 Coors Light 5.25 Corona 5.25 Miller High Life Pony 3.95 PBR 3.95 White Claw 6.95 NA Athletic Upside Dawn 4.95 Disclaimer: Pricing and availability subject to change. See More Menus Menu | Reserve Augusta, GA Charleston, SC Columbia, SC Greenville, SC Spanish Fort, AL Surfside Beach, SC Sign Up For Mailing List Select your favorite location Contact Contact Catering CentraArchy Restaurants Join Our Team Gift Cards Sitemap © 2026 CentraArchy Restaurants. All Rights Reserved.",
      "hash": "dcda54cf9180",
      "downloadedAt": "2026-01-18T17:02:05.295Z",
      "trimmedAt": "2026-01-18T17:12:04.721Z",
      "sizeReduction": "89.9%"
    },
    {
      "url": "https://californiadreaming.rest/happenings/",
      "text": "Locations + Menus Alabama Spanish Fort Georgia Augusta South Carolina Charleston Columbia Greenville Surside Beach Reserve Menu Order Online Order Online Home Happenings Gift Cards Order Online Contact Locations + Menus Alabama Spanish Fort Georgia Augusta South Carolina Charleston Columbia Greenville Surside Beach Reserve Menu Order Online Order Online Home Happenings Gift Cards Order Online Contact With Love from California Dreaming Celebrate Valentine’s Weekend with Love from California Dreaming Dine-in reservations recommended | To Go available : call: 706-760-8606 | : call: 843-766-1644 Augusta Reserve online, Charleston Reserve online, : call: 803-254-6767 | : call: 864-234-9000, Columbia Reserve online, Greenville Reserve online, : call: 843-215-5255 | : , call: 251-626-9942 Surfside Beach Reserve online, Spanish Fort Reserve online Game On 🍗 Jan. 17 – Feb. 8 Game Day Wings Available January 17 – February 8 Game on. 3 lbs. of crispy jumbo chicken wings, tossed your way with four bold flavor options:Nashville Hot | House Buffalo | Sweet Chili | Tijuana — our classic dry-rub favorite Choose any two flavors per order. Served with fresh celery, ranch, and blue cheese dip. Pro Tip: Available for pickup or dine-in. | | | | | Order ahead for easy pickup: Augusta Charleston Columbia Greenville Spanish Fort Surfside Previous Happenings Menu | Reserve Augusta, GA Charleston, SC Columbia, SC Greenville, SC Spanish Fort, AL Surfside Beach, SC Sign Up For Mailing List Select your favorite location Contact Contact Catering CentraArchy Restaurants Join Our Team Gift Cards Sitemap © 2026 CentraArchy Restaurants. All Rights Reserved.",
      "hash": "ed0ef679b3da",
      "downloadedAt": "2026-01-18T17:02:12.061Z",
      "trimmedAt": "2026-01-18T17:12:04.735Z",
      "sizeReduction": "97.4%"
    },
    {
      "url": "https://californiadreaming.rest/location/Greenville-SC/",
      "text": "Locations + Menus Alabama Spanish Fort Georgia Augusta South Carolina Charleston Columbia Greenville Surside Beach Reserve Menu Order Online Order Online Home Happenings Gift Cards Order Online Contact Locations + Menus Alabama Spanish Fort Georgia Augusta South Carolina Charleston Columbia Greenville Surside Beach Reserve Menu Order Online Order Online Home Happenings Gift Cards Order Online Contact Greenville, SC Sidle up to one of the bar stools overlooking the restaurant or grab a seat by window, the vibrant atmosphere at California Dreaming is inviting for families and date-nights alike. The large, open interior decked with limestone and expansive kitchen has a dedicated team cooking American classics from scratch daily. Don’t leave without ordering a thick-cut broiled steak or honey-butter croissants. Proudly serving the Greenville, SC community since 1991. Open for lunch and dinner daily, featuring patio seating as well as online ordering with curbside pickup. To ensure the best experience for all guests, we seat groups of up to 8. While larger groups are seated separately, this arrangement is flexible during quieter hours. 40 Beacon Dr. Greenville, SC 29615 Directions 864.234.9000 Order Now Reserve Hours Open Today Sunday 11am-9pm Open Today - Sunday 11am-9pm Monday 11am-9pm Tuesday 11am-9pm Wednesday 11am-9pm Thursday 11am-9pm Friday 11am-10pm Saturday 11am-10pm facebook instagram DINE DINE | DRINK | WINE | DESSERT | KIDS DINE Apps She Crab Soup 8.95 A rich and creamy Charleston classic Steamed Peel & Eat Shrimp 12.95 (9) Old Bay boil, served with cocktail sauce Nashville Hot Wings 16.95 Marinated in hot pepper sauce, fried crispy, with bleu cheese dip Chicken Tenders 12.95 Served with house-made honey BBQ sauce Baked Potato Soup 7.95 Creamy soup, scallions, cheese, ham, bacon Chili 8.95 Topped with cheese, scallions and sour cream, served with corn tortilla chips Our Famous Croissants (5) 6.95 Topped with honey-butter Nachos house-made chips Traditional 13.95 Chili, cheese, tomatoes, jalapenos, sour cream BBQ Chicken 15.95 Smoky BBQ sauce, red onions, cheese sauce Seafood 17.95 Spicy shrimp, salmon, red onions, cheese sauce and lobster cream sauce with dill Entrees Cali Bowl Warm sushi rice, avocado, jalapenos, sesame seeds, mango, scallions, jicama slaw, pickled red onions, chipotle mayo. Choice of: Tuna Poke* 17.95 Miso Salmon 17.95 Steak 18.95 Fried Chicken 15.95 Chicken Tenders Platter 17.95 Fried chicken tenderloins, served with house-made honey BBQ sauce and french fries Blackened Chicken Pasta 18.95 Alfredo, scallions, tomatoes, with romano cheese Knob Hill Chicken 18.95 Topped with ham and monterey jack cheese, with side item Seafood Favorites Miso Salmon 25.95 Miso glazed, sweet soy, with side Carolina Trout 24.95 Grilled with arugula and lemon Baked Shrimp Alfredo 23.95 Roasted garlic alfredo, large shrimp, romano cheese and breadcrumbs Crab Cakes 31.95 Jumbo lump, mustard sauce, served with mashed potatoes and seasonal veggie Fried Seafood Platters Shrimp 20.95 Oysters 24.95 Flounder 20.95 All Three 27.95 Served with french fries Salads California Dreaming 14.95 Mixed greens, ham and turkey, cheddar and monterey jack cheeses, egg, tomatoes, almonds topped with warm ham and bacon, house dressing Roasted Salmon or Chicken Mixed greens, bacon, egg, avocado, tomatoes, balsamic vinaigrette Salmon 16.95 Chicken 15.95 Caesar Crisp romaine, grated romano cheese, croutons Chicken or Fried Shrimp 14.95 Fried Oysters 17.95 Chicken Club 15.95 Mixed greens, fried chicken strips, avocado, bacon, egg, tomatoes, house-made ranch dressing Steaks, Chops + Ribs Aged USDA Choice | Served with a house or caesar salad and side item. Add broiled or fried shrimp to any steak +$6.95 Pork Chop 26.95 16oz. double bone, frenched chop, peach jalapeno jam Marinated Sirloin* 26.95 10oz. sirloin marinated in fruit juices, garlic, soy sauce and spices Filet Mignon* 39.95 8oz. barrel cut Steak + Shrimp* 27.95 Two 3oz. filet medallions, crispy fried shrimp Ribeye* 38.95 14oz. hand cut with cajun butter New York Strip* 38.95 14oz. center cut topped with garlic butter Baby Back Ribs Danish full-flavored ribs, grilled with a charred exterior, basted with BBQ sauce, with side item One Rack 21.95 Two Racks 29.95 Tacos (3) Served with side item Chicken 15.95 Shredded lettuce, chipotle & cilantro mayo, pico de gallo, Monterey cheese Steak 17.95 Cilantro cabbage slaw, chipotle mayo, pickled onions, queso fresco Crispy Shrimp 16.95 Jicama slaw, chipotle mayo, tomatoes, pickled onions, scallions, queso fresco Sandwiches Served with french fries Dreaming Double* 15.95 Double stack angus beef-blend, bacon, american cheese, pickles, signature sauce and onions Veggie Burger 13.95 House-made, pepper jack, avocado, lettuce, tomato, BBQ molasses sauce, mayo and mustard Spicy Chicken 14.95 Nashville hot fried chicken, american cheese, jicama slaw, pickles, chipotle mayo Club 14.95 Thinly sliced turkey, ham, bacon, cheddar and monterey jack cheeses, lettuce, tomato and mayo Chicken 14.95 Broiled, topped with jack cheese, bacon, arugula, tomato and honey mustard Sides French Fries 5.95 Seasonal Veggie 5.95 Cole Slaw 5.95 Mashed Potatoes 5.95 Baked Potato 6.95 after 4pm Desserts Chocolate Brownie 8.95 Apple Walnut Cobbler 8.95 Croissant Bread Pudding 8.95 Cheesecake 9.95 seasonal topping *Denotes cooked to order. Consuming raw or undercooked meats, poultry, seafood, shellfish or eggs may increase your risk of foodbourne illness especially if you have certain medical conditions. Gluten Free/Prepared in a fryer with wheat ingredients Disclaimer: Pricing and availability subject to change. DRINK Cocktails Barrel-Aged Old Fashioned 13.95 Elijah Craig Small Batch bourbon Dreamsicle #3 10.95 Evan Williams bourbon, Licor 43, vanilla, orange juice Spritz-mas 9.95 Aperol, cranberry, lemon, prosecco Harvest Ember 10.95 Evan Williams bourbon, apple butter, lemon, spiced honey, apple wood smoke Margaritas Pouring - Lunazul tequila Classic 10.95 Agave, lime Spiced Cranberry 10.95 White cranberry, cinnamon, lime, Cointreau Smoky Peach 10.95 Ilegal mezcal, peach, agave, lime Pineapple Jalapeño 10.95 Pineapple, jalapeño, lime, triple sec Martinis Toasted Marshmallow 11.95 Hoodoo Espresso vodka, toasted marshmallow infusion Sugar Cookie 11.95 Baileys, Absolut Vanilla vodka, di Amore amaretto Strawberry Rose 12.95 Tito's vodka, rose essence, Chambord, strawberry Dirty 13.95 Grey Goose vodka, olive brine, Dolin dry vermouth Frozen Drinks $10.95 Cali Crush Parrot Bay Coconut rum, blue curacao, pineapple, house sour Irish Coffee Jameson whiskey, Kahlua, cream, whipped cream Zero Proof Coconut Faux-Jito 9.95 Non-Alcoholic, Seedlip Spice 94, Coco Lopez, pineapple, lime, mint Pineapple Spritz 9.95 Non-Alcoholic, Seedlip Grove 42, pineapple, lime, grenadine, cherry Spirits Bourbon / Whiskey Angels Envy 13.95 Basil Hayden Straight 12.95 Blade & Bow 11.95 Buffalo Trace 11.95 Bulleit Rye 11.95 Eagle Rare 10 Year 15.95 Elijah Craig Small Batch 10.95 Four Roses Small Batch 9.95 Henry McKenna 13.95 Knob Creek 10.95 New Riff 14.95 Old Forester 10.95 Penelope Toasted 16.95 Redemption Rye 9.95 Redwood Empire Emerald Rye 13.95 Rittenhouse Rye 10.95 Widow Jane 10 Year 16.95 Tequila Casamigos Blanco 13.95 Cazadores Anejo 15.95 Clase Azul Reposado 28.95 Don Julio Blanco 13.95 Espolon Blanco 10.95 Herradura Reposado 13.95 Lalo Blanco 12.95 Patron Silver 13.95 Beer On Tap Blue Moon 6.25 Breckenridge Vanilla Porter 6.95 Coors Light 5.95 Michelob Ultra 5.95 Yuengling 6.25 Bottles / Cans Angry Orchard 4.95 Bud Light 4.95 Corona 5.95 Heineken 5.25 Highland Pilsner 5.25 Highland Porter 5.25 Miller Lite 4.95 Stella Artois 5.25 Disclaimer: Pricing and availability subject to change. WINE Whites Chardonnay, EOS, California 7.95 Chardonnay, Diora, Monterey 9.95 Chardonnay, Buehler, Russian River 11.95 Chardonnay, Frank Family, Carneros, California 55.00 Moscato, Seven Daughters, Italy 8.95 Moscato Rosé, Risata, Italy 7.95 Pinot Grigio, Lunardi, Italy 7.95 Prosecco, Riondo, Italy 8.95 Riesling, Loosen Bros. \"Dr L\" Mosel, Germany 7.95 Sauvignon Blanc, Wairau River, New Zealand 8.95 Sauvignon Blanc, Jax, California 10.95 Sparkling Wine, Poema, Cava 7.95 Reds Cabernet Sauvignon, Firestone, Paso Robles 7.95 Cabernet Sauvignon, Leese-Fitch, California 8.95 Cabernet Sauvignon, The Federalist, California 11.95 Cabernet Sauvignon, Lake Sonoma, California 49.00 Malbec, Alta Vista \"Vive\", Argentina 7.95 Merlot, Spellbound, California 8.95 Pinot Noir, Elouan, Oregon 9.95 Pinot Noir, Fowles Wine, Australia 11.95 Pinot Noir Rosé, Villa Wolf, Pfalz, Germany 7.95 Red Blend, Clos de los Siete, Argentina 9.95 Red Blend, Conundrum, California 42.00 Red Zinfandel, Seghesio Family Vineyards, California 10.95 Disclaimer: Pricing and availability subject to change. DESSERT Desserts Chocolate Brownie 8.95 Topped with a Hershey's bar, served with vanilla ice cream. Apple Walnut Cobbler 8.95 Served hot with vanilla ice cream. Croissant Bread Pudding 8.95 Warm croissants, raisins and creme anglaise, with vanilla ice cream and rum sauce. New York Cheesecake 9.95 seasonal topping Disclaimer: Pricing and availability subject to change. KIDS Kids Menu Served with fries and a beverage. Chicken Strips 6.95 Cheeseburger 6.95 Fried Shrimp 6.95 Chicken Wings 6.95 Grilled Cheese 6.95 Fettuccine Alfredo 6.95 (no side) Disclaimer: Pricing and availability subject to change. See More Menus Menu | Reserve Augusta, GA Charleston, SC Columbia, SC Greenville, SC Spanish Fort, AL Surfside Beach, SC Sign Up For Mailing List Select your favorite location Contact Contact Catering CentraArchy Restaurants Join Our Team Gift Cards Sitemap © 2026 CentraArchy Restaurants. All Rights Reserved.",
      "hash": "f818c9615767",
      "downloadedAt": "2026-01-18T17:02:09.277Z",
      "trimmedAt": "2026-01-18T17:12:04.802Z",
      "sizeReduction": "91.4%"
    },
    {
      "url": "https://californiadreaming.rest/menu/",
      "text": "Locations + Menus Alabama Spanish Fort Georgia Augusta South Carolina Charleston Columbia Greenville Surside Beach Reserve Menu Order Online Order Online Home Happenings Gift Cards Order Online Contact Locations + Menus Alabama Spanish Fort Georgia Augusta South Carolina Charleston Columbia Greenville Surside Beach Reserve Menu Order Online Order Online Home Happenings Gift Cards Order Online Contact Order Now Alabama Spanish Fort 30500 State Hwy 181 Spanish Fort, AL 36527 30500 State Hwy 181 Spanish Fort, AL 36527 | 251.626.9942 Menus Reservations Order Now Catering Georgia Augusta 3241 Washington Rd. Augusta, GA 30907 3241 Washington Rd. Augusta, GA 30907 | 706.860.6206 Menus Reservations Order Now Catering South Carolina Charleston 1 Ashley Point Dr Charleston, SC 29407 1 Ashley Point Dr Charleston, SC 29407 | 843.766.1644 Menus Reservations Order Now Catering Columbia 401 South Main St. Columbia, SC 29201 401 South Main St. Columbia, SC 29201 | 803.254.6767 Menus Reservations Order Now Catering Greenville 40 Beacon Dr. Greenville, SC 29615 40 Beacon Dr. Greenville, SC 29615 | 864.234.9000 Menus Reservations Order Now Catering Surfside Beach 2657 Beaver Run Blvd Surfside Beach, SC 29575 2657 Beaver Run Blvd Surfside Beach, SC 29575 | 843.215.5255 Menus Reservations Order Now Catering Open Open Open Open Open Open Open Open Open Open Menu | Reserve Augusta, GA Charleston, SC Columbia, SC Greenville, SC Spanish Fort, AL Surfside Beach, SC Sign Up For Mailing List Select your favorite location Contact Contact Catering CentraArchy Restaurants Join Our Team Gift Cards Sitemap © 2026 CentraArchy Restaurants. All Rights Reserved.",
      "hash": "faca3f5677c8",
      "downloadedAt": "2026-01-18T17:02:11.226Z",
      "trimmedAt": "2026-01-18T17:12:04.843Z",
      "sizeReduction": "98.8%"
    }
  ],
  "sizeReduction": "93.3%"
}