{
  "venueId": "ChIJr4BTw5Z7_ogRynn84Z_BHUs",
  "venueName": "Ritual Rooftop Restaurant & Lounge",
  "venueArea": "Downtown Charleston",
  "website": "http://www.ritualchs.com/",
  "scrapedAt": "2026-01-18T17:04:31.285Z",
  "trimmedAt": "2026-01-18T17:12:44.378Z",
  "pages": [
    {
      "url": "http://www.ritualchs.com/cocktails",
      "text": "0 menus COCKTAILS WINE LIST Plates Deserts & Aperitif's BRUNCH The ritual cocktail experience 16 $ Pomegranate Bessos Fall Bitters (Nutmeg), Grey Goose Vodka, Pomegranate Liquor, St Germain, Simple Syrup, Lemon Juice 16 $ 15 $ Tepache Betty Ginger Infused Titos, House Teach, Lemon Club Soda 15 $ 16 $ Manzanito A rum blend of Bacardi Superior, Havana Club Anejo Classico, Pussers Navy Strength Apple Pucker Elizabeth Allspice Dram, Cinnamon Apple Simple, Lemon Juice 16 $ 16 $ CAFÉ EXPRÉS Cazadores Reposado, Vanilla Spiced Simple, Faretti Espresso Liqueur, Espresso 16 $ ritual classics 16 $ espresso martini Vodka, Faretti Espresso Liqueur, Liquir 43, Second State Espresso 16 $ 15 $ Pain Killer Pussers Navy Strength Rum, Coco Lopez, Nutmeg, Pineapple, Orange, and Lime juice 15 $ 15 $ Seasonal Boston Sour Fall Bitters (Nutmeg), Tin Cup Whiskey, Vanilla Pomegranate Simple Syrup, Pomegranate Liquor, Egg white*, Lemon Juice 15 $ 14 $ Seasonal Old fashioned Fall Bitters (Nutmeg), Chicken Cock Whiskey, Simple syrup, 14 $ ------ SHAREABLE COCKTAILS Serves Four & Available as Individual Cocktails ------ 48 $ LEAN WITH IT ROCK WITH IT Rum Heaven Coconut, Heaven Club, Lemon, Cranberry, Orange 48 $ 47 $ Tulum Walker Don Gato Blanco Tequila, Ancho Reyes Chili Verde, Vanilla Pomegranate Simple syrup, Pineapple Juice, Lime Juice and Ginger Beer 47 $ 38 $ Espresso Martini Flight Four of Our House Seasonal Espresso Martinis Ask About Our Seasonal Flavors! 38 $ 39 $ Patron Tequila Flight Neat Pours of Patron’s Core Tequilas Blanco, Reposado, Anejo, Cristalino 39 $ Margaritas 15 $ La Dlablita Rosa Casamigos Reposado, Raspberry Szechuan Peppercorn Simple, Lime Juice 15 $ Jalapeno Infused Lalo Tequila, Cointreau, Passionfruit, Lime $15 EL JEFE Jalapeno Infused Lalo Tequila, Cointreau, Passionfruit, Lime $15 15 $ House classic margarita Lunazul Blanco Tequila, Cointreau, Simple Syrup, Lime Juice 15 $ SHots 9 $ Gold Digger Shot Deep Eddy Lemon, Simple, Lemon, Magic Sparkles 9 $ 10 $ Watermelon Blast Watermelon Red Bull, Vodka 10 $ 9 $ Cazadores Express Tequila Espresso Martini Shot 9 $ THC CANS & MOCKTAILS HAZE CAN: 10mg Delta-9 $11 HAZE Lemon Lift or Peak Punch Haze flavors by the can HAZE CAN: 10mg Delta-9 $11 13 $ Zilch N/A Champagne 13 $ 13 $ Pomegranate Cooler Pomegranate Vanilla Simple Syrup, Lemon Lift Haze 13 $ 13 $ Haze Jungle Punch Rotating Haze or High Rise Flavor meets a tropical citrus punch 13 $ zero proof 10 $ The VPL~ (very Pretty Lady) Non-Alcoholic Vanilla Pomegranate Lemondrop Martini 10 $ 8 $ Pina Fuego Pineapple and Lime Juice, Jalapeno, Tajin and Club soda 8 $ 11 $ The Perfect Red Bull Serve Regular, Sugar-free, Watermelon, Tropical 11 $ 6 $ Second state cold brew 6 $ BEERS PACIFICO MILLER LITE MICHELOB ULTRA WICKED WEED PERNICIOUS HIGH NOON SURF SIDE",
      "hash": "6f04961dd1d7",
      "downloadedAt": "2026-01-18T16:54:49.635Z",
      "trimmedAt": "2026-01-18T17:12:44.309Z",
      "sizeReduction": "98.7%"
    },
    {
      "url": "http://www.ritualchs.com/hoursandlocation",
      "text": "0 HOURS & Location 145 calhoun Street unit 301charleston, sc Located in the heart of Downtown Charleston, Ritual is nestled high above King and Calhoun Street. With breathtaking views of the Cooper River Bridge, Marion Square, and more. MONDAY : 4:00 PM - CLOSE TUESDAY: CLOSED WEDNEDAY: 4:00 PM - CLOSE THURSDAY: 4:00 PM - CLOSE FRIDAY: 12:00 PM - 2:00 AM SATURDAY: 11:00 AM - 2:00 AM SUNDAY: 11:00 AM - CLOSE",
      "hash": "72067401d51c",
      "downloadedAt": "2026-01-18T16:54:50.323Z",
      "trimmedAt": "2026-01-18T17:12:44.317Z",
      "sizeReduction": "99.6%"
    },
    {
      "url": "http://www.ritualchs.com/",
      "text": "0 welcome to your new ritual. Visit Us DAY AND NIGHTLIFE RESTAURANT NIGHTCLUB Immerse yourself in the dynamic realm of Ritual Rooftop Restaurant & Lounge, a Downtown Charleston rooftop restaurant and lounge during the day, bar and nightclub by night. Book a VIP Table Book a Reservation First Name Last Name Email Address Sign Up Thank you! PURCHASE A GIFT CARD Restaurant & Night Club Gift Cards",
      "hash": "7ff0199e909b",
      "downloadedAt": "2026-01-18T16:54:47.855Z",
      "trimmedAt": "2026-01-18T17:12:44.350Z",
      "sizeReduction": "99.8%"
    },
    {
      "url": "http://www.ritualchs.com/happenings",
      "text": "0 HAPPENINGS Charleston Restaurant Week Charleston Restaurant Week is the perfect reason to experience Ritual CHS. From , the downtown destination offers a thoughtfully curated , showcasing Coastal Mexican inspired flavors with Ritual’s signature Tulum flair. January 8–18 four-course dinner for $35 Our menu opens with a taste of empanadas filled with garlic mushrooms or slow-roasted chicken tinga, followed by vibrant starters like guacamole or shrimp aguachile. Entrée options include tomatillo-lime braised chicken, roasted chile relleno, or an elevated (pictured above). Dessert brings a sweet finish with churros, or our tres leches tart. braised boneless short rib finished with cranberry mole Handcrafted cocktail specials, including classic margaritas and our favorite seasonal specials, round out the experience. For diners seeking bold flavor, atmosphere, and exceptional value, we are a standout this Restaurant Week! Reservations are encouraged at . ritualchs.com 📍 145 Calhoun St. Unit 301 Charleston, SC, 29401 Click Here Give the gift of good taste and get a gift for yourself Make someone’s day with the perfect present — a Toasty gift card. Whether it’s for a special occasion, a simple thank-you, or just because, our gift cards are easy to buy and even easier to love. Right now, buy a $100 gift card and get a $30 gift card for yourself. $30 card redeemable through January 31st! Gifting can be rewarding! Order online today and share the taste of something special. Click Here Happy Hour Join us for Happy Hour 4-6 PM Monday, Wednesday, Thursday for $9 HOUSE COCKTAILS, $10 TAPAS/ EMPANADAS, $6 SINGLE TACOS, $7 SURFSIDES, $8 SELECT WINES FULL MENU Wine Club Wednesday's Join us every Wednesday for live music, ½ off all bottles of wine, and a time to socialize with fellow wine-lovers in CHS! 🍾 WINTER BRUNCH! 🥙 \"Rise and shine at Ritual Rooftop in Charleston! Join us for a vibrant brunch experience, savoring dishes like our Brunch Burger, Chicken & Waffle, and Tulum Asada Bowl, all while taking in the stunning city views. Come for the food, stay for the atmosphere! JOIN US FOR BRUNCH FRI- 12:00-3:00 PM SAT/SUN- 11:00-3:00 PM BRUNCH MENU",
      "hash": "bb899ecf3686",
      "downloadedAt": "2026-01-18T16:54:48.892Z",
      "trimmedAt": "2026-01-18T17:12:44.361Z",
      "sizeReduction": "98.5%"
    },
    {
      "url": "http://www.ritualchs.com/private-events",
      "text": "0 host your private event on the rooftop. SUBMIT AN INQUIRY OUR VENUES CALHOUN STREET Patio Features: Lounge Seating, Bar Seating, High Top Tables, View of downtown Charleston over Marion Square. INQUIRE ABOUT THE PATIO Green TERRACE Features: Lounge Seating, Bar Seating, Fire Pits, View of downtown Charleston over Marion Square. INQUIRE ABOUT THE GREEN INSIDE LOUNGE Features: Lounge Seating, Bar Seating, Vibrant Lighting, DJ Booth. INQUIRE ABOUT THE INSIDE LOUNGE Email Address Sign Up Thank you!",
      "hash": "cf38f673eabc",
      "downloadedAt": "2026-01-18T16:54:48.127Z",
      "trimmedAt": "2026-01-18T17:12:44.378Z",
      "sizeReduction": "99.7%"
    }
  ],
  "sizeReduction": "99.2%"
}