{
  "venueId": "ChIJB8KRscFz_ogRXKHf2CSoLrA",
  "venueName": "The Boathouse at Breach Inlet",
  "venueArea": "Mount Pleasant",
  "website": "http://www.boathouserestaurants.com/",
  "scrapedAt": "2026-01-18T17:04:24.100Z",
  "trimmedAt": "2026-01-18T17:05:08.929Z",
  "pages": [
    {
      "url": "http://www.boathouserestaurants.com/isle-of-palms-the-boathouse-at-breach-inlet-specials",
      "text": "Specials Monday January 19th Happy Hour 04:00 PM - 06:00 PM Tuesday January 20th Happy Hour 04:00 PM - 06:00 PM Wednesday January 21st Happy Hour 04:00 PM - 06:00 PM Thursday January 22nd Happy Hour 04:00 PM - 06:00 PM Friday January 23rd Happy Hour 04:00 PM - 06:00 PM",
      "hash": "3568eecce1f8",
      "downloadedAt": "2026-01-18T16:57:27.784Z",
      "trimmedAt": "2026-01-18T17:05:08.866Z",
      "sizeReduction": "99.6%"
    },
    {
      "url": "http://www.boathouserestaurants.com/isle-of-palms-the-boathouse-at-breach-inlet-drink-menu",
      "text": "Our Drinks Cocktails Draft Beer Beer",
      "hash": "5f6c54e153cb",
      "downloadedAt": "2026-01-18T16:57:26.478Z",
      "trimmedAt": "2026-01-18T17:05:08.869Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://www.boathouserestaurants.com/isle-of-palms-the-boathouse-at-breach-inlet-menus-happy-hour",
      "text": "Our Menus Daily Specials RAW BAR Fish Board Dinner SIDES Kids Happy Hour Bar Menu Sustainable Seafood Dinner",
      "hash": "70128d38278e",
      "downloadedAt": "2026-01-18T16:57:28.590Z",
      "trimmedAt": "2026-01-18T17:05:08.874Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "http://www.boathouserestaurants.com/isle-of-palms-the-boathouse-at-breach-inlet-happy-hours-specials",
      "text": "Specials Monday January 19th Happy Hour 04:00 PM - 06:00 PM Tuesday January 20th Happy Hour 04:00 PM - 06:00 PM Wednesday January 21st Happy Hour 04:00 PM - 06:00 PM Thursday January 22nd Happy Hour 04:00 PM - 06:00 PM Friday January 23rd Happy Hour 04:00 PM - 06:00 PM",
      "hash": "a392f6d126aa",
      "downloadedAt": "2026-01-18T16:57:29.245Z",
      "trimmedAt": "2026-01-18T17:05:08.877Z",
      "sizeReduction": "99.6%"
    },
    {
      "url": "http://www.boathouserestaurants.com/isle-of-palms-the-boathouse-at-breach-inlet-events",
      "text": "Specials and Events Sustainable Seafood Dinner Sunday January 18th The Boathouse at Breach Inlet has partnered with The South Carolina Aquarium for a Sustainable Seafood Dinner. Chef Robert Drake celebrates local sustainable seafood with a 6 Course Menu. $95 per person plus tax and gratuity. Ticketed Event. Reservations Only. 06:00 PM - 08:00 PM 2026-01-18 18:00:00 2026-01-18 20:00:00 America/New_York Sustainable Seafood Dinner The Boathouse at Breach Inlet has partnered with The South Carolina Aquarium for a Sustainable Seafood Dinner. Chef Robert Drake celebrates local sustainable seafood with a 6 Course Menu. $95 per person plus tax and gratuity. Ticketed Event. Reservations Only. The Boathouse At Breach Inlet The Boathouse At Breach Inlet manager@boathouserestaurants.com",
      "hash": "d26c28fa4689",
      "downloadedAt": "2026-01-18T16:57:27.129Z",
      "trimmedAt": "2026-01-18T17:05:08.880Z",
      "sizeReduction": "98.9%"
    },
    {
      "url": "http://www.boathouserestaurants.com/",
      "text": "× Jan 18th 2026 6 pm- 8 pm The Boathouse at Breach Inlet has partnered with The South Carolina Aquarium for a Sustainable Seafood Dinner. Chef Robert Drake celebrates local sustainable seafood with a 6 Course Menu. $95 per person plus tax and gratuity. Ticketed Event. Reservations Only. Book Now 101 Palm Blvd, Isle of Palms, SC 29451 map marker pin Our Story Daily fresh fish selection Our roots run deep when it comes to Southern cooking, drawing from passed-down recipes scrawled on cards in Southern family kitchens to the modern locavore movement, and relying on South Carolina's natural fresh abundance. Upon opening in 1997, The Boathouse pioneered a focus on serving diverse and delicious seafood that could be found in nearby rivers, lakes, and oceans. Read more about us Group Dining andSpecial Events The Inlet Bar A beautiful screened-in area with a private bar and lovely views of the dock and Intracoastal Waterway, ideal for casual inners up to people 15 or cocktail events up to 25 people. The Waterfront Deck Our largest private dining space, the Waterfront Deck is screened-in with beautiful views of the Breach Inlet, marsh and gorgeous sunsets. The space is open air or can be heated during winter months. Ideal space for large parties to enjoy a seated or buffet dinner, the Deck’s capacity is up to 80 people. Reserving half or a portion the deck is also ideal for smaller groups. The Sunroom Our completely indoor dining area is surrounded by windows on three sides with a more intimate feel. It is a perfect space for business dinners and bridal luncheons. The Sunroom can accommodate up to 30 guests. Parties Private Parties Reservations Call us at or book a table through Open Table: (843)-886-8000 We've partnered with the South Carolina Aquarium Good Catch program in support of local fisheries and consumption of responsibly harvested seafood. Events Sustainable Seafood Dinner Sunday January 18th The Boathouse at Breach Inlet has partnered with The South Carolina Aquarium for a Sustainable Seafood Dinner. Chef Robert Drake celebrates local sustainable seafood with a 6 Course Menu. $95 per person plus tax and gratuity. Ticketed Event. Reservations Only. Specials Check them out Reviews review by - Yelp Matt N: A lowcountry staple that will always have a special place in my heart...it was the first restaurant I went to when I moved to the area! The place is solid in every aspect and they have gotten better each year (free hush puppies instead of boring bread etc)... review by - Yelp Stephan C: Nothing comes close to the water view you get from the Boathouse. Sitting in their \"Crows Nest\", our bartender was Will. A great asset to this restaurant. He made me a great manhattan! Suggested a special they had. Seared Ahi tuna. Perfect! Rumor has it their hush puppies were the best.... it's no longer a rumor. These were perfect!!! Served with a flavored butter. Yum!!... review by - Yelp Tim H: Come here every year! Great seafood! Nicole our server was wonderful. She even listened to one of my boring stories!!!! Food was great.. unfortunately the dolphins were not jumping this year..looking forward to next year!!Give this place a try!! review by - Yelp Kathy J: This is our 3rd time in one week over our vacation that we have had dinner at the Boathouse! We were thrilled that the beach house we rented was walking distance and you cannot beat the service & fresh fish served at this great restaurant! review by - Yelp Billy E: The rooftop bar is great! We watched the fireworks here on 4th of July and you could see all the fireworks from all around. We had dinner before and I didn't expect much since the 3 star rating, but the food was great. Prices were great too! Valet is a plus...if definitely go back. Stop reviews carousel Play reviews carousel Newsletter Location 101 Palm Blvd Isle of Palms, SC 29451 Visit our sister restaurants Hours Rooftop Bar Hours - Drinks and Appetizer Open at 3 pm Daily Happy Hour - Bar ONLY Monday - Friday 4 pm - 6 pm Dinner Hours - Full Menu Sunday - Thursday 5 pm - 9 pm Friday - Saturday 5 pm - 9 pm Find us on... Facebook page Instagram page Contact us (843)-886-8000 manager@boathouserestaurants.com Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "e87d22873e98",
      "downloadedAt": "2026-01-18T16:57:25.715Z",
      "trimmedAt": "2026-01-18T17:05:08.925Z",
      "sizeReduction": "98.7%"
    },
    {
      "url": "http://www.boathouserestaurants.com/isle-of-palms-the-boathouse-at-breach-inlet-food-menu",
      "text": "Our Menus Daily Specials RAW BAR Fish Board Dinner SIDES Kids Happy Hour Bar Menu Sustainable Seafood Dinner",
      "hash": "fadb1f452b1b",
      "downloadedAt": "2026-01-18T16:57:25.856Z",
      "trimmedAt": "2026-01-18T17:05:08.929Z",
      "sizeReduction": "99.9%"
    }
  ],
  "sizeReduction": "99.3%"
}