{
  "venueId": "ChIJJ2Ioio57_ogRS3Y7F80xrNM",
  "venueName": "R Kitchen",
  "venueArea": "West Ashley",
  "website": "http://rutledgekitchen.com/",
  "scrapedAt": "2026-01-18T17:04:25.207Z",
  "trimmedAt": "2026-01-18T17:07:06.401Z",
  "pages": [
    {
      "url": "http://rutledgekitchen.com/",
      "text": "R kitchen Our five course tasting menu is recreated every day by combining seasonal ingredients with the inspiration and imagination of our chefs we’re A KITCHEN, NOT A RESTAURANT. R Kitchen is designed to give chefs the freedom to play with food as they see fit without the constraints of a set menu. Since we love making adjustments as we go, menus are not available prior to checking in for your reservation. We will always accommodate reasonable dietary restrictions to the best of our ability based on availability of product and with advanced notice. Please let us know of any food allergies or dietary restrictions when making your reservation. Our doors are open to everyone, but please keep in mind that you will be dining with the chefs. Please consider some content to be rated TV-MA and may not be words you want your kids to hear… Prepare to get brunched in the face! Are you ready for brunch R Kitchen style?! Check out the new pop -up event Reckless breakfast every Sunday morning at our West Ashely location with Chef Chris Seeley Learn more",
      "hash": "3df339f91121",
      "downloadedAt": "2026-01-18T17:03:07.687Z",
      "trimmedAt": "2026-01-18T17:07:06.392Z",
      "sizeReduction": "98.7%"
    },
    {
      "url": "http://rutledgekitchen.com/new-page-3",
      "text": "Locations Join us at either of our 2 location in Downtown Charleston or West Ashley R KITCHEN DOWNTOWN 212 Rutledge AvenueCharleston, SC 29403 Open Tuesday through Sunday Seatings @ 6:00 pm and 8:00 pm Dinner $70 Per Person + Tax Wine and Beer options available for purchase - Wines - $30 bottle / $10 glass - Beer - $6/$9 Corkage fee $15 Limited street parking - Uber/Taxi is recommended R KITCHEN WEST ASHLEY 1337 Ashley River RoadCharleston, SC 29407 Open Tuesday through Saturday Seatings @ 6:00 pm and 8:00 pm Dinner $70 Per Person + Tax On-Site Parking",
      "hash": "53121585b7be",
      "downloadedAt": "2026-01-18T17:03:07.871Z",
      "trimmedAt": "2026-01-18T17:07:06.401Z",
      "sizeReduction": "99.3%"
    }
  ],
  "sizeReduction": "99.0%"
}