{
  "venueId": "ChIJBZbEhlNw_ogR7W9FQmFVYCU",
  "venueName": "Langdon's Restaurant & Wine Bar",
  "venueArea": "Mount Pleasant",
  "website": "http://www.owensdininggroup.com/",
  "scrapedAt": "2026-01-19T03:25:39.420Z",
  "trimmedAt": "2026-01-19T03:26:25.451Z",
  "pages": [
    {
      "url": "http://www.owensdininggroup.com/",
      "text": "[Page Title: Owens Dining Group | Langdon's | Opal | Wood & Grain]\n\n\"From lamb chops to grouper, Langdon's never fails to impress. The friendly, inviting, and relaxed atmosphere and the excellent menu selections echo Owens' personality and flair.\"\n - CHARLESTON CITY PAPER\n [ ENTER SITE ]\n\n\"This welcoming neighborhood restaurant — much like highly regarded sister property Langdon's — quickly achieved \"destination\" status with its pleasing combination of generous California-style, Mediterranean-influenced cuisine, personable service, and an award-winning wine list.\"\n - PATRICIA AGNEW, CHARLESTON MAGAZINE\n [ ENTER SITE ]\n\nFounded by Chef Patrick Owens in June 2017, Wood & Grain brings a unique culinary concept, marrying wood-fired cooking with the finest seafood.\n [ ENTER SITE ]\n\nChef Patrick Owens’ latest creation to land is Tierra al Mar. Settle in for a dining experience that offers Chef Owens’ distinctive twist on Latin American-inspired cuisine with the focus on fresh and flavorful Latin American ingredients, while still celebrating the Lowcountry bounty.\n [ ENTER SITE ]\n\nODG CATERING\n\nChef\n\nPATRICK OWENS\nOUR LATEST NEWS \nWood & Grain Named One of the Best Restaurants in Charleston by Condé Nast Traveler\n\nA lot has changed since the best restaurants in Charleston burst onto the national food scene, celebrating the city’s seafood tradition, unique\n\nNow Hiring All Positions\n\nJoin us for Open Job Interviews at Langdon’s, Opal and Wood & Grain, every Wednesday from 2-4pm.\n\nLangdon’s Now Open on Sundays\n\nWe are no longer serving lunch at Langdon’s. However, we are now open seven days a week, including Sunday from 5 to 10 p.m.\nE-GIFT CARDS WordPress Themes \nCOPYRIGHT © 2026 - ALL RIGHTS RESERVED - OWENS DINING GROUP\nEmployment Opportunities",
      "hash": "06ed59d5f1c9",
      "downloadedAt": "2026-01-19T02:11:27.371Z",
      "trimmedAt": "2026-01-19T03:26:25.428Z",
      "sizeReduction": "96.8%"
    },
    {
      "url": "http://www.owensdininggroup.com/tierra-al-mar/",
      "text": "[Page Title: TIERRA AL MAR | Owens Dining Group]\n\nMENU LUNCH MENU DINNER MENU KIDS MENU HAPPY HOUR DRINK MENU \nChef Patrick Owens’ latest creation to land is Tierra al Mar. Settle in for a dining experience that offers Chef Owens’ distinctive twist on Latin American-inspired cuisine with the focus on fresh and flavorful Latin American ingredients, while still celebrating the Lowcountry bounty. Local seafood and seasonal produce will once again play a starring role on the menu that will change to reflect products in season.\n\nWhen creating the new Latin American-inspired culinary concept, Chef Owens drew inspiration and flavors from his travels. For months now, Chef Owens has been keeping busy with creating unique sauces and smoked meats. Tierra al Mar’s elevated Latin American-inspired cuisine highlights a combination of multicultural bold, yet refined flavors, and exceptional, high-quality ingredients sourced from Mexico.\n\nThe menu features an assortment of inventive tacos, seasonal vegetables, and a large selection of local seafood dishes as well as assorted smoked meats, proteins, and unique sauces. The full bar offers a large array of mezcal, tequilas, beer, and wine.\n\nDINE WITH US\n\n778 South Shelmore Blvd.\n Mt Pleasant, SC 29464\nMap Our Location \nHOURS\n\nLunch: 11am - 3pm\nHappy Hour: 3pm - 5pm\n(limited menu)\nDinner: 5pm - 9pm\n\nHappy Hour: 4pm - 5pm\nDinner: 5pm - 9pm\nMonday - Friday: Saturday & Sunday: Walk-In Only \nCONTACT US\nMedia Inquiries E-Gift cards are available . HERE × WordPress Themes \nCOPYRIGHT © 2026 - ALL RIGHTS RESERVED - OWENS DINING GROUP\nEmployment Opportunities",
      "hash": "3094ed60f675",
      "downloadedAt": "2026-01-19T02:11:31.134Z",
      "trimmedAt": "2026-01-19T03:26:25.441Z",
      "sizeReduction": "98.7%"
    },
    {
      "url": "http://www.owensdininggroup.com/opal/",
      "text": "[Page Title: OPAL | Owens Dining Group]\n\nMENU MENU WINE LIST HAPPY HOUR RESERVATIONS E-GIFT CARDS \nOpal Restaurant + Bar is a contemporary neighborhood eatery offering California-Mediterranean inspired cuisine in an elegant but convivial atmosphere. We make all of our pastas in house and feature an array of housemade pastas, charcuterie, local seafood and top-quality meats. We constantly seek to create a unique and memorable dining experience. This pursuit is supported by our talented kitchen staff and knowledgeable front-of-house team, and nurtured by our relationships with local farmers and fine purveyors around the world.\n\nTo purchase gift cards, please .\nclick here “Opal is not just a place to go for food, but to go for an incredible dining experience. Much like Langdon’s, we predict Opal will quickly become an enduring favorite in Mt. Pleasant and a destination for serious eaters from the entire area.” \n– ERIC DOKSA, CHARLESTON CITY PAPER\n\nDINE WITH US\n\nShoppes at Seaside Farms\n 1960 Riviera Dr. Suite C\n Mt. Pleasant, SC 29464\nMap Our Location \nHOURS\n\nSunday – Thursday: 5pm – 9pm\nFriday & Saturday: 5pm – 10pm\nHappy Hour: 4pm – 5pm \nCONTACT US\n\n843.654.9070\ninfo@opalrestaurantsc.com *not for reservations Media Inquiries E-GIFT CARDS E-Gift cards are available . HERE × WordPress Themes \nCOPYRIGHT © 2026 - ALL RIGHTS RESERVED - OWENS DINING GROUP\nEmployment Opportunities",
      "hash": "448f268aa04e",
      "downloadedAt": "2026-01-19T02:11:30.228Z",
      "trimmedAt": "2026-01-19T03:26:25.446Z",
      "sizeReduction": "97.9%"
    },
    {
      "url": "http://www.owensdininggroup.com/langdons/",
      "text": "[Page Title: LANGDON’S | Owens Dining Group]\n\nMENU DINNER MENU WINE LIST RESERVATIONS E-GIFT CARDS \nLangdon’s is a classic fine dining restaurant that fuses Lowcountry and global flavors and warm hospitality in a refined, contemporary setting. As Mt. Pleasant’s only AAA Four Diamond restaurant, we put the greatest emphasis on execution, attention to detail, and consistency in creating top-notch food. Under the leadership of Chef/Owner Patrick Owens, Langdon’s continues to be a neighborhood favorite since opening in 2003.\n\nTo purchase gift cards, please .\nclick here \n“Langdon’s has matured into a polished venture: Infusing local ingredients with a mash-up of contemporary flavor notes that honor the love and the obligation from chef Owens’ kitchen.”\n\n— Deidre Schipani, Charleston Magazine\n\nAAA Four-Diamond Award\n2003-2020\n\nWine Spectator\nAward of Excellence\n2003-2020\n\nDINE WITH US\n\n778 South Shelmore Blvd.\n Mt Pleasant, SC 29464\nMap Our Location \nHOURS\n\nDinner:\nMonday - Sunday, 5 pm\n\nCONTACT US\n\n843.388.9200\ninfo@langdonsrestaurant.com *not for reservations Media Inquiries E-GIFT CARDS E-Gift cards are available . HERE × WordPress Themes \nCOPYRIGHT © 2026 - ALL RIGHTS RESERVED - OWENS DINING GROUP\nEmployment Opportunities",
      "hash": "490f933d4077",
      "downloadedAt": "2026-01-19T02:11:27.588Z",
      "trimmedAt": "2026-01-19T03:26:25.451Z",
      "sizeReduction": "98.1%"
    }
  ],
  "sizeReduction": "98.1%"
}