{
  "venueId": "ChIJP9grKQF7_ogR7wc66cQotRE",
  "venueName": "Ruby Sunshine",
  "venueArea": "Downtown Charleston",
  "website": "https://www.rubybrunch.com/?olonwp=JjBtp_vMLk25gkYh_bnoiQ",
  "scrapedAt": "2026-01-18T17:04:25.850Z",
  "trimmedAt": "2026-01-18T17:07:16.664Z",
  "pages": [
    {
      "url": "https://www.rubybrunch.com/?olonwp=JjBtp_vMLk25gkYh_bnoiQ",
      "text": "MENUS Sweet, Savory, or Syrupy —whatever you're craving, we've got it. Dive into our menu, where it’s all about one thing: Brunch. View More BELIEVE IN BETTER BISCUITS Our legendary biscuits are crafted from scratch and baked fresh all day, every day. Fun Fact: we serve over 40,000 biscuits a week! And the best part? These buttery clouds of goodness come with our signature house-made cane-syrup butter. Catering You bring the people. We’ll bring the mimosas. INQUIRE NOW",
      "hash": "cef0abce58fe",
      "downloadedAt": "2026-01-18T16:54:50.475Z",
      "trimmedAt": "2026-01-18T17:07:16.436Z",
      "sizeReduction": "99.8%"
    },
    {
      "url": "https://www.rubybrunch.com/menu",
      "text": "Menu Seasonal Specials Dietary Preference Ruby’s Doggone Good Menu Menu Starters BEIGNETS Fresh handmade New Orleans-style beignets covered with powdered sugar (6 per order) FRIED GREEN TOMATOES Fried green tomatoes topped with lettuce, remoulade, red tomatoes and bacon-onion jam LOADED TOTS Tots topped with apple-braised pork debris, pork tasso cream sauce and chives Add bacon PIG-CANDY BACON BITES Applewood-smoked bacon bites with candy glaze FRENCH TOAST BITES Brioche French toast bites, fried and tossed in cinnamon sugar and served with cream cheese icing & praline sauce Specialties Made Fresh from Scratch BISCUITS & GRAVY* Buttermilk biscuits covered in country sausage gravy served with two eggs any style, and Applewood-smoked bacon + Add fried chicken, original or sweet heat-style +Add fried green tomato COSTA RICAN BREAKFAST Two eggs any style, spicy chorizo sausage, slow-cooked black beans & Rice, topped with warm tomato salsa crispy plantains, and avocado MIGAS A Tex-Mex egg scramble with pico de gallo, spicy chorizo sausage over crispy tortilla strips, topped with chipotle sour cream, pico de gallo, pepper jack, and cilantro served with a side of avocado Make it Skinny… Tex-Mex egg white scramble with pico de gallo and spinach +Add shrimp SHRIMP & GRITS Gulf shrimp sautéed with pork tasso, bell pepper, red onion, beer & rosemary-butter reduction, over creamy stone-ground grits served with a buttermilk biscuit SWEET HEAT CHICKEN & FRENCH TOAST BITES Fried chicken and fresh strawberries tossed in hot honey glaze over French toast bites THE TRIFECTA* “Taste of Ruby” featuring our signature egg benedicts: Cochon, Chicken St. Charles and Bayou Shrimp Pancakes Served with applewood-smoked bacon WHITE CHOCOLATE BREAD PUDDING PANCAKES Filled with white chocolate bread pudding and cinnamon sugar topped with white chocolate whiskey sauce CINNAMON SWIRL PANCAKES Filled with cinnamon & sugar and topped with cream cheese icing CLASSIC BUTTERMILK PANCAKES With cane syrup butter Sandwiches CLASSIC BREAKFAST SANDWICH* Applewood-smoked bacon, scrambled egg, and cheddar served on your choice of brioche bun or buttermilk biscuit with a side of breakfast potatoes. Protein sub by request RUBY FRIED CHICKEN SANDWICH Crispy fried chicken, housemade roasted red pepper aioli, and pickles on a brioche bun, served with fries. Fried Chicken tossed in hot honey glaze Try It Sweet Heat-Style! HOT HONEY CHICKEN BISCUIT Crispy fried chicken tossed in hot honey glaze on a buttermilk biscuit, served with breakfast potatoes SOUTHERN BLT Fried green & fresh red tomato, Applewood-smoked bacon, lettuce and mayo on toast, served with fries SMASHBURGER* Two smashed beef patties with cheddar, red onion, lettuce, tomato, pickles, bacon-onion jam, and mayo on a brioche bun, served with fries Ruby Refreshers RUBY COLADA Natalie’s Beet Orange Juice, cream of coconut, pineapple and fresh lime juice SPARKLING SUNRISE Ritual Zero Proof Tequila, muddled fresh strawberries & Crofter’s strawberry preserves with fresh lime juice, Natalie’s Blood Orange Juice, and San Pellegrino Sparkling Limonata Coffee & Beverages Our smooth Signature Breakfast Blend is crafted exclusively for you and the Ruby Krewe by our friends at French Truck Coffee. CREAMY VANILLA ICED COFFEE French Truck cold brew coffee, vanilla syrup, milk and cream topped with whipped cream and nutmeg CREAMY VANILLA SPICED LATTE French Truck espresso, vanilla syrup, milk and cream topped with whipped cream and nutmeg NOLA-STYLE ICED COFFEE French Truck cold brew coffee, milk & cream HOT COFFEE LATTE, CAPPUCINO OR ESPRESSO HOT CHOCOLATE OR HOT TEA JUICE (ORANGE, CRANBERRY, PINEAPPLE OR APPLE) MILK, CHOCOLATE MILK ICED TEA (SWEET OR UNSWEETENED) LEMONADE SODA PERRIER SPARKLING WATER ACQUA PANNA STILL WATER *These items may be cooked to order. Consuming raw or undercooked meats, poultry, seafood, shellfish or eggs may increase your risk of foodborne illness, especially if you have certain medical conditions. Food prepared in our kitchen may contain or come in contact with peanuts, tree nuts, soybeans, milk, wheat, fish and shellfish. Please let your server know if you have a food allergy or restriction. Ruby Slipper Restaurant Group Bennies CHICKEN ST. CHARLES* Fried chicken breast served over a buttermilk biscuit, topped with two poached eggs, finished with a pork tasso cream sauce EGGS COCHON* Slow-cooked, apple-braised pork served over a buttermilk biscuit, topped with two poached eggs, finished with hollandaise EGGS BLACKSTONE “THE O.G”* Applewood-smoked bacon and grilled tomato served over a buttermilk biscuit, topped with two poached eggs, finished with hollandaise, served with a side salad BAYOU SHRIMP* Gulf shrimp sautéed with pork tasso and Creole tomato sauce served over two poached eggs, fried green tomatoes and a buttermilk biscuit ONE TOMATO, TWO TOMATO* Fried green tomato and grilled red tomato served over a buttermilk biscuit, topped with two poached eggs and hollandaise, served with a side salad THE PEACEMAKER* CAN’T DECIDE? MIX ANY TWO of our Benedicts and get the best of both worlds. Harmony on a plate! French Toast Served with applewood-smoked bacon CLASSIC FRENCH TOAST Brioche French toast topped with fresh strawberries and cane syrup butter FRENCH TOAST BITES Brioche French toast bites, fried and tossed in cinnamon sugar and served with cream cheese icing & praline sauce BANANAS FOSTER FRENCH TOAST New Orleans-style French toast with rum-flambéed bananas and raisins served with Applewood-smoked bacon BERRY CHANTILLY STUFFED FRENCH TOAST Brioche French toast stuffed with almond cheesecake, topped with Chantilly cream, blueberry compote, and macerated strawberries Eggs & Omelets SOUTHERN BREAKFAST Two eggs any style, stone-ground grits, Applewood-smoked bacon, fried green tomato with a buttermilk biscuit GULF SHRIMP OMELET* Gulf shrimp, red onion, bell pepper, and cheddar cheese served with creamy stone-ground grits and a buttermilk biscuit BREAKFAST TACOS (VEG) Three grilled flour tortillas filled with a scramble of eggs, pico de gallo, pepper jack, chipotle sour cream, and avocado, served with a side of breakfast potatoesChorizo, Applewood-Smoked Bacon, Ham, Pork Sausage, Chicken Sausage, Shrimp Add Meat THREE LITTLE PIGS OMELET* Applewood-smoked bacon, ham, and sausage with Swiss cheese served with grits and a buttermilk biscuit FLORENTINE OMELET* Portobello mushroom, spinach & goat cheese served with a side salad and a buttermilk biscuit egg whites, spinach, mushrooms, and goat cheese Make It Skinny… SPANISH OMELET* Chorizo sausage, pico de gallo and pepper jack cheese served with grits and a buttermilk biscuit B.Y.O. OMELET Served with creamy stone-ground grits and a buttermilk biscuitCheddar, Swiss, Pepper Jack or Goat CheeseOnion, Tomato, Spinach, Mushrooms, Bell Peppers, Applewood-Smoked Bacon, Ham, Pork Sausage, Chicken Sausage, Chorizo, ShrimpPico De Gallo, Tasso Cream Sauce, Hollandaise Choose Your Cheese: Add up to 3: Sauce it up: Lighter Fare AVOCADO TOAST* Multigrain toast points topped with a poached egg, herbed creme fraiche, pickled red onions, flash-fried capers and chives SKINNY FLORENTINE OMELET * Egg whites, portobello mushroom, spinach and goat cheese, served with a side salad and a buttermilk biscuit SKINNY MIGAS A Tex-Mex egg white scramble with pico de gallo, and spinach, served with a side of avocado COBB SALAD Mixed greens topped with fried chicken breast, pepper jack, sliced red onion, cherry tomatoes, avocado, candied bacon, and hardboiled egg, served with green goddess dressing On the Side APPLEWOOD-SMOKED BACON, PORK SAUSAGE LINKS, CHICKEN SAUSAGE PATTIES, CHORIZO SAUSAGE STONE-GROUND GRITS, BREAKFAST POTATOES, TATER TOTS, FRENCH FRIES BUTTERMILK BISCUIT OR TOAST served with butter or Crofter’s Preserves SEASONAL FRESH FRUIT SIDE SALAD served with Champagne Vinaigrette ONE EGG* (ANY STYLE) CLASSIC BUTTERMILK PANCAKE Eye Opening Cocktails RUBY MIMOSA A generous pour of our sparkling wine, OJ and a splash of pomegranate juice BIG EASY MIMOSA A generous pour of our sparkling wine and choice of juice or house purée (grapefruit, cranberry, pineapple, blood orange, or seasonal) AWARD-WINNING BLOODY MARY Our spicy housemade mix paired with Fris vodka or Pueblo Viejo 100% agave tequila BACON BLOODY MARY Our spicy housemade mix with Applewood-smoked bacon infused Fris vodka MORNING MARGARITA Pueblo Viejo 100% agave tequila, fresh seasonal juice, triple sec and lime PEACH BELINI A generous pour of our sparkling wine with housemade peach purée and peach schnapps LAVENDER PALOMA Pueblo Viejo 100% agave tequila with lavender syrup, fresh lime juice, and grapefruit Perrier HELLO SUNSHINE Miles’ Gin, grapefruit juice, and rosemary simple syrup SAZERAC SIPPER Sazerac Rye Whiskey, Peychaud’s Bitters, rosemary simple syrup and ginger ale in an Herbsaint-coated glass, garnished with a rosemary sprig IRISH COFFEE A blend of Ryan’s Irish cream and Paddy’s Irish whiskey with French Truck coffee served hot or iced BOOZY ICED COFFEE Fris vodka, cold-brewed French Truck coffee, milk & cream, vanilla syrup, and whipped cream BOURBON MILK PUNCH Benchmark bourbon with milk, cream, vanilla syrup, and nutmeg Starters BEIGNETS Fresh handmade New Orleans-style beignets covered with powdered sugar (6 per order) FRIED GREEN TOMATOES Fried green tomatoes topped with lettuce, remoulade, red tomatoes and bacon-onion jam LOADED TOTS Tots topped with apple-braised pork debris, pork tasso cream sauce and chives Add bacon PIG-CANDY BACON BITES Applewood-smoked bacon bites with candy glaze FRENCH TOAST BITES Brioche French toast bites, fried and tossed in cinnamon sugar and served with cream cheese icing & praline sauce Eye Opening Cocktails RUBY MIMOSA A generous pour of our sparkling wine, OJ and a splash of pomegranate juice BIG EASY MIMOSA A generous pour of our sparkling wine and choice of juice or house purée (grapefruit, cranberry, pineapple, blood orange, or seasonal) AWARD-WINNING BLOODY MARY Our spicy housemade mix paired with Fris vodka or Pueblo Viejo 100% agave tequila BACON BLOODY MARY Our spicy housemade mix with Applewood-smoked bacon infused Fris vodka MORNING MARGARITA Pueblo Viejo 100% agave tequila, fresh seasonal juice, triple sec and lime PEACH BELINI A generous pour of our sparkling wine with housemade peach purée and peach schnapps LAVENDER PALOMA Pueblo Viejo 100% agave tequila with lavender syrup, fresh lime juice, and grapefruit Perrier HELLO SUNSHINE Miles’ Gin, grapefruit juice, and rosemary simple syrup SAZERAC SIPPER Sazerac Rye Whiskey, Peychaud’s Bitters, rosemary simple syrup and ginger ale in an Herbsaint-coated glass, garnished with a rosemary sprig IRISH COFFEE A blend of Ryan’s Irish cream and Paddy’s Irish whiskey with French Truck coffee served hot or iced BOOZY ICED COFFEE Fris vodka, cold-brewed French Truck coffee, milk & cream, vanilla syrup, and whipped cream BOURBON MILK PUNCH Benchmark bourbon with milk, cream, vanilla syrup, and nutmeg Bennies CHICKEN ST. CHARLES* Fried chicken breast served over a buttermilk biscuit, topped with two poached eggs, finished with a pork tasso cream sauce EGGS COCHON* Slow-cooked, apple-braised pork served over a buttermilk biscuit, topped with two poached eggs, finished with hollandaise EGGS BLACKSTONE “THE O.G”* Applewood-smoked bacon and grilled tomato served over a buttermilk biscuit, topped with two poached eggs, finished with hollandaise, served with a side salad BAYOU SHRIMP* Gulf shrimp sautéed with pork tasso and Creole tomato sauce served over two poached eggs, fried green tomatoes and a buttermilk biscuit ONE TOMATO, TWO TOMATO* Fried green tomato and grilled red tomato served over a buttermilk biscuit, topped with two poached eggs and hollandaise, served with a side salad THE PEACEMAKER* CAN’T DECIDE? MIX ANY TWO of our Benedicts and get the best of both worlds. Harmony on a plate! Specialties Made Fresh from Scratch BISCUITS & GRAVY* Buttermilk biscuits covered in country sausage gravy served with two eggs any style, and Applewood-smoked bacon + Add fried chicken, original or sweet heat-style +Add fried green tomato COSTA RICAN BREAKFAST Two eggs any style, spicy chorizo sausage, slow-cooked black beans & Rice, topped with warm tomato salsa crispy plantains, and avocado MIGAS A Tex-Mex egg scramble with pico de gallo, spicy chorizo sausage over crispy tortilla strips, topped with chipotle sour cream, pico de gallo, pepper jack, and cilantro served with a side of avocado Make it Skinny… Tex-Mex egg white scramble with pico de gallo and spinach +Add shrimp SHRIMP & GRITS Gulf shrimp sautéed with pork tasso, bell pepper, red onion, beer & rosemary-butter reduction, over creamy stone-ground grits served with a buttermilk biscuit SWEET HEAT CHICKEN & FRENCH TOAST BITES Fried chicken and fresh strawberries tossed in hot honey glaze over French toast bites THE TRIFECTA* “Taste of Ruby” featuring our signature egg benedicts: Cochon, Chicken St. Charles and Bayou Shrimp Pancakes Served with applewood-smoked bacon WHITE CHOCOLATE BREAD PUDDING PANCAKES Filled with white chocolate bread pudding and cinnamon sugar topped with white chocolate whiskey sauce CINNAMON SWIRL PANCAKES Filled with cinnamon & sugar and topped with cream cheese icing CLASSIC BUTTERMILK PANCAKES With cane syrup butter French Toast Served with applewood-smoked bacon CLASSIC FRENCH TOAST Brioche French toast topped with fresh strawberries and cane syrup butter FRENCH TOAST BITES Brioche French toast bites, fried and tossed in cinnamon sugar and served with cream cheese icing & praline sauce BANANAS FOSTER FRENCH TOAST New Orleans-style French toast with rum-flambéed bananas and raisins served with Applewood-smoked bacon BERRY CHANTILLY STUFFED FRENCH TOAST Brioche French toast stuffed with almond cheesecake, topped with Chantilly cream, blueberry compote, and macerated strawberries Eggs & Omelets SOUTHERN BREAKFAST Two eggs any style, stone-ground grits, Applewood-smoked bacon, fried green tomato with a buttermilk biscuit GULF SHRIMP OMELET* Gulf shrimp, red onion, bell pepper, and cheddar cheese served with creamy stone-ground grits and a buttermilk biscuit BREAKFAST TACOS (VEG) Three grilled flour tortillas filled with a scramble of eggs, pico de gallo, pepper jack, chipotle sour cream, and avocado, served with a side of breakfast potatoesChorizo, Applewood-Smoked Bacon, Ham, Pork Sausage, Chicken Sausage, Shrimp Add Meat THREE LITTLE PIGS OMELET* Applewood-smoked bacon, ham, and sausage with Swiss cheese served with grits and a buttermilk biscuit FLORENTINE OMELET* Portobello mushroom, spinach & goat cheese served with a side salad and a buttermilk biscuit egg whites, spinach, mushrooms, and goat cheese Make It Skinny… SPANISH OMELET* Chorizo sausage, pico de gallo and pepper jack cheese served with grits and a buttermilk biscuit B.Y.O. OMELET Served with creamy stone-ground grits and a buttermilk biscuitCheddar, Swiss, Pepper Jack or Goat CheeseOnion, Tomato, Spinach, Mushrooms, Bell Peppers, Applewood-Smoked Bacon, Ham, Pork Sausage, Chicken Sausage, Chorizo, ShrimpPico De Gallo, Tasso Cream Sauce, Hollandaise Choose Your Cheese: Add up to 3: Sauce it up: Sandwiches CLASSIC BREAKFAST SANDWICH* Applewood-smoked bacon, scrambled egg, and cheddar served on your choice of brioche bun or buttermilk biscuit with a side of breakfast potatoes. Protein sub by request RUBY FRIED CHICKEN SANDWICH Crispy fried chicken, housemade roasted red pepper aioli, and pickles on a brioche bun, served with fries. Fried Chicken tossed in hot honey glaze Try It Sweet Heat-Style! HOT HONEY CHICKEN BISCUIT Crispy fried chicken tossed in hot honey glaze on a buttermilk biscuit, served with breakfast potatoes SOUTHERN BLT Fried green & fresh red tomato, Applewood-smoked bacon, lettuce and mayo on toast, served with fries SMASHBURGER* Two smashed beef patties with cheddar, red onion, lettuce, tomato, pickles, bacon-onion jam, and mayo on a brioche bun, served with fries On the Side APPLEWOOD-SMOKED BACON, PORK SAUSAGE LINKS, CHICKEN SAUSAGE PATTIES, CHORIZO SAUSAGE STONE-GROUND GRITS, BREAKFAST POTATOES, TATER TOTS, FRENCH FRIES BUTTERMILK BISCUIT OR TOAST served with butter or Crofter’s Preserves SEASONAL FRESH FRUIT SIDE SALAD served with Champagne Vinaigrette ONE EGG* (ANY STYLE) CLASSIC BUTTERMILK PANCAKE Coffee & Beverages Our smooth Signature Breakfast Blend is crafted exclusively for you and the Ruby Krewe by our friends at French Truck Coffee. CREAMY VANILLA ICED COFFEE French Truck cold brew coffee, vanilla syrup, milk and cream topped with whipped cream and nutmeg CREAMY VANILLA SPICED LATTE French Truck espresso, vanilla syrup, milk and cream topped with whipped cream and nutmeg NOLA-STYLE ICED COFFEE French Truck cold brew coffee, milk & cream HOT COFFEE LATTE, CAPPUCINO OR ESPRESSO HOT CHOCOLATE OR HOT TEA JUICE (ORANGE, CRANBERRY, PINEAPPLE OR APPLE) MILK, CHOCOLATE MILK ICED TEA (SWEET OR UNSWEETENED) LEMONADE SODA PERRIER SPARKLING WATER ACQUA PANNA STILL WATER *These items may be cooked to order. Consuming raw or undercooked meats, poultry, seafood, shellfish or eggs may increase your risk of foodborne illness, especially if you have certain medical conditions. Food prepared in our kitchen may contain or come in contact with peanuts, tree nuts, soybeans, milk, wheat, fish and shellfish. Please let your server know if you have a food allergy or restriction. Ruby Slipper Restaurant Group Starters Starters BEIGNETS Fresh handmade New Orleans-style beignets covered with powdered sugar (6 per order) FRIED GREEN TOMATOES Fried green tomatoes topped with lettuce, remoulade, red tomatoes and bacon-onion jam LOADED TOTS Tots topped with apple-braised pork debris, pork tasso cream sauce and chives Add bacon PIG-CANDY BACON BITES Applewood-smoked bacon bites with candy glaze FRENCH TOAST BITES Brioche French toast bites, fried and tossed in cinnamon sugar and served with cream cheese icing & praline sauce Eye-Opening Cocktails Eye Opening Cocktails RUBY MIMOSA A generous pour of our sparkling wine, OJ and a splash of pomegranate juice BIG EASY MIMOSA A generous pour of our sparkling wine and choice of juice or house purée (grapefruit, cranberry, pineapple, blood orange, or seasonal) AWARD-WINNING BLOODY MARY Our spicy housemade mix paired with Fris vodka or Pueblo Viejo 100% agave tequila BACON BLOODY MARY Our spicy housemade mix with Applewood-smoked bacon infused Fris vodka MORNING MARGARITA Pueblo Viejo 100% agave tequila, fresh seasonal juice, triple sec and lime PEACH BELINI A generous pour of our sparkling wine with housemade peach purée and peach schnapps LAVENDER PALOMA Pueblo Viejo 100% agave tequila with lavender syrup, fresh lime juice, and grapefruit Perrier HELLO SUNSHINE Miles’ Gin, grapefruit juice, and rosemary simple syrup SAZERAC SIPPER Sazerac Rye Whiskey, Peychaud’s Bitters, rosemary simple syrup and ginger ale in an Herbsaint-coated glass, garnished with a rosemary sprig IRISH COFFEE A blend of Ryan’s Irish cream and Paddy’s Irish whiskey with French Truck coffee served hot or iced BOOZY ICED COFFEE Fris vodka, cold-brewed French Truck coffee, milk & cream, vanilla syrup, and whipped cream BOURBON MILK PUNCH Benchmark bourbon with milk, cream, vanilla syrup, and nutmeg Bennies Bennies CHICKEN ST. CHARLES* Fried chicken breast served over a buttermilk biscuit, topped with two poached eggs, finished with a pork tasso cream sauce EGGS COCHON* Slow-cooked, apple-braised pork served over a buttermilk biscuit, topped with two poached eggs, finished with hollandaise EGGS BLACKSTONE “THE O.G”* Applewood-smoked bacon and grilled tomato served over a buttermilk biscuit, topped with two poached eggs, finished with hollandaise, served with a side salad BAYOU SHRIMP* Gulf shrimp sautéed with pork tasso and Creole tomato sauce served over two poached eggs, fried green tomatoes and a buttermilk biscuit ONE TOMATO, TWO TOMATO* Fried green tomato and grilled red tomato served over a buttermilk biscuit, topped with two poached eggs and hollandaise, served with a side salad THE PEACEMAKER* CAN’T DECIDE? MIX ANY TWO of our Benedicts and get the best of both worlds. Harmony on a plate! Specialties Specialties Made Fresh from Scratch BISCUITS & GRAVY* Buttermilk biscuits covered in country sausage gravy served with two eggs any style, and Applewood-smoked bacon + Add fried chicken, original or sweet heat-style +Add fried green tomato COSTA RICAN BREAKFAST Two eggs any style, spicy chorizo sausage, slow-cooked black beans & Rice, topped with warm tomato salsa crispy plantains, and avocado MIGAS A Tex-Mex egg scramble with pico de gallo, spicy chorizo sausage over crispy tortilla strips, topped with chipotle sour cream, pico de gallo, pepper jack, and cilantro served with a side of avocado Make it Skinny… Tex-Mex egg white scramble with pico de gallo and spinach +Add shrimp SHRIMP & GRITS Gulf shrimp sautéed with pork tasso, bell pepper, red onion, beer & rosemary-butter reduction, over creamy stone-ground grits served with a buttermilk biscuit SWEET HEAT CHICKEN & FRENCH TOAST BITES Fried chicken and fresh strawberries tossed in hot honey glaze over French toast bites THE TRIFECTA* “Taste of Ruby” featuring our signature egg benedicts: Cochon, Chicken St. Charles and Bayou Shrimp French Toast French Toast Served with applewood-smoked bacon CLASSIC FRENCH TOAST Brioche French toast topped with fresh strawberries and cane syrup butter FRENCH TOAST BITES Brioche French toast bites, fried and tossed in cinnamon sugar and served with cream cheese icing & praline sauce BANANAS FOSTER FRENCH TOAST New Orleans-style French toast with rum-flambéed bananas and raisins served with Applewood-smoked bacon BERRY CHANTILLY STUFFED FRENCH TOAST Brioche French toast stuffed with almond cheesecake, topped with Chantilly cream, blueberry compote, and macerated strawberries Pancakes Pancakes Served with applewood-smoked bacon WHITE CHOCOLATE BREAD PUDDING PANCAKES Filled with white chocolate bread pudding and cinnamon sugar topped with white chocolate whiskey sauce CINNAMON SWIRL PANCAKES Filled with cinnamon & sugar and topped with cream cheese icing CLASSIC BUTTERMILK PANCAKES With cane syrup butter Eggs & Omelets Eggs & Omelets SOUTHERN BREAKFAST Two eggs any style, stone-ground grits, Applewood-smoked bacon, fried green tomato with a buttermilk biscuit GULF SHRIMP OMELET* Gulf shrimp, red onion, bell pepper, and cheddar cheese served with creamy stone-ground grits and a buttermilk biscuit BREAKFAST TACOS (VEG) Three grilled flour tortillas filled with a scramble of eggs, pico de gallo, pepper jack, chipotle sour cream, and avocado, served with a side of breakfast potatoesChorizo, Applewood-Smoked Bacon, Ham, Pork Sausage, Chicken Sausage, Shrimp Add Meat THREE LITTLE PIGS OMELET* Applewood-smoked bacon, ham, and sausage with Swiss cheese served with grits and a buttermilk biscuit FLORENTINE OMELET* Portobello mushroom, spinach & goat cheese served with a side salad and a buttermilk biscuit egg whites, spinach, mushrooms, and goat cheese Make It Skinny… SPANISH OMELET* Chorizo sausage, pico de gallo and pepper jack cheese served with grits and a buttermilk biscuit B.Y.O. OMELET Served with creamy stone-ground grits and a buttermilk biscuitCheddar, Swiss, Pepper Jack or Goat CheeseOnion, Tomato, Spinach, Mushrooms, Bell Peppers, Applewood-Smoked Bacon, Ham, Pork Sausage, Chicken Sausage, Chorizo, ShrimpPico De Gallo, Tasso Cream Sauce, Hollandaise Choose Your Cheese: Add up to 3: Sauce it up: Sammies & Salads Sandwiches CLASSIC BREAKFAST SANDWICH* Applewood-smoked bacon, scrambled egg, and cheddar served on your choice of brioche bun or buttermilk biscuit with a side of breakfast potatoes. Protein sub by request RUBY FRIED CHICKEN SANDWICH Crispy fried chicken, housemade roasted red pepper aioli, and pickles on a brioche bun, served with fries. Fried Chicken tossed in hot honey glaze Try It Sweet Heat-Style! HOT HONEY CHICKEN BISCUIT Crispy fried chicken tossed in hot honey glaze on a buttermilk biscuit, served with breakfast potatoes SOUTHERN BLT Fried green & fresh red tomato, Applewood-smoked bacon, lettuce and mayo on toast, served with fries SMASHBURGER* Two smashed beef patties with cheddar, red onion, lettuce, tomato, pickles, bacon-onion jam, and mayo on a brioche bun, served with fries On the Side On the Side APPLEWOOD-SMOKED BACON, PORK SAUSAGE LINKS, CHICKEN SAUSAGE PATTIES, CHORIZO SAUSAGE STONE-GROUND GRITS, BREAKFAST POTATOES, TATER TOTS, FRENCH FRIES BUTTERMILK BISCUIT OR TOAST served with butter or Crofter’s Preserves SEASONAL FRESH FRUIT SIDE SALAD served with Champagne Vinaigrette ONE EGG* (ANY STYLE) CLASSIC BUTTERMILK PANCAKE Coffee & Beverages Coffee & Beverages Our smooth Signature Breakfast Blend is crafted exclusively for you and the Ruby Krewe by our friends at French Truck Coffee. CREAMY VANILLA ICED COFFEE French Truck cold brew coffee, vanilla syrup, milk and cream topped with whipped cream and nutmeg CREAMY VANILLA SPICED LATTE French Truck espresso, vanilla syrup, milk and cream topped with whipped cream and nutmeg NOLA-STYLE ICED COFFEE French Truck cold brew coffee, milk & cream HOT COFFEE LATTE, CAPPUCINO OR ESPRESSO HOT CHOCOLATE OR HOT TEA JUICE (ORANGE, CRANBERRY, PINEAPPLE OR APPLE) MILK, CHOCOLATE MILK ICED TEA (SWEET OR UNSWEETENED) LEMONADE SODA PERRIER SPARKLING WATER ACQUA PANNA STILL WATER *These items may be cooked to order. Consuming raw or undercooked meats, poultry, seafood, shellfish or eggs may increase your risk of foodborne illness, especially if you have certain medical conditions. Food prepared in our kitchen may contain or come in contact with peanuts, tree nuts, soybeans, milk, wheat, fish and shellfish. Please let your server know if you have a food allergy or restriction. Ruby Slipper Restaurant Group Seasonal Specials Seasonal Specials KING CAKE BEIGNETS New Orleans-style beignets topped with almond cheesecake, blueberry compote, lemon curd, whipped cream and Mardi Gras sugar crystals. OOH-BAE STUFFED FRENCH TOAST Brioche French toast stuffed with ube cheesecake, topped with lemon curd, passion fruit popping boba and whipped cream. KREWE-BERRY MARGARITA Pueblo Viejo 100% Blanco tequila and triple sec blended with macerated blueberries, fresh blueberry juice and house sour mix, finished with a Mardi Gras sugar salt rim. Dietary Preference If you have a specific food allergy that could cause a medical reaction, we kindly ask that you inform your server before placing your order. Our team will work with you to help identify options that best meet your needs. This includes, but is not limited to, soy allergies. While we offer keto-friendly, vegetarian, vegan, and gluten-free options, please note that there is always a risk of cross-contact when preparing dishes in our kitchens. Many of our menu items may contain ingredients that were prepared in facilities that process or package nuts. As such, we are unable to guarantee 100% nut-free options. DOWNLOAD PDF Ruby’s Doggone Good Menu Ruby's Doggone Good Menu SHAGGY’S SCRAMBLE HOWL-LE-LU-JAH, the dog days are over!!! No need to beg for a piece of mommy’s omelet. Rollover and enjoy two eggs, cheddar cheese, and butter scrambled in with dices of green peppers and chicken sausage. BERRY GOOD BOY PUPCAKES Who has time to chase squirrels when pupcakes are unleashed? Your pup will sit and stay for our pet friendly pancakes topped with fresh strawberries and banana. It’s not just a treat; it’s the beagles-knees! RUBY PUPPYCCINO Not your average puppyccino! Your canine connoisseur will lap up the lagniappe and drool over the decadent combo of tasty, whipped cream, savory bacon, and fresh juicy blueberries. According to official research, it is as satisfying as a belly rub! Available only at the following Ruby Slipper and Ruby Sunshine locations: Franklin, TN, Brook Highland, AL, Charleston Downtown, SC, South End Charleston, SC, Baton Rouge, LA, Veterans Metairie, LA, Mid-City New Orleans, LA, Mobile, AL, Baytowne Miramar Beach, FL Menu items and pricing may vary by location",
      "hash": "d716fa20ad3f",
      "downloadedAt": "2026-01-18T16:54:52.241Z",
      "trimmedAt": "2026-01-18T17:07:16.664Z",
      "sizeReduction": "96.7%"
    }
  ],
  "sizeReduction": "97.4%"
}