{
  "venueId": "ChIJ83uOsQZ5_ogRWdldDaVO3Nw",
  "venueName": "Ray's Pizza",
  "venueArea": "James Island",
  "website": "https://www.rayspizzasc.com/",
  "scrapedAt": "2026-01-19T02:19:31.513Z",
  "trimmedAt": "2026-01-19T02:20:09.680Z",
  "pages": [
    {
      "url": "https://www.rayspizzasc.com/",
      "text": "[Page Title: James Island Pizza Delivery & Pickup | Ray's Pizza | Delicious Pizza Delivery & Pizza Takeout]\n\n0 \nON JAMES ISLAND\nRAY’S PIZZA ORDER ONLINE - VIEW MENU Pizza Delivery & Pickup \n1041 Folly Rd Charleston, SC 29412\n843-804-9900 ORDER ONLINE - VIEW MENU Let Ray’s Pizza Cater Your BIRTHDAY party or Event! Click Here To Check Out Our Catering Menu & Party Options FRESH INGREDIENTS HAND TOSSED DOUGH PIZZA BY THE SLICE & MORE! ORDER ONLINE - VIEW MENU \nAt Ray’s Pizza, our sauces and dough are made in-house daily, using the highest quality ingredients, including San Marzano tomatoes imported from Italy. Our pizzas are topped with fresh produce from local purveyors and superb meats. We also offer made-from-scratch Italian dishes for take-out and delivery.\n\nChef/owner Kevin Ray has worked in and managed pizza restaurants for 20+ years.  He is excited to bring his expertise to the James Island community! Our staff is trained to go above and beyond to make sure you have a quality experience, stop in soon to see us!\n\nHosting an event or party? Please contact us at for your catering needs!\n843.804.9900",
      "hash": "28e899b27859",
      "downloadedAt": "2026-01-19T02:10:14.731Z",
      "trimmedAt": "2026-01-19T02:20:09.663Z",
      "sizeReduction": "99.2%"
    },
    {
      "url": "https://www.rayspizzasc.com/pizza-party-catering",
      "text": "[Page Title: Pizza Catering Charleston | Pizza Party & Catering Menu | Ray's Pizza Catering & Large Party Menu — Ray's Pizza]\n\n0 Party & Catering menu Bring The Flavor of Ray’s Pizza To Your Next Event! \nWhether you’re planning a family gathering, office lunch, birthday party, or community event, let Ray's Pizza take care of the food with our delicious catering options.\n\nFrom hand-tossed pizzas and hearty pastas to fresh salads and sandwiches, our catering menu is packed with crowd-pleasers made from quality ingredients.\n\nWe make it easy to feed a hungry group—so you can focus on enjoying the moment.\n\nCatering orders are customizable, so give us a call and we can create the perfect menu for your event.\nPlease place catering orders at least 48 hours in advance 843-804-9900 Click To Email Click Here To Download Our Catering Menu & See Prices FRESH INGREDIENTS HAND TOSSED DOUGH WINGS-PIZZA-PASTA & MORE",
      "hash": "5ba4a83cdff5",
      "downloadedAt": "2026-01-19T02:10:14.903Z",
      "trimmedAt": "2026-01-19T02:20:09.674Z",
      "sizeReduction": "99.5%"
    },
    {
      "url": "https://www.rayspizzasc.com/contact",
      "text": "[Page Title: Ray's Pizza James Island Location & Contact | Ray's Pizza Delivery & Pizza Take Out | James Island — Ray's Pizza]\n\n0 \nJAMES ISLAND LOCATION & Contact\nDELIVERY & PickuP Orders 1041 Folly Road CHARLESTON, SC 29412 804-9900 843- ORDER FOOD ONLINE",
      "hash": "6fed26094fa3",
      "downloadedAt": "2026-01-19T02:10:15.450Z",
      "trimmedAt": "2026-01-19T02:20:09.680Z",
      "sizeReduction": "99.8%"
    }
  ],
  "sizeReduction": "99.5%"
}