{
  "venueId": "ChIJo8feqg96_ogRN252YIZn2_8",
  "venueName": "Oak Steakhouse",
  "venueArea": "Downtown Charleston",
  "website": "https://www.oaksteakhouserestaurant.com/location/oak-steakhouse-charleston/?y_source=1_ODE4NDQwNTgtNzE1LWxvY2F0aW9uLndlYnNpdGU%3D",
  "scrapedAt": "2026-01-18T17:04:29.816Z",
  "trimmedAt": "2026-01-18T17:11:49.027Z",
  "pages": [
    {
      "url": "https://www.oaksteakhouserestaurant.com/location/oak-steakhouse-raleigh/",
      "text": "Main content starts here, tab to start navigating Oak Steakhouse Raleigh Reservations Slide 1 of 4 Slide 2 of 4 Slide 3 of 4 Slide 4 of 4 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Hours & Location 417 W Hargett Street, Raleigh, NC 27603 (984) 255-1818 oakraleigh@theindigoroad.com Located at The Dillon. Hours 5 p.m. to 10 p.m. Monday to Friday 4 p.m. to 10 p.m. Saturday 4 p.m. to 9 p.m. Sunday Facebook Instagram Modern Flavor, Southern Spirit In the heart of The Warehouse District, Oak Steakhouse Raleigh brings a contemporary approach to the classic American steakhouse; where timeless hospitality meets modern Southern charm. Named among Raleigh Magazine’s Best Steakhouses and praised by The News & Observer for its commitment to quality, Oak has quickly become a destination for refined dining and memorable evenings. The menu celebrates the finest cuts of Certified Angus Beef®, sourced for peak marbling and flavor, alongside fresh seafood and locally inspired dishes that reflect North Carolina’s rich culinary traditions. Signature plates include perfectly seared filets, roasted seasonal vegetables, and a rotating selection of chef-driven creations that evolve with the region’s harvest. Set within a sophisticated yet inviting space, Oak Steakhouse Raleigh pairs warm hospitality with an atmosphere designed for every occasion; from intimate dinners to spirited gatherings. With its curated wine list, handcrafted cocktails, and thoughtful service, Oak offers an experience rooted in tradition yet defined by innovation. Be the First to Know Get insider access to Oak Steakhouse. Sign up for our mailing list and be the first to hear about exclusive events, menus and announcements. Email Signup Get Directions Press WALTER Magazine 10 Tips for Grilling Steak with Chef Todd Woods Issuu Midtown Magazine WRAL.com Cook up spicy, sweet, crispy pig ears :: News & Observer Review: Oak Steakhouse brings new school update to classic American steakhouse Raleigh Magazine The 25 Best Dishes in Raleigh Issuu Raleigh’s Best New Restaurants of 2019 Spectrum News 1 Menu Hopping: Oak Steakhouse Opens in Downtown Raleigh ABC11 Raleigh-Durham Angus Barn, O-Ku win top honors at Toast to the Triangle News & Observer The Dillon continues to add restaurants. Look for a steakhouse to open downtown. Triangle Business Journal New steakhouse coming to The Dillon About Our Story Menus See what we're serving. View Menus Private Dining Host your next special occasion with us. Inquire Now Steak at Home Certified Angus Beef Wet Aged and Dry Aged Steaks are not only served at our restaurants, they are now delivered to your doorstep.Vacuum packed, boxed on dry ice, and shipped always with a little extra love and care.Whether it is for your home, your best friend, or holiday gift, we ship nationwide, just for you. Or them. Or your Boss! Simplicity at its best. We handle all the tough stuff. Year Round. Nationwide. Place an Order Gallery View Gallery Reservations Order Online Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Alexandria Atlanta Charleston Charlotte Highlands Nashville Raleigh Rogers Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "28eb84750ef6",
      "downloadedAt": "2026-01-18T16:54:43.537Z",
      "trimmedAt": "2026-01-18T17:11:48.892Z",
      "sizeReduction": "93.2%"
    },
    {
      "url": "https://www.oaksteakhouserestaurant.com/location/oak-steakhouse-charleston/?y_source=1_ODE4NDQwNTgtNzE1LWxvY2F0aW9uLndlYnNpdGU%3D",
      "text": "Main content starts here, tab to start navigating Oak Steakhouse Charleston Reservations Slide 1 of 7 Slide 2 of 7 Slide 3 of 7 Slide 4 of 7 Slide 5 of 7 Slide 6 of 7 Slide 7 of 7 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Hours & Location 17 Broad Street, Charleston, SC 29401 (843) 722-4220 Monday - Friday: 5 - 10 p.m.Saturday + Sunday: 4 - 10 p.m. Dinner Parking Valet service is available at the restaurant entrance for your convenience. Nearby public parking is also accessible, with the closest garage located at the just a short walk away. East Bay/Prioleau Car Park Facebook Instagram A Charleston Classic Located on Charleston’s storied Broad Street, Oak Steakhouse redefines the classic American steakhouse experience in a setting as unforgettable as the cuisine. Housed in a grand 1848 bank building, the restaurant spans three floors of preserved architectural splendor, featuring arched windows, soaring 20-foot ceilings, original ironwork, working fireplaces, and 150-year-old heart pine floors that speak to the city’s rich heritage. Oak’s menu centers around Prime Certified Angus® Beef, sourced from top-tier producers and aged to perfection. Complementing the steaks is a thoughtful selection of locally and regionally sourced seafood, produce, and Lowcountry ingredients that reflect the bounty of the Southeast. The wine list is equally impressive—highlighting bold California Cabernets, refined Old World reds, and over 200 labels curated to pair beautifully with the menu. With four distinct dining spaces, warm hospitality, and a balance of tradition and sophistication, Oak Steakhouse Charleston is a destination for memorable evenings, special occasions, and exceptional food done right. Be the First to Know Get insider access to Oak Steakhouse. Sign up for our mailing list and be the first to hear about exclusive events, menus and announcements. Email Signup Get Directions Press Condé Nast Traveler \"This is one can't-miss steakhouse\" Condé Nast Traveler 36 Best Restaurants in Charleston Condé Nast Traveler Oak Steakhouse — Restaurant Review Explore Charleston 37 Spots for Oysters in Charleston Far & Wide 50 Best Steakhouses in the U.S. Ranked (#21) Charleston City Paper Our go-to restaurants for everything from decadent to down-home fare Far & Wide 50 Best Steakhouses in the U.S., Ranked Foursquare The 15 Best Places for Key Lime Pie in Charleston Travel + Leisure The Best Steakhouses in the United States Food Network The Best Steak Restaurants in the Country About Our Story Menus See what we're serving. View Menus Private Dining Host your next special occasion with us. Inquire Now Steak at Home Certified Angus Beef Wet Aged and Dry Aged Steaks are not only served at our restaurants, they are now delivered to your doorstep.Vacuum packed, boxed on dry ice, and shipped always with a little extra love and care.Whether it is for your home, your best friend, or holiday gift, we ship nationwide, just for you. Or them. Or your Boss! Simplicity at its best. We handle all the tough stuff. Year Round. Nationwide. Place an Order Gallery View Gallery Reservations Order Online Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Alexandria Atlanta Charleston Charlotte Highlands Nashville Raleigh Rogers Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "342b7c3f9652",
      "downloadedAt": "2026-01-18T16:54:39.802Z",
      "trimmedAt": "2026-01-18T17:11:48.904Z",
      "sizeReduction": "92.7%"
    },
    {
      "url": "https://www.oaksteakhouserestaurant.com/location/jacksonville/",
      "text": "Main content starts here, tab to start navigating Jacksonville Coming Soon Hours & Location 204 N. Laura Street, Jacksonville, FL 32202 oakjacksonville@theindigoroad.com Hours Coming Soon A Modern Classic in the Heart of Jacksonville Oak Steakhouse Jacksonville brings the acclaimed legacy of its sister locations—recognized by Travel + Leisure, Atlanta Magazine, and Jezebel—to the heart of Northeast Florida. Located in a beautifully restored 100-year-old building with striking art-deco character, Oak offers an elevated dining experience rooted in tradition. Guests enjoy Prime Certified Angus Beef®, a seasonally driven menu featuring local and regional ingredients, a world-class wine list, and gracious, attentive service in a space that’s both sophisticated and welcoming. Be the First to Know Get insider access to Oak Steakhouse. Sign up for our mailing list and be the first to hear about our opening date, exclusive pre-opening events, and priority to our first reservations. Email Signup Get Directions Reservations Order Online Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Alexandria Atlanta Charleston Charlotte Highlands Nashville Raleigh Rogers Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "422e8574a4df",
      "downloadedAt": "2026-01-18T16:54:42.477Z",
      "trimmedAt": "2026-01-18T17:11:48.909Z",
      "sizeReduction": "94.9%"
    },
    {
      "url": "https://www.oaksteakhouserestaurant.com/location/oak-steakhouse-charlotte/",
      "text": "Main content starts here, tab to start navigating Oak Steakhouse Charlotte Reservations Slide 1 of 5 Slide 2 of 5 Slide 3 of 5 Slide 4 of 5 Slide 5 of 5 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Hours & Location 4777 Sharon Road, Suite 125, Charlotte, NC 28210 (704) 954-8900 oakcharlotte@theindigoroad.com Oak Steakhouse Charlotte is located in the SunTrust Building at Sharon Square. Sunday – Thursday 5pm-9pmFriday & Saturday 5pm-10pm Dinner Half-Off Bottles Sundays Sunday evenings enjoy half-off bottles of wine up to $100. All bottles $100 or more are $50 off. Reservations Reservations on OpenTable encouraged, but not required.To-go is available by calling . (704) 954-8900 Facebook Instagram Where Classic Steakhouse Tradition Meets Southern Charm Located in the vibrant SouthPark neighborhood, Oak Steakhouse Charlotte offers a contemporary take on the classic American steakhouse. Known for its impeccable service and sophisticated yet welcoming atmosphere, Oak has earned recognition from Charlotte Magazine and The Charlotte Observer for its elevated dining experience that combines timeless technique with modern creativity. The menu highlights the finest cuts of Certified Angus Beef®, complemented by locally and regionally sourced seafood, produce, and seasonal specialties. Signature dishes like the dry-aged ribeye, house-cut filet, and buttery crab cakes are crafted with care and precision, while inventive sides and composed plates celebrate the flavors of the Carolinas. The bar program features an extensive wine list, handcrafted cocktails, and a thoughtful selection of bourbons that pair perfectly with each meal. Inside, the warm glow of the dining room, accented by exposed brick, rich wood, and intimate lighting, sets the stage for every occasion, from business dinners and celebrations to memorable nights out. With a private dining room, lively bar, and attentive team dedicated to genuine hospitality, Oak Steakhouse Charlotte delivers an experience that’s as refined as it is inviting. Order Online Be the First to Know Get insider access to Oak Steakhouse. Sign up for our mailing list and be the first to hear about exclusive events, menus and announcements. Email Signup Get Directions Press Charlotte Business Journal Local Restaurant Group Lands on National Ranking Axios One of Charlotte's Best Steakhouses Charlotte Magazine Steakhouse Guide: Where to Celebrate Special Occasions in Charlotte Charlotte Observer The 2021 ultimate guide to patios in Charlotte: SouthPark edition Charlotte Magazine A Date Night at Oak Steakhouse About Our Story Menus See what we're serving. View Menus Private Dining Host your next special occasion with us. Inquire Now Steak At Home Certified Angus Beef Wet Aged and Dry Aged Steaks are not only served at our restaurants, they are now delivered to your doorstep.Vacuum packed, boxed on dry ice, and shipped always with a little extra love and care.Whether it is for your home, your best friend, or holiday gift, we ship nationwide, just for you. Or them. Or your Boss! Simplicity at its best. We handle all the tough stuff. Year Round. Nationwide. Place an Order Gallery View Gallery Reservations Order Online Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Alexandria Atlanta Charleston Charlotte Highlands Nashville Raleigh Rogers Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "572d630ae690",
      "downloadedAt": "2026-01-18T16:54:41.423Z",
      "trimmedAt": "2026-01-18T17:11:48.920Z",
      "sizeReduction": "92.3%"
    },
    {
      "url": "https://www.oaksteakhouserestaurant.com/location/oak-steakhouse-alexandria/",
      "text": "Main content starts here, tab to start navigating Oak Steakhouse Alexandria Reservations Slide 1 of 4 Slide 2 of 4 Slide 3 of 4 Slide 4 of 4 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Hours & Location 901 North Saint Asaph Street, Alexandria, VA 22314 (703) 840-3395 oaksteakhousealexandria@theindigoroad.com DinnerSunday – Thursday: 5 to 9 p.m.Friday – Saturday: 5 to 10 p.m. Bar MenuMonday - Friday: 5 to 6:30 p.m. Facebook Instagram A Classic Steakhouse Reimagined in Historic Alexandria in Old Town, Oak Steakhouse Alexandria brings its celebrated approach to the modern American steakhouse to one of the city’s most storied neighborhoods. Recognized by Eater DC and Northern Virginia Magazine for its elevated cuisine and gracious service, Oak offers a dining experience rooted in timeless tradition and driven by innovation. The menu features Prime Certified Angus Beef® cuts, expertly prepared and complemented by locally sourced seafood, seasonal vegetables, and contemporary chef-driven dishes. Guests can expect everything from signature bone-in ribeye and seared scallops to inventive small plates designed to share. The carefully curated wine list and handcrafted cocktail program reflect Oak’s passion for balance, flavor, and craftsmanship. Inside, the atmosphere blends modern sophistication with a nod to the building’s historic charm, rich wood, exposed brick, and ambient lighting create a setting that’s both intimate and inviting. Whether for a romantic dinner, a business gathering, or a celebration among friends, Oak Steakhouse Alexandria captures the best of Southern hospitality and steakhouse excellence in every detail. Be the First to Know Get insider access to Oak Steakhouse. Sign up for our mailing list and be the first to hear about exclusive events, menus and announcements. Email Signup Get Directions Press Local Experience Your Weekend Guide The List | Are You On It? OAK STEAKHOUSE: ALEXANDRIA Hospitality Design A New Steakhouse Opens in a DC Suburb, Crafted in a Warm, Rustic Style Thrillist Actually Fun Things to Do in DC This Christmas Weekend The Zebra Foody Newz: Openings, Closures and Restaurant Week Alexandria Stylebook Restaurant Report: Oak Steakhouse Washington Post A Charleston restaurant group plants a steak in Old Town Northern Virginia Magazine 5 things to know about the August food scene in Northern VA Northern Virginia Magazine 5 things to know about the August food scene in Northern VA Alexandria Times Oak Steakhouse joins Alexandria's sizzling restaurant scene | | Alexandria, VA About Our Story Menus See what we're serving. View Menus Private Dining Host your next special occasion with us. Inquire Now Steak at Home Certified Angus Beef Wet Aged and Dry Aged Steaks are not only served at our restaurants, they are now delivered to your doorstep.Vacuum packed, boxed on dry ice, and shipped always with a little extra love and care.Whether it is for your home, your best friend, or holiday gift, we ship nationwide, just for you. Or them. Or your Boss! Simplicity at its best. We handle all the tough stuff. Year Round. Nationwide. Place an Order Gallery View Gallery Reservations Order Online Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Alexandria Atlanta Charleston Charlotte Highlands Nashville Raleigh Rogers Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "6a9b974a6a73",
      "downloadedAt": "2026-01-18T16:54:39.841Z",
      "trimmedAt": "2026-01-18T17:11:48.932Z",
      "sizeReduction": "93.1%"
    },
    {
      "url": "https://www.oaksteakhouserestaurant.com/location/oak-steakhouse-atlanta/",
      "text": "Main content starts here, tab to start navigating Oak Steakhouse Atlanta Reservations Slide 1 of 5 Slide 2 of 5 Slide 3 of 5 Slide 4 of 5 Slide 5 of 5 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Hours & Location 950 Third Street, Alpharetta, GA 30009 (678) 722-8333 Monday through Thursday5 p.m. to 10 p.m.Friday5 p.m. to 11 p.m. Saturday4 p.m. to 11 p.m. Sunday4 p.m. to 9 p.m. Facebook Instagram A Modern Classic in the Heart of Avalon Located in the heart of Alpharetta’s vibrant Avalon community, Oak Steakhouse brings a modern sensibility to the classic American steakhouse. Since opening, it has earned acclaim from Atlanta Magazine, Eater Atlanta, and Thrillist for its impeccable service, refined atmosphere, and culinary excellence. Oak combines the warmth of Southern hospitality with the sophistication of a city steakhouse, creating a destination for celebrations, business dinners, and evenings that call for something exceptional. At the center of the menu is Certified Angus Beef®, hand-selected and aged to perfection—featuring signature cuts like the filet, New York strip, and bone-in ribeye. Seasonal seafood dishes, housemade pastas, and locally inspired sides round out the menu, while nightly specials showcase the creativity of the kitchen and the best ingredients from regional purveyors. Guests can also enjoy an award-winning wine list and expertly crafted cocktails that complement every plate. The restaurant’s ambiance blends rustic charm and contemporary design, with leather banquettes, exposed brick, and an inviting glow from the open kitchen. Whether dining in the intimate dining room, relaxing at the lively bar, or gathering in one of the private spaces, Oak Steakhouse Alpharetta offers a timeless yet fresh approach to dining, one that continues to set the standard for steakhouses in the Southeast. Order Online Be the First to Know Get insider access to Oak Steakhouse. Sign up for our mailing list and be the first to hear about exclusive events, menus and announcements. Email Signup Get Directions Press Atlanta Magazine Best Steakhouses in Atlanta Jezebel Magazine The Best Steakhouses in Atlanta JEZEBEL 100 Hottest Restaurants Travel Channel Delightfully Delicious Sweet And Savory Pies Eater Atlanta Feast on Juicy Steaks at These Atlanta Steakhouses AJC 10 summer spritzers to cool you off in metro Atlanta FOX 5 Atlanta Burgers with Buck: Oak Steakhouse Eater Atlanta Best Steakhouses in Atlanta Atlanta Journal-Constitution 5 Fabulous Hidden Gems for Brunch in Atlanta Jezebel #41 in list of “100 Hottest Restaurants About Our Story Menus See what we're serving. View Menus Private Dining Host your next special occasion with us. Inquire Now Steak at Home Certified Angus Beef Wet Aged and Dry Aged Steaks are not only served at our restaurants, they are now delivered to your doorstep.Vacuum packed, boxed on dry ice, and shipped always with a little extra love and care.Whether it is for your home, your best friend, or holiday gift, we ship nationwide, just for you. Or them. Or your Boss! Simplicity at its best. We handle all the tough stuff. Year Round. Nationwide. Place an Order Gallery View Gallery Reservations Order Online Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Alexandria Atlanta Charleston Charlotte Highlands Nashville Raleigh Rogers Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "72e94370ece2",
      "downloadedAt": "2026-01-18T16:54:40.365Z",
      "trimmedAt": "2026-01-18T17:11:48.943Z",
      "sizeReduction": "92.9%"
    },
    {
      "url": "https://www.oaksteakhouserestaurant.com/location/oak-steakhouse-highlands/",
      "text": "Main content starts here, tab to start navigating Oak Steakhouse Highlands At Skyline Lodge Slide 1 of 6 Slide 2 of 6 Slide 3 of 6 Slide 4 of 6 Slide 5 of 6 Slide 6 of 6 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Hours & Location 470 Skyline Lodge Rd, Highlands, NC 28741 828-482-4720 oakhighlands@theindigoroad.com Oak Steakhouse Hours Bar: Bar opens at 4 p.m. Dinner: &Sunday, Monday Thursday 5 p.m. to 9 p.m. Friday & Saturday 5 p.m. to 10 p.m. Brunch: Sundays 9 a.m. to 2 p.m. *Walk-ins are welcome but reservations are strongly recommended Monday Wine Night On Mondays, enjoy half off bottles of wine priced up to $100. For bottles over $100, receive $50 off. Facebook Instagram A Modern Steakhouse in the Mountains Skyline Lodge’s second floor is home to Oak Steakhouse, a contemporary steakhouse featuring the finest cuts of Certified Angus Beef and locally sourced produce from area farms. The first and only steakhouse in Highlands, Oak partners with area purveyors and neighboring farms to bring the flavors of Appalachia right to the table. Guests will enjoy a variety of starters, entrees, sides, and more, including Venison Wellington with mushrooms, pearl onion, prosciutto, and celery root puree, Sunburst Farms Trout with carrots, squash, caramelized cippolini, pepperonata, and gremolata; and, of course, a selection of Certified Angus Beef steaks. And for those with a sweet tooth, Oak Steakhouse offers delectable treats such as 8 Layer Chocolate Cake (which also happens to be gluten-free) and a house-made seasonal sorbet. The beverage program at Oak features an expansive wine list that complements the restaurant’s culinary menus, an ever-evolving cocktail selection, a variety of local beers, spirit-free cocktails, and more. The menu features creative touches on classic libations. Guests are encouraged to enjoy their beverages “on the rocks and under the stars” on the property’s outdoor patio, which overlooks the lodge’s stone terrace and overhears the sounds of Big Creek Falls and Laurel Falls just below. In addition to Oak, Skyline Lodge’s central lobby bar features expansive lounge seating, vaulted load-bearing ceilings, and two large scale fireplaces of hand-carved, locally quarried granite, and offers mid-century favorites such as Corpse Revivers, Manhattans, and Whisky Smashes as well as contemporary riffs on classics—nodding to the property’s 1960s roots. About Skyline Lodge Upcoming Events Be the First to Know Get insider access to Oak Steakhouse. Sign up for our mailing list and be the first to hear about exclusive events, menus and announcements. Email Signup Get Directions Private Dining & Events Host your next special occasion with us. We can host up to 75 guests in indoor and outdoor venues. Inquire Now Press Garden & Gun Seven Southern Hotel Bars Worth a Stay Chilled Magazine What Are Table-side Cocktail Experiences in Today’s Top Bars Plateau Magazine Midcentury Style with Modern Taste AAA Explorer Worth The Drive Maxim A Seriously Good Steakhouse Atlanta Magazine 3 killer hotel restaurants around Atlanta Laurel Magazine Oak Steakhouse: Under the Stars, On the Rocks Guest Chef Series Southbound Magazine Killer Hotel Restaurants StyleBlueprint 5 Southern Road Trips to Add to Your Bucket List Laurel Magazine Skyline’s Got the Sizzle About Our Story Menus View Menus Steak at Home Certified Angus Beef Wet Aged and Dry Aged Steaks are not only served at our restaurants, they are now delivered to your doorstep.Vacuum packed, boxed on dry ice, and shipped always with a little extra love and care.Whether it is for your home, your best friend, or holiday gift, we ship nationwide, just for you. Or them. Or your Boss! Simplicity at its best. We handle all the tough stuff. Year Round. Nationwide. Place an Order Gallery View Gallery Reservations Order Online Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Alexandria Atlanta Charleston Charlotte Highlands Nashville Raleigh Rogers Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "84b03ae08e35",
      "downloadedAt": "2026-01-18T16:54:41.950Z",
      "trimmedAt": "2026-01-18T17:11:48.953Z",
      "sizeReduction": "91.5%"
    },
    {
      "url": "https://www.oaksteakhouserestaurant.com/location/rogers/",
      "text": "Main content starts here, tab to start navigating Oak Steakhouse Rogers Reservations Hours & Location 4100 S. Pinnacle Hills Pkwy, Rogers, AR 72758 oakrogers@theindigoroad.com Hours Sunday through Thursday 3 to 10 p.m.Friday & Saturday 3 to 11 p.m. Bar Sunday through Thursday 4 to 9 p.m.Friday & Saturday 4 to 10 p.m. Dinner Saturday & Sunday 10 a.m. to 2 p.m. Brunch Open Daily from 6:30am to 3pm Little Acorn Café Parking Guests of Oak Steakhouse can valet for $15 at the Avail's valet stand. Free street parking is also available. Facebook Instagram A Modern American Steakhouse Above It All Perched on the rooftop of , Oak Steakhouse brings its signature approach to the classic American steakhouse, where the finest cuts of steak, an uncompromising commitment to quality, and genuine hospitality set the stage for an unforgettable dining experience. Hotel Avail in Rogers Rooted in tradition but driven by innovation, Oak’s menu highlights the highest-quality beef, sourced from the top producers within the Certified Angus Beef® portfolio, alongside locally inspired dishes that reflect the season. The bar program features a curated selection of wines, handcrafted cocktails, and a deep collection of bourbons and spirits to complement every meal. With a stylish dining room, an intimate bar, private dining space, and an expansive outdoor terrace, Oak Steakhouse Rogers is a destination for celebrations, business gatherings, and indulgent evenings alike, where every detail is designed to elevate the moment. Be the First to Know Get insider access to Oak Steakhouse. Sign up for our mailing list and be the first to hear about exclusive events, menus and announcements. Email Signup Get Directions Press Axios Oak Steakhouse Talk Business & Politics Rooftop restaurant opens at new hotel in Rogers Northwest Arkansas Democrat-Gazette Oak Steakhouse in Rogers AY Magazine Oak Steakhouse Brings Upscale Dining, Rooftop Views to Rogers About Our Story Menus See What We're Serving Menus Private Dining Host your next special occasion with us. Inquire Now Steak at Home Certified Angus Beef Wet Aged and Dry Aged Steaks are not only served at our restaurants, they are now delivered to your doorstep.Vacuum packed, boxed on dry ice, and shipped always with a little extra love and care.Whether it is for your home, your best friend, or holiday gift, we ship nationwide, just for you. Or them. Or your Boss! Simplicity at its best. We handle all the tough stuff. Year Round. Nationwide. Place an Order Gallery View Gallery Reservations Order Online Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Alexandria Atlanta Charleston Charlotte Highlands Nashville Raleigh Rogers Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "a5a0e11d2ae1",
      "downloadedAt": "2026-01-18T16:54:44.066Z",
      "trimmedAt": "2026-01-18T17:11:48.962Z",
      "sizeReduction": "92.8%"
    },
    {
      "url": "https://www.oaksteakhouserestaurant.com/alexandria-menus/",
      "text": "Main content starts here, tab to start navigating Menus Alexandria Raw Bar Bar Menu Dinner Wine, Cocktail + Beer Dessert Shellfish & Crudo Crudo* fresh fish, apple consomme, compressed apple with honey, micro nasturtium 22 $ East Coast Oysters* gin cocktail sauce, mignonette 4 $ Oysters Rockefeller* bacon, spinach, garlic streusel 5 $ Octopus Ceviche* citrus, hazelnut puree, finger limes, serrano dressing, pancetta crumble 18 $ Shrimp Cocktail* gin cocktail sauce, dijonaise 22 $ Chilled Shellfish Platter* chef selection of oysters, shrimp, jumbo lump crab, & ceviche with gin cocktail sauce, dijonnaise, & mignonette Caviar Service ostera caviar, blinis, craime fraiche, egg yolk, egg white, shallots 100 $ Monday-Friday 5-6:30pm Roasted Garlic Hummus pickled kabocha squash, zaatar, grilled pita 8 $ Burger & Beer Special* burger & draft beer special 21 $ East Coast Oysters* gin cocktail sauce, mignonette 3 $ Baked Smoked Gouda Mac & Cheese rotating special 8 $ Oysters Rockefeller* oysters rockefeller with bacon, spinach, garlic streusel 4 $ Beef-Fat Fries beef-fat fries, parmesan cheese, chives 7 $ Ceviche* aji amarillo, pink peppercorn, micro cilantro 14 $ Featured House White Wine Featured House Red Wine Featured Happy Hour Cocktail Bread Service Housemade \"Parkerhouse\" Rolls 8 $ Appetizers Roasted Garlic Hummus peas, pickled squash, baby heirloom tomatoes, zaatar 14 $ Italian Burrata Whipped avocado,pea puree, basil oil, baby heirloom tomatoes, micro basil, toasted coconut, english peas 21 $ Braised Beef Belly bacon jam, poached mustard greens, celery root puree, toasted sesame bordelaise 22 $ Charcuterie Board rosette de lyon, saucisson 'a L'ail, duck prosciutto, dijon mustard, cornichon, frisee, radish, compressed melon 30 $ Seared Hudson Valley Foie Gras compressed rhubarb, gridled toast, balsamic reduction, candies beet sauce 29 $ C.A.B. Beef Tartare aji amarillo, roasted garlic puree, potato chips, smoked sea salt 21 $ Soup & Salads Baby Gem Caesar Traditional Caesar, Grated Parmesan, White Anchovy, Garlic Streusel 16 $ Grilled Chicken Breast 14 $ Grilled Steak 22 $ Grilled Shrimp 21 $ Iceberg Wedge Baby Heirloom Tomato, Bleu Cheese, Pork Rind, Fines Herbs, Pickled Shallot, Buttermilk Dressing 15 $ Grilled Chicken Breast 14 $ Grilled Steak 22 $ Grilled Shrimp 21 $ Stone Fruit Salad mixed greens, peaches, radishes, basil-caraway vinagrette 16 $ Entrees Oak A5 Wagyu Burger white cheddar sauce, caramelized onions, bacon, creamy harissa, beef-fat fries 28 $ Steak Frites butcher’s steak, beef-fat fries, au poivre 40 $ Chef's Fresh Catch braised napa cabbage, peas, carpers, marcona almonds, lemongrass oil MP Seared Sea Scallops fennel gonocchi, carrots, beet chips, avocado mousse, sherry-rum sauce 40 $ Seared Duck Breast wild rice, white asparagus, swiss chard, white wine-butter sauce 40 $ Signature Steaks 6oz Petit Filet Mignon Certified Angus Beef 52 $ 10oz Filet Mignon Certified Angus Beef 77 $ 10oz Hanger Certified Angus Beef 47 $ 12oz Boneless Prime New York Strip Certified Angus Beef 68 $ 16oz Prime Boneless Ribeye Certified Angus Beef 84 $ Lagenfelder Farms 15oz Pork Chop 41 $ Kagoshima A5 Japanese Wagyu NY Strip | 2oz Minimum per oz 40 $ Add to Any Steak Grilled Shrimp 21 $ Jumbo Lump Crab Oscar 28 $ Seared Foie Gras 27 $ Bleu Cheese Crust 8 $ Seared Sea Scallops 22 $ Sauces & Butters Oak Steak Sauce 2 $ Au Poivre 4 $ Bearnaise 3 $ Chimichurri 2 $ Hollandaise 2 $ Creamy Horseradish 2 $ Red Wine Jus 4 $ Black Truffle Butter + 6 $ Roasted Garlic Butter 3 $ Sides for The Table Baked Smoked Gouda Mac & Cheese . 14 $ Add Jumbo Lump Crab + 25 $ Add lardones + 8 $ Crispy Brussels Sprouts apple cider soy caramel, fried shallot 13 $ Sauteed Spinach garlic, shallot, olive oil 13 $ Cremini & King Oyster Mushrooms veal jus, soy black pepper butter, garlic streusel 18 $ Yukon Gold Potato Purée 12 $ Creamed Corn potato, garlic, basil, thyme, parmesan 12 $ Beef-Fat Fries parmesan, chive 12 $ Cocktails Dude Where's My Car-amel? apple insfused vodka, caramel simple, lemon, licor 43, club soda 17 $ Land Before Thyme gin, grapefruit juice, thyme simple, pomegranate juice 17 $ Crouching Ginger Hidden Tiger blanco tequila, lime, ginger simple, creme de cassis 17 $ Rum-ble In The Bronx dark rum, licor 43, cappelletti, lemon 17 $ Smokey And The Bourbon allspiced infused whiskey, lemon, ginger beer, smoked maple simple 17 $ The Oak Manhattan bourbon & rye, \"secret\" vermouth blend, house-made cherry bitters 18 $ Beer | Draft Port City Optimal Wit Belgian Style White Ale, Alexandria, VA (4.9%ABV) Port City Monumental IPA IPA, Alexandria, VA (6.3%ABV) Right Proper \"Senate Beer\" American-Style Lager, Washington DC (4.7%ABV) Seasonal Rotating Selection Beer | Can / Bottle Ornery \"Light of Cologne\" German Pale Ale, Manassas, VA (5% ABV) Right Proper \"Raised By Wolves\" dry hopped pale ale, Washington DC (5%ABV) Great Lakes Brewing Co. \"Eliot Ness\" Amber Lager, Cleveland OH (6.1% ABV) Honor \"Hazy\" Hazy IPA, Sterling VA (6.3% ABV) Solace \"Partly Cloudy\" IPA, Sterling VA (7.5%ABV) Seasonal Rotating Selection N/A Clausthaler \"Original\" N/A Kit \"Hazy\" Hazy IPA, Portland ME Spirit Free Cocktails Lost In Cranslation cranberry juice, allspice simple, caramel simple, lemon, club soda 10 $ Dragaon Pom Z pomegrante juice, ginger beer, ginger simple, lime 10 $ The Thymeinator grapefruit juice, thyme simple, lemon, club soda 10 $ Wine by The Glass Jeio Prosecco NV Veneto, Italy 13 $ Brut Rosé, Piper-Sonoma NV Sonoma Coast, CA 15 $ Charles Le Bel \"Inspiration 1818\" NV Champagne, France 29 $ Sauvignon Blanc, Dawn Chorus Hawke's Bay, New Zealand 2022 13 $ Albarino, Hendry Vineyards Napa Valley, CA 2022 15 $ Pinot Grigio, Tiefenbrunner Alto Adige, Italy 2021 12 $ Chardonnay, Mason Cellars Napa Valley, CA 2021 16 $ Chardonnay, Duckhorn Portfolio \"Decoy Limited\" Sonoma Coast, CA 2021 18 $ Rosé, Conde Valdemar Rioja, Spain 2022 13 $ Pinot Noir, Annabella Russian River Valley, CA 2020 14 $ Pinot Noir, J. Christopher \"Basalte\" Willamette Valley, OR 2021 18 $ Malbec, Familia Mayol Mendoza, Argentina 2022 12 $ Super Tuscan, Avignonesi \"Grifi\" Tuscany, Italy 2020 18 $ Bordeaux, Chateau Cissac \"Reflets\" Bordeaux, France 2019 19 $ Cabernet Sauvignon, Robert Hall Paso Robles, CA 2020 13 $ Cabernet Sauvignon, Michael Pozzan Alexander Valley, CA 2020 16 $ Red Blend, Leviathan Oakville, CA 2021 20 $ Cabernet Sauvignon, Clos du Val Napa Valley, CA 2021 25 $ Wines by the Bottle List Available Upon Request Desserts 7 Layer Chocolate Cake cocao nib crumble, salted caramel ice cream, caramelized milk choclate ganache 17 $ Chocolate Semifreddo Muscadine granita, candied almonds 13 $ Caramel Apple Bread Pudding croissant bread pudding, caramelized apples, mapple ice cream, spiced bourbon caramel 13 $ Toasted Milk Cheesecake quince jam, honey cardamom chantilly cream, pistachio-orange crumble 16 $ Oak Sundae chocolate cake, chocolate sauce, cookie batter cream, grahm cracker ice cream, toasted marshmallows 12 $ Pumpkin-Date Sticky Cake maple roasted pecans, creme fraiche ice cream, pumpkin caramel 14 $ Oatmeal Cream Pie 10 $ Cocktails Under the Milky Way House Infused Chocolate Vodka, Baileys, Dulce De Leche, Chocolate Bitters 13 $ Reservations Order Online Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Alexandria Atlanta Charleston Charlotte Highlands Nashville Raleigh Rogers Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "aee058b68c55",
      "downloadedAt": "2026-01-18T16:54:44.595Z",
      "trimmedAt": "2026-01-18T17:11:49.006Z",
      "sizeReduction": "94.2%"
    },
    {
      "url": "https://www.oaksteakhouserestaurant.com/location/oak-steakhouse-nashville/",
      "text": "Main content starts here, tab to start navigating Oak Steakhouse Nashville Slide 1 of 4 Slide 2 of 4 Slide 3 of 4 Slide 4 of 4 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Hours & Location 801 Clark Place, Nashville, TN 37203 (615) 902-3111 Hours Sunday - Thursday 5-9Fri & Saturday 4-10 Facebook Instagram Where Southern Warmth Meets Steakhouse Excellence In the heart of downtown Nashville, Oak Steakhouse redefines the classic American steakhouse with a modern, chef-driven approach. Known for its uncompromising quality, the menu showcases the finest Prime Certified Angus Beef®—sourced from the top producers within the CAB portfolio—alongside seasonally inspired dishes that highlight the rich bounty of Appalachian ingredients. More than just a steakhouse, Oak delivers an elevated dining experience where precision in the kitchen meets genuine hospitality at every turn. Whether you’re savoring a perfectly aged ribeye, sharing a selection of small plates, or toasting with a glass from the expertly curated wine list, every visit is a celebration of exceptional ingredients and thoughtful craftsmanship. Order Takeout Be the First to Know Get insider access to Oak Steakhouse. Sign up for our mailing list and be the first to hear about exclusive events, menus and announcements. Email Signup Get Directions Press Eat This, Not That! The Best Chocolate Cake in Every State Franklin Lifestyle Magazine Five Reasons Why We Love Oak Steakhouse Eat This, Not That! 8 Chefs' Tips for Ordering the Best Meal at a Steakhouse Nashville Scene Ben’s Friends Launches Nashville Chapter Edible Nashville Oak Steakhouse: Anything but Average Visit Music City Oak Steakhouse Nashville Announces New Executive Chef Eater Nashville 15 Essential Restaurants for a Big Juicy Steak in Nashville Garden & Gun Five Must-Try Southern Martinis Eater Nashville 12 Top Spots for a Big Juicy Steak in Nashville StyleBlueprint Where to Find the Best Fresh-Baked Bread in Nashville About Our Story Menus See what we're serving. View Menus Private Dining Host your next special occasion with us. Inquire Now Steak at Home Certified Angus Beef Wet Aged and Dry Aged Steaks are not only served at our restaurants, they are now delivered to your doorstep.Vacuum packed, boxed on dry ice, and shipped always with a little extra love and care.Whether it is for your home, your best friend, or holiday gift, we ship nationwide, just for you. Or them. Or your Boss! Simplicity at its best. We handle all the tough stuff. Year Round. Nationwide. Place an Order Gallery View Gallery Reservations Order Online Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Alexandria Atlanta Charleston Charlotte Highlands Nashville Raleigh Rogers Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "d04dc0b9081f",
      "downloadedAt": "2026-01-18T16:54:43.007Z",
      "trimmedAt": "2026-01-18T17:11:49.017Z",
      "sizeReduction": "93.5%"
    },
    {
      "url": "https://www.oaksteakhouserestaurant.com/location/oak-steakhouse-charleston/",
      "text": "Main content starts here, tab to start navigating Oak Steakhouse Charleston Reservations Slide 1 of 7 Slide 2 of 7 Slide 3 of 7 Slide 4 of 7 Slide 5 of 7 Slide 6 of 7 Slide 7 of 7 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Hours & Location 17 Broad Street, Charleston, SC 29401 (843) 722-4220 Monday - Friday: 5 - 10 p.m.Saturday + Sunday: 4 - 10 p.m. Dinner Parking Valet service is available at the restaurant entrance for your convenience. Nearby public parking is also accessible, with the closest garage located at the just a short walk away. East Bay/Prioleau Car Park Facebook Instagram A Charleston Classic Located on Charleston’s storied Broad Street, Oak Steakhouse redefines the classic American steakhouse experience in a setting as unforgettable as the cuisine. Housed in a grand 1848 bank building, the restaurant spans three floors of preserved architectural splendor, featuring arched windows, soaring 20-foot ceilings, original ironwork, working fireplaces, and 150-year-old heart pine floors that speak to the city’s rich heritage. Oak’s menu centers around Prime Certified Angus® Beef, sourced from top-tier producers and aged to perfection. Complementing the steaks is a thoughtful selection of locally and regionally sourced seafood, produce, and Lowcountry ingredients that reflect the bounty of the Southeast. The wine list is equally impressive—highlighting bold California Cabernets, refined Old World reds, and over 200 labels curated to pair beautifully with the menu. With four distinct dining spaces, warm hospitality, and a balance of tradition and sophistication, Oak Steakhouse Charleston is a destination for memorable evenings, special occasions, and exceptional food done right. Be the First to Know Get insider access to Oak Steakhouse. Sign up for our mailing list and be the first to hear about exclusive events, menus and announcements. Email Signup Get Directions Press Condé Nast Traveler \"This is one can't-miss steakhouse\" Condé Nast Traveler 36 Best Restaurants in Charleston Condé Nast Traveler Oak Steakhouse — Restaurant Review Explore Charleston 37 Spots for Oysters in Charleston Far & Wide 50 Best Steakhouses in the U.S. Ranked (#21) Charleston City Paper Our go-to restaurants for everything from decadent to down-home fare Far & Wide 50 Best Steakhouses in the U.S., Ranked Foursquare The 15 Best Places for Key Lime Pie in Charleston Travel + Leisure The Best Steakhouses in the United States Food Network The Best Steak Restaurants in the Country About Our Story Menus See what we're serving. View Menus Private Dining Host your next special occasion with us. Inquire Now Steak at Home Certified Angus Beef Wet Aged and Dry Aged Steaks are not only served at our restaurants, they are now delivered to your doorstep.Vacuum packed, boxed on dry ice, and shipped always with a little extra love and care.Whether it is for your home, your best friend, or holiday gift, we ship nationwide, just for you. Or them. Or your Boss! Simplicity at its best. We handle all the tough stuff. Year Round. Nationwide. Place an Order Gallery View Gallery Reservations Order Online Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Alexandria Atlanta Charleston Charlotte Highlands Nashville Raleigh Rogers Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "d178a6b52c49",
      "downloadedAt": "2026-01-18T16:54:40.898Z",
      "trimmedAt": "2026-01-18T17:11:49.027Z",
      "sizeReduction": "92.7%"
    }
  ],
  "sizeReduction": "93.2%"
}