{
  "venueId": "ChIJ92l-OmJj_ogR6yu73GBVWkU",
  "venueName": "The Grit Counter - North Charleston",
  "venueArea": "North Charleston",
  "website": "http://gritcounter.com/",
  "scrapedAt": "2026-01-18T17:04:23.848Z",
  "trimmedAt": "2026-01-18T17:05:05.229Z",
  "pages": [
    {
      "url": "http://gritcounter.com/north-charleston-the-grit-counter-north-charleston-locations-order",
      "text": "Location North Charleston Order from North Charleston Jobs at North Charleston",
      "hash": "0ff5609cad8f",
      "downloadedAt": "2026-01-18T17:01:39.214Z",
      "trimmedAt": "2026-01-18T17:05:05.198Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "http://gritcounter.com/",
      "text": "× Order your favorite dishes in seconds! Order Online Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! Job Listings Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! about us read more about us order online Pick Up Your Favorite Food or Have It Delivered.Don’t Feel Like Cooking? Let us Help! order now gift cards Searching for the perfect gift for that adventurous foodie in your life? Something that’s fun for everyone and tantalizes the taste buds? Look no further than our gift cards! Treat your loved ones to delicious food and southern hospitality all while supporting local. Our gift cards are valid at both Grit Counter locations as well as our sister restaurant, Grace & Grit! purchase gift cards house made creative dishes Menu Southern hospitality about us Farm Fresh Ingredients order online Dot slide navigation number 1 Dot slide navigation number 2 Dot slide navigation number 3 slideshow start stop playing Newsletter Reviews Review by - Google Cody B: This place should go on your “To do” list if you ever find yourself in North Charleston!!! The food was amazing. Plenty of options for vegans and alternative diet people. I love it! Vegetarian options: I’m a vegetarian myself. The menu was like walking into a candy shop. There were so many options. Brussel sprouts, corn, green onions, spinach and so much more. Review by - Google Kevin B: The staff was so friendly and inviting, the food was prepared quickly and it's delicious! I got the brunch bowl (I subbed in goat cheese grits) and the it was jam packed with flavors, from savory bacon to sweet maple syrup... Review by - Google Sonia D: I really enjoyed the Dirty Bird breakfast. I had fried pickles with it. My friend had the Park Circle and we tried the parmesan grits. They were really good. The biscuit was soft and delicious! Review by - Google Aubrey X: Visiting this establishment and not partaking in one of the grit bowls is a sin. Intriguing flavors and hefty portions are the reasons I'd definitely return. The hospitality of the crew was the cherry on top. Review by - Google Angela V: WOW - came in & sat at the bar area, ordered the park circle ''peaches & cream.'' Grits asked for extra crispy bacon 🥓 ✔️, the biscuits were flaky w house homemade blueberry jam!... Stop reviews carousel Play reviews carousel Location and Hours 3438 W Montague Ave North Charleston, SC 29418 (854)-895-4748 Tue, Wed, Thur 8:00 AM - 2:00 PM Fri, Sat 8:00 AM - 8:00 PM Sun 9:00 AM - 3:00 PM Locations 3438 W Montague Ave North Charleston, SC (854)-895-4748 Hours Tue, Wed, Thur 8:00 AM - 2:00 PM Fri, Sat 8:00 AM - 8:00 PM Sun 9:00 AM - 3:00 PM Find us on... Facebook page Instagram page Contact us info@gracegrit.com Cobb salad bowl Fried oyster salad Indoor dining area The BLT Bowl Assorted dishes, top view An assortment of dishes and drinks on a table with Chicken &... Fried chicken and waffle Soft shell sandwich and fries Patio at night The Brunch Bowl The Harvest Bowl Famous Grit Flight The Grit Counter North sign outside Bar, beer tap Hot Chicken Sandwich Fried Basket with fried Flounder served with sauces, Fries and... Fried Oyster Salad Assorted grit bowls lined up on a table, top view Beer taps Different kinds of dishes arranged on a table, top view Shrimp n Grits Banana Pudding Sweet Corn Soft Serve, close up Back patio, seating area under trees Pimento Cheese Hushpuppies Restaurant's chef, headshot Owners, a portrait shot outside Banana Pudding Sweet Corn Soft Serve Exterior, back patio details VISIT OUR SISTER RESTAURANT Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "6d34e8ae52f4",
      "downloadedAt": "2026-01-18T17:01:37.781Z",
      "trimmedAt": "2026-01-18T17:05:05.220Z",
      "sizeReduction": "97.6%"
    },
    {
      "url": "http://gritcounter.com/north-charleston-the-grit-counter-north-charleston-happy-hours-specials",
      "text": "Specials Friday January 23rd HAPPY HOUR EVERY FRIDAY & SATURDAY! DRINK SPECIALS: $5 Craft Draft Beers $4 Mimosas $5 Mellow Creme Soda, Honeysuckle Spritzer & Frose FOOD SPECIALS: $5 Pimp & Pups (Pimento Hushpuppies & Hot Pimento Cheese) $4.50 Lil' Counter Fries (Gouda Mornay, House Ranch, Scallions) $7 Waffle Slider (Hot Chicken, Hot Honey Drizzle, Syrup) $7 Lil' Smasher (Smashburger Patty, Fried Pickles, American Cheese, Ranch Dressing, Toasted Sesame Seed Bun) 03:00 PM - 06:00 PM Saturday January 24th HAPPY HOUR DRINK SPECIALS: $5 Craft Draft Beers $4 Mimosas $5 Mellow Creme Soda, Honeysuckle Spritzer & Frose FOOD SPECIALS: $5 Pimp & Pups (Pimento Hushpuppies & Hot Pimento Cheese) $4.50 Lil' Counter Fries (Gouda Mornay, House Ranch, Scallions) $7 Waffle Slider (Hot Chicken, Hot Honey Drizzle, Syrup) $7 Lil' Smasher (Smashburger Patty, Fried Pickles, American Cheese, Ranch Dressing, Toasted Sesame Seed Bun) 03:00 PM - 06:00 PM",
      "hash": "c9cb96d9c83b",
      "downloadedAt": "2026-01-18T17:01:38.574Z",
      "trimmedAt": "2026-01-18T17:05:05.223Z",
      "sizeReduction": "98.7%"
    },
    {
      "url": "http://gritcounter.com/north-charleston-the-grit-counter-north-charleston-food-menu",
      "text": "Our Menu Breakfast Menu Beer Beverages Cocktails Wine",
      "hash": "d589f316a998",
      "downloadedAt": "2026-01-18T17:01:37.883Z",
      "trimmedAt": "2026-01-18T17:05:05.229Z",
      "sizeReduction": "100.0%"
    }
  ],
  "sizeReduction": "98.8%"
}