{
  "venueId": "ChIJzarq2kF6_ogRVIM0AFqqF0k",
  "venueName": "Sorghum & Salt",
  "venueArea": "Mount Pleasant",
  "website": "https://www.sorghumandsalt.com/?utm_source=google&utm_medium=wix_google_business_profile&utm_campaign=7720430434952843743",
  "scrapedAt": "2026-01-19T02:45:59.483Z",
  "trimmedAt": "2026-01-19T02:54:32.036Z",
  "pages": [
    {
      "url": "https://www.sorghumandsalt.com/?utm_source=google&utm_medium=wix_google_business_profile&utm_campaign=7720430434952843743",
      "text": "[Page Title: Vegetable forward farm to table restaurant Charleston| Sorghum & Salt]\n\ntop of page Farm & Sea To Table Cuisine.\nProudly Sourced Locally. ​ ​ \nFollow us on Instagram\n#wix @wix Load more /'lōkˌvôr/ ə Locavore\n[loh-kuh-vawr]\nnoun\nA person who makes an effort to eat food that is grown, raised or produced locally. Here at Sorghum & Salt we strive to use both high quality and local products on our menu. |   | 186 St. Philip St. Charleston, SC 29403 (843) 872-6393 contact@sorghumandsalt.com Menus Click here to see our most up to date Food, Drink, and Vegan Menus! View Menu >> Book A Table More Info >> We take reservations through Resy, OpenTable, as well as over the phone. Click here to start! FAQ's or Contact Click here for some answers to our most frequently asked questions or to contact us! FAQ's Contact NOTICE ​ All checks paid with a card will have a 3 % Non-Cash Payment Adjustment charge . ​ Tables of 6 or more people will have an automatic 20% gratuity. ​ Due to the nature of our small restaurant we do reserve the right to ask for you to either kindly move to the bar or to another available table once your allotted dining time has passed (1h 45m) Follow us bottom of page",
      "hash": "ec90b379642c",
      "downloadedAt": "2026-01-19T02:12:08.147Z",
      "trimmedAt": "2026-01-19T02:54:31.996Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "https://www.sorghumandsalt.com/menu",
      "text": "[Page Title: MENUS | Sorghum & Salt]\n\ntop of page MENUS \nAll menus are updated DAILY based on local availability and seasonability. Be sure to check out what we are cooking up at the moment\nFOOD & DRINKS Click here to see what items are currently being offered on our ever evolving menu. DESSERTS Click to see what we are serving up to satisfy your sweet tooth \nWe try our best to alter our menu to these allergies when requested.\nDue to our menu changing so frequently, we cannot guarantee what will and will not satisfy an allergen  until you dine with us. Please note that we are  certified in being free of any and all allergens but we try our best. not Peanut/Tree Nut Dairy Allergy Soy Allergy Gluten Free/Celiac Shellfish Allergy bottom of page",
      "hash": "f1046d1bfee5",
      "downloadedAt": "2026-01-19T02:12:08.257Z",
      "trimmedAt": "2026-01-19T02:54:32.036Z",
      "sizeReduction": "99.9%"
    }
  ],
  "sizeReduction": "99.9%"
}