{
  "venueId": "ChIJ1zFQ0pFx_ogRBO6Rg-0KS3o",
  "venueName": "Spread Bagelry",
  "venueArea": "Mount Pleasant",
  "website": "https://www.spreadbagelry.com/mt-pleasant",
  "scrapedAt": "2026-01-18T17:04:23.125Z",
  "trimmedAt": "2026-01-18T17:04:46.765Z",
  "pages": [
    {
      "url": "https://www.spreadbagelry.com/menu/",
      "text": "We'd love to hear your order. Start Your Order Bagels Plain Everything Sesame Poppy Onion Whole Wheat Salted Egg Everything Egg Whole Wheat Everything Blueberry Cinnamon Raisin Rosemary Olive Oil Gluten Free Bagels Gluten-Free Plain Gluten-Free Everything View Nutrition & Allergens Spreads Plain Veggie Scallion Nova Salmon Jalapeno Pistachio Honey Plant-based Whitefish Salad Tuna Salad …and more! Side Jams Peanut Butter, Peanut Butter & Strawberry, Farm Fresh Butter, Butter & Strawberry Jam, Plain Spread & Strawberry Jam Side Hustles Nova Salmon, Spread Ketchup, Spread Hot Sauce Beverages Coffee Fresh Drip, Red Eye (Hot Only), Cold Brew Espresso American, Cappuccino, Latte, Vanilla Bean Latte, Sea Salt Carmel Latte, Dirty Chai Latte, Pistachio Rose Latte Non-Coffee Hot Tea, Hot Chocolate, Chai Latte Download the Menu All Day Sandwiches The Standard A timeless breakfast staple: your choice of bagel, fluffy eggs or egg whites, melted Cooper Sharp, smoked bacon, turkey bacon, or pork roll The Classic Classic for a reason: your choice of bagel, smoked Nova Salmon or whitefish salad, cream cheese, fresh tomato and onion, and capers Frittata Scramble A savory-sweet twist on a breakfast classic. Your favorite bagel, loaded with fluffy eggs, cheddar, thick smoked bacon, fresh tomato, and our own strawberry jam Egg White Light and satisfying: your choice of bagel with fluffy egg whites, Swiss cheese, spinach, fresh tomato, and crisp turkey bacon Nova Scramble For lox lovers: your choice of bagel, fluffy eggs, smoked salmon spread, fresh tomato, and onion Carnegie Breakfast The real deal. Your choice of bagel, authentic Carnegie Deli pastrami, fluffy eggs, and melted Swiss cheese The Cure There when you need it. Your choice of bagel, brisket, smoked bacon, and jalapeño cream cheese The Carnegie Reuben A throwback done right. Your choice of bagel, real Carnegie Deli pastrami, melted Swiss, sauerkraut, and Russian dressing The Philly Special Our hometown hero. Your choice of bagel, brisket, seared red onion, spinach, and melted Cooper Sharp *Substitute Chicken for Brisket Avocado Toast A fresh, modern must-have. Your choice of bagel (open-faced), smashed ripe avocado, cherry tomatoes, chili flakes, and a squeeze of lime The Club You want in? Roasted chicken, cheddar, smoked bacon, crisp Granny Smith apple, and honey mustard mayo The BLT A classic reinvented: your choice of bagel, crispy smoked bacon, fresh lettuce, ripe tomato, and creamy garlic mayo The Garden Veggie A fresh delight. Your choice of bagel, veggie cream cheese, crisp cucumber, slides tomato, and baby spinach Za'atar Chicken Salad Sandwich Herby and vibrant. Your choice of bagel, za’atar chicken salad, golden raisins, crisp lettuce, and tangy pickled red onion Inside-Out Grilled Cheese Melty perfection. Your choice of bagel, sliced tomato, smoked bacon, Swiss and Cooper Sharp *No additions Wood Oven Tuna Melt Warm and comforting. Your choice of bagel (open-faced), our house-made tuna salad, and melted Swiss Roasted Pizza Bagels Two of the all-time greats. Your choice of bagel (open-faced), marinara, melted mozzarella, and a dash of oregano Add Ons Tomato, red onion, cucumber, lettuce, spinach, capers, avocado, apple slices, smoked bacon, turkey bacon, sausage, pork roll, Cooper Sharp, cheddar, Swiss Download the Menu Breakfast Starts Here. Order Now Make Your Next Gathering Excellent Bring a few dozen bagels to your next office lunch, brunch party, or local event. Learn More",
      "hash": "1a8bfa6ccbbd",
      "downloadedAt": "2026-01-18T16:57:25.418Z",
      "trimmedAt": "2026-01-18T17:04:46.733Z",
      "sizeReduction": "95.2%"
    },
    {
      "url": "https://www.spreadbagelry.com/mt-pleasant",
      "text": "Back to all Locations Mt. Pleasant Order Online Store Info 1400 Shucker Circle, Suite 100 Mt. Pleasant, SC 29464 Open Google Maps 843.380.5300 Order Type Dine-In Pickup Store Hours Monday 6AM - 2:30PM * Tuesday 6AM - 2:30PM * Wednesday 6AM - 2:30PM * Thursday 6AM - 2:30PM * Friday 6AM - 2:30PM * Saturday 6AM - 2:30PM * Sunday 6AM - 2:30PM * *or until sold out On Rotation at Spread: Dog Days Are Over Florence + The Machine // On Rotation at Spread: Bon Iver, St. Vincent \"Roslyn\" // On Rotation at Spread: Uncle John’s Band Grateful Dead // Spread the Southern Charm Our brand new Spread location is a taste of Montreal bagels in the South, by way of Philly. With charming outdoor seating in a corner location, our Mt. Pleasant Spread offers a sunny patio experience, or a cozy interior option for those who like to be closer to the fire burning in the oven. Mt. Pleasant Favorites The Standard A timeless classic: Your choice of bagel, fluffy eggs, thick-cut smoked bacon, and melted Cooper Sharp. Start Your Order BYO Breakfast Sandwich You tell us exactly how you like it. Choose a wood-fired bagel, and add fluffy eggs, cheese, and any other fresh toppings you want. Start Your Order The Classic So good every time. Your choice of bagel, smoked nova salmon or whitefish salad, cream cheese, fresh tomato and onion, and capers. Start Your Order Breakfast Starts Here. Order Now SPREAD RITUALS It’s my favorite Saturday morning ritual to walk to Spread with our baby and pup! Sam, Local at Mt. Pleasant Bagel after yoga workout class in the morning! I also grab bagels for work breakfasts. Emma, Local at Mt. Pleasant In the Neighborhood Located in the heart of Mt. Pleasant, Oyster Park is home to luxury apartments, southern dining staples, and wellness centers for the whole community to enjoy. It’s no wonder this city is top-ranked on travel lists every year, and Spread is excited to call it home. favorite local spots Drift Boutique, and West Marine Pilates, barre, and… The Works spreadbagelry PA • NJ • SC • GA Wood Oven Bagels & Artisan Sandwiches Breakfast | Brunch | Lunch | Catering 🥯✨National Bagel Day- Thursday, 1/15! ✨🥯 We’re cel Just a reminder 👀 National Bagel Day is tomorrow ( Not to be dramatic, but I was busy all weekend. Th It’s an avocado toast kind of day 🥑 Follow the sign. Stay for the warmth. 🔥🥯 Load More Follow on Instagram",
      "hash": "59cf835ae682",
      "downloadedAt": "2026-01-18T16:57:25.384Z",
      "trimmedAt": "2026-01-18T17:04:46.744Z",
      "sizeReduction": "97.4%"
    },
    {
      "url": "https://www.spreadbagelry.com/locations/",
      "text": "Locations 17 Locations Across 4 States Pennsylvania Ambler DISCOVER STORE 40 W. Skippack Pike Ambler, PA 19002 ORDER ONLINE GET DIRECTIONS Bryn Mawr DISCOVER STORE 915 Lancaster Ave., Suite 180 Bryn Mawr, PA 19010 ORDER ONLINE GET DIRECTIONS Penn DISCOVER STORE 3602 Chestnut Street Philadelphia, PA 19104 ORDER ONLINE GET DIRECTIONS 16th Street DISCOVER STORE 106 S. 16th Street Philadelphia, PA 19102 ORDER ONLINE GET DIRECTIONS Rittenhouse DISCOVER STORE 262 S. 20th Street Philadelphia, PA 19103 ORDER ONLINE GET DIRECTIONS South Street DISCOVER STORE 443 South St Philadelphia, PA 19147 ORDER ONLINE GET DIRECTIONS Wayne DISCOVER STORE 134 N. Wayne Ave., Suite 102 Wayne, PA 19087 ORDER ONLINE GET DIRECTIONS Glen Mills DISCOVER STORE Glen Eagle Square - 515 Wilmington West Chester Pike Glen Mills, PA 19342 ORDER ONLINE GET DIRECTIONS King of Prussia DISCOVER STORE 100 Main Street, Suite 160 King of Prussia, PA 19406 ORDER ONLINE GET DIRECTIONS Upper Dublin DISCOVER STORE 1091 Market Street Dresher, PA 19025 ORDER ONLINE GET DIRECTIONS Newtown Square DISCOVER STORE 102 Squire Dr Newtown Square, PA 19073 ORDER ONLINE GET DIRECTIONS Wynnewood DISCOVER STORE 50 East Wynnewood Rd., Unit 7 Wynnewood, PA 19096 ORDER ONLINE GET DIRECTIONS New Jersey Cherry Hill DISCOVER STORE 950 Garden Park Blvd., Unit B1 Cherry Hill, NJ 08002 ORDER ONLINE GET DIRECTIONS South Carolina Mt. Pleasant DISCOVER STORE 1400 Shucker Circle, Suite 100 Mt. Pleasant, SC 29464 ORDER ONLINE GET DIRECTIONS Charleston DISCOVER STORE 595 King Street, Suite 133 (Spring St. Entrance) Downtown Charleston, SC 29403 ORDER ONLINE GET DIRECTIONS Georgia Savannah DISCOVER STORE 6 West State Street Savannah, GA 31401 ORDER ONLINE GET DIRECTIONS Coming Soon to Buckhead! DISCOVER STORE 47 Irby Avenue NW Atlanta, GA 30305 Apply Now GET DIRECTIONS spreadbagelry PA • NJ • SC • GA Wood Oven Bagels & Artisan Sandwiches Breakfast | Brunch | Lunch | Catering 🥯✨National Bagel Day- Thursday, 1/15! ✨🥯 We’re cel Just a reminder 👀 National Bagel Day is tomorrow ( Not to be dramatic, but I was busy all weekend. Th It’s an avocado toast kind of day 🥑 Follow the sign. Stay for the warmth. 🔥🥯 Load More Follow on Instagram",
      "hash": "9e3b5466f861",
      "downloadedAt": "2026-01-18T16:57:25.944Z",
      "trimmedAt": "2026-01-18T17:04:46.754Z",
      "sizeReduction": "97.8%"
    },
    {
      "url": "https://www.spreadbagelry.com/locations",
      "text": "Locations 17 Locations Across 4 States Pennsylvania Ambler DISCOVER STORE 40 W. Skippack Pike Ambler, PA 19002 ORDER ONLINE GET DIRECTIONS Bryn Mawr DISCOVER STORE 915 Lancaster Ave., Suite 180 Bryn Mawr, PA 19010 ORDER ONLINE GET DIRECTIONS Penn DISCOVER STORE 3602 Chestnut Street Philadelphia, PA 19104 ORDER ONLINE GET DIRECTIONS 16th Street DISCOVER STORE 106 S. 16th Street Philadelphia, PA 19102 ORDER ONLINE GET DIRECTIONS Rittenhouse DISCOVER STORE 262 S. 20th Street Philadelphia, PA 19103 ORDER ONLINE GET DIRECTIONS South Street DISCOVER STORE 443 South St Philadelphia, PA 19147 ORDER ONLINE GET DIRECTIONS Wayne DISCOVER STORE 134 N. Wayne Ave., Suite 102 Wayne, PA 19087 ORDER ONLINE GET DIRECTIONS Glen Mills DISCOVER STORE Glen Eagle Square - 515 Wilmington West Chester Pike Glen Mills, PA 19342 ORDER ONLINE GET DIRECTIONS King of Prussia DISCOVER STORE 100 Main Street, Suite 160 King of Prussia, PA 19406 ORDER ONLINE GET DIRECTIONS Upper Dublin DISCOVER STORE 1091 Market Street Dresher, PA 19025 ORDER ONLINE GET DIRECTIONS Newtown Square DISCOVER STORE 102 Squire Dr Newtown Square, PA 19073 ORDER ONLINE GET DIRECTIONS Wynnewood DISCOVER STORE 50 East Wynnewood Rd., Unit 7 Wynnewood, PA 19096 ORDER ONLINE GET DIRECTIONS New Jersey Cherry Hill DISCOVER STORE 950 Garden Park Blvd., Unit B1 Cherry Hill, NJ 08002 ORDER ONLINE GET DIRECTIONS South Carolina Mt. Pleasant DISCOVER STORE 1400 Shucker Circle, Suite 100 Mt. Pleasant, SC 29464 ORDER ONLINE GET DIRECTIONS Charleston DISCOVER STORE 595 King Street, Suite 133 (Spring St. Entrance) Downtown Charleston, SC 29403 ORDER ONLINE GET DIRECTIONS Georgia Savannah DISCOVER STORE 6 West State Street Savannah, GA 31401 ORDER ONLINE GET DIRECTIONS Coming Soon to Buckhead! DISCOVER STORE 47 Irby Avenue NW Atlanta, GA 30305 Apply Now GET DIRECTIONS spreadbagelry PA • NJ • SC • GA Wood Oven Bagels & Artisan Sandwiches Breakfast | Brunch | Lunch | Catering 🥯✨National Bagel Day- Thursday, 1/15! ✨🥯 We’re cel Just a reminder 👀 National Bagel Day is tomorrow ( Not to be dramatic, but I was busy all weekend. Th It’s an avocado toast kind of day 🥑 Follow the sign. Stay for the warmth. 🔥🥯 Load More Follow on Instagram",
      "hash": "df5a0bfb81a6",
      "downloadedAt": "2026-01-18T16:57:26.506Z",
      "trimmedAt": "2026-01-18T17:04:46.765Z",
      "sizeReduction": "97.8%"
    }
  ],
  "sizeReduction": "97.2%"
}