{
  "venueId": "ChIJq1l1Umt6_ogRWXP-xf8ofwU",
  "venueName": "Francis Marion Hotel",
  "venueArea": "Downtown Charleston",
  "website": "http://www.francismarionhotel.com/",
  "scrapedAt": "2026-01-18T17:04:30.735Z",
  "trimmedAt": "2026-01-18T17:12:06.937Z",
  "pages": [
    {
      "url": "http://www.francismarionhotel.com/accomodations/packages/",
      "text": "843-722-0600 Reservations@thefrancismarion.com Facebook RSS YouTube Pinterest TripAdvisor Facebook RSS YouTube Pinterest TripAdvisor Contact Accessibility SPECIAL OFFERS SIGN UP FOR SPECIAL OFFERS SEASONAL PACKAGES DOG PACKAGE Pack your bags for you & your pup! Head to The Francis Marion Hotel for the perfect pet-friendly getaway. Book your stay in the heart of downtown Charleston, where unforgettable adventures await you both just steps from our front door. Make your trip extra special & treat your furry friend to our Enjoy a welcome treat from our neighbors at Woof Gang Bakery, a detailed guide to Charleston’s pet-friendly spots, and an exclusive Francis Marion Hotel collapsible dog bowl — perfect for on-the-go adventures! Dog Package! Book Now CHRISTMAS DINNER Christmas is the perfect time to join family and friends for a festive tradition in Charleston. Your package includes elegant accommodations and a wonderful Christmas Buffett for two in the Colonial Ballroom Includes Christmas Dinner for two on December 25, 2025 Pricing includes taxes and gratuity for the Dinner. Reservations for Dining are required. Seatings offered between 11AM-3PM, buffet ends at 4PM. Please call 843-724-8888 to make reservations. Book Now WINTER PACKAGE Spend the Winter Season with The Francis Marion Hotel! Start your day with a hearty breakfast buffet in our very own Swamp Fox Restaurant. After you have finished sight seeing and shopping, come back to an elegant and comfortable room and unwind with Hot Cocoa and Cookies. Your package includes: Accommodations Breakfast buffet for two daily Nightly turn down amenity with Hot Cocoa and Cookies. Starting from $179 per night Book Now CARRIAGE & COCOA Enjoy the timeless tradition of riding through the beautiful streets of Charleston, SC while sipping tall mugs of our Chef’s house-brewed hot cocoa. Your package includes elegant accommodations offering unsurpassed views of the “Holy City”, 2 Francis Marion mugs filled with hot cocoa and a carriage ride* through Charleston’s famed historic district. *Not available on Christmas Eve or Christmas Day Book Now RELAX & REFRESH Refresh & Relax Spa Package- an elegant escape that blends relaxation, refreshment, and refined indulgence. The Refresh & Relax package includes a handcrafted Charleston Tea Time cocktail at the Swamp Fox Bar- inspired by southern sweet tea & infused with seasonal botanicals, a 30 minute refreshing mini facial at The Spa of Charleston, a curated truffle amenity awaiting your arrival + luxurious overnight accomodations. *this package is for two (2) people. Book Now THE NOTEBOOK PACKAGE The Lowcountry’s historic landmarks, scenic views, and undeniable charm made it the perfect backdrop for one of the most iconic love stories ever filmed—The Notebook. Now, you can experience the magic for yourself with our exclusive Notebook Package at the Francis Marion Hotel. Walk in the footsteps of Noah and Allie as you explore the timeless beauty of Charleston, where history and romance come to life. Let us make your stay unforgettable with special touches inspired by the beloved film. Your Package includes: Overnight accommodations Self-guided walking tour to popular attractions from the movie Lunch to-go for two people Book Now JAZZ PACKAGE Charleston Jazz Orchestra has become one of the nation’s leading jazz ensembles. Under the direction of Robert Lewis, the Orchestra has brought a level of musical prestige to the region that has garnered Charleston the status as one of the top jazz destinations in the world. The Charleston Jazz Package includes: Accommodations at The Francis Marion Hotel 2 Cocktails at The Swamp Fox Restaurant 2 tickets to the Charleston Jazz Orchestra Book Now CHARLESTON PACKAGES CHARLESTON GETAWAY Why not pamper yourself with a night out on-the-town. Your package includes luxurious accommodations and a $50 gift certificate for your choice of any participating Upper King Street restaurants. Book Now DISCOVER CHARLESTON WITH BREAKFAST Your Discover Charleston Package includes Breakfast for 2 and your daily choice of two tickets to either the South Carolina Aquarium, Drayton Hall, McLeod Plantation Historic Site, or a carriage ride through the historic district We recommend during this time, to call your desired attraction choice prior to booking to ensure you have a reservation with them during your visit. Book Now HISTORY BUFF'S GUIDE TO CHARLESTON Your trip will be one for the (history) books! Start your days by fueling up at The Swamp Fox Restaurant located right in the hotel. Begin with Breakfast in the Swamp Fox Restaurant. Book a tour with Palmetto Carriage Tours, explore Charleston Museum, or visit a historic home. Come back to an elegant and comfortable room to rest for your next round of historical experiences! We recommend during this time to call your desired attraction choice prior to booking to insure you have a reservation with them during your visit. Book Now HEART OF CHARLESTON ROMANCE PACKAGE Let us help celebrate your occasion in one of the most romantic cities in the country. Includes fine chocolates and a bottle of wine. Book Now SPA PACKAGE The Spa of Charleston Package Retreat to Charleston, SC where you can unwind with a stress relieving, deeply relaxing massage or facial treatment performed by our educated and experienced technicians at our full service day spa- The Spa of Charleston. Your package includes accommodations, two – $100 gift cards to The Spa of Charleston per night & wine and cheese amenity on the night of arrival More information about the spa can be found here Book Now Truffles & Tranquility Escape reality and enjoy a serene getaway of luxury service and top of the line spa treatments courtesy of our new spa, The Spa of Charleston. Your package includes a wine & truffle welcome amenity, daily breakfast, and your choice of an aromatherapy massage or revitalizing facial. Spa appointments are required. Book Now DINING PACKAGES SWAMP FOX DINING Simply a delicious way to enhance your stay! Enjoy a $75.00 credit toward any meal each day in our own Swamp Fox Restaurant & Bar. Serving classic Lowcountry inspired Southern fare; the Swamp Fox boasts an exciting selection of dinner specialty menus for any taste. Our bountiful Breakfast and Lunch menus are included in your choice as well. Book Now CAROLINA IN THE MORNING Nothing can be finer than to wake up to a Carolina morning. This package includes breakfast for two guests at the Swamp Fox Restaurant. View Breakfast Menu Here Book Now Francis Marion Rates & Packages Reservations: (843) 722-0600 or Toll Free (877) 756-2121 Rates vary depending on room type and season. Please call or use Book Now to check on rates for your stay. All rates subject to availability and applicable sales tax. Not valid with groups, existing reservations or other offers or discounts. Blackout dates may apply.",
      "hash": "0b1055ab106c",
      "downloadedAt": "2026-01-18T16:53:58.259Z",
      "trimmedAt": "2026-01-18T17:12:06.845Z",
      "sizeReduction": "97.0%"
    },
    {
      "url": "https://www.francismarionhotel.com/accomodations/packages/",
      "text": "843-722-0600 Reservations@thefrancismarion.com Facebook RSS YouTube Pinterest TripAdvisor Facebook RSS YouTube Pinterest TripAdvisor Contact Accessibility SPECIAL OFFERS SIGN UP FOR SPECIAL OFFERS SEASONAL PACKAGES DOG PACKAGE Pack your bags for you & your pup! Head to The Francis Marion Hotel for the perfect pet-friendly getaway. Book your stay in the heart of downtown Charleston, where unforgettable adventures await you both just steps from our front door. Make your trip extra special & treat your furry friend to our Enjoy a welcome treat from our neighbors at Woof Gang Bakery, a detailed guide to Charleston’s pet-friendly spots, and an exclusive Francis Marion Hotel collapsible dog bowl — perfect for on-the-go adventures! Dog Package! Book Now CHRISTMAS DINNER Christmas is the perfect time to join family and friends for a festive tradition in Charleston. Your package includes elegant accommodations and a wonderful Christmas Buffett for two in the Colonial Ballroom Includes Christmas Dinner for two on December 25, 2025 Pricing includes taxes and gratuity for the Dinner. Reservations for Dining are required. Seatings offered between 11AM-3PM, buffet ends at 4PM. Please call 843-724-8888 to make reservations. Book Now WINTER PACKAGE Spend the Winter Season with The Francis Marion Hotel! Start your day with a hearty breakfast buffet in our very own Swamp Fox Restaurant. After you have finished sight seeing and shopping, come back to an elegant and comfortable room and unwind with Hot Cocoa and Cookies. Your package includes: Accommodations Breakfast buffet for two daily Nightly turn down amenity with Hot Cocoa and Cookies. Starting from $179 per night Book Now CARRIAGE & COCOA Enjoy the timeless tradition of riding through the beautiful streets of Charleston, SC while sipping tall mugs of our Chef’s house-brewed hot cocoa. Your package includes elegant accommodations offering unsurpassed views of the “Holy City”, 2 Francis Marion mugs filled with hot cocoa and a carriage ride* through Charleston’s famed historic district. *Not available on Christmas Eve or Christmas Day Book Now RELAX & REFRESH Refresh & Relax Spa Package- an elegant escape that blends relaxation, refreshment, and refined indulgence. The Refresh & Relax package includes a handcrafted Charleston Tea Time cocktail at the Swamp Fox Bar- inspired by southern sweet tea & infused with seasonal botanicals, a 30 minute refreshing mini facial at The Spa of Charleston, a curated truffle amenity awaiting your arrival + luxurious overnight accomodations. *this package is for two (2) people. Book Now THE NOTEBOOK PACKAGE The Lowcountry’s historic landmarks, scenic views, and undeniable charm made it the perfect backdrop for one of the most iconic love stories ever filmed—The Notebook. Now, you can experience the magic for yourself with our exclusive Notebook Package at the Francis Marion Hotel. Walk in the footsteps of Noah and Allie as you explore the timeless beauty of Charleston, where history and romance come to life. Let us make your stay unforgettable with special touches inspired by the beloved film. Your Package includes: Overnight accommodations Self-guided walking tour to popular attractions from the movie Lunch to-go for two people Book Now JAZZ PACKAGE Charleston Jazz Orchestra has become one of the nation’s leading jazz ensembles. Under the direction of Robert Lewis, the Orchestra has brought a level of musical prestige to the region that has garnered Charleston the status as one of the top jazz destinations in the world. The Charleston Jazz Package includes: Accommodations at The Francis Marion Hotel 2 Cocktails at The Swamp Fox Restaurant 2 tickets to the Charleston Jazz Orchestra Book Now CHARLESTON PACKAGES CHARLESTON GETAWAY Why not pamper yourself with a night out on-the-town. Your package includes luxurious accommodations and a $50 gift certificate for your choice of any participating Upper King Street restaurants. Book Now DISCOVER CHARLESTON WITH BREAKFAST Your Discover Charleston Package includes Breakfast for 2 and your daily choice of two tickets to either the South Carolina Aquarium, Drayton Hall, McLeod Plantation Historic Site, or a carriage ride through the historic district We recommend during this time, to call your desired attraction choice prior to booking to ensure you have a reservation with them during your visit. Book Now HISTORY BUFF'S GUIDE TO CHARLESTON Your trip will be one for the (history) books! Start your days by fueling up at The Swamp Fox Restaurant located right in the hotel. Begin with Breakfast in the Swamp Fox Restaurant. Book a tour with Palmetto Carriage Tours, explore Charleston Museum, or visit a historic home. Come back to an elegant and comfortable room to rest for your next round of historical experiences! We recommend during this time to call your desired attraction choice prior to booking to insure you have a reservation with them during your visit. Book Now HEART OF CHARLESTON ROMANCE PACKAGE Let us help celebrate your occasion in one of the most romantic cities in the country. Includes fine chocolates and a bottle of wine. Book Now SPA PACKAGE The Spa of Charleston Package Retreat to Charleston, SC where you can unwind with a stress relieving, deeply relaxing massage or facial treatment performed by our educated and experienced technicians at our full service day spa- The Spa of Charleston. Your package includes accommodations, two – $100 gift cards to The Spa of Charleston per night & wine and cheese amenity on the night of arrival More information about the spa can be found here Book Now Truffles & Tranquility Escape reality and enjoy a serene getaway of luxury service and top of the line spa treatments courtesy of our new spa, The Spa of Charleston. Your package includes a wine & truffle welcome amenity, daily breakfast, and your choice of an aromatherapy massage or revitalizing facial. Spa appointments are required. Book Now DINING PACKAGES SWAMP FOX DINING Simply a delicious way to enhance your stay! Enjoy a $75.00 credit toward any meal each day in our own Swamp Fox Restaurant & Bar. Serving classic Lowcountry inspired Southern fare; the Swamp Fox boasts an exciting selection of dinner specialty menus for any taste. Our bountiful Breakfast and Lunch menus are included in your choice as well. Book Now CAROLINA IN THE MORNING Nothing can be finer than to wake up to a Carolina morning. This package includes breakfast for two guests at the Swamp Fox Restaurant. View Breakfast Menu Here Book Now Francis Marion Rates & Packages Reservations: (843) 722-0600 or Toll Free (877) 756-2121 Rates vary depending on room type and season. Please call or use Book Now to check on rates for your stay. All rates subject to availability and applicable sales tax. Not valid with groups, existing reservations or other offers or discounts. Blackout dates may apply.",
      "hash": "0dc1e8b48c2b",
      "downloadedAt": "2026-01-18T16:53:56.539Z",
      "trimmedAt": "2026-01-18T17:12:06.873Z",
      "sizeReduction": "97.0%"
    },
    {
      "url": "https://www.francismarionhotel.com/menu/",
      "text": "843-722-0600 Reservations@thefrancismarion.com Facebook RSS YouTube Pinterest TripAdvisor Facebook RSS YouTube Pinterest TripAdvisor Contact Accessibility MENU Serving Classic Southern Cuisine Since 1924 MENU Serving Classic Southern Cuisine Since 1924 MENU Serving Classic Southern Cuisine Since 1924 MENU Find a Table Make a Reservation",
      "hash": "25cd6af776fe",
      "downloadedAt": "2026-01-18T16:53:57.097Z",
      "trimmedAt": "2026-01-18T17:12:06.883Z",
      "sizeReduction": "99.8%"
    },
    {
      "url": "https://www.francismarionhotel.com/swamp-fox-restaurant/",
      "text": "843-722-0600 Reservations@thefrancismarion.com Facebook RSS YouTube Pinterest TripAdvisor Facebook RSS YouTube Pinterest TripAdvisor Contact Accessibility CLASSIC SOUTHERN CUISINE SINCE 1924 Reserve a Table ; HOURS We are open everyday! Breakfast: 7am – 11am Lunch: 11:30am – 3pm Dinner: 5pm – 10pm Enjoy Live Piano Music every Thursday, Friday & Saturday evening from 6pm – 9pm ROOM SERVICE We offer Room Service to our Francis Marion Hotel Guests. Please reference the menu located in your room. from your room phone to place your order. Dial extension 2292 CONTACT 843-724-8888 Heyward Davis Executive Chef Daniel James Executive Sous Chef The Swamp Fox Restaurant Located in the heart of Downtown Charleston, The Swamp Fox Restaurant sits at the corner of King and Calhoun Street overlooking Marion Square. Named for Revolutionary War hero General Francis Marion, The Swamp Fox has been the epicenter of King Street dining since 1924. Our talented culinary team utilizes farm fresh ingredients and locally caught seafood to produce the most flavorful dishes. If you are looking for classic Lowcountry cuisine, the Swamp Fox Restaurant is the perfect taste of the south. Proud Participant of the Certified South Carolina Fresh on the Menu Join us in our Lounge for cocktails & a limited Lounge Menu. Subscribe to our Newsletter MENUS Breakfast Lunch Dinner RESTAURANT WEEK JANUARY 8 – 18, 2026 VIEW MENU VIEW MENU BREAKFAST BUFFET WEEKDAYS: $20 | WEEKENDS: $25 with live music Bar & Lounge Join us in our lounge for cocktails and light bites. Open everyday from 3pm – 10pm. View lounge menu here! theswamp_fox Dive into the New Year at the Swamp Fox Restaurant Something sweet is coming to our menu this week! 🍰 Have you joined us for Restaurant Week yet?! Don’ Beat the midsummer heat with our new refreshing co This Fourth of July weekend, treat yourself to a s Today’s lunch specials: 🦐 Fried shrimp platter (fr Father's Day Feast All Weekend Long! Treat Dad to Celebrate with classic Lowcountry cuisine this Mot Fuel up for the Cooper River Bridge Run with our d Get your green on at the Swamp Fox this St. Patric Load More... Follow on Instagram Private Dining at the Swamp Fox Restaurant Parkview Room The perfect space for an intimate private dining experience, our Parkview Room that resides inside the Swamp Fox Restaurant seats up to 30 guests. Including priced out menus that are curated specifically to your wants, our chefs make your special event memorable. Perfect for bridal lunch shower, brunches the morning after your wedding, graduation parties, retirement parties, baby showers & so much more. Call us today to learn more about reserving our Private Dining Space at the Swamp Fox Retsaurant.(843) 722 – 0600 Learn More Contact Sales Team for More Information Plan the Perfect Stay Book the perfect package at the Francis Marion Hotel. Choose from one of our Dining Inclusive packages that make dining with the Swamp Fox Restaurant that much easier. Whether you want breakfast included or a romantic dinner for two, plan the best trip to Charleston, South Carolina today. View Packages 387 King Street Charleston, SC 29403 | (843) 724 – 8888",
      "hash": "a21463ef7517",
      "downloadedAt": "2026-01-18T16:53:57.730Z",
      "trimmedAt": "2026-01-18T17:12:06.911Z",
      "sizeReduction": "99.0%"
    },
    {
      "url": "http://www.francismarionhotel.com/",
      "text": "843-722-0600 Reservations@thefrancismarion.com Facebook RSS YouTube Pinterest TripAdvisor Facebook RSS YouTube Pinterest TripAdvisor Contact Accessibility FRANCIS MARION HOTEL A RICH HISTORY MAKE A RESERVATION FRANCIS MARION HOTEL A RICH HISTORY MAKE A RESERVATION FRANCIS MARION HOTEL A RICH HISTORY MAKE A RESERVATION WELCOME TO OUR HOTEL BOOK YOUR STAY Named for Revolutionary War hero (the “Swamp Fox”), the Francis Marion Hotel became an instant Charleston landmark when it opened in 1924. Rising 12 stories above the Historic District, the hotel offers spectacular views of Charleston’s church steeples, historic mansions, and famous harbor, providing easy access to the wealth of Charleston’s attractions. Francis Marion With continuous restorations throughout the years, the Francis Marion features 235 modern and comfortable guestrooms and suites while preserving our historical architecture. Located downtown on Marion Square, the hotel is within walking distance of the magnificent gardens, house museums, antique shops, local boutiques, restaurants, and nightlife that has made Charleston one of the south’s premier cities. With such on-site amenities as , the , Starbucks, and 18,000 square feet of , no one will fault you if you end up staying inside the Francis Marion Hotel for the duration of your stay. The Spa of Charleston Swamp Fox Restaurant and Bar meeting space Francis Marion Hotel, a member of since 1999. Historic Hotels of America Sign Up for Special Offers Contact Us! Looking for the perfect gift for any occasion? Give the gift of a stay at the historic Francis Marion Hotel or a dinner at the Swamp Fox Restaurant. Purchase a Gift Card francismarionhotel A little history, a lot of rhythm 🎶 Opened during Dive into the New Year at the Swamp Fox Restaurant Celebrate Christmas in the historic Colonial Ballr We are now hiring a Corporate Social Media & Web M 'Tis the season for winter festivities and new pac Now that it’s socially acceptable to put up the Ch LIMITED TIME ONLY: Receive 30% off the Refresh & R Such an incredible event for an amazing cause! Gra The clocks fell back, but we’re moving forward int Enjoy 25% off our Wicked Good Fun package when you Load More... Follow on Instagram ROOMS & SUITES Experience unsurpassed views of the historic harbor at the Francis Marion Hotel.You may never want to leave your room! Historic Charm Packages and Specials Learn More SWAMP FOX RESTAURANT Named for Revolutionary War hero, General Francis Marion, features farm fresh sustainable ingredients showcasing Charleston’s cuisine for breakfast, lunch, and dinner. The Swamp Fox Restaurant and Bar Book a Table View Menus EVENTS The Heart of Charleston’s social, business and community life since 1924. Find out what makes us the perfect Charleston event venue for any occasion MEETINGS Add a little Southern Charm to your next meeting! The Francis Marion Hotel offers everything you will need for an unforgettable meeting or conference in Charleston. Learn More Book A Meeting WEDDINGS Begin your Love Story in the Heart of Downtown Charleston It’s time to have the wedding of your dreams! The Francis Marion Hotel has three of the most beautiful ballrooms in the Lowcountry, the perfect setting for an elegant wedding reception. Learn more about Weddings CAREERS LEARN MORE Proud Memeber of",
      "hash": "e3683f804acb",
      "downloadedAt": "2026-01-18T16:53:56.406Z",
      "trimmedAt": "2026-01-18T17:12:06.937Z",
      "sizeReduction": "98.8%"
    }
  ],
  "sizeReduction": "98.3%"
}