{
  "venueId": "ChIJS9Mft0Rj_ogRWvHBvtPfIGE",
  "venueName": "Istanbul Shish Kabob Restaurant (Halal)",
  "venueArea": "North Charleston",
  "website": "https://istanbulshishkabob.com/",
  "scrapedAt": "2026-01-18T17:04:26.499Z",
  "trimmedAt": "2026-01-18T17:08:00.759Z",
  "pages": [
    {
      "url": "https://istanbulshishkabob.com/north-charleston-istanbul-shish-kabob-restaurant-food-menu",
      "text": "Our Menu Menu",
      "hash": "62d181717d9f",
      "downloadedAt": "2026-01-18T16:59:56.159Z",
      "trimmedAt": "2026-01-18T17:08:00.740Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "https://istanbulshishkabob.com/",
      "text": "× Order your favorite dishes in seconds! Order Online × Did you know we do catering? Whatever your occasion, however big or small, we have the perfect options to choose from. Cater your birthday party, holiday party, corporate events, wedding festivities and more! Catering Packages 4940 Centre Pointe Drive, North Charleston, SC 29418 map marker pin order online No Need To Call In Or Wait In Line Place your Order now! order Freshly Prepared Innovative, Exceptional Dining Experience Our Menu place your order For Fast And Efficient Service Order Dot slide navigation number 1 Dot slide navigation number 2 slideshow start stop playing Catering Leave The Cooking To Us Savor the Flavors of Our Catering. Our dishes are made from the freshest ingredients and served with love. catering Reviews Review by - Yelp Sarah M: I was kind of craving for some Middle Eastern food once I saw this place pop up on my maps, and I was impressed by the quality and service of the food here! If you're looking for a quick and cheap meal that is different from your typical.. Review by - Yelp Beatriz O: I ordered the shawarma plate and was completely satisfied and happy with it. It was delicious. Portions match the price. I couldn't finish mine but that because I stuffed my face with their delicious bread with fresh garlic sauce, olives.. Review by - Yelp Lauren H: So great! Really absolutely delicious. The service was so kind and welcoming. The food was amazing. I love Middle Eastern food. This was fantastic. All the spices and seasonings were spot on. The grilled shrimp were amazing. Heads on you know they're.. Review by - Yelp Greg B: This place was Amazing! They bring a bread and three different garnishes for all tables. The bread was very light and fluffy. It had air inside, very hot and soft. The garlic sauce was like a very strong tahini sauce. The corn mixture was good. The.. Review by - Yelp Allison H: I absolutely love this restaurant. The atmosphere, the staff, the food, everything is so exquisite and I love bringing new friends here. Normally I come with my mother in law and sister in law. We always get the trio dish with their incredible pita bread.. Stop reviews carousel Play reviews carousel Newsletter Location 4940 Centre Pointe Drive North Charleston, SC 29418 Hours Tue, Wed, Thur, Fri, Sat 11:00 AM - 8:00 PM Sun 11:00 AM - 6:00 PM Find us on... Facebook page Instagram page Yelp page Contact us (843)-996-4738 charlestongalaxy@gmail.com Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "798bae55fc96",
      "downloadedAt": "2026-01-18T16:59:56.091Z",
      "trimmedAt": "2026-01-18T17:08:00.756Z",
      "sizeReduction": "98.1%"
    },
    {
      "url": "https://istanbulshishkabob.com/north-charleston-istanbul-shish-kabob-restaurant-drink-menu",
      "text": "Our Drinks Drinks",
      "hash": "fe413ff8d3f1",
      "downloadedAt": "2026-01-18T16:59:56.754Z",
      "trimmedAt": "2026-01-18T17:08:00.759Z",
      "sizeReduction": "100.0%"
    }
  ],
  "sizeReduction": "99.1%"
}