{
  "venueId": "ChIJNXJ234B7_ogRva6P1mgPOw0",
  "venueName": "Dalila's",
  "venueArea": "Mount Pleasant",
  "website": "http://www.dalilasonspring.com/",
  "scrapedAt": "2026-01-18T17:04:25.642Z",
  "trimmedAt": "2026-01-18T17:07:14.123Z",
  "pages": [
    {
      "url": "http://www.dalilasonspring.com/cocktails",
      "text": "+ Victory Park Vodka, St Germain, Orgeat, Cava We Call This a Porch Pounder + Casa Fuego Reposado Tequila, Apricot, Pineapple, Chile de Árbol A Spicy Marg with Some Extra Goodies + Old Harbor Pineapple Rum, Fernet, Ginger Fruit, Spice, and Everything Nice + El Conejo Mezcal, Dark Rum, Banana, Passionfruit, Citrus Daiquiri Riff Packed with Smoke and Tropical Fruit + Captain's Kick Spiced Rum, Scotch, Ginger, Macadamia, Citrus Think of a Nutty Spiced Mule Mixed with a Mai Tai + Bottom Bay Gin, Banana, Falernum, Pineapple, Citrus We Went All Out Tiki on This One + Dirty Chai Vanilla Chai Bourbon, Java Rum, Cold Brew, Coconut Cream That Boozy Breakfast Drink You've Been Wanting Contains caffeine + Enzo Overproof Rum, Fernet, Campari, Pineapple A Kingston Negroni Meets a Fruity Ferrari Shot + El Pinto Bourbon, Mezcal, Rum, Benedictine, Peychaud's This Old Fashioned Hits All the Bases + Ol' Doops Rye, Pineapple Rum, Banana, Vermouth, Herbstura A Manhattan Being Fed Tropical Fruits on the Beach + Doctor's Cave White Rum, Blanc Vermouth, Grapefruit, Bitters An Island-Inspired Manhattan + Count Camellia Gin, Blanc Vermouth, Coconut Oolong Campari Mike’s Favorite Twist on the Negroni + Lola's Nightcap Toasted Coconut Pecan Rum, Amaro, Cold Brew Espresso, Nutmeg Espresso Martini? Try This Espresso Old Fashioned Contains caffeine",
      "hash": "3da5f597432f",
      "downloadedAt": "2026-01-18T16:56:06.253Z",
      "trimmedAt": "2026-01-18T17:07:14.101Z",
      "sizeReduction": "98.2%"
    },
    {
      "url": "http://www.dalilasonspring.com/events",
      "text": "PRIVATE EVENTS We would love to host you for your next event! Our space features an indoor bar as well as indoor and outdoor seating and standing room. The capacity of our space is 40 people. We are able to serve all of our famous, hand-crafted cocktails as well as beer, wine and food at events. For more information about hosting an event at Dalila’s, download our Private Events Information Package below or contact us directly at . manager@dalilasonspring.com Download events package",
      "hash": "4bc7a81c121b",
      "downloadedAt": "2026-01-18T16:56:07.494Z",
      "trimmedAt": "2026-01-18T17:07:14.104Z",
      "sizeReduction": "99.1%"
    },
    {
      "url": "http://www.dalilasonspring.com/",
      "text": "441 Meeting Street, Suite FCharleston, SC 29403Monday-Saturday 5pm-2am Cocktails About Menu Events Contact",
      "hash": "662f5b3ddb22",
      "downloadedAt": "2026-01-18T16:56:06.045Z",
      "trimmedAt": "2026-01-18T17:07:14.118Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://www.dalilasonspring.com/menu",
      "text": "Our Menufall 2023 View fullsize View fullsize View fullsize",
      "hash": "fbd82575574b",
      "downloadedAt": "2026-01-18T16:56:06.901Z",
      "trimmedAt": "2026-01-18T17:07:14.123Z",
      "sizeReduction": "99.9%"
    }
  ],
  "sizeReduction": "99.6%"
}