{
  "venueId": "ChIJM-G_SU57_ogRcyuhXRHmmFM",
  "venueName": "Heavy's Barburger",
  "venueArea": "Mount Pleasant",
  "website": "https://www.heavysbarburger.com/",
  "scrapedAt": "2026-01-18T17:04:25.498Z",
  "trimmedAt": "2026-01-18T17:07:12.874Z",
  "pages": [
    {
      "url": "https://www.heavysbarburger.com/",
      "text": "Shakin’ Margaritas &smashin’ burgers Welcome to our neighborhood burger joint, where our music sets the vibe before you even hit the door. Step inside and keep the good times rollin’ — we’re talkin’ fresh off the flat top smashburgers, Shorty Margaritas, and a crew that’s genuinely glad you’re here. Come one, come all - we can’t wait to serve ya! Downtown Charleston Learn more Daniel Island Learn more OUR MENU Pairs Best With Good PEOPLE This is the kind of food that just Smashburgers hot off the flat top, BLTs & Mahi sandwiches, Fried Chicken Salads, and House-Made Onion Rings built to pass around the table. . hits Our drink game’s strong too — Shorty Margaritas, neighborhood beers, easy wines, and zero-proof options that still bring the vibe. No fluff. No fuss. Just , cold drinks, and the kind of menu you’ll wanna run back to weekly. damn delicious food View Our Menu The Heavy’s vibe, anywhere you want it. Learn more JOIN OUR TEAM You can never have too much of a good thing — especially when it comes to people. If you're into team service, positive energy, and putting hospitality first, you're our kind of person. Heavy’s is a burger joint built with exceptional people, great food, and a killer playlist. Good vibes and good taste required. Apply Now HEAVY LISTENING Around here, we take two things seriously: great food and good music. really If you’re craving the Heavy’s vibe beyond the barstool, hit play on our Spotify playlist and tune into our playlist of the season. It’s sure to bring the energy wherever you are. Solid tunes, on tap. always Listen now",
      "hash": "84409506951a",
      "downloadedAt": "2026-01-18T16:56:20.031Z",
      "trimmedAt": "2026-01-18T17:07:12.837Z",
      "sizeReduction": "99.4%"
    },
    {
      "url": "https://www.heavysbarburger.com/menu",
      "text": "OUR MENU View our full food menu and drink selection - it’s full of all things you love, from our famous Barburger and Jumbo Wings to our Fresh Salads and Shorty Margarita. Menu offerings vary by location! Check your local Heavy’s for location-specific menu & pricing. For catering party trays, click here . Charleston Menu Daniel Island Menu Shareable Snacks Comes with One Dipping Sauce.. Additional Sauces +$1 each Our Crispy Wings Tossed in Choice of Red Ranger Sauce, The Wright Sauce, or Lemon Pepper Dry Rub. Buttermilk Ranch for Dipping. Served with Carrots & Celery. HEAVY’S JUMBO WINGS SIX / TEN RGF Four Jumbo Tenders, Buttermilk-Dipped, Hand-Breaded & Fried. Honey Mustard for Dipping. CHICKEN TENDERS & FRIES Dunked in Red Ranger Sauce for +$1 Viv’s Deviled Eggs & Heavy’s Sweet & Spicy Thick-Cut Bacon BACON & EGGS GF House-Made Hand-Cut Sweet Onion Rings. Served with Heavy’s Sauce and Sweet & Sassy BBQ for Dipping. ONION RINGS BASKET / HEAVY BASKET Heavy’s Sandwiches Crispy Fried Chicken Breast Dipped in Spiked-Up Cayenne Sauce, Topped with Pepper Slaw and Pickles THE RED RANGER Grilled Chicken Breast with Pepper Jack Cheese, Avocado, Lettuce, Tomato, Red Onion and Duke's Mayo on a Martin's Potato Bun THUNDERBIRD Fish Filet Dusted with our Rub and Seared on a Cast Iron Skillet, Topped with Lettuce, Tomato, Red Onion and Heavy’s Sauce ST. JOE BLACKENED FISH Fresh Local Tomatoes, Applewood Smoked Bacon, and Fresh Lettuce with Duke’s Mayo on Normandy Farm Sourdough HEAVY’S BLT (SEASONAL) Slow-Roasted Prime Rib, Sliced Thin and Piled High on a Toasted French Loaf. Served with House-Made Jus for Dipping and The Wright Sauce. BIG TIM’S PRIME RIB Salads & Soups Hand-Breaded Chicken on Fresh Greens with Cheddar, Cucumbers, Tomatoes, Bacon, Toasted Almonds, and Crunchy Sweet Potato Straws with a Side of Heavy’s Honey Mustard|| FRIED CHICKEN SALAD RGF Sub: Chicken Salad +$1 Grilled Chicken +$2 Barburger Patty +$1 | Blackened Fish +$5 Roasted Chicken, Chilled, Sliced, and Tossed with Fresh Greens, Avocado, Diced Tomatoes, Toasted Almonds, Roasted Corn, Sweet Dates, Crumbled Goat Cheese, Cornbread Croutons, and Our Lemon Vinaigrette THE COMPANY SALAD GF Fresh Romaine Hearts Tossed in Our House-Made Caesar with Fresh Baked Sourdough Croutons, Topped with a Grilled Chicken Breast and Grated Parmesan GRILLED CHICKEN CAESAR RGF Brisket, Short-Rib, Kicked-Up with Sautéed Onions, Peppers, Stewed Tomatoes, and Beans. Topped with Cheddar & Jalapeños. STEW’S CHILI CUP / BOWL RGF We griddle-cook each of our quarter-pound smashburgers to order with our blend of ground Angus beef and serve ‘em on a Toasted Sesame Bun.Double Patty, American Cheese, Sliced Tomato, Red Onion, Lettuce, Pickles, Heavy’s Sauce BARBURGER American Cheese, Red Onion, Pickles, Duke’s Mayo, French’s Mustard LUTEN’S CHEESEBURGER Thick-Cut Bacon, Pepper Jack Cheese, Grilled Onions, Pickled Jalapeños, Sweet & Sassy BBQ, Fried Onion Straws UNCLE GENE’S RANCHERO American & Swiss, Grilled Onions, Pickles, Heavy’s Sauce on Griddled Texas Toast PATTY MELT Marinated Mushrooms, Caramelized Onions, Swiss Cheese, Duke’s Mayo FUN GUY Stew’s Chili, Grilled Onions, Cheddar Cheese, French’s Mustard on a Toasted Martin’s Potato Bun STEW’S CHILI & CHEESE BURGER House-Made Veggie Patty, Swiss Cheese, Sliced Tomato, Red Onion, Lettuce, Pickles, Duke’s Mayo on a Toasted Martin’s Potato Bun HIPPIE BURGER Heavy’s Sides Add to any sandwich or burger. CRINKLE CUT FRY RGF SWEET POTATO FRY GF HEAVY’S COLESLAW GF CUP OF STEW’S CHILI RGF LIL RANCH SALAD GF We Have Pie! Made In-House with Fresh Lemons and Limes in a Graham Cracker and Almond Crust with House-Made Whipped Topping LEMON LIME ICEBOX PIE Heavy-Handed Pours El Jimador Reposado, Agave Nectar, Orange, Fresh Squeezed Lime. SHORTY MARGARITA GF Add: Grand Marnier float +$3 Top Shelf Margarita with Patron Silver, Cointreau, Fresh Lime & Grand Marnier Side Piece ELECTRA 225 GF A tad on the sweet side. Bulleit Bourbon, Angostura, Maple, Orange, and a good Cherry OUR BEST OLD FASHIONED GF Frozen Tequila Sunrise-ish THE BANDWAGON GF Served Very Cold! Wild Turkey 101, Cherry & Rosemary Syrup, Fresh Squeezed Lemon CHERRY BOMB MANHATTAN GF Deep Eddy Lime Vodka, Ginger Beer, Lime MULE NAMED EDGAR GF Jasper Gin, Ancho Reyes, Honey, Fresh Squeezed Lemon BEE STING Appleton Estates Rum, Plantation Pineapple Rum, Grand Marnier, Orgeat, Bitters, Fresh Squeezed Orange and Pineapple Juice HEY KOOL-AID MAN! GF Zero-Proof “Cocktails” Amethyst Lemon Cucumber Serrano, Agave, Lime, Lemon, Orange GOOD GIRL DAISY GF Amethyst Blueberry Ginger Mint & Lois’s Lemonade BLUEBERRY LEMON CRUSH GF Soft Drinks LOIS’S FRESH LEMONADE GF BOTTLED DRINKS: CHEERWINE, NEHI, TOPO CHICO, IBC ROOT BEER, MEXICAN COKE GF DR. PEPPER & COKE PRODUCTS GF ICED TEA GF Gluten-Friendly* Request Gluten FriendlyGluten Friendlyon any Burger/Sandwich +$3on any Burger/Sandwich +$1 RGF = GF = Sub Gluten Free Bun Sub Lettuce Wrap *Prepared in a shared kitchen. Not recommended for celiac or severe gluten allergy.",
      "hash": "a4ec0fdc2ca3",
      "downloadedAt": "2026-01-18T16:56:20.114Z",
      "trimmedAt": "2026-01-18T17:07:12.860Z",
      "sizeReduction": "97.3%"
    },
    {
      "url": "https://www.heavysbarburger.com/locations",
      "text": "```html ``` hey, charleston neighbors! hey, charleston neighbors! hey, charleston neighbors! downtown charleston 1137 Morrison Dr, Charleston, SC 29403 (843) 212-3302 Hours: Open 11 am - 10 pm DailyHeavy's Hour: Weekdays 4 - 6 pm No Reservations - Just Come on In! Order Online Get Directions Our Menu Apply Now About Our Charleston Location Morrison Drive — The Original Heavy’s Barburger Tucked between Morrison Drive and Meeting Street, our first Heavy’s Barburger is where the neighborhood comes to hang. It’s all good vibes, cold drinks, and our delicious smashburgers that bring people together. Kick back in the dining room, catch the breeze on the front deck, or unwind on the patio with your four-legged partner while our playlist sets the vibe. Whether you’re rolling solo or rolling deep, this place just hits right. And take it from the locals — the Onion Ring Basket is a must for your table. join us forHeavy’s Hour Weekdays 4 - 6 pm $5 Shorty MargaritasNeighborhood Draft BeerGlass of House WineJack & CokeTito’s Vodka & Soda ORDER OUR FOR YOUR NEXT EVENT PARTY Trays Bring the flavor to your next event with Party Trays from Heavy’s. We’ve got trays of our hand-breaded Chicken Tenders, crispy Jumbo Wings, freshly tossed Company Salad, and Bacon & Eggs tray (aka Viv’s Deviled Eggs). Plus, a whole Lemon Lime Icebox Pie! Perfect for Holidays, Beach Days, Boat Days, and . all the days Available for pick-up only. Learn More",
      "hash": "c5cc11993685",
      "downloadedAt": "2026-01-18T16:56:20.885Z",
      "trimmedAt": "2026-01-18T17:07:12.874Z",
      "sizeReduction": "99.2%"
    }
  ],
  "sizeReduction": "98.7%"
}