{
  "venueId": "ChIJAQrCJuZk_ogRVUTcLhfqijc",
  "venueName": "Park Pizza Co",
  "venueArea": "North Charleston",
  "website": "http://parkpizzaparkcircle.com/",
  "scrapedAt": "2026-01-19T03:25:39.261Z",
  "trimmedAt": "2026-01-19T03:26:23.489Z",
  "pages": [
    {
      "url": "http://parkpizzaparkcircle.com/",
      "text": "[Page Title: Park Pizza – Best Pizza In Town!]\n\npark pizza co PLEASE CALL US TO PLACE ANY ORDER OR FOR QUESTIONS REGARDING ORDERING.MONDAY - FRIDAY: 11AM - 10PMSATURDAY: 4PM - 10PMSUNDAY: CLOSED (843) 225-PARK  (843) 225-7275 FOR DELIVERIES: We deliver only to Park Circle and parts of Hanahan$8.00 order minimum + $1.00 delivery charge.  Credit or Debit Only. No cash.Last delivery taken at 9:15 every night menu pizza of the month \nChori Pollo\n\nQueso Blanco, Mozzarella, Chorizo, Chicken, Tajin-seasoned Black Beans and topped with diced White Onions and Cilantro\n10″ pizza $13.75 12″ pizza $ 18.75 16″ pizza $25.75 \nCalzone $13.75\npark pizzas \n* MAKE ANY PIZZA INTO A CALZONE!\n* CALZONES WILL BE SERVED WITH A SIDE OF MARINARA ONLY IF THE PIZZA HAS AN EXISTING MARINARA BASE. OTHERWISE, IT IS AVAILABLE UPON REQUEST. pizzas - Intermediate \n10” pizza $12.7512” pizza $17.7516” pizza $23.75Calzone $12.75\n\nMARQUEE\n\nmarinara, mozzarella, pepperoni, banana peppers, feta\n\nADAM\n\nmarinara, mozzarella, garlic, pepperoni, black olives, broccoli\n\nROSS\n\nmarinara, mozzarella, garlic, pepperoni, fresh jalapenos\n\nBIRD ON A WIRE\n\nolive oil, mozzarella, red bbq chicken, red onions, cilantro\n\nBIG Z\n\nmarinara, mozzarella, pepperoni, pineapple, fresh jalapenos\n\nWHITE ROOM\n\nolive oil, mozzarella, garlic, ricotta, basil, parmesan, oregano\n\nLATE NIGHT\n\nolive oil, mozzarella, garlic, double pepperoni\n\nTHE POCKET\n\nOlive Oil, Mozzarella, Cheddar, Ham, Broccoli\n\nRANCH CHICK\n\nmarinara, mozzarella, baked chicken, bacon, tomato, ranch\n\nGRILLED CHEESE\n\nbutter, mozzarella, provolone, cheddar, dill pickles\n\nENVY\n\npesto, mozzarella, spinach, artichokes, feta\n\nB.S.T.\n\ntomato cream sauce, mozzarella, bacon, spinach, tomato\n\nTHREE PIGS\n\nmarinara, mozzarella, pepperoni, pork sausage, salami\n\nSPACEBALLS\n\nmarinara, mozzarella, ricotta, meatballs, garlic, oregano\npizzas - advanced \n10” pizza $13.7512” pizza $18.7516” pizza $25.75Calzone $13.75\n\nBLUE ANGUS\n\nolive oil, mozzarella, horseradish, roast beef, caramelized onions, bleu cheese\n\nTHAI\n\nolive oil, mozzarella, cream cheese, provolone, thai chicken, broccoli, cilantro, honey roasted peanuts\n\nGREEK\n\nolive oil, mozzarella, garlic, spinach, tomato, black olives, pepperoncini, red onions, feta\n\nLASAGNA\n\nolive oil, garlic, mozzarella, ricotta, sausage meat sauce, oregano, basil\n\nKURT BRUSSELL\n\nolive oil, mozzarella, brussels sprouts, bacon, blue cheese, & honey balsamic reduction\n\nBONZAI\n\nolive oil, mozzarella, red bbq chicken, bacon, pineapple, cheddar\n\nBASIL LOUISE\n\nPesto, Ricotta, Garlic, Mozzarella, Sliced Tomatoes, Basil, Balsamic Reduction\n\nCAROLINA\n\nolive oil, mozzarella, mustard bbq chicken, pork sausage, banana peppers, cheddar\n\nMUSHROOM SWISS BURGER\n\nolive oil, mozzarella, cream cheese, ground beef, mushrooms, caramelized onions, swiss\n\nCROSBY, DILLS & NASH\n\nSpicy Pepper Sauce, Mozzarella, Cheddar, Nashville Hot Baked Chicken, White Onions, Dill Pickles\n\nSTEELER\n\nmarinara, mozzarella, pork sausage, mushrooms, hot cherry peppers, caramelized onions, provolone\n\nCLASSIC\n\nmarinara, mozzarella, pepperoni, pork sausage, green peppers, mushrooms, white onions, black olives\n\nPETER RABBIT\n\nmarinara, mozzarella, green peppers, red onions, black and green olives, broccoli, mushooms\n\n7 LAYER\n\nblack bean spread, mozzarella, cream cheese, cheddarjack, black olives, pico, jalapenos, cilantro\n\nNACHO\n\nblack bean spread, mozzarella, cheddar, pepperjack, taco-spiked chicken, pico, jalapenos, cilantro\n\nBIG DIPPER\n\npesto, alfredo, mozzarella, spinach, artichokes, white onions, parmesan\n\nLONGBOARD\n\npesto, mozzarella, turkey sausage, pineapple, feta\n\nCOWBOY\n\nred bbq sauce, mozzarella, ground beef, bacon, red onions, tomato, cheddar\n\nFIREBIRD\n\nbuffalo sauce, mozzarella, buffalo chicken, bacon, green onions, jalapenos, provolone\n\nMCPARK\n\nSpecial Sauce, Mozzarella, American Cheese, Ground Beef, Diced White Onions, Dill Pickles, Sesame Seeds\npizzas - expert \n10” pizza $14.7512” pizza $19.7516” pizza $26.75Calzone $14.75\n\nCORDON BLEU\n\nalfredo, dijon mustard, swiss, spinach, baked chicken, ham, bleu cheese, mozzarella\n\nGRINDER\n\nolive oil, mozzarella, spinach, pepperoni, salami, ham, tomato, banana peppers, red onions, olive oil vinaigrette\n\nBRADWELL\n\nolive oil, mozzarella, provolone, turkey sausage, fig preserves, caramelized onions, apples, bleu cheese, pecans\n\nEGGSCAPE FROM NEW YORK\n\nbaked eggs, american cheese, mozzarella, maple pork sausage, bacon, green onions, everything bagel seasoned crust (not available as calzone)\n\nSHE CRAB\n\nolive oil, cream cheese, mozzarella, crab, tomato, garlic, green onions, parmesan\nbuild your own \nBUILD YOUR OWN\nbase : MARINARA OR OLIVE OIL + MOZZARELLA 10\" OR CALZONES $10.75 | 12\" $13.75 | 16\" $18.75 +ANY OTHER BASE: + PROTEINS OR CHEESES:  +VEGGIES , FRUITS OR OTHERSOTHER BASES: CHEESES: VEGGIES AND FRUITS: PROTEINS: OTHERS: 10\" or CALZONES +1.00 | 12\"+1.25 | 16\" +$1.75 10\" or CALZONES +1.25 | 12\" +$1.50 | 16\" +$2.25 10\" or CALZONES +1.00 | 12\" +1.25 | 16\" +$1.75 MARINARA, OLIVE OIL, ALFREDO, TOMATO CREAM, BUTTER, SPINACH PESTO, RED BBQ SAUCE, BLACK BEAN SPREAD, BUFFALO SAUCE MOZZARELLA, PROVOLONE, RICOTTA, PARMESAN, SWISS, CHEDDAR, FETA, BLEU CHEESE, PEPPERJACK, BLUE CHEESE CRUMBLES, CREAM CHEESE Fresh button MUSHROOMS, FRESH TOMATOES, SUNDRIED TOMATOES, SPINACH, ARTICHOKES, BROCCOLI, BRUSSELS SPROUTS, WHITE ONIONS, RED ONIONS, GREEN ONIONS, CARAMELIZED ONIONS, PICO SALSA, GREEN BELL PEPPERS, BANANA PEPPERS, HOT CHERRY PEPPERS, PEPPERONCINI, Pickled JALAPENOS, FRESH JALAPENOS, BLACK OLIVES, GREEN OLIVES, DILL PICKLES, GRANNY SMITH APPLES, PINEAPPLE, FIG PRESERVES PEPPERONI, PORK SAUSAGE, TURKEY SAUSAGE, SALAMI, HAM, BACON, GROUND BEEF, TACO-SPIcED BEEF, ROAST BEEF, MORNING STAR FARM'S VEGGIE Grillers CRUMBLES, SLICED TURKEY, MEATBALLS, BAKED CHICKEN, RED BBQ CHICKEN, MUSTARD BBQ CHICKEN, BUFFALO CHICKEN, THAI CURRY CHICKEN, NASHVILLE HOT BAKED CHICKEN, TACO-SPIcED CHICKEN, TERIYAKI CHICKEN, PESTO CHICKEN, HOT DOG SLICES, CRAB, ANCHOVY, BAKED EGG (Applied as a base) BALSAMIC REDUCTION, BASIL, CILANTRO, GARLIC, OREGANO, HORSERADISH, PECANS, HONEY ROASTED PEANUTS, SESAME SEEDS, RANCH DRESSING, EVERYTHING BAGEL CRUST incredibowls \nincredibowls\n\nAll of the pizza, none of the crust! The toppings and combinations that we love baked in a 7″ bowl for a gluten-friendly* option!* we are not a gluten-free facility\n\nFiesta\n\n$13.75\n\nBlack Bean Spread, Mozzarella, Cheddar, Pepper Jack, Baked Chicken, Pico Salsa, Jalapenos, Cilantro\n\nSpinach ‘Lasagna’\n\n$13.75\n\nNo Noodles! Marinara, Mozzarella, Spinach, Pork Sausage, Ricotta, Garlic, Oregano, Basil\n\nCarniFour\n\n$13.75\n\nMarinara, Mozzarella, Provolone, Pepperoni, Pork Sausage, Ham, Bacon\n\nPeter Rabbit\n\n$13.75\n\nMarinara, Mozzarella, Mushrooms, Green Peppers, Red Onions, Broccoli, Black Olives, Green Olives\n\nClassic\n\n$13.75\n\nMarinara, Mozzarella, Pepperoni, Pork Sausage, Mushrooms, Green Peppers, White Onions, Black Olives\nsandwiches All Sandwiches served with all-natural kettle chips.Cold Sandwiches come with your choice of one meat, One CHEESE (PROVOLONE, SWISS, AMERICAN OR MOZZARELLA), lettuce, tomato, red onion, banana peppers AND CONDIMENTS (MUSTARD, MAYO, AND/OR ITALIAN DRESSING) toasted sandwiches $11.75 \nCHICKEN PARM\n\nmarinara, ricotta, baked chicken, provolone, parmesan, oregano\n\nPAOLO\n\nmarinara, meatballs, provolone, mozzarella, oregano\n\nRED HEAD\n\nbuffalo chicken, red onions, green peppers, provolone, bleu cheese\n\nCHICKEN BACON RANCH\n\nbaked chicken, bacon, tomato, mozzarella, ranch, oregano\n\nTHE GARDEN\n\nolive oil, garlic, mushrooms, tomato, green peppers, red onions, black and green olives, provolone, oregano\n\nSUBURRITO\n\nblack bean spread, taco-spiked-chicken, red onions, pico salsa, jalapenos, cheddar\n\ncold or toasted Sandwiches$10.75\n\nITALIAN (PEPPERONI + SALAMI)\n\nROAST BEEF\n\nTURKEY\n\nHAM\nsalads GREENLEAF + ICEBERG MIX DRESSING: EXTRA + 1.50ranch, bleu cheese, honey mustard, golden italian, lite olive oil vinaigrette, creamy cucumber wasabi (house favorite) **HALF SIZE EMPIRE OR CIRCLE: $5.00 salads$9.75 \nEMPIRE\n\ntomato, red onions, black olives, pepperoncini, feta\n\nCIRCLE\n\ntomato, red onions, black and green olives, provolone\n\npremium Salads$12.75\n\nCHEF\n\ntomato, red onions, green peppers, ham, turkey, cheddar\n\nITALIAN\n\ntomato, red onions, hot cherry peppers, pepperoni, salami, provolone\n\nTACO\n\npico salsa, black olives, cilantro, taco-spiked chicken, cheddar\n\nBUFFALO\n\ntomatoes, red onions, green peppers, bleu cheese crumbles, buffalo chicken\n\nCHICKEN & GREENS\n\ntomato, red onions, green peppers, broccoli, cheddar, and your choice of chicken\nextras \nextras\n\nSIDE OF MARINARA\n\n$1.00\n\nPIZZA BY THE SLICE\n\n$4.00\n\nMARINARA + MOZARELLA (EACH ADDITIONAL TOPPING .50)\n* slices available until 2pm…not available for delivery*\n\nGARLIC PARMESAN KNOTS WITH MARINARA\n\n$8.75\n\n10″ TRIPLE CHEESE GARLIC STRIPS WITH MARINARA + RANCH\n\n$9.75\n12″ (add $2.00) \nPIZZA ROLL\n\n$12.75\n\n10inch dough filled with up to 4 toppings and mozzarella, folded, brushed with herb and garlic butter, and baked with a side of marinara\nComes w/ 1 Topping … Additional Toppings +1.00 kids \nkids pizzas\n\nBOSTON\n\n$4.50\n\nkid-size pizza rollup, cheese or pepperoni, side of marinara\n\nROMAN\n\n$4.50\n\nkid-sized dough, baked with cheddar and sliced hot dogs\n\nJUDE\n\n$4.00\n\nkid-sized dough with mozzarella and marinara, olive oil or butter\ndesserts desserts \nCOUNTER TREATS\n\nBrownies, Toffee Crunch Blondies, GF Brown Butter Marshmallow Crispy Treats & Chocolate Chunk Cookies… CALL FOR AVAILABILITY\n\nAPPLE “PIE”\n\n$9.75\n\n10” dessert pizza topped with cream cheese, butter, apples, cinnamon sugar & pecans\n\nMONKEY BITES\n\n$8.75\n\nmini pizza dough cinnamon rolls topped with cream cheese icing\n\nCAKES & PIES & CHEESECAKES\nCALL FOR SELECTION drinks drinks \n12 OZ. CANS\n\n$1.75\n\nCOKE, DIET COKE, SPRITE, MT. DEW, DR. PEPPER, DIET DR. PEPPER\n\n6 PACK MIX & MATCH CANNED SODAS\n\n$8.75\n\n12 OZ. BOTTLE BOYAN ROOT BEER\n\n$2.75\n\n12 OZ BOYLAN SPARKLING LEMONADE\n\n$2.75\n\n16 OZ PURE LEAF SWEET TEA\n\n$2.75\n\n16 OZ. BOTTLED WATER\n\n$1.00",
      "hash": "8aa30bc1bec9",
      "downloadedAt": "2026-01-19T02:15:00.763Z",
      "trimmedAt": "2026-01-19T03:26:23.489Z",
      "sizeReduction": "94.7%"
    }
  ],
  "sizeReduction": "94.7%"
}