{
  "venueId": "ChIJVVhz9kRj_ogRZB6sgimCvxk",
  "venueName": "Baba Kabob Market and Deli Halal ( حلال)",
  "venueArea": "North Charleston",
  "website": "http://babakabobmarketanddeli.com/",
  "scrapedAt": "2026-01-18T17:04:26.821Z",
  "trimmedAt": "2026-01-18T17:08:04.676Z",
  "pages": [
    {
      "url": "http://babakabobmarketanddeli.com/north-charleston-baba-kabob-market-and-deli-food-menu#",
      "text": "Our Menu Menu",
      "hash": "04d1dfc299aa",
      "downloadedAt": "2026-01-18T16:58:11.518Z",
      "trimmedAt": "2026-01-18T17:08:04.654Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://babakabobmarketanddeli.com/north-charleston-baba-kabob-market-and-deli-drink-menu",
      "text": "Our Drinks Drinks",
      "hash": "3a1c360db648",
      "downloadedAt": "2026-01-18T16:58:10.884Z",
      "trimmedAt": "2026-01-18T17:08:04.656Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://babakabobmarketanddeli.com/north-charleston-baba-kabob-market-and-deli-food-menu",
      "text": "Our Menu Menu",
      "hash": "98889a94117e",
      "downloadedAt": "2026-01-18T16:58:10.243Z",
      "trimmedAt": "2026-01-18T17:08:04.660Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://babakabobmarketanddeli.com/",
      "text": "× Order your favorite dishes in seconds! Order Online × Did you know we do catering? Whatever your occasion, however big or small, we have the perfect options to choose from. Cater your birthday party, holiday party, corporate events, wedding festivities and more! Catering Packages × Let us host your special event! Whether a birthday party, office function or any other special occasion - we take care of all the fine details, bringing your event to life, just as you imagined. Host your next party or get together Book your party × We are taking online reservations! Let’s ensure you get a great table: Book today! We recommend making a reservation ahead of time. Book your table today! Book Table Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! Job Listings Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! 4952 Centre Pointe Dr Suite 110, North Charleston, SC 29418 map marker pin order Take us home with you Our menu, wherever you want it Pickup DoorDash UberEats GrubHub Catering Catering made easy Let us bring the flavor to your event cater inquire now Reservations Halal Restaurant in North Charleston Click the button below to make a reservation Reserve Reviews Review by - Yelp Shahad A: This is the best place in Charleston to get authentic Arabic food and groceries. The staff are amazing and very friendly, highly recommended!! Review by - Yelp Daniela Z: I love this spot! Everything is fresh and they are always so kind and friendly. I forgot to take a picture of the pistachio baklava which was also DELICIOUS. Review by - Yelp Sheila K: Amazing! We ordered chicken kabob platters with an order of hummus. We are not disappointed. The food is fresh and flavorful. Review by - Yelp Lauren K: This place is so authentic and amazing!! They are so friendly and their food is always cooked to order and so delicious, I would eat here every day if I could, you have to try their hummus too it's the best Review by - Yelp Courtney U: My husband has been deployed where they had food like this and he was craving it and we found this place. The staff is so friendly and the food honestly makes me cry it's so so good... Stop reviews carousel Play reviews carousel Halal Fresh Meat Our Menu food Halal International Grocery Order Dot slide navigation number 1 Dot slide navigation number 2 Dot slide navigation number 3 Dot slide navigation number 4 Dot slide navigation number 5 Dot slide navigation number 6 Dot slide navigation number 7 Dot slide navigation number 8 Dot slide navigation number 9 Dot slide navigation number 10 Dot slide navigation number 11 slideshow start stop playing Newsletter Location 4952 Centre Pointe Dr Suite 110 North Charleston, SC 29418 Hours Mon, Tue, Wed, Thur, Fri, Sat 10:00 AM - 8:00 PM Sun 11:00 AM - 6:00 PM Find us on... Facebook page Instagram page Yelp page Contact us (843)-990-9522 walidisma@gmail.com Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "e21cc262f76c",
      "downloadedAt": "2026-01-18T16:58:10.122Z",
      "trimmedAt": "2026-01-18T17:08:04.676Z",
      "sizeReduction": "97.8%"
    }
  ],
  "sizeReduction": "99.2%"
}