{
  "venueId": "ChIJX4SGmHl8_ogRbTRIfJhMXIs",
  "venueName": "Buck's Pizza",
  "venueArea": "West Ashley",
  "website": "http://buckspizza.com/",
  "scrapedAt": "2026-01-18T17:04:26.944Z",
  "trimmedAt": "2026-01-18T17:08:06.066Z",
  "pages": [
    {
      "url": "http://buckspizza.com/",
      "text": "HOME Locations About Blog Contact Franchise Information Check your local Buck's for Dine-in | Curbside | Delivery | Drive-thru HOME Locations About Blog Contact Franchise Information Find My Buck's Buck's Pizza FIND US NEAR YOU GOOD | BETTER | BUCKS Everyone loves delicious food, especially pizza, but with today’s hectic life, you probably don’t have time to prepare a home-cooked meal. That’s where Buck’s Pizza comes in. Bucks Pizza offers menu choices of pasta, wings, salads, sandwiches, desserts & the Best PIZZA using the freshest ingredients served at the peak of deliciousness. Whether you crave pizza made with handmade dough and carefully selected tomatoes, hot and crispy chicken tenders, or even a healthy salad, our menu has something sure to please even the pickiest eaters. Locations & Menus Checking on your order? For faster service placing an order or to check on an order, please contact your local Buck's. Locations GOOD | BETTER | BUCKS Using the freshest ingredients served at the peak of deliciousness. Delicious since 1994 HOME LOCATIONS ABOUT BLOG CONTACT FRANCHISE INFORMATION Website Built by Magnus Marketing",
      "hash": "86d629ea6032",
      "downloadedAt": "2026-01-18T17:02:00.331Z",
      "trimmedAt": "2026-01-18T17:08:06.040Z",
      "sizeReduction": "99.0%"
    },
    {
      "url": "https://buckspizza.com/locations/",
      "text": "HOME Locations About Blog Contact Franchise Information Check your local Buck's for Dine-in | Curbside | Delivery | Drive-thru HOME Locations About Blog Contact Franchise Information Find My Buck's Locations Peachtree, GA Gloversville, NY Morganton, NC Tryon, NC Clearfield, PA DuBois, PA St. Marys, PA Charleston, SC Lexington, SC Walterboro, SC Hidalgo, TX Mont Belvieu, TX Clear Lake, TX Open your own Franchise! Buffalo, MN Mission, TX Hidalgo, TX Antigo, WI GOOD | BETTER | BUCKS Using the freshest ingredients served at the peak of deliciousness. Delicious since 1994 HOME LOCATIONS ABOUT BLOG CONTACT FRANCHISE INFORMATION Website Built by Magnus Marketing Privacy Policy",
      "hash": "ebda6607523d",
      "downloadedAt": "2026-01-18T17:02:00.699Z",
      "trimmedAt": "2026-01-18T17:08:06.066Z",
      "sizeReduction": "99.7%"
    }
  ],
  "sizeReduction": "99.5%"
}