{
  "venueId": "ChIJ2z_fQId7_ogRoxp_7evokOU",
  "venueName": "Matador Charleston",
  "venueArea": "Downtown Charleston",
  "website": "https://www.matadorrestaurants.com/locations/charleston-sc",
  "scrapedAt": "2026-01-18T17:04:23.374Z",
  "trimmedAt": "2026-01-18T17:04:52.919Z",
  "pages": [
    {
      "url": "https://www.matadorrestaurants.com/#section-locations",
      "text": "Welcome to the Matador Come in and be enveloped by our passion for the most daring of spirits. For brave, fresh Mexican flavors, and beautiful scratch-made cocktails. For the people and the culture of Mexico, where we forge friendships with tequila makers, listen to their stories, and bring them home to share with you, as we guide you through your tequila experience. Choose from the most diverse selection of tequilas you’ll find anywhere—in a space filled with furnishings and fittings inspired by our travels, and crafted by our founder’s own hands. Join us. We invite you to become a part of the journey. Taste Mexico Reimagined The Matador uses all-natural ingredients only, and that includes our carne, pollo, carnitas and seafood. We source the freshest, in-season vegetables and fruits available. Then we take those ingredients and cook them up into creative dishes that taste a bit like Mexico, a bit like the local area, and a bit like nothing you’ve ever tasted before. Please click to see our current takeout menu, including our Take n Bake dishes, Familia meals, and beverages to go. Order Online Please select your to view our current dine-in menus. location Seasonal Features From The Bar Looking for other non-alcoholic cocktails? Ask any Matador team member about non-alcoholic margarita options featuring Lyre’s N/A tequila and orange liqueur. From the kitchen From The Bar Looking for other non-alcoholic cocktails? Ask any Matador team member about non-alcoholic margarita options featuring Lyre’s N/A tequila and orange liqueur. SCRATCH MARGARITA Dhōs Blanco N/A tequila, Dhōs Orange N/A triple sec, fresh-muddled lime and orange, agave MANGO-JALAPEÑO LIMEADE Dhōs Blanco N/A tequila, lime, mango, jalapeño, pineapple, Sprite CRANBERRY PONCHE Dhōs Blanco N/A tequila, Dhōs Orange N/A triple sec, cranberry, pomegranate, hibiscus, tamarind, lemon, ginger, cinnamon, star anise, allspice, Sprite From the kitchen PAPAS CON RAJAS veg/gf Fried chipotle-seasoned potato wedges, roasted poblano, fire-roasted corn, Monterey Jack cheese, avocado crema, molcajete salsa SEARED AHI TUNA gf Tamari ponzu, guacamole, shaved serrano, chile seasoning, sesame seeds, fried corn tostadas GRILLED CHICKEN LETTUCE WRAPS gf Butter lettuce, orange-agave marinated chicken, slaw, cucumber, avocado, molcajete salsa, queso fresco Add a third taco for $6 *CHICKEN CHIMICHANGAS Two crispy fried chimichangas, braised chicken, black bean queso, Monterey Jack & cheddar cheeses, shredded lettuce, pico de gallo, avocado crema Served with choice of house-made enchilada sauce and Mexican rice *For every order of this entree, we'll donate $1 to St. Jude Children’s Research Hospital Mix & Match Available Monday to Friday, 11am-3pm. Soup, choice of salad, and choice of entree for $16! CHOOSE YOUR SALAD Romaine Salad Cilantro-pepita dressing, toasted pepitas, pico de gallo, cotija, lime House Salad Baby spring mixed green, blistered tomato and roasted pepper relish, hibiscus-pickled onion, cucumber, tajin, choice of dressing CHOOSE YOUR ENTRÉE Proteins: Chicken, Carnitas, Beyond Picadillo Add guacamole and cilantro-lime sour cream $3 Taco Serrano slaw, tomatillo salsa, garlic crema, pico de gallo, cotija Burrito Mexican rice and beans, Jack & cheddar cheeses, served divorciadas style with verde and roja sauces Quesadilla Monterey Jack cheese, pico de gallo, garlic crema, toasted pepitas, cilantro SOUP Chicken Tortilla Soup Roasted chicken, fire-roasted corn, avocado, tortilla strips, cotija, cilantro Happy Hour 4PM to 6PM and 10PM-Close Grande Nachos House-made tortilla chips, layered with jack & cheddar cheese mix, Mexican black beans, pico de gallo, guacamole, cilantro-lime sour cream, and garnished with green onion Add choice of protein* Romaine Salad Cilantro pepita dressing, toasted pepitas, pico de gallo, cotija, lime [gf/v] Crispy Brussels Sprouts Fried brussels sprouts, peppers & onions, lime, agave, cotija [gf/v] Black Bean Dip Black beans, habanero, garlic crema, tomatillo salsa, green onion [gf/v] Quesadilla Cheese (only) or choice of protein* with pico de gallo, cilantro-lime sour cream, guacamole, garlic crema, toasted pepitas, garnished with cilantro Haba Prawns Fiery roasted habanero sauce, roasted garlic & jalapeño polenta, hibiscus pickled onion [gf] Queso Con Chorizo Melted three-cheese house blend, creamy habanero sauce, pico de gallo, cilantro, queso fresco [gf] Chicken Tortilla Soup Roasted chicken, fire-roasted corn, avocado, tortilla strips, cotija, cilantro Matador Guacamole Orange-habanero salsa Maya, tomatillo salsa, pico, queso fresco, cilantro [gf] Baja Fish Tacos (2) Panko crusted and fried Mahi Mahi, serrano slaw, guacamole, chipotle mayo, radish, cilantro, lime Steak Tacos (2) Topped with shredded lettuce, guajillo chile sauce, pico de gallo, garlic crema Shrimp Tacos (2) Topped with serrano slaw, tomatillo salsa, pico de gallo, garlic crema, cotija cheese Fried Tacos (2) *Offered at select locations* Crispy fried corn tortillas, shredded chicken, black bean queso, shredded lettuce, pico de gallo, serrano vinaigrette, salsa Maya, chimichurri mayo Street Tacos (3 or 5) Choice of protein* topped with tomatillo salsa, cilantro & white onion mix and cotija cheese *Choices of Protein Chicken, Carnitas, Chorizo, Ground Beef, or Beyond Picadillo, Steak or Shrimp Snacks + Starters Dip Flight Creamy three-cheese queso, fresh guacamole, and hearty black bean dip Matador Guacamole Orange-habanero salsa Maya, tomatillo salsa, pico, queso fresco, cilantro [gf] Black Bean Dip Black beans, habanero, garlic crema, tomatillo salsa, green onion [gf/v] Queso Con Chorizo Melted three-cheese house blend, creamy habanero sauce, pico de gallo, cilantro, queso fresco [gf] Crispy Brussels Sprouts Fried brussels sprouts, peppers & onions, lime, agave, cotija [gf/v] Fried Tacos *Offered at select locations* Crispy fried corn tortillas, shredded chicken, black bean queso, shredded lettuce, pico de gallo, serrano vinaigrette, salsa Maya, chimichurri mayo Street Tacos Served with white onion, cilantro, cotija, house-made salsa, radish, and lime on corn tortillas [gf]: Carnitas, house-made Chorizo, Beyond Picadillo, Ground Beef, or Shredded Chicken Boulevard Style - add guacamole and pico de gallo Grilled Stuffed Jalapeños Goat Cheese, hickory smoked bacon, ranch dressing [gf] Quesabirria Three corn tortillas, Monterey Jack cheese, roasted poblanos, beef birria, onions, cilantro, birria jus Haba Prawns Fiery roasted habanero sauce, roasted garlic & jalapeño polenta, hibiscus pickled onion [gf] Ahi Tuna Tostada* Agave ponzu sauce, avocado, chipotle mayo, green onion, finishing salt [gf] Coconut Crusted Shrimp Fresh lime, orange, and tomato juices, fresh chiles, red onion, cucumber, avocado, orange segments [gf] Grande Nachos Cheddar, Monterey Jack, black beans, pico de gallo, guacamole, cilantro-lime sour cream Add: Shredded Chicken, Carnitas, House Chorizo, Ground Beef, Beyond Picadilo Marinated Steak* Matador Quesadilla Monterey Jack, guacamole, garlic crema, toasted pepitas, pico de gallo, cilantro-lime sour cream Choose from: Cheese (plain - no crema, pepitas, pico de gallo), Carnitas, Ground Beef, or Chicken Carne Asada* or Shrimp Soups + Salads + Sandwiches Tortilla Chicken Soup Roasted chicken, fire-roasted corn, avocado, tortilla strips, cotija, cilantro [gf] Romaine Salad Cilantro-pepita dressing, toasted pepitas, pico de gallo, cotija, lime [gf] House Salad Baby spring mixed green, blistered tomato and roasted pepper relish, hibiscus-pickled onion, cucumber, tajin, choice of dressing Chop Salad Fire-roasted corn, red bell pepper, Mexican black beans, pico de gallo, romaine lettuce, green and red cabbages, fried tortilla strips, chipotle ranch Choose Chile-Sautéed Shrimp or Marinated Chicken Breast Taco Salad Black beans, Monterey Jack, cotija, shredded lettuce, guacamole, pico de gallo, cilantro-lime sour cream, serrano vinaigrette, garlic crema, jalapenos en escabeche Matador Bowl Mexican black beans & rice, cheese blend, serrano slaw, pico de gallo, guacamole, radish, tortilla strips Choice of: roja, verde, habanero, or poblano crema [gf] Add: Braised Chicken, Carnitas, Chorizo, Ground Beef, or Southwest Veg Beyond Picadilo Gaucho Bowl Sautéed peppers & onions, Mexican black beans & rice, Jack & cheddar cheeses, shredded lettuce, pico de gallo, guacamole, cilantro-lime sour cream, French fried onions Add: Grilled Chicken or Sautéed Shrimp Grilled Marinated Steak* Carne Asada Sandwich* Grilled marinated steak, caramelized onion, serrano slaw, roasted poblano, pico de gallo, French fried onions, chimichurri mayo Wagyu Bacon Cheeseburger Mixed greens, pico de gallo, bacon, French fried onions, Jack & cheddar cheeses, chipotle mayo Agave Chicken Wrap Agave-marinated chicken breast, bacon, avocado, cilantro-pepita dressing, pico de gallo, shredded lettuce, serrano vinaigrette, cotija Specialty Tacos Two tacos on flour tortillas with Mexican black beans & rice. Add a third taco for $6. Enchiladas Two enchiladas with Monterey Jack, pico de gallo, guacamole, cilantro-lime sour cream, Mexican black beans & rice Burritos Flour tortilla filled with Mexican black beans & rice, Jack and cheddar cheeses, and sides of serrano slaw, pico de gallo, guacamole, cilantro-lime sour cream, garlic crema Specialty Tacos Two tacos on flour tortillas with Mexican black beans & rice. Add a third taco for $6. Baja Fish Tacos Panko crusted and fried Mahi Mahi, serrano slaw, guacamole, chipotle mayo, radish, cilantro, lime Coconut Shrimp Tacos Crispy coconut-breaded shrimp, mango-pineapple salsa, pico, cilantro-lime sour cream, serrano slaw, on flour tortillas Mango Steak Tacos Grilled choice carne asada*, mango-pineapple salsa, serrano slaw, guajillo-chile sauce, Tajin Ribeye Tacos Grilled ribeye, French fried onions, chimicurri mayo, avocado, grilled red pepper, cotija Enchiladas Two enchiladas with Monterey Jack, pico de gallo, guacamole, cilantro-lime sour cream, Mexican black beans & rice Divorciadas Mild sweet and tangy salsa verde, medium smokey salsa roja, braised chicken thighs, corn tortillas [gf] Habanero Fiery hot habanero salsa, shredded chicken, flour tortillas Shredded Beef Medium and smoky salsa roja, flour tortillas, shredded braised beef birria, flour tortillas Verde Carnitas Medium sweet and tangy salsa verde, braised carnitas, corn tortillas [gf] Burritos Flour tortilla filled with Mexican black beans & rice, Jack and cheddar cheeses, and sides of serrano slaw, pico de gallo, guacamole, cilantro-lime sour cream, garlic crema Poblano Carnitas Braised carnitas, rich and mild crema salsa Habanero Steak Grilled marinated steak*, picante habanero sauce Verde Chicken Braised chicken, chile verde sauce Beyond Burrito Plant-based protein, medium and smokey salsa roja, caramelized onions, roasted poblanos [v] Entrees Braised Carnitas Pork shoulder, Mexican black beans, Mexican black beans & rice, pico de Gallo, hibiscus pickled onions, guacamole, cilantro-lime sour cream, choice of flour or corn tortillas Skillet Seared Fajitas Sautéed peppers & onions, Mexican black beans, Jack & cheddar cheeses, romaine, pico de gallo, guacamole, cilantro-lime sour cream, choice of flour or corn tortillas Choose From: Marinated Carne Asada* Marinated Chicken Breast or Shrimp Chile-Seasoned Ribeye* Grilled Carne Asada Street corn & leeks, grilled peppers, cotija, cilantro, Mexican black beans & rice, flour or corn tortillas. (gf) Choose From: Marinated Carne Asada* Chile-Seasoned Ribeye* ~Make it surf and turf, add habanero, Chile-garlic or poblano shrimp~ Shrimp & Chorizo Paella Shrimp, house-made chorizo, sautéed fajita peppers, achiote-chile rice, saffron cream Mango-Pineapple Mahi Mahi Chunky mango & pineapple salsa, fruity salsa verde, serrano slaw, chile-achiote rice, cilantro, lime Roasted Chile Rellenos Poblanos stuﬀed with Mexican rice, Monterey Jack cheese, tomatillo salsa served with Mexican black beans, poblano crema, garlic crema, pico de gallo, and tortilla strips Choose from: Shredded Chicken, Beyond Picadillo, or Carnitas (gf) We Know Tequila Drinking tequila is like drinking in the essence of Mexico. The Matador believes there’s a perfect tequila for every person and every occasion, and we love nothing more than helping our guests discover theirs. We’ve curated a collection of more than 150 tequilas that we feel are truly excellent, from all over Mexico. Some are available exclusively at the Matador. We even serve our own Private Reserve Tequila—from barrels we select personally after tastings with the makers in Mexico. This gives you endless ways to experience the fun of this wild and extraordinary spirit, and the nuances of the different regions of Mexico where it’s produced. Try a margarita made with our own fresh, house-made sour mix, or one of our many other creative cocktails crafted by our in-house mixologist. Let us guide you through a flight, to discover something new and intriguing. Or just savor a beautiful shot of your all-time favorite. Want free nachos?! Join our (free) loyalty program and receive an order of our standard Grande Nachos when you download The Matador app! Plus earn points for every dollar spent, get a free dessert on your birthday & more! Sign Up Now Locations The Matador may be slightly mysterious, but we’re not hard to find. To connect with a specific restaurant, please select a location. Ballard Matador Boise Matador SE Portland Matador Meridian Matador NW Portland Matador Redmond Matador 21+ Tacoma Matador 21+ West Seattle Matador 21+ N Portland Matador Charleston Matador Charlotte Matador Greenville Matador About Us At the Matador, tequila is more than a beverage—it’s almost a culture of its own. We immerse ourselves in it. We know the landscape and the people who make a difference within it. We love everything about tequila, and we enjoy sharing our knowledge, to help our guests appreciate it as much as we do. We serve a menu of scratch-made dishes that complement the nuances of great blancos, reposados and añejos, with exciting preparations that re-think Mexican, always fresh ingredients and creative plate presentations. The restaurant interiors reflect the craft, heart, soul and sense of adventure that live inside every good bottle of tequila. Step into the Matador, and gain insider access to the world of tequila, the flavorful foods that go with it and the rarified atmosphere of craft, care and pleasure it creates. Cater Your Event Click below to see our outside catering menus. Whether ordering lunch for the office, or a taco bar for a special event, we've got you covered. Order Catering Online Hosted Events Tucked away from the crowd, the Matador offers several unique private spaces for you and your group. We’ll help you with all the details for a perfect event, whether you’re planning a gathering of friends and family, a business luncheon, a professional workshop, or even a tequila tasting seminar. Take a look at our in-house catering menus: Catering Menu Our Event Venues We have many wonderful options in the Seattle, Portland, Charleston, and Boise areas. See the venues available near you, and inquire about hosting your event with us! Find Your Venue Contact Us The Matador may be slightly mysterious, but we’re not hard to find. To connect with a specific restaurant, please select a location from the options below. Choose Location Ballard Boise East Portland Meridian NW Portland Redmond Tacoma West Seattle North Portland Charlotte Greenville Charleston Gift Cards & Apparel Gift Cards from the Matador are the perfect way to give your friends and family an excuse to sample new tequilas or try a new entrée from the Matador. Order a Gift Card Here $25 Traditional - Heather Black $25 Classic - Black $25 View Cart We are proud to partner with St. Jude! You can support their mission every time you order our featured entrée on our menu. Seasonal Features St. Jude freely shares the discoveries it makes, which means doctors and scientists worldwide can use that knowledge to save thousands more children. When you visit the Site, we automatically collect certain information about your device, including information about your web browser, IP address, time zone, and some of the cookies that are installed on your device. Privacy Policy Ok. I Agree",
      "hash": "01fa9b803a0e",
      "downloadedAt": "2026-01-18T16:54:31.625Z",
      "trimmedAt": "2026-01-18T17:04:52.057Z",
      "sizeReduction": "94.0%"
    },
    {
      "url": "https://www.matadorrestaurants.com/menus/charleston/tequila",
      "text": "More Menus Tequila Main Menu Cocktails Happy Hour Dessert Wine Tequila Mezcaleria Tequila Seasonal Features MIX & MATCH Available Monday to Friday, 11am - 3pm. Soup, choice of salad, and choice of entrée for $16! Seasonal Features PAPAS CON RAJAS veg/gf Fried chipotle-seasoned potato wedges, roasted poblano, fire-roasted corn, Monterey Jack cheese, avocado crema, molcajete salsa $9.5 SEARED AHI TUNA gf Tamari ponzu, guacamole, shaved serrano, chile seasoning, sesame seeds, fried corn tostadas $15 GRILLED CHICKEN LETTUCE WRAPS gf Butter lettuce, orange-agave marinated chicken, slaw, cucumber, avocado, molcajete salsa, queso fresco $13.5/18 *CHICKEN CHIMICHANGAS Two crispy fried chimichangas, braised chicken, black bean queso, Monterey Jack & cheddar cheeses, shredded lettuce, pico de gallo, avocado crema Served with choice of house-made enchilada sauce and Mexican rice Add a third Chimichanga +$6 *For every order of this entree, we'll donate $1 to St. Jude Children’s Research Hospital $19.5 MIX & MATCH Available Monday to Friday, 11am - 3pm. Soup, choice of salad, and choice of entrée for $16! CHOOSE YOUR SALAD Romain Salad Cilantro-pepita dressing, toasted pepitas, pico de gallo, cotija, lime House Salad Baby spring mixed green, blistered tomato and roasted pepper relish, hibiscus-pickled onion, cucumber, tajin, choice of dressing CHOOSE YOUR ENTRÉE Proteins: Chicken, Carnitas, Beyond Picadillo Add guacamole and cilantro-lime sour cream $3 Taco Serrano slaw, tomatillo salsa, garlic crema, pico de gallo, cotija Burrito Mexican rice and beans, Jack & cheddar cheeses Served divorciadas style with verde and roja sauces Quesadilla Monterey Jack cheese, pico de gallo, garlic crema, toasted pepitas, cilantro SOUP Chicken Tortilla Roasted chicken, fire-roasted corn, avocado, tortilla strips, cotija, cilantro Snacks Starters Snacks Dip Flight Creamy three-cheese queso, fresh guacamole, and hearty black bean dip [gf/v] $16 Matador Guacamole Orange-habanero salsa Maya, tomatillo salsa, pico, queso fresco, cilantro [gf] $12 Black Bean Dip Black beans, habanero, garlic crema, tomatillo salsa, green onion [gf/v] $10.5 Queso Con Chorizo Melted three-cheese house blend, creamy habanero sauce, pico de gallo, cilantro, queso fresco [gf] $12 Crispy Brussels Sprouts Fried brussels sprouts, peppers & onions, lime, agave, cotija [gf/v] $12 Fried Tacos Crispy fried corn tortillas, shredded chicken, black bean queso, shredded lettuce, pico de gallo, serrano vinaigrette, salsa Maya, chimichurri mayo $11.5 Street Tacos White onion, cilantro, housemade salsa, radish, cotija, and lime on corn tortillas [gf]: Carnitas, House Chorizo, Beyond Picadillo, Ground Beef or Shredded Chicken 3 for $11 5 for $16.5 Boulevard Style [add guacamole and pico de gallo] $3.5 Starters Grilled Stuffed Jalapeños Goat Cheese, smoked bacon, ranch dressing [gf] $14.5 Quesabirria Three corn tortillas, Monterey Jack cheese, roasted poblanos, beef birria, onions, cilantro, birria jus [gf] $16 Haba Prawns Fiery roasted habanero sauce, roasted garlic & jalapeño polenta, hibiscus-pickled onion, cilantro $15 Crispy Coconut Shrimp Shredded coconut, chile-flour batter, pickled jalapeño and Fresno chiles, salsa verde, chipotle ranch $14.5 Grande Nachos Cheddar, Monterey Jack, black beans, pico de gallo, guacamole, cilantro-lime sour cream [gf] $13.5 Add Shredded Chicken, Carnitas, House Chorizo, Ground Beef, or Beyond Picadillo $3.5 Add Marinated Steak* $6 Matador Quesadilla Monterey Jack, pico de gallo, garlic crema, toasted pepitas, guacamole, cilantro-lime sour cream Cheese (plain - no crema, pepitas, pico de gallo) $11.5 Shredded Chicken, Carnitas, House Chorizo, or Ground Beef $13.5 Carne Asada*, Shrimp, or Beyond Picadillo $14.5 Ahi Tuna Tostadas* Agave ponzu sauce, avocado, chipotle mayo, green onion, finishing salt [gf] $15 Soups & Salads Add to any salad: Grilled Chicken $5, Marinated Steak* $7, Sautéed Shrimp $6, or Mahi Mahi Fillet $8 Sandwiches All Sandwiches and wraps are served with chipotle-garlic salt seasoned French fries Soups & Salads Add to any salad: Grilled Chicken $5, Marinated Steak* $7, Sautéed Shrimp $6, or Mahi Mahi Fillet $8 Tortilla Chicken Soup Roasted chicken, fire-roasted corn, avocado, tortilla strips, cotija, cilantro [gf] $10 bowl, $6 cup Romaine Salad Cilantro-pepita dressing, toasted pepitas, pico de gallo, cotija, lime [gf/veg] $9.5 Chop Salad Fire-roasted corn, red bell pepper, Mexican black beans, pico de gallo, romaine lettuce, green and red cabbages, fried tortilla strips, chipotle ranch Chile-Sauteed Shrimp or Marinated Chicken Breast $18.5 Taco Salad Black beans, Monterey Jack, cotija, shredded lettuce, guacamole, pico de gallo, cilantro-lime sour cream, serrano vinaigrette, garlic crema, jalapeños en escabeche Choose from: Carnitas, Shredded Chicken, House Chorizo, or Ground Beef $16 Grilled Chicken Breast, Shrimp, or Beyond Picadillo $17.5 Grilled Steak* $20 Sandwiches All Sandwiches and wraps are served with chipotle-garlic salt seasoned French fries Carne Asada Sandwich* Grilled marinated steak*, French fried onions, serrano slaw, roasted poblano, pico de gallo, chimichurri mayo $19.5 Wagyu Bacon Cheeseburger* Mixed greens, pico de gallo, bacon, French fried onions, Jack & cheddar cheeses, chipotle mayo $18 Agave Chicken Wrap Agave-marinated chicken breast, bacon, avocado, cilantro-pepita dressing, pico de gallo, shredded lettuce, serrano vinaigrette, cotija $17 Matador Bowl Mexican black beans & rice, cheese blend, serrano slaw, pico de gallo, guacamole, radish, tortilla strips Choice of: roja, verde, habanero, or poblano crema Braised Chicken, Carnitas, Chorizo, Ground Beef, or Southwest Veg {gf} $17 Grilled Chicken, or Beyond Picadillo $18.5 Gaucho Bowl Sautéed peppers & onions, Mexican black beans & rice, Jack & cheddar cheeses, shredded lettuce, pico de gallo, guacamole, cilantro-lime sour cream, French fried onions Grilled Chicken or Sautéed Shrimp $20.5 Grilled Marinated Steak $21.5 Specialty Tacos Two tacos on flour tortillas with Mexican black beans and rice Add a third taco $6 Tacos Two tacos on flour or corn tortillas with Mexican black beans and rice Add a third taco $4 Specialty Tacos Two tacos on flour tortillas with Mexican black beans and rice Add a third taco $6 Baja Fish Tacos Panko-crusted and fried Mahi Mahi, serrano slaw, guacamole, chipotle mayo, radish, cilantro, lime $21 Coconut Shrimp Tacos Crispy coconut-breaded shrimp, mango-pineapple salsa, pico, cilantro-lime sour cream, serrano slaw, on flour tortillas $20 Mango Steak Tacos Grilled carne asada*, mango-pineapple salsa, serrano slaw, guajillo-chile sauce, Tajin $22 Ribeye Tacos Grilled ribeye, French fried onions, chimicurri mayo, avocado, grilled red pepper, cotija $22.5 Tacos Two tacos on flour or corn tortillas with Mexican black beans and rice Add a third taco $4 Topped with shredded lettuce, guajillo chile sauce, pico de gallo, garlic crema: Marinated Carne Asada* $19.5 Shredded Chicken Thigh $17 Beyond Picadillo $18.5 --- Topped with tomatillo salsa, pico de gallo, garlic crema, cotija cheese: Braised Pork Carnitas $17 Chile Sautéed Shrimp $18.5 Grilled Chicken Breast $17.5 Enchiladas Two enchiladas with Monterey Jack, pico de gallo, guacamole, cilantro-lime sour cream, Mexican black beans & rice Add a third enchilada $4 Enchiladas Two enchiladas with Monterey Jack, pico de gallo, guacamole, cilantro-lime sour cream, Mexican black beans & rice Add a third enchilada $4 Divorciadas Mild sweet and tangy salsa verde, medium smoky salsa roja, slow braised chicken thigh, corn tortillas [gf] Habanero Fiery hot habanero salsa, shredded chicken, flour tortillas Shredded Beef Medium and smoky salsa roja, shredded braised beef birria, flour tortillas Verde Carnitas Medium sweet and tangy salsa verde, braised carnitas, corn tortillas [gf] Burritos Flour tortilla filled with Mexican black beans & rice, Jack and cheddar cheeses, and sides of serrano slaw, pico de gallo, guacamole, cilantro-lime sour cream, garlic crema Cali style – add French fries, avocado, and hot sauce $3 Flour tortilla filled with Mexican black beans & rice, Jack and cheddar cheeses, and sides of serrano slaw, pico de gallo, guacamole, cilantro-lime sour cream, garlic crema Cali style – add French fries, avocado, and hot sauce $3 Poblano Carnitas Braised carnitas, rich and mild crema salsa Habanero Steak Grilled marinated steak*, picante habanero sauce Verde Chicken Braised chicken, chile verde sauce Beyond Burrito Plant-based protein, medium and smoky salsa roja, caramelized onions, roasted poblanos [v] Entrées Braised Carnitas Pork shoulder, guacamole, cilantro-lime sour cream, pico de gallo, pickled onions, salsa Maya, Mexican black beans & rice Choice of flour or corn tortillas $22.5 Skillet Seared Fajitas Sautéed peppers & onions, Mexican black beans, Jack & cheddar cheeses, romaine, pico de gallo, guacamole, cilantro-lime sour cream, flour or corn tortillas Choose from: Marinated Carne Asada* $31 Marinated Chicken Breast or Shrimp $27 Chile-Seasoned Ribeye* $32 Shrimp & Chorizo Paella Shrimp, house chorizo, sautéed fajita peppers, achiote-chile rice, saffron [gf] $23.5 Grilled Carne Asada* Street corn & leeks, grilled peppers, cotija, cilantro, Mexican black beans & rice [gf] Marinated Carne Asada* $30.5 Chile-Seasoned Ribeye* $31.5 Surf & Turf: Add habanero, Chile-garlic or poblano shrimp $5 additional Mango-Pineapple Mahi Mahi Chunky mango & pineapple salsa, fruity salsa verde, serrano slaw, chile-achiote rice, cilantro, lime $24 Roasted Chile Rellenos Poblanos stuffed with Mexican rice, Monterey Jack cheese, and tomatillo salsa, served with Mexican black beans, poblano crema, garlic crema, pico de gallo, and tortilla strips Shredded Chicken, Carnitas, or Beyond picadillo [gf] $23.5 *These items are served raw or undercooked, or contain (or may contain) raw or undercooked ingredients. Thoroughly cooking food or animal origin, including but no limited to beef, eggs, fish, lamb, milk, poultry or shellstock reduces the risk of food borne illness. Young children, the elderly and individuals with certain health conditions may be at a higher risk if these foods are consumed raw or undercooked. Kids Menu Available until 9pm, ages 12 and under. Includes entree and beverage for $9, add ice cream for $3 Entrées Served with choice of fries or rice Beverages Entrées Served with choice of fries or rice Cheese Quesadilla Serviced with sour cream and guacamole on flour tortilla Chicken Strips Served with ranch dressing Kid's Taco Spicy seasoned shredded chicken or ground beef, served with shredded lettuce, cheese, and sour cream Beverages Coke Sprite Lemonade Pineapple Juice Milk Seasonal Features Starting 2026 with a dry January? The Matador has got you covered. We’ve created a special menu featuring nothing but premium non-alcoholic spirits to kick off the new year. Starting 2026 with a dry January? The Matador has got you covered. We’ve created a special menu featuring nothing but premium non-alcoholic spirits to kick off the new year. SCRATCH MARGARITA Dhōs Blanco N/A tequila, Dhōs Orange N/A triple sec, fresh-muddled lime and orange, agave $12.5 MANGO-JALAPEÑO LIMEADE Dhōs Blanco N/A tequila, lime, mango, jalapeño, pineapple, Sprite $12.5 CRANBERRY PONCHE Dhōs Blanco N/A tequila, Dhōs Orange N/A triple sec, cranberry, pomegranate, hibiscus, tamarind, lemon, ginger, cinnamon, star anise, allspice, Sprite $13 Matador Margaritas *Contains Alcoholic* House* Lunazul Blanco, triple sec, lime, lemon, agave $12.5 Cadillac Lunazul Blanco, triple sec, lemon, lime, Grand Marnier $13.5 Smokey Ilegal Joven mezcal, triple sec, charred pineapple, lime, Tajin $14 Bartender's Olmeca Altos Reposado, triple sec, lime, lemon, agave, cranberry, Grand Marnier $14 Blood Orange Lalo Blanco, Solerno Blood Orange Liqueur, citrus, agave $15.5 Pineapple-Habanero Choose between Koch Elemental mezcal or Milagro Silver Triple sec, pineapple, lime, habanero, chile salt, Tajin $13.5 Dragonfruit* Olmeca Altos Reposado, triple sec, dragonfruit, lime, orange, spiced citrus sugar $14 Strawberry Mangonada* Corralejo Silver, triple sec, lime, mango, strawberry, lemon, chamoy, Tajin $14.5 Ginger-Orange Choose Código Blanco + Cointreau or Ilegal Joven mezcal + Solerno Blood Orange liqueur Ginger, orange, lime, spiced citrus sugar $15.5 Top Shelf Patrón Silver, Cointreau, lime, lemon, agave $16 Cucumber-Jalapeño Exotico Blanco, triple sec, cucumber, jalapeño, lemon, lime, agave, Tajin $13.5 Passionfruit Choose between Koch Elemental mezcal or Milagro Silver Passoã Passionfruit liqueur, lemon, lime, agave, chile salt $13.5 Gato Royalé Don Gato Blanco, Chambord, Spanish Cava, lime, lemon, agave, cranberry, spiced citrus sugar $16 Sangrias Spiced Red Burgundy, brandy, pisco, mango, ginger, orange, lemon, cinnamon $12.5 Spanish Rosé Spanish Rosé, Chablis, pineapple, orange, pisco, lime, cucumber, spice $12.5 Sparkling Strawberry Chablis, Spanish Cava, pisco, strawberry, pineapple, orange, hibiscus, spice $12.5 All tequilas and mezcals used in our cocktails are certified, 100% agave spirits. *Can be made as a non-alcoholic margarita using Dhōs N/A spirits. Every day 4pm to 6pm and 10pm to close $7 $8 $7 Romaine Salad Crispy Brussels Sprouts Black Bean Dip Fried Tacos (2) Chicken Tortilla Soup Quesadilla Cheese (no pico), Chicken, Carnitas, Chorizo, Ground Beef, or Beyond Picadillo, Steak* or Shrimp +2 $8 Grande Nachos Add chicken, Beyond Picadillo, House Chorizo, Carnitas, or Ground Beef $3.5 Marinated Steak* $5 Matador Guacamole Orange-habanero salsa Maya, tomatillo salsa, pico, queso fresco, cilantro Haba Prawns Steak* or Shrimp Tacos (2) Baja Fish Tacos (2) Queso Con Chorizo [gf] Melted three-cheese house blend, creamy habanero sauce, pico de gallo, cilantro, queso fresco Street Tacos Choice of: Chorizo, Beyond Picadillo, Ground Beef, Shredded Chicken, or Carnitas Three for $8, Five for $11 Allergy or dietary preference? Please ask your server! Allergy or dietary preference? Please ask your server! *Consuming raw or under-cooked food may increase your risk of food borne illness. Dessert Dessert Salted Caramel Brownie Bittersweet chocolate, salted dulce de leche, strawberry compote, vanilla ice cream $8 Fried Ice Cream Toasted coconut, whipped cream, reposado dulce de leche, cinnamon [gf] $8 Agave spirits, especially aged tequilas and mezcals, go great with dessert! Ask your server or bartender for a pairing suggestion. Bubbles Segura Viudas Brut Rosé Cava Pendés, Catalunya, Spain dry with well-balanced acidity; bright pink with fresh. intense strawberry, cherry, and a soft minerality $16 Freixenet Blanc De Blancs Brut Cava Penedès, Catalunya, Spain bright, creamy texture; crisp apple & light vanilla notes with velvety smooth bubbles and a clean, dry ﬁnish $13 | 48 Rosé & White Casillero Del Diablo Rosé Chile vibrantly fresh and crisp; sharp raspberry, strawberry, and floral aromas, red berry and stonefruit with firm acids $11 | 40 Trivento White Malbec Mendoza, Argentina crystal-clear and very light-bodied; apple and cherry on the nose with flavors of plum, red berry, tropical fruit, and subtle spice and earth on the clean, acidic finish $11 | 40 Ramón Bilbao Verdejo Rueda, Spain crisp, fresh, and aromatic; bright acid with ripe fruit, citrus, floral, and grass notes $12 | 44 Natura Sauvignon Blanc Central Valley, Chile light-bodied, fresh and bright, with vibrant and complex grapefruit, lime, herbs, and a well-balanced acidity $11 | 40 Josh Craftsman's Chardonnay North Coast, California gentle oak balanced with fresh, juicy tropical fruits, honey, ripe peach, and citrus flavors $12 | 44 Red Alamos Malbec Mendoza, Argentina deep concentrated plum, dark cherry and blackberry flavors; finishing with hints of brown spice and vanilla $11 | 40 Ontañón Natura Insolitós Tempranillo Rioja, Spain deep ruby color with a powerful bouquet of blackberry, blueberry, and sweet fig and full-bodied flavors of jammy black fruit, spice, smoke, and coffee with a strong, tannic, lingering finish $12 | 44 Josh Craftsman's Cabernet Sauvignon California full bodied with lush, dark fruit, cinnamon spice, light vanilla and toasty oak; long, soft tannic finish $13 | 48 Clos De Los Siete Blend, \"C7\" By Michel Rolland Mendoza, Argentina lush, fruit-forward plum, blackberry, and cherry with dark chocolate, ash, herbs, and oak; velvety tannins on a long, minerally finish $15 | 56 Browne Heritage Pinot Noir Williamette Valley, Oregon juicy, ripe fruit and berry notes with concentrated floral accents of violet and jasmine, citrus spice, rich loam and lingering, silky tannins $14 | 52 Top Shelf Tuesday A night to experiment Join us every Tuesday for 1/2 off all tequilas $16 and up, plus margarita specials featuring a rotating tequila each month! Join us every Tuesday for 1/2 off all tequilas $16 and up, plus margarita specials featuring a rotating tequila each month! Código Blanco Tequila of the Month, May 2024 Blanco (also called Silver, White, or Plata tequilas) Bottled either right from the still with no aging or allowed to brieﬂy mellow in stainless steel tanks for up to 60 days, blanco tequilas are fresh, bright, and agave forward. This expression is ideal when looking to experience the intense, pure aromas and ﬂavors of a tequila. Fruit & Citrus Crisp, hints of orange peel, grapefruit, pineapple, lemon Pepper & Spice Bold, hints of peppercorn, cinnamon, clove, long finish Earthy & Floral Clean, hints of herbs, clay, mint, fresh flowers, wood, licorice Fruit & Citrus Crisp, hints of orange peel, grapefruit, pineapple, lemon 1800 $10 Camarena $9 Chamucos $12 Chinaco $12 Cincoro $18 Clase Azul Plata $30 Don Julio $14 El Tequileño $9 El Tesoro $14 Fuenteseca Cosecha $28 Milagro $10 Milagro Select Barrel $14 Olmeca Altos Plata $9 Patrón $14 Patrón Gran Platinum $36 Siembra Azul $15 Teremana $11 Pepper & Spice Bold, hints of peppercorn, cinnamon, clove, long finish Casa Dragones $20 Casamigos $15 Centinela $11 Código $13 Don Fulano Fuerte $15 Don Ramon $11 El Mayor $10 Espolòn $10 Exotico $9 G4 $14 Gran Centenario $10 Grand Mayan $18 José Cuervo Reserva Platino $15 Lunazul $8 Siete Leguas $14 Terralta 110 $14 Earthy & Floral Clean, hints of herbs, clay, mint, fresh flowers, wood, licorice ArteNOM 1579 $15 Astral $14 Avión $12 Casa Noble $12 Cazadores $10 Cimmaron $9 Código \"Rosa\" $15 Corralejo $10 Don Fulano $14 Fortaleza $14 Fortaleza Still Strength $15 Herradura $14 Partida $14 Sauza Hornitos Plata $9 Siembra Valles $15 Tequila Ocho $14 Terralta $12 *House favorites Reposado (Rested tequilas) Aged between two months to one year in oak barrels, reposados show gentle amber colors and subtle, warm wood notes while still displaying some of the lighter characteristics of un-aged blancos. Honey & Caramel Hints of vanilla, chocolate, butter, toffee, cinnamon, toasted, sweet Smoke & Oak Hints of wood, agave, leather, heat, pepper Herbal & Floral Clean, hints of fresh cut grass, earthy, licorice, juniper, agave Honey & Caramel Hints of vanilla, chocolate, butter, toffee, cinnamon, toasted, sweet 1800 $10 Camarena $9 Campo Bravo $9 Casa Noble $12 Casamigos $16 Chinaco $14 Clase Azul $33 Código $15 Corralejo $10 Don Julio $14 Don Ramon $11 El Mayor $10 El Tequileño $10 Fortaleza $15 Hussongs $12 Milagro $10 Milagro Select Barrel $15 Smoke & Oak Hints of wood, agave, leather, heat, pepper Casa Dragones $32 Cazadores $10 Chamucos $14 Cincoro $22 Don Fulano $15 Grand Mayan $20 Herradura $14 Jose Cuervo Reserva de la Familia $20 Lobos $14 Olmeca Altos $9 Siete Leguas $14 Herbal & Floral Clean, hints of fresh cut grass, earthy, licorice, juniper, agave Arte NOM 1414 $15 Avión $14 Centinela $12 Cimmaron $9 El Tesoro $15 Espolòn $10 G4 $14 Gran Centenario $11 La Gritona $12 Partida $14 Patrón $14 Sauza Hornitos $9 Tequila Ocho $14 Teremana $11 *House favorites Añejo (Aged tequilas) Aged for one to three years in smaller oak barrels, which produces darker colors and smoother, complex flavors with strong wood influences. An excellent alternative to traditional whiskeys or cognacs. Vanilla & Toffee Hints of caramel, almond, warm, buttery, toasted Cinnamon & Spice Hints of peppercorn, orange peels, spice, chile pepper, heat Nutty & Smokey Hints of oak, wood, brandy, earthy, fruit, cocoa, suede Vanilla & Toffee Hints of caramel, almond, warm, buttery, toasted Avión $14 Casa Noble $14 Casamigos $17 Centinela $14 Chinaco $18 Cincoro $30 Don Julio $15 Don Julio 1942 $34 El Mayor $11 Herradura $15 Herradura Legend $30 Milagro $12 Milagro Select Barrel $22 Partida $15 Sauza Hornitos $10 Sauza Hornitos Black $11 Teremana $13 Cinnamon & Spice Hints of peppercorn, orange peels, spice, chile pepper, heat 1800 $12 Casa Dragones $35 Cazadores $11 Clase Azul $95 Código $28 Corralejo $12 Don Fulano $20 Fortaleza $20 Gran Centenatio $11 Patrón $16 Nutty & Smokey Hints of oak, wood, brandy, earthy, fruit, cocoa, suede Arte NOM 1146 $20 Camarena $10 Chamucos $14 Don Ramon $12 El Tesoro $20 Espolon $12 Grand Mayan $24 Siete Leguas $15 Tequila Ocho $18 *House favorites Extra Añejo Aged for at least three years in oak barrels no larger than 600 liters, extra añejos are incredibly rich and concentrated with heavy, almost syrupy flavors and intense wood notes. 1800 Milenio $45 Avión Reserva 44 $30 Cazadores $16 Centinela Tres Años $29 Cincoro $280 Clase Azul Ultra $300 Código Origen $60 Corralejo $30 Don Fulano Imperial $37 El Mayor $20 G4 $30 Gran Centenario Leyenda $30 Grand Mayan Ultra $40 Herradura Selección Suprema $62 Jose Cuervo Reserva de la Familia $34 Partida Elegante $75 Patrón $20 Patrón Gran Burdeos $85 Patrón Piedra $67 Rey Sol $55 Tears of Llorona $55 Tequila Ocho $38 Mezcal Made from a variety of different agaves and usually produced by fire-roasting piñas in underground pits, giving mezcals the smokiness they are known for. Mezcals are an older and more traditional form of agave spirit and tend to have stronger, more intense flavor profiles than tequilas. Approachable For the beginners. Espadín and other milder agaves produce mezcals with gentle charred agave sweetness, moderate citrus, tropical fruit, burnt hardwoods, and earth. Exotic For the curious. Wild-harvested agaves and single village bottlings have very unique flavor profiles and strongly express their terroir, producing varied notes of vegetation, earth, mineral, fruits, citrus, spice and herbs. Artisanal For the bold. Rare agaves and traditional production techniques produce incredibly complex mezcals with a wide array of pungent aromas and intense flavors. Approachable For the beginners. Espadín and other milder agaves produce mezcals with gentle charred agave sweetness, moderate citrus, tropical fruit, burnt hardwoods, and earth. 400 Conejos Joven $9 Casamigos Joven $16 Del Maguey Chichicapa $16 Del Maguey Vida $11 Fidencio Clássico $12 Ilegal Joven $14 Ilegal Reposado $15 Meteoro Espadín $12 Montelobos Espadín $12 Sombra $12 Exotic For the curious. Wild-harvested agaves and single village bottlings have very unique flavor profiles and strongly express their terroir, producing varied notes of vegetation, earth, mineral, fruits, citrus, spice and herbs. 400 Conejos Espadín, Cuishe $14 400 Conejos Espadín, Tobala $14 Banhez Espadín y Barril $11 Bozal Cuixe $15 Bozal Tobaische $15 Del Maguey Minero $16 Del Maguey Vida de Muertos $14 Koch Espadín San Baltazar Guélavila $15 Nuestra Soledad San Luis del Rio $14 Yola Espadín, Madrecuixe $15 Artisanal For the bold. Rare agaves and traditional production techniques produce incredibly complex mezcals with a wide array of pungent aromas and intense flavors. Bozal Coyote Ancestral Reserva $24 Bozal Pechuga Sacrificio $20 Código Ancestral Paplomé $33 Del Maguey Tobala $29 Real Minero Pechuga $37 Other Juice There are many other types of spirits besides tequila and mezcal that can be made from a variety of agaves and related species. These spirits can exhibit a wide array of exotic aromas and flavors. Other Juice There are many other types of spirits besides tequila and mezcal that can be made from a variety of agaves and related species. These spirits can exhibit a wide array of exotic aromas and flavors. Balam Raicilla Madurado Flor de Desierto Sotol Sierra La Higuera Wheeleri Sotol Pizcadores Bancanora Joven & Cristalino 100% agave Jovens are blancos blended with small amounts of reposados or añejos so that the intense agave notes found in a blanco are balanced by the deeper notes of an aged tequila. Cristalinos are aged tequilas that have been filtered to remove colors and heavier wood notes that come from barrel-aging, resulting in a tequila with the complexity of an añejo but with the bright notes and color of a blanco. Joven & Cristalino 100% agave Jovens are blancos blended with small amounts of reposados or añejos so that the intense agave notes found in a blanco are balanced by the deeper notes of an aged tequila. Cristalinos are aged tequilas that have been filtered to remove colors and heavier wood notes that come from barrel-aging, resulting in a tequila with the complexity of an añejo but with the bright notes and color of a blanco. 1800 $15 Avión Reserva $30 Casa Dragones Joven $68 Cazadores $12 Clase Azul Joven Gold $65 Don Julio 70th Anniversary $18 Espolón $18 Gran Centenario $20 Herradura Ultra $15 Lobos Joven $14 Maestro Dobel 50 $30 Partida $15 House Flights Try one of our curated \"expression\" flights as shown below or ask your server about a blanco, reposado, and añejo \"familia.\" Mezcal Ilegal Joven / Banhez Espadín y Barril / Del Maguey Vida de Muertos Classic Espadín notes of clean agave, citrus, & light smoke / Floral, fruity blend of Espadín & Barril agaves with balanced spice and citrus / Special high-proof, single-village expression with deep vegetal and citrus tones. $18 Blanco Blanco tequilas are the perfect way to taste and experience the terrior of a tequila - the effects that different growing regions have on agave fruit and the spirits made from them. Blanco I - El Valle Código / Partida / Jose Cuervo Reserva de la Familia Tequilas from \"the Valley\" tend to be a bit bolder and assertive, with earthy, vegetal, spicy, and herbal flavors $20 Blanco II - Los Altos Siete Leguas / El Tesoro / Patrón Tequilas from \"the Highlands\" tend to be somewhat sweeter and softer, with more tropical fruit, ﬂoral, and mineral notes $20 Reposado Milagro Select Barrel / Don Julio / Casamigos Single barrel expression with light oak, spice, & caramel / Mellow oak, vanilla, fruit, & smoke / Full-bodied agave expression, deep caramel & wood sugars $21 Añejo El Mayor / Gran Centenario / Herradura Soft, sweet, & buttery roasted agave / Honey-spiced rich, toasted oak / Deep roasted fruit, cocoa, wood, & vanilla $18 Extra Añejo Corralejo / Avión 44 / Jose Cuervo Reserva de la Familia Lush, intense fruit, caramel, & oak / Custom \"petite\" cask aging; rich & silky / Complex, rich, & nuanced private family reserve $45 El Presidente Centenario Leyenda / Herradura Selección Suprema / Partida Elegante Aged in French Limousin Oak; warm & velvety balance of vanilla, agave, & dark spice / Rich & ﬂoral with complex fruit & agave. Long ﬁnish of creamy, toasted oak / Deep wood, caramel, pepper, cocoa, & honey; elegant & reﬁned $80 Cristalino Herradura Ultra / Don Julio 70th Anniversary / Avión Reserva Dark vanilla, birthday cake, & dried fruit / Light oak, baking spice, & light vanilla-honey / Caramel, cinnamon, hints of mineral, citrus, & toasted nuts $30 Cocktails Matador Favorites Mezcalerita Koch Elemental Espadín, triple sec, orange, lemon, lime, agave, orange bitters, Tajin $13 Oaxacan Old Fashioned Ilegal Joven, aromatic bitters, agave, orange peel $15 Ancho Paloma Rosaluna Joven, Ancho Reyes Chile liqueur, lime, grapefruit, Squirt, sal de gusano $13.5 Pineapple-Habanero Margarita Koch Elemental Espadín, triple sec, pineapple, lime, habanero, chile salt, Tajin $13.5 Mezcal Negra Rosaluna Joven, Averna, orange bitters, cherry $15 Ginger-Orange Margarita Ilegal Joven, Solerno Blood Orange liqueur, ginger, orange, lime, spiced citrus sugar $15.5 Pineapple Mule Koch Elemental Espadín, grilled pineapple, ginger-orange syrup, lime, soda, served in a copper mug $13 Smokey Margarita Ilegal Joven, triple sec, charred pineapple, lime, Tajin $14 Chile Mango Margarita Rosaluna Joven, Ancho Reyes Chile liqueur, mango, agave, lime, spiced citrus sugar $15 Passionfruit Margaritas Koch Elemental Espadín, Passoã Passionfruit liqueur, lemon, lime, agave, chile salt $13.5 Bee Sting Ilegal Joven, honey, lemon, ancho chile $14 Mezcal Michelada Dos XX lager, Koch Elemental Espadín, spicy tomato, tamarind, lime, celery bitters, Tajin $12 Matador Favorites House* Lunazul Blanco, triple sec, lime, lemon, agave $12.5 Cadillac Lunazul Blanco, triple sec, lime, lemon, agave, Grand Marnier $13.5 Bartender's Olmeca Altos Reposado, triple sec, lime, lemon, agave, cranberry, Grand Marnier $14 Top Shelf Patrón Silver, Cointreau, lime, lemon, agave $16 Blood Orange Lalo Blanco, Solerno Blood Orange liqueur, citrus, agave $15.5 Cucumber-Jalapeńo Exotico Blanco, triple sec, cucumber, jalapeño, lemon, lime, agave, Tajin $13.5 FOOD Menu Menu Chips & Salsa (gf/veg) Freshly fried corn tortillas, house-roasted tomato salsa $4 Matador Guacamole (gf/veg) Orange-habanero salsa Maya, tomatillo salsa, pico, queso fresco, cilantro, fried corn tortillas $11 Dip Flight (gf/veg) Creamy three-cheese queso, fresh guacamole, and hearty black bean dip $15 Bacon Cheeseburger* Charbroiled steak burger, arugula, pico de gallo, bacon, French fried onions, Jack & cheddar cheeses, chipotle mayo, chipotle-garlic $17 Sauteed Prawns (gf) Roasted garlic & jalapeño polenta, hibiscus- pickled onion, cilantro Choice of sauce: Garlic-chile butter, poblano crema, fiery habanero $14 Baja Fish Tacos Panko crusted and fried mahi mahi, serrano slaw, guacamole, chipotle mayo, radish, cilantro, lime $11 Taco Flight Three large tacos on flour tortillas Shredded chicken, carnitas, and beef picadillo tacos topped with serrano slaw, tomatillo salsa, pico de gallo, garlic crema, cotija cheese $17 Flights Beginner I Ilegal Joven / Banhez Artesanal / Del Maguey Vida Puebla Classic Espadín notes of clean agave, citrus, & light smoke / Floral, fruity blend of Espadín & Barril agaves with balanced spice and citrus / Single-village expression from the base of the volcano Popocatépetl; green herb & vegetal notes with savory roasted agave $16 Beginner II Nuestra Soledad San Luis del Rio / Koch Espadín San Baltazar Guélavila / Don Amado Rustico High-mountain, single-village Espadín; balanced agave, mineral, citrus / From the Tlacolula district in the Valles Centrales region; subtle mineral, fruit, herbs, & brine / Clay pot-distilled Espadín from Santa Catarina Minas; deep, warm, floral $20 Advance I Real Minero Largo / Mezcales de Leyenda Guerrero / Tileño Tepextate Rare, wild agave from the Karwinskii family; sharp fruit, chocolate, dry ash & smoke / Cupreata agave wild-harvested from high-altitude oak forests; complex tropical & citrus notes with subtle spice / Seldom-distilled 25-year-old wild agave; deep fruit, intense mineral, spice & citrus $36 Advanced II Bozal Chino Verde Ancestral Reserva / Mezcales de Leyenda Durrango / Del Maguey Pechuga Rare agave foraged from the Sierra Madre del Sur mountains; pronounced herb and smoke, charred wood & desert soil / High-altitude desert maguey Cenizo; buttery, intense, exotic fruit, earth & clay / Espadín clay pot-distilled with chicken breast & wild-mountain apples, bananas, pineapples, & plums $41 Aficionada Chacolo Ixtero Amarillo / C ódigo Ancestral Papalomé / Coyote Sotol Vibora Maguey Ixtero Amarillo milled by hand with axes, naturally fermented in wooden tinas, and distilled in a Filipino still made of copper and a hollowed out tree trunk; creamy but dry, aggresive herbs, spice, salinity, & tropical fruit / Tobala agaves harvested from sub-tropical forests in mountain canyons & fermented in leather tanks; rustic & raw, intensely floral, aromatic, vegetal, & sweet / Pechuga-style Sotol distilled with rattlesnake meat & rattlesnake venom before a 2-month aging; savory & full-bodied with powerful mineral, herb, & salinity $41 Mezcal Made from a variety of different agaves and usually produced by fire-roasting piñas in underground pits, giving mezcals the smokiness they are known for. Mezcals are an older and more traditional form of agave spirit and tend to have stronger, more intense flavor profiles than tequilas. Approachable For the beginners. Espadín and other milder agaves produce mezcals with gentle charred agave sweetness, moderate citrus, tropical fruit, burnt hardwoods, and earth. Advanced For the curious. Wild-harvested agaves and single village bottlings have very unique flavor profiles and strongly express their terroir, producing varied notes of vegetation, earth, mineral, fruits, citrus, spice, and herbs. Exotic For the bold. Rare agaves and ancestral production techniques produce incredibly complex mezcals with a wide array of pungent aromas and intense flavors. Approachable For the beginners. Espadín and other milder agaves produce mezcals with gentle charred agave sweetness, moderate citrus, tropical fruit, burnt hardwoods, and earth. 400 Conejos Joven $10 Banhez Espadín y Barril $10 Casamigos Joven $16 Del Maguey Chichicapa $18 Del Maguey Vida $12 Del Maguey Vida Puebla $11 Fidencio Clásico $13 Ilegal Joven $13 Ilegal Reposado $15 Montelobos Espadín $12 Siete Misterios Doba-Yej $11 Sombra $12 Tileño Espadín $16 Union $11 Advanced For the curious. Wild-harvested agaves and single village bottlings have very unique flavor profiles and strongly express their terroir, producing varied notes of vegetation, earth, mineral, fruits, citrus, spice, and herbs. 400 Conejos Espadín y Cuishe $14 400 Conejos Espadín y Tobala $14 Bozal Cuixe $15 Bozal Tepeztate $16 Bozal Tobasiche $16 Del Maguey Minero $16 Del Maguey Santo Domingo Albarradas $16 Del Maguey Vida de Muertos $14 Derrumbes San Luis Potosi $15 Don Amado Rustico $15 Ilegal Añejo $25 Koch Espadín San Baltazar Guélavila $16 Los Nahuales Joven Mezcales De Leyenda Durango $20 Mezcales De Leyenda Guerrero $20 Mezcales De Leyenda Oaxaca $18 Nuestra Soledad Lachigui $14 Nuestra Soledad San Baltazar $14 Nuestra Soledad San Luis del Rio $14 Real Minero Barril $32 Real Minero Espadín $28 Real Minero Largo $32 Siete Misterios Espadín y Tepeztate $22 Siete Misterios Espadín y Tobala $24 Yola Espadín, Madrecuixe $15 Exotic For the bold. Rare agaves and ancestral production techniques produce incredibly complex mezcals with a wide array of pungent aromas and intense flavors. Banhez Pechuga $22 Banhez Tepeztate $22 Banhez Tobala $24 Bozal Borrego Sacrificio $26 Bozal Chino Verde Ancestral Reserva $26 Bozal Coyote Ancestral Reserva $26 Bozal Pechuga Sacrificio $24 Código Ancestral Papalomé $35 Del Maguey Pechuga $40 Del Maguey Tobala $29 Fidencio Pechuga $20 Derrumbes San Luis Potosi $12 Lost Explorer Tobala $29 Montelobos Pechuga $28 Montelobos Tobala $24 Real Minero Pechuga $38 Rey Campero Jabali $26 Scorpion 5 year $34 Siete Misterios Coyote $32 Siete Misterios Pechuga $55 Tileño Tepextate $25 Tileño Tobala $20 *House favorites OTHER JUICE There are many other types of spirits besides tequila and mezcal that can be made from a variety of agaves and related species. These spirits can exhibit a wide array of exotic aromas and flavors. OTHER JUICE There are many other types of spirits besides tequila and mezcal that can be made from a variety of agaves and related species. These spirits can exhibit a wide array of exotic aromas and flavors. Balam Raicilla Madurado $16 Chacolo Ixtero Amarillo $29 Coyote Sotol Vibora $20 Flor de Desierto Sotol Cascabel $20 Flor de Desierto Sotol Sierra $15 La Higuera Wheeleri Sotol $12 Pizcadores Bancanora $15 Pizcadores Raicilla $15 Rancho Tepúa Bacanora $16 Siempre Sotol $12 When you visit the Site, we automatically collect certain information about your device, including information about your web browser, IP address, time zone, and some of the cookies that are installed on your device. Privacy Policy Ok. I Agree",
      "hash": "464682ca986e",
      "downloadedAt": "2026-01-18T16:54:34.204Z",
      "trimmedAt": "2026-01-18T17:04:52.179Z",
      "sizeReduction": "93.0%"
    },
    {
      "url": "https://www.matadorrestaurants.com/become-a-matador?location=Charleston%20SC",
      "text": "Become A Matador We are always looking for amazing people to join our team! If you are passionate about people and want to be a part of our family, feel free to fill in the information below or call any one of our restaurants and ask about their next open interview! We hope to see you soon! First Name Last Name Email Phone Address What position are you applying for? Location to which you are applying Availability (part-time, full-time, seasonal) When can you start? What is your current employment status? Why would you like to work for the Matador? Your resume When you visit the Site, we automatically collect certain information about your device, including information about your web browser, IP address, time zone, and some of the cookies that are installed on your device. Privacy Policy Ok. I Agree",
      "hash": "5c01a55ab857",
      "downloadedAt": "2026-01-18T16:54:39.184Z",
      "trimmedAt": "2026-01-18T17:04:52.183Z",
      "sizeReduction": "97.5%"
    },
    {
      "url": "https://www.matadorrestaurants.com/menus/charleston/dessert",
      "text": "More Menus Dessert Main Menu Cocktails Happy Hour Dessert Wine Tequila Mezcaleria Dessert Seasonal Features MIX & MATCH Available Monday to Friday, 11am - 3pm. Soup, choice of salad, and choice of entrée for $16! Seasonal Features PAPAS CON RAJAS veg/gf Fried chipotle-seasoned potato wedges, roasted poblano, fire-roasted corn, Monterey Jack cheese, avocado crema, molcajete salsa $9.5 SEARED AHI TUNA gf Tamari ponzu, guacamole, shaved serrano, chile seasoning, sesame seeds, fried corn tostadas $15 GRILLED CHICKEN LETTUCE WRAPS gf Butter lettuce, orange-agave marinated chicken, slaw, cucumber, avocado, molcajete salsa, queso fresco $13.5/18 *CHICKEN CHIMICHANGAS Two crispy fried chimichangas, braised chicken, black bean queso, Monterey Jack & cheddar cheeses, shredded lettuce, pico de gallo, avocado crema Served with choice of house-made enchilada sauce and Mexican rice Add a third Chimichanga +$6 *For every order of this entree, we'll donate $1 to St. Jude Children’s Research Hospital $19.5 MIX & MATCH Available Monday to Friday, 11am - 3pm. Soup, choice of salad, and choice of entrée for $16! CHOOSE YOUR SALAD Romain Salad Cilantro-pepita dressing, toasted pepitas, pico de gallo, cotija, lime House Salad Baby spring mixed green, blistered tomato and roasted pepper relish, hibiscus-pickled onion, cucumber, tajin, choice of dressing CHOOSE YOUR ENTRÉE Proteins: Chicken, Carnitas, Beyond Picadillo Add guacamole and cilantro-lime sour cream $3 Taco Serrano slaw, tomatillo salsa, garlic crema, pico de gallo, cotija Burrito Mexican rice and beans, Jack & cheddar cheeses Served divorciadas style with verde and roja sauces Quesadilla Monterey Jack cheese, pico de gallo, garlic crema, toasted pepitas, cilantro SOUP Chicken Tortilla Roasted chicken, fire-roasted corn, avocado, tortilla strips, cotija, cilantro Snacks Starters Snacks Dip Flight Creamy three-cheese queso, fresh guacamole, and hearty black bean dip [gf/v] $16 Matador Guacamole Orange-habanero salsa Maya, tomatillo salsa, pico, queso fresco, cilantro [gf] $12 Black Bean Dip Black beans, habanero, garlic crema, tomatillo salsa, green onion [gf/v] $10.5 Queso Con Chorizo Melted three-cheese house blend, creamy habanero sauce, pico de gallo, cilantro, queso fresco [gf] $12 Crispy Brussels Sprouts Fried brussels sprouts, peppers & onions, lime, agave, cotija [gf/v] $12 Fried Tacos Crispy fried corn tortillas, shredded chicken, black bean queso, shredded lettuce, pico de gallo, serrano vinaigrette, salsa Maya, chimichurri mayo $11.5 Street Tacos White onion, cilantro, housemade salsa, radish, cotija, and lime on corn tortillas [gf]: Carnitas, House Chorizo, Beyond Picadillo, Ground Beef or Shredded Chicken 3 for $11 5 for $16.5 Boulevard Style [add guacamole and pico de gallo] $3.5 Starters Grilled Stuffed Jalapeños Goat Cheese, smoked bacon, ranch dressing [gf] $14.5 Quesabirria Three corn tortillas, Monterey Jack cheese, roasted poblanos, beef birria, onions, cilantro, birria jus [gf] $16 Haba Prawns Fiery roasted habanero sauce, roasted garlic & jalapeño polenta, hibiscus-pickled onion, cilantro $15 Crispy Coconut Shrimp Shredded coconut, chile-flour batter, pickled jalapeño and Fresno chiles, salsa verde, chipotle ranch $14.5 Grande Nachos Cheddar, Monterey Jack, black beans, pico de gallo, guacamole, cilantro-lime sour cream [gf] $13.5 Add Shredded Chicken, Carnitas, House Chorizo, Ground Beef, or Beyond Picadillo $3.5 Add Marinated Steak* $6 Matador Quesadilla Monterey Jack, pico de gallo, garlic crema, toasted pepitas, guacamole, cilantro-lime sour cream Cheese (plain - no crema, pepitas, pico de gallo) $11.5 Shredded Chicken, Carnitas, House Chorizo, or Ground Beef $13.5 Carne Asada*, Shrimp, or Beyond Picadillo $14.5 Ahi Tuna Tostadas* Agave ponzu sauce, avocado, chipotle mayo, green onion, finishing salt [gf] $15 Soups & Salads Add to any salad: Grilled Chicken $5, Marinated Steak* $7, Sautéed Shrimp $6, or Mahi Mahi Fillet $8 Sandwiches All Sandwiches and wraps are served with chipotle-garlic salt seasoned French fries Soups & Salads Add to any salad: Grilled Chicken $5, Marinated Steak* $7, Sautéed Shrimp $6, or Mahi Mahi Fillet $8 Tortilla Chicken Soup Roasted chicken, fire-roasted corn, avocado, tortilla strips, cotija, cilantro [gf] $10 bowl, $6 cup Romaine Salad Cilantro-pepita dressing, toasted pepitas, pico de gallo, cotija, lime [gf/veg] $9.5 Chop Salad Fire-roasted corn, red bell pepper, Mexican black beans, pico de gallo, romaine lettuce, green and red cabbages, fried tortilla strips, chipotle ranch Chile-Sauteed Shrimp or Marinated Chicken Breast $18.5 Taco Salad Black beans, Monterey Jack, cotija, shredded lettuce, guacamole, pico de gallo, cilantro-lime sour cream, serrano vinaigrette, garlic crema, jalapeños en escabeche Choose from: Carnitas, Shredded Chicken, House Chorizo, or Ground Beef $16 Grilled Chicken Breast, Shrimp, or Beyond Picadillo $17.5 Grilled Steak* $20 Sandwiches All Sandwiches and wraps are served with chipotle-garlic salt seasoned French fries Carne Asada Sandwich* Grilled marinated steak*, French fried onions, serrano slaw, roasted poblano, pico de gallo, chimichurri mayo $19.5 Wagyu Bacon Cheeseburger* Mixed greens, pico de gallo, bacon, French fried onions, Jack & cheddar cheeses, chipotle mayo $18 Agave Chicken Wrap Agave-marinated chicken breast, bacon, avocado, cilantro-pepita dressing, pico de gallo, shredded lettuce, serrano vinaigrette, cotija $17 Matador Bowl Mexican black beans & rice, cheese blend, serrano slaw, pico de gallo, guacamole, radish, tortilla strips Choice of: roja, verde, habanero, or poblano crema Braised Chicken, Carnitas, Chorizo, Ground Beef, or Southwest Veg {gf} $17 Grilled Chicken, or Beyond Picadillo $18.5 Gaucho Bowl Sautéed peppers & onions, Mexican black beans & rice, Jack & cheddar cheeses, shredded lettuce, pico de gallo, guacamole, cilantro-lime sour cream, French fried onions Grilled Chicken or Sautéed Shrimp $20.5 Grilled Marinated Steak $21.5 Specialty Tacos Two tacos on flour tortillas with Mexican black beans and rice Add a third taco $6 Tacos Two tacos on flour or corn tortillas with Mexican black beans and rice Add a third taco $4 Specialty Tacos Two tacos on flour tortillas with Mexican black beans and rice Add a third taco $6 Baja Fish Tacos Panko-crusted and fried Mahi Mahi, serrano slaw, guacamole, chipotle mayo, radish, cilantro, lime $21 Coconut Shrimp Tacos Crispy coconut-breaded shrimp, mango-pineapple salsa, pico, cilantro-lime sour cream, serrano slaw, on flour tortillas $20 Mango Steak Tacos Grilled carne asada*, mango-pineapple salsa, serrano slaw, guajillo-chile sauce, Tajin $22 Ribeye Tacos Grilled ribeye, French fried onions, chimicurri mayo, avocado, grilled red pepper, cotija $22.5 Tacos Two tacos on flour or corn tortillas with Mexican black beans and rice Add a third taco $4 Topped with shredded lettuce, guajillo chile sauce, pico de gallo, garlic crema: Marinated Carne Asada* $19.5 Shredded Chicken Thigh $17 Beyond Picadillo $18.5 --- Topped with tomatillo salsa, pico de gallo, garlic crema, cotija cheese: Braised Pork Carnitas $17 Chile Sautéed Shrimp $18.5 Grilled Chicken Breast $17.5 Enchiladas Two enchiladas with Monterey Jack, pico de gallo, guacamole, cilantro-lime sour cream, Mexican black beans & rice Add a third enchilada $4 Enchiladas Two enchiladas with Monterey Jack, pico de gallo, guacamole, cilantro-lime sour cream, Mexican black beans & rice Add a third enchilada $4 Divorciadas Mild sweet and tangy salsa verde, medium smoky salsa roja, slow braised chicken thigh, corn tortillas [gf] Habanero Fiery hot habanero salsa, shredded chicken, flour tortillas Shredded Beef Medium and smoky salsa roja, shredded braised beef birria, flour tortillas Verde Carnitas Medium sweet and tangy salsa verde, braised carnitas, corn tortillas [gf] Burritos Flour tortilla filled with Mexican black beans & rice, Jack and cheddar cheeses, and sides of serrano slaw, pico de gallo, guacamole, cilantro-lime sour cream, garlic crema Cali style – add French fries, avocado, and hot sauce $3 Flour tortilla filled with Mexican black beans & rice, Jack and cheddar cheeses, and sides of serrano slaw, pico de gallo, guacamole, cilantro-lime sour cream, garlic crema Cali style – add French fries, avocado, and hot sauce $3 Poblano Carnitas Braised carnitas, rich and mild crema salsa Habanero Steak Grilled marinated steak*, picante habanero sauce Verde Chicken Braised chicken, chile verde sauce Beyond Burrito Plant-based protein, medium and smoky salsa roja, caramelized onions, roasted poblanos [v] Entrées Braised Carnitas Pork shoulder, guacamole, cilantro-lime sour cream, pico de gallo, pickled onions, salsa Maya, Mexican black beans & rice Choice of flour or corn tortillas $22.5 Skillet Seared Fajitas Sautéed peppers & onions, Mexican black beans, Jack & cheddar cheeses, romaine, pico de gallo, guacamole, cilantro-lime sour cream, flour or corn tortillas Choose from: Marinated Carne Asada* $31 Marinated Chicken Breast or Shrimp $27 Chile-Seasoned Ribeye* $32 Shrimp & Chorizo Paella Shrimp, house chorizo, sautéed fajita peppers, achiote-chile rice, saffron [gf] $23.5 Grilled Carne Asada* Street corn & leeks, grilled peppers, cotija, cilantro, Mexican black beans & rice [gf] Marinated Carne Asada* $30.5 Chile-Seasoned Ribeye* $31.5 Surf & Turf: Add habanero, Chile-garlic or poblano shrimp $5 additional Mango-Pineapple Mahi Mahi Chunky mango & pineapple salsa, fruity salsa verde, serrano slaw, chile-achiote rice, cilantro, lime $24 Roasted Chile Rellenos Poblanos stuffed with Mexican rice, Monterey Jack cheese, and tomatillo salsa, served with Mexican black beans, poblano crema, garlic crema, pico de gallo, and tortilla strips Shredded Chicken, Carnitas, or Beyond picadillo [gf] $23.5 *These items are served raw or undercooked, or contain (or may contain) raw or undercooked ingredients. Thoroughly cooking food or animal origin, including but no limited to beef, eggs, fish, lamb, milk, poultry or shellstock reduces the risk of food borne illness. Young children, the elderly and individuals with certain health conditions may be at a higher risk if these foods are consumed raw or undercooked. Kids Menu Available until 9pm, ages 12 and under. Includes entree and beverage for $9, add ice cream for $3 Entrées Served with choice of fries or rice Beverages Entrées Served with choice of fries or rice Cheese Quesadilla Serviced with sour cream and guacamole on flour tortilla Chicken Strips Served with ranch dressing Kid's Taco Spicy seasoned shredded chicken or ground beef, served with shredded lettuce, cheese, and sour cream Beverages Coke Sprite Lemonade Pineapple Juice Milk Seasonal Features Starting 2026 with a dry January? The Matador has got you covered. We’ve created a special menu featuring nothing but premium non-alcoholic spirits to kick off the new year. Starting 2026 with a dry January? The Matador has got you covered. We’ve created a special menu featuring nothing but premium non-alcoholic spirits to kick off the new year. SCRATCH MARGARITA Dhōs Blanco N/A tequila, Dhōs Orange N/A triple sec, fresh-muddled lime and orange, agave $12.5 MANGO-JALAPEÑO LIMEADE Dhōs Blanco N/A tequila, lime, mango, jalapeño, pineapple, Sprite $12.5 CRANBERRY PONCHE Dhōs Blanco N/A tequila, Dhōs Orange N/A triple sec, cranberry, pomegranate, hibiscus, tamarind, lemon, ginger, cinnamon, star anise, allspice, Sprite $13 Matador Margaritas *Contains Alcoholic* House* Lunazul Blanco, triple sec, lime, lemon, agave $12.5 Cadillac Lunazul Blanco, triple sec, lemon, lime, Grand Marnier $13.5 Smokey Ilegal Joven mezcal, triple sec, charred pineapple, lime, Tajin $14 Bartender's Olmeca Altos Reposado, triple sec, lime, lemon, agave, cranberry, Grand Marnier $14 Blood Orange Lalo Blanco, Solerno Blood Orange Liqueur, citrus, agave $15.5 Pineapple-Habanero Choose between Koch Elemental mezcal or Milagro Silver Triple sec, pineapple, lime, habanero, chile salt, Tajin $13.5 Dragonfruit* Olmeca Altos Reposado, triple sec, dragonfruit, lime, orange, spiced citrus sugar $14 Strawberry Mangonada* Corralejo Silver, triple sec, lime, mango, strawberry, lemon, chamoy, Tajin $14.5 Ginger-Orange Choose Código Blanco + Cointreau or Ilegal Joven mezcal + Solerno Blood Orange liqueur Ginger, orange, lime, spiced citrus sugar $15.5 Top Shelf Patrón Silver, Cointreau, lime, lemon, agave $16 Cucumber-Jalapeño Exotico Blanco, triple sec, cucumber, jalapeño, lemon, lime, agave, Tajin $13.5 Passionfruit Choose between Koch Elemental mezcal or Milagro Silver Passoã Passionfruit liqueur, lemon, lime, agave, chile salt $13.5 Gato Royalé Don Gato Blanco, Chambord, Spanish Cava, lime, lemon, agave, cranberry, spiced citrus sugar $16 Sangrias Spiced Red Burgundy, brandy, pisco, mango, ginger, orange, lemon, cinnamon $12.5 Spanish Rosé Spanish Rosé, Chablis, pineapple, orange, pisco, lime, cucumber, spice $12.5 Sparkling Strawberry Chablis, Spanish Cava, pisco, strawberry, pineapple, orange, hibiscus, spice $12.5 All tequilas and mezcals used in our cocktails are certified, 100% agave spirits. *Can be made as a non-alcoholic margarita using Dhōs N/A spirits. Every day 4pm to 6pm and 10pm to close $7 $8 $7 Romaine Salad Crispy Brussels Sprouts Black Bean Dip Fried Tacos (2) Chicken Tortilla Soup Quesadilla Cheese (no pico), Chicken, Carnitas, Chorizo, Ground Beef, or Beyond Picadillo, Steak* or Shrimp +2 $8 Grande Nachos Add chicken, Beyond Picadillo, House Chorizo, Carnitas, or Ground Beef $3.5 Marinated Steak* $5 Matador Guacamole Orange-habanero salsa Maya, tomatillo salsa, pico, queso fresco, cilantro Haba Prawns Steak* or Shrimp Tacos (2) Baja Fish Tacos (2) Queso Con Chorizo [gf] Melted three-cheese house blend, creamy habanero sauce, pico de gallo, cilantro, queso fresco Street Tacos Choice of: Chorizo, Beyond Picadillo, Ground Beef, Shredded Chicken, or Carnitas Three for $8, Five for $11 Allergy or dietary preference? Please ask your server! Allergy or dietary preference? Please ask your server! *Consuming raw or under-cooked food may increase your risk of food borne illness. Dessert Dessert Salted Caramel Brownie Bittersweet chocolate, salted dulce de leche, strawberry compote, vanilla ice cream $8 Fried Ice Cream Toasted coconut, whipped cream, reposado dulce de leche, cinnamon [gf] $8 Agave spirits, especially aged tequilas and mezcals, go great with dessert! Ask your server or bartender for a pairing suggestion. Bubbles Segura Viudas Brut Rosé Cava Pendés, Catalunya, Spain dry with well-balanced acidity; bright pink with fresh. intense strawberry, cherry, and a soft minerality $16 Freixenet Blanc De Blancs Brut Cava Penedès, Catalunya, Spain bright, creamy texture; crisp apple & light vanilla notes with velvety smooth bubbles and a clean, dry ﬁnish $13 | 48 Rosé & White Casillero Del Diablo Rosé Chile vibrantly fresh and crisp; sharp raspberry, strawberry, and floral aromas, red berry and stonefruit with firm acids $11 | 40 Trivento White Malbec Mendoza, Argentina crystal-clear and very light-bodied; apple and cherry on the nose with flavors of plum, red berry, tropical fruit, and subtle spice and earth on the clean, acidic finish $11 | 40 Ramón Bilbao Verdejo Rueda, Spain crisp, fresh, and aromatic; bright acid with ripe fruit, citrus, floral, and grass notes $12 | 44 Natura Sauvignon Blanc Central Valley, Chile light-bodied, fresh and bright, with vibrant and complex grapefruit, lime, herbs, and a well-balanced acidity $11 | 40 Josh Craftsman's Chardonnay North Coast, California gentle oak balanced with fresh, juicy tropical fruits, honey, ripe peach, and citrus flavors $12 | 44 Red Alamos Malbec Mendoza, Argentina deep concentrated plum, dark cherry and blackberry flavors; finishing with hints of brown spice and vanilla $11 | 40 Ontañón Natura Insolitós Tempranillo Rioja, Spain deep ruby color with a powerful bouquet of blackberry, blueberry, and sweet fig and full-bodied flavors of jammy black fruit, spice, smoke, and coffee with a strong, tannic, lingering finish $12 | 44 Josh Craftsman's Cabernet Sauvignon California full bodied with lush, dark fruit, cinnamon spice, light vanilla and toasty oak; long, soft tannic finish $13 | 48 Clos De Los Siete Blend, \"C7\" By Michel Rolland Mendoza, Argentina lush, fruit-forward plum, blackberry, and cherry with dark chocolate, ash, herbs, and oak; velvety tannins on a long, minerally finish $15 | 56 Browne Heritage Pinot Noir Williamette Valley, Oregon juicy, ripe fruit and berry notes with concentrated floral accents of violet and jasmine, citrus spice, rich loam and lingering, silky tannins $14 | 52 Top Shelf Tuesday A night to experiment Join us every Tuesday for 1/2 off all tequilas $16 and up, plus margarita specials featuring a rotating tequila each month! Join us every Tuesday for 1/2 off all tequilas $16 and up, plus margarita specials featuring a rotating tequila each month! Código Blanco Tequila of the Month, May 2024 Blanco (also called Silver, White, or Plata tequilas) Bottled either right from the still with no aging or allowed to brieﬂy mellow in stainless steel tanks for up to 60 days, blanco tequilas are fresh, bright, and agave forward. This expression is ideal when looking to experience the intense, pure aromas and ﬂavors of a tequila. Fruit & Citrus Crisp, hints of orange peel, grapefruit, pineapple, lemon Pepper & Spice Bold, hints of peppercorn, cinnamon, clove, long finish Earthy & Floral Clean, hints of herbs, clay, mint, fresh flowers, wood, licorice Fruit & Citrus Crisp, hints of orange peel, grapefruit, pineapple, lemon 1800 $10 Camarena $9 Chamucos $12 Chinaco $12 Cincoro $18 Clase Azul Plata $30 Don Julio $14 El Tequileño $9 El Tesoro $14 Fuenteseca Cosecha $28 Milagro $10 Milagro Select Barrel $14 Olmeca Altos Plata $9 Patrón $14 Patrón Gran Platinum $36 Siembra Azul $15 Teremana $11 Pepper & Spice Bold, hints of peppercorn, cinnamon, clove, long finish Casa Dragones $20 Casamigos $15 Centinela $11 Código $13 Don Fulano Fuerte $15 Don Ramon $11 El Mayor $10 Espolòn $10 Exotico $9 G4 $14 Gran Centenario $10 Grand Mayan $18 José Cuervo Reserva Platino $15 Lunazul $8 Siete Leguas $14 Terralta 110 $14 Earthy & Floral Clean, hints of herbs, clay, mint, fresh flowers, wood, licorice ArteNOM 1579 $15 Astral $14 Avión $12 Casa Noble $12 Cazadores $10 Cimmaron $9 Código \"Rosa\" $15 Corralejo $10 Don Fulano $14 Fortaleza $14 Fortaleza Still Strength $15 Herradura $14 Partida $14 Sauza Hornitos Plata $9 Siembra Valles $15 Tequila Ocho $14 Terralta $12 *House favorites Reposado (Rested tequilas) Aged between two months to one year in oak barrels, reposados show gentle amber colors and subtle, warm wood notes while still displaying some of the lighter characteristics of un-aged blancos. Honey & Caramel Hints of vanilla, chocolate, butter, toffee, cinnamon, toasted, sweet Smoke & Oak Hints of wood, agave, leather, heat, pepper Herbal & Floral Clean, hints of fresh cut grass, earthy, licorice, juniper, agave Honey & Caramel Hints of vanilla, chocolate, butter, toffee, cinnamon, toasted, sweet 1800 $10 Camarena $9 Campo Bravo $9 Casa Noble $12 Casamigos $16 Chinaco $14 Clase Azul $33 Código $15 Corralejo $10 Don Julio $14 Don Ramon $11 El Mayor $10 El Tequileño $10 Fortaleza $15 Hussongs $12 Milagro $10 Milagro Select Barrel $15 Smoke & Oak Hints of wood, agave, leather, heat, pepper Casa Dragones $32 Cazadores $10 Chamucos $14 Cincoro $22 Don Fulano $15 Grand Mayan $20 Herradura $14 Jose Cuervo Reserva de la Familia $20 Lobos $14 Olmeca Altos $9 Siete Leguas $14 Herbal & Floral Clean, hints of fresh cut grass, earthy, licorice, juniper, agave Arte NOM 1414 $15 Avión $14 Centinela $12 Cimmaron $9 El Tesoro $15 Espolòn $10 G4 $14 Gran Centenario $11 La Gritona $12 Partida $14 Patrón $14 Sauza Hornitos $9 Tequila Ocho $14 Teremana $11 *House favorites Añejo (Aged tequilas) Aged for one to three years in smaller oak barrels, which produces darker colors and smoother, complex flavors with strong wood influences. An excellent alternative to traditional whiskeys or cognacs. Vanilla & Toffee Hints of caramel, almond, warm, buttery, toasted Cinnamon & Spice Hints of peppercorn, orange peels, spice, chile pepper, heat Nutty & Smokey Hints of oak, wood, brandy, earthy, fruit, cocoa, suede Vanilla & Toffee Hints of caramel, almond, warm, buttery, toasted Avión $14 Casa Noble $14 Casamigos $17 Centinela $14 Chinaco $18 Cincoro $30 Don Julio $15 Don Julio 1942 $34 El Mayor $11 Herradura $15 Herradura Legend $30 Milagro $12 Milagro Select Barrel $22 Partida $15 Sauza Hornitos $10 Sauza Hornitos Black $11 Teremana $13 Cinnamon & Spice Hints of peppercorn, orange peels, spice, chile pepper, heat 1800 $12 Casa Dragones $35 Cazadores $11 Clase Azul $95 Código $28 Corralejo $12 Don Fulano $20 Fortaleza $20 Gran Centenatio $11 Patrón $16 Nutty & Smokey Hints of oak, wood, brandy, earthy, fruit, cocoa, suede Arte NOM 1146 $20 Camarena $10 Chamucos $14 Don Ramon $12 El Tesoro $20 Espolon $12 Grand Mayan $24 Siete Leguas $15 Tequila Ocho $18 *House favorites Extra Añejo Aged for at least three years in oak barrels no larger than 600 liters, extra añejos are incredibly rich and concentrated with heavy, almost syrupy flavors and intense wood notes. 1800 Milenio $45 Avión Reserva 44 $30 Cazadores $16 Centinela Tres Años $29 Cincoro $280 Clase Azul Ultra $300 Código Origen $60 Corralejo $30 Don Fulano Imperial $37 El Mayor $20 G4 $30 Gran Centenario Leyenda $30 Grand Mayan Ultra $40 Herradura Selección Suprema $62 Jose Cuervo Reserva de la Familia $34 Partida Elegante $75 Patrón $20 Patrón Gran Burdeos $85 Patrón Piedra $67 Rey Sol $55 Tears of Llorona $55 Tequila Ocho $38 Mezcal Made from a variety of different agaves and usually produced by fire-roasting piñas in underground pits, giving mezcals the smokiness they are known for. Mezcals are an older and more traditional form of agave spirit and tend to have stronger, more intense flavor profiles than tequilas. Approachable For the beginners. Espadín and other milder agaves produce mezcals with gentle charred agave sweetness, moderate citrus, tropical fruit, burnt hardwoods, and earth. Exotic For the curious. Wild-harvested agaves and single village bottlings have very unique flavor profiles and strongly express their terroir, producing varied notes of vegetation, earth, mineral, fruits, citrus, spice and herbs. Artisanal For the bold. Rare agaves and traditional production techniques produce incredibly complex mezcals with a wide array of pungent aromas and intense flavors. Approachable For the beginners. Espadín and other milder agaves produce mezcals with gentle charred agave sweetness, moderate citrus, tropical fruit, burnt hardwoods, and earth. 400 Conejos Joven $9 Casamigos Joven $16 Del Maguey Chichicapa $16 Del Maguey Vida $11 Fidencio Clássico $12 Ilegal Joven $14 Ilegal Reposado $15 Meteoro Espadín $12 Montelobos Espadín $12 Sombra $12 Exotic For the curious. Wild-harvested agaves and single village bottlings have very unique flavor profiles and strongly express their terroir, producing varied notes of vegetation, earth, mineral, fruits, citrus, spice and herbs. 400 Conejos Espadín, Cuishe $14 400 Conejos Espadín, Tobala $14 Banhez Espadín y Barril $11 Bozal Cuixe $15 Bozal Tobaische $15 Del Maguey Minero $16 Del Maguey Vida de Muertos $14 Koch Espadín San Baltazar Guélavila $15 Nuestra Soledad San Luis del Rio $14 Yola Espadín, Madrecuixe $15 Artisanal For the bold. Rare agaves and traditional production techniques produce incredibly complex mezcals with a wide array of pungent aromas and intense flavors. Bozal Coyote Ancestral Reserva $24 Bozal Pechuga Sacrificio $20 Código Ancestral Paplomé $33 Del Maguey Tobala $29 Real Minero Pechuga $37 Other Juice There are many other types of spirits besides tequila and mezcal that can be made from a variety of agaves and related species. These spirits can exhibit a wide array of exotic aromas and flavors. Other Juice There are many other types of spirits besides tequila and mezcal that can be made from a variety of agaves and related species. These spirits can exhibit a wide array of exotic aromas and flavors. Balam Raicilla Madurado Flor de Desierto Sotol Sierra La Higuera Wheeleri Sotol Pizcadores Bancanora Joven & Cristalino 100% agave Jovens are blancos blended with small amounts of reposados or añejos so that the intense agave notes found in a blanco are balanced by the deeper notes of an aged tequila. Cristalinos are aged tequilas that have been filtered to remove colors and heavier wood notes that come from barrel-aging, resulting in a tequila with the complexity of an añejo but with the bright notes and color of a blanco. Joven & Cristalino 100% agave Jovens are blancos blended with small amounts of reposados or añejos so that the intense agave notes found in a blanco are balanced by the deeper notes of an aged tequila. Cristalinos are aged tequilas that have been filtered to remove colors and heavier wood notes that come from barrel-aging, resulting in a tequila with the complexity of an añejo but with the bright notes and color of a blanco. 1800 $15 Avión Reserva $30 Casa Dragones Joven $68 Cazadores $12 Clase Azul Joven Gold $65 Don Julio 70th Anniversary $18 Espolón $18 Gran Centenario $20 Herradura Ultra $15 Lobos Joven $14 Maestro Dobel 50 $30 Partida $15 House Flights Try one of our curated \"expression\" flights as shown below or ask your server about a blanco, reposado, and añejo \"familia.\" Mezcal Ilegal Joven / Banhez Espadín y Barril / Del Maguey Vida de Muertos Classic Espadín notes of clean agave, citrus, & light smoke / Floral, fruity blend of Espadín & Barril agaves with balanced spice and citrus / Special high-proof, single-village expression with deep vegetal and citrus tones. $18 Blanco Blanco tequilas are the perfect way to taste and experience the terrior of a tequila - the effects that different growing regions have on agave fruit and the spirits made from them. Blanco I - El Valle Código / Partida / Jose Cuervo Reserva de la Familia Tequilas from \"the Valley\" tend to be a bit bolder and assertive, with earthy, vegetal, spicy, and herbal flavors $20 Blanco II - Los Altos Siete Leguas / El Tesoro / Patrón Tequilas from \"the Highlands\" tend to be somewhat sweeter and softer, with more tropical fruit, ﬂoral, and mineral notes $20 Reposado Milagro Select Barrel / Don Julio / Casamigos Single barrel expression with light oak, spice, & caramel / Mellow oak, vanilla, fruit, & smoke / Full-bodied agave expression, deep caramel & wood sugars $21 Añejo El Mayor / Gran Centenario / Herradura Soft, sweet, & buttery roasted agave / Honey-spiced rich, toasted oak / Deep roasted fruit, cocoa, wood, & vanilla $18 Extra Añejo Corralejo / Avión 44 / Jose Cuervo Reserva de la Familia Lush, intense fruit, caramel, & oak / Custom \"petite\" cask aging; rich & silky / Complex, rich, & nuanced private family reserve $45 El Presidente Centenario Leyenda / Herradura Selección Suprema / Partida Elegante Aged in French Limousin Oak; warm & velvety balance of vanilla, agave, & dark spice / Rich & ﬂoral with complex fruit & agave. Long ﬁnish of creamy, toasted oak / Deep wood, caramel, pepper, cocoa, & honey; elegant & reﬁned $80 Cristalino Herradura Ultra / Don Julio 70th Anniversary / Avión Reserva Dark vanilla, birthday cake, & dried fruit / Light oak, baking spice, & light vanilla-honey / Caramel, cinnamon, hints of mineral, citrus, & toasted nuts $30 Cocktails Matador Favorites Mezcalerita Koch Elemental Espadín, triple sec, orange, lemon, lime, agave, orange bitters, Tajin $13 Oaxacan Old Fashioned Ilegal Joven, aromatic bitters, agave, orange peel $15 Ancho Paloma Rosaluna Joven, Ancho Reyes Chile liqueur, lime, grapefruit, Squirt, sal de gusano $13.5 Pineapple-Habanero Margarita Koch Elemental Espadín, triple sec, pineapple, lime, habanero, chile salt, Tajin $13.5 Mezcal Negra Rosaluna Joven, Averna, orange bitters, cherry $15 Ginger-Orange Margarita Ilegal Joven, Solerno Blood Orange liqueur, ginger, orange, lime, spiced citrus sugar $15.5 Pineapple Mule Koch Elemental Espadín, grilled pineapple, ginger-orange syrup, lime, soda, served in a copper mug $13 Smokey Margarita Ilegal Joven, triple sec, charred pineapple, lime, Tajin $14 Chile Mango Margarita Rosaluna Joven, Ancho Reyes Chile liqueur, mango, agave, lime, spiced citrus sugar $15 Passionfruit Margaritas Koch Elemental Espadín, Passoã Passionfruit liqueur, lemon, lime, agave, chile salt $13.5 Bee Sting Ilegal Joven, honey, lemon, ancho chile $14 Mezcal Michelada Dos XX lager, Koch Elemental Espadín, spicy tomato, tamarind, lime, celery bitters, Tajin $12 Matador Favorites House* Lunazul Blanco, triple sec, lime, lemon, agave $12.5 Cadillac Lunazul Blanco, triple sec, lime, lemon, agave, Grand Marnier $13.5 Bartender's Olmeca Altos Reposado, triple sec, lime, lemon, agave, cranberry, Grand Marnier $14 Top Shelf Patrón Silver, Cointreau, lime, lemon, agave $16 Blood Orange Lalo Blanco, Solerno Blood Orange liqueur, citrus, agave $15.5 Cucumber-Jalapeńo Exotico Blanco, triple sec, cucumber, jalapeño, lemon, lime, agave, Tajin $13.5 FOOD Menu Menu Chips & Salsa (gf/veg) Freshly fried corn tortillas, house-roasted tomato salsa $4 Matador Guacamole (gf/veg) Orange-habanero salsa Maya, tomatillo salsa, pico, queso fresco, cilantro, fried corn tortillas $11 Dip Flight (gf/veg) Creamy three-cheese queso, fresh guacamole, and hearty black bean dip $15 Bacon Cheeseburger* Charbroiled steak burger, arugula, pico de gallo, bacon, French fried onions, Jack & cheddar cheeses, chipotle mayo, chipotle-garlic $17 Sauteed Prawns (gf) Roasted garlic & jalapeño polenta, hibiscus- pickled onion, cilantro Choice of sauce: Garlic-chile butter, poblano crema, fiery habanero $14 Baja Fish Tacos Panko crusted and fried mahi mahi, serrano slaw, guacamole, chipotle mayo, radish, cilantro, lime $11 Taco Flight Three large tacos on flour tortillas Shredded chicken, carnitas, and beef picadillo tacos topped with serrano slaw, tomatillo salsa, pico de gallo, garlic crema, cotija cheese $17 Flights Beginner I Ilegal Joven / Banhez Artesanal / Del Maguey Vida Puebla Classic Espadín notes of clean agave, citrus, & light smoke / Floral, fruity blend of Espadín & Barril agaves with balanced spice and citrus / Single-village expression from the base of the volcano Popocatépetl; green herb & vegetal notes with savory roasted agave $16 Beginner II Nuestra Soledad San Luis del Rio / Koch Espadín San Baltazar Guélavila / Don Amado Rustico High-mountain, single-village Espadín; balanced agave, mineral, citrus / From the Tlacolula district in the Valles Centrales region; subtle mineral, fruit, herbs, & brine / Clay pot-distilled Espadín from Santa Catarina Minas; deep, warm, floral $20 Advance I Real Minero Largo / Mezcales de Leyenda Guerrero / Tileño Tepextate Rare, wild agave from the Karwinskii family; sharp fruit, chocolate, dry ash & smoke / Cupreata agave wild-harvested from high-altitude oak forests; complex tropical & citrus notes with subtle spice / Seldom-distilled 25-year-old wild agave; deep fruit, intense mineral, spice & citrus $36 Advanced II Bozal Chino Verde Ancestral Reserva / Mezcales de Leyenda Durrango / Del Maguey Pechuga Rare agave foraged from the Sierra Madre del Sur mountains; pronounced herb and smoke, charred wood & desert soil / High-altitude desert maguey Cenizo; buttery, intense, exotic fruit, earth & clay / Espadín clay pot-distilled with chicken breast & wild-mountain apples, bananas, pineapples, & plums $41 Aficionada Chacolo Ixtero Amarillo / C ódigo Ancestral Papalomé / Coyote Sotol Vibora Maguey Ixtero Amarillo milled by hand with axes, naturally fermented in wooden tinas, and distilled in a Filipino still made of copper and a hollowed out tree trunk; creamy but dry, aggresive herbs, spice, salinity, & tropical fruit / Tobala agaves harvested from sub-tropical forests in mountain canyons & fermented in leather tanks; rustic & raw, intensely floral, aromatic, vegetal, & sweet / Pechuga-style Sotol distilled with rattlesnake meat & rattlesnake venom before a 2-month aging; savory & full-bodied with powerful mineral, herb, & salinity $41 Mezcal Made from a variety of different agaves and usually produced by fire-roasting piñas in underground pits, giving mezcals the smokiness they are known for. Mezcals are an older and more traditional form of agave spirit and tend to have stronger, more intense flavor profiles than tequilas. Approachable For the beginners. Espadín and other milder agaves produce mezcals with gentle charred agave sweetness, moderate citrus, tropical fruit, burnt hardwoods, and earth. Advanced For the curious. Wild-harvested agaves and single village bottlings have very unique flavor profiles and strongly express their terroir, producing varied notes of vegetation, earth, mineral, fruits, citrus, spice, and herbs. Exotic For the bold. Rare agaves and ancestral production techniques produce incredibly complex mezcals with a wide array of pungent aromas and intense flavors. Approachable For the beginners. Espadín and other milder agaves produce mezcals with gentle charred agave sweetness, moderate citrus, tropical fruit, burnt hardwoods, and earth. 400 Conejos Joven $10 Banhez Espadín y Barril $10 Casamigos Joven $16 Del Maguey Chichicapa $18 Del Maguey Vida $12 Del Maguey Vida Puebla $11 Fidencio Clásico $13 Ilegal Joven $13 Ilegal Reposado $15 Montelobos Espadín $12 Siete Misterios Doba-Yej $11 Sombra $12 Tileño Espadín $16 Union $11 Advanced For the curious. Wild-harvested agaves and single village bottlings have very unique flavor profiles and strongly express their terroir, producing varied notes of vegetation, earth, mineral, fruits, citrus, spice, and herbs. 400 Conejos Espadín y Cuishe $14 400 Conejos Espadín y Tobala $14 Bozal Cuixe $15 Bozal Tepeztate $16 Bozal Tobasiche $16 Del Maguey Minero $16 Del Maguey Santo Domingo Albarradas $16 Del Maguey Vida de Muertos $14 Derrumbes San Luis Potosi $15 Don Amado Rustico $15 Ilegal Añejo $25 Koch Espadín San Baltazar Guélavila $16 Los Nahuales Joven Mezcales De Leyenda Durango $20 Mezcales De Leyenda Guerrero $20 Mezcales De Leyenda Oaxaca $18 Nuestra Soledad Lachigui $14 Nuestra Soledad San Baltazar $14 Nuestra Soledad San Luis del Rio $14 Real Minero Barril $32 Real Minero Espadín $28 Real Minero Largo $32 Siete Misterios Espadín y Tepeztate $22 Siete Misterios Espadín y Tobala $24 Yola Espadín, Madrecuixe $15 Exotic For the bold. Rare agaves and ancestral production techniques produce incredibly complex mezcals with a wide array of pungent aromas and intense flavors. Banhez Pechuga $22 Banhez Tepeztate $22 Banhez Tobala $24 Bozal Borrego Sacrificio $26 Bozal Chino Verde Ancestral Reserva $26 Bozal Coyote Ancestral Reserva $26 Bozal Pechuga Sacrificio $24 Código Ancestral Papalomé $35 Del Maguey Pechuga $40 Del Maguey Tobala $29 Fidencio Pechuga $20 Derrumbes San Luis Potosi $12 Lost Explorer Tobala $29 Montelobos Pechuga $28 Montelobos Tobala $24 Real Minero Pechuga $38 Rey Campero Jabali $26 Scorpion 5 year $34 Siete Misterios Coyote $32 Siete Misterios Pechuga $55 Tileño Tepextate $25 Tileño Tobala $20 *House favorites OTHER JUICE There are many other types of spirits besides tequila and mezcal that can be made from a variety of agaves and related species. These spirits can exhibit a wide array of exotic aromas and flavors. OTHER JUICE There are many other types of spirits besides tequila and mezcal that can be made from a variety of agaves and related species. These spirits can exhibit a wide array of exotic aromas and flavors. Balam Raicilla Madurado $16 Chacolo Ixtero Amarillo $29 Coyote Sotol Vibora $20 Flor de Desierto Sotol Cascabel $20 Flor de Desierto Sotol Sierra $15 La Higuera Wheeleri Sotol $12 Pizcadores Bancanora $15 Pizcadores Raicilla $15 Rancho Tepúa Bacanora $16 Siempre Sotol $12 When you visit the Site, we automatically collect certain information about your device, including information about your web browser, IP address, time zone, and some of the cookies that are installed on your device. Privacy Policy Ok. I Agree",
      "hash": "67cd1c92931d",
      "downloadedAt": "2026-01-18T16:54:37.741Z",
      "trimmedAt": "2026-01-18T17:04:52.304Z",
      "sizeReduction": "93.0%"
    },
    {
      "url": "https://www.matadorrestaurants.com/menus/charleston/main-menu",
      "text": "More Menus Main Menu Main Menu Cocktails Happy Hour Dessert Wine Tequila Mezcaleria Main Menu Seasonal Features MIX & MATCH Available Monday to Friday, 11am - 3pm. Soup, choice of salad, and choice of entrée for $16! Seasonal Features PAPAS CON RAJAS veg/gf Fried chipotle-seasoned potato wedges, roasted poblano, fire-roasted corn, Monterey Jack cheese, avocado crema, molcajete salsa $9.5 SEARED AHI TUNA gf Tamari ponzu, guacamole, shaved serrano, chile seasoning, sesame seeds, fried corn tostadas $15 GRILLED CHICKEN LETTUCE WRAPS gf Butter lettuce, orange-agave marinated chicken, slaw, cucumber, avocado, molcajete salsa, queso fresco $13.5/18 *CHICKEN CHIMICHANGAS Two crispy fried chimichangas, braised chicken, black bean queso, Monterey Jack & cheddar cheeses, shredded lettuce, pico de gallo, avocado crema Served with choice of house-made enchilada sauce and Mexican rice Add a third Chimichanga +$6 *For every order of this entree, we'll donate $1 to St. Jude Children’s Research Hospital $19.5 MIX & MATCH Available Monday to Friday, 11am - 3pm. Soup, choice of salad, and choice of entrée for $16! CHOOSE YOUR SALAD Romain Salad Cilantro-pepita dressing, toasted pepitas, pico de gallo, cotija, lime House Salad Baby spring mixed green, blistered tomato and roasted pepper relish, hibiscus-pickled onion, cucumber, tajin, choice of dressing CHOOSE YOUR ENTRÉE Proteins: Chicken, Carnitas, Beyond Picadillo Add guacamole and cilantro-lime sour cream $3 Taco Serrano slaw, tomatillo salsa, garlic crema, pico de gallo, cotija Burrito Mexican rice and beans, Jack & cheddar cheeses Served divorciadas style with verde and roja sauces Quesadilla Monterey Jack cheese, pico de gallo, garlic crema, toasted pepitas, cilantro SOUP Chicken Tortilla Roasted chicken, fire-roasted corn, avocado, tortilla strips, cotija, cilantro Snacks Starters Snacks Dip Flight Creamy three-cheese queso, fresh guacamole, and hearty black bean dip [gf/v] $16 Matador Guacamole Orange-habanero salsa Maya, tomatillo salsa, pico, queso fresco, cilantro [gf] $12 Black Bean Dip Black beans, habanero, garlic crema, tomatillo salsa, green onion [gf/v] $10.5 Queso Con Chorizo Melted three-cheese house blend, creamy habanero sauce, pico de gallo, cilantro, queso fresco [gf] $12 Crispy Brussels Sprouts Fried brussels sprouts, peppers & onions, lime, agave, cotija [gf/v] $12 Fried Tacos Crispy fried corn tortillas, shredded chicken, black bean queso, shredded lettuce, pico de gallo, serrano vinaigrette, salsa Maya, chimichurri mayo $11.5 Street Tacos White onion, cilantro, housemade salsa, radish, cotija, and lime on corn tortillas [gf]: Carnitas, House Chorizo, Beyond Picadillo, Ground Beef or Shredded Chicken 3 for $11 5 for $16.5 Boulevard Style [add guacamole and pico de gallo] $3.5 Starters Grilled Stuffed Jalapeños Goat Cheese, smoked bacon, ranch dressing [gf] $14.5 Quesabirria Three corn tortillas, Monterey Jack cheese, roasted poblanos, beef birria, onions, cilantro, birria jus [gf] $16 Haba Prawns Fiery roasted habanero sauce, roasted garlic & jalapeño polenta, hibiscus-pickled onion, cilantro $15 Crispy Coconut Shrimp Shredded coconut, chile-flour batter, pickled jalapeño and Fresno chiles, salsa verde, chipotle ranch $14.5 Grande Nachos Cheddar, Monterey Jack, black beans, pico de gallo, guacamole, cilantro-lime sour cream [gf] $13.5 Add Shredded Chicken, Carnitas, House Chorizo, Ground Beef, or Beyond Picadillo $3.5 Add Marinated Steak* $6 Matador Quesadilla Monterey Jack, pico de gallo, garlic crema, toasted pepitas, guacamole, cilantro-lime sour cream Cheese (plain - no crema, pepitas, pico de gallo) $11.5 Shredded Chicken, Carnitas, House Chorizo, or Ground Beef $13.5 Carne Asada*, Shrimp, or Beyond Picadillo $14.5 Ahi Tuna Tostadas* Agave ponzu sauce, avocado, chipotle mayo, green onion, finishing salt [gf] $15 Soups & Salads Add to any salad: Grilled Chicken $5, Marinated Steak* $7, Sautéed Shrimp $6, or Mahi Mahi Fillet $8 Sandwiches All Sandwiches and wraps are served with chipotle-garlic salt seasoned French fries Soups & Salads Add to any salad: Grilled Chicken $5, Marinated Steak* $7, Sautéed Shrimp $6, or Mahi Mahi Fillet $8 Tortilla Chicken Soup Roasted chicken, fire-roasted corn, avocado, tortilla strips, cotija, cilantro [gf] $10 bowl, $6 cup Romaine Salad Cilantro-pepita dressing, toasted pepitas, pico de gallo, cotija, lime [gf/veg] $9.5 Chop Salad Fire-roasted corn, red bell pepper, Mexican black beans, pico de gallo, romaine lettuce, green and red cabbages, fried tortilla strips, chipotle ranch Chile-Sauteed Shrimp or Marinated Chicken Breast $18.5 Taco Salad Black beans, Monterey Jack, cotija, shredded lettuce, guacamole, pico de gallo, cilantro-lime sour cream, serrano vinaigrette, garlic crema, jalapeños en escabeche Choose from: Carnitas, Shredded Chicken, House Chorizo, or Ground Beef $16 Grilled Chicken Breast, Shrimp, or Beyond Picadillo $17.5 Grilled Steak* $20 Sandwiches All Sandwiches and wraps are served with chipotle-garlic salt seasoned French fries Carne Asada Sandwich* Grilled marinated steak*, French fried onions, serrano slaw, roasted poblano, pico de gallo, chimichurri mayo $19.5 Wagyu Bacon Cheeseburger* Mixed greens, pico de gallo, bacon, French fried onions, Jack & cheddar cheeses, chipotle mayo $18 Agave Chicken Wrap Agave-marinated chicken breast, bacon, avocado, cilantro-pepita dressing, pico de gallo, shredded lettuce, serrano vinaigrette, cotija $17 Matador Bowl Mexican black beans & rice, cheese blend, serrano slaw, pico de gallo, guacamole, radish, tortilla strips Choice of: roja, verde, habanero, or poblano crema Braised Chicken, Carnitas, Chorizo, Ground Beef, or Southwest Veg {gf} $17 Grilled Chicken, or Beyond Picadillo $18.5 Gaucho Bowl Sautéed peppers & onions, Mexican black beans & rice, Jack & cheddar cheeses, shredded lettuce, pico de gallo, guacamole, cilantro-lime sour cream, French fried onions Grilled Chicken or Sautéed Shrimp $20.5 Grilled Marinated Steak $21.5 Specialty Tacos Two tacos on flour tortillas with Mexican black beans and rice Add a third taco $6 Tacos Two tacos on flour or corn tortillas with Mexican black beans and rice Add a third taco $4 Specialty Tacos Two tacos on flour tortillas with Mexican black beans and rice Add a third taco $6 Baja Fish Tacos Panko-crusted and fried Mahi Mahi, serrano slaw, guacamole, chipotle mayo, radish, cilantro, lime $21 Coconut Shrimp Tacos Crispy coconut-breaded shrimp, mango-pineapple salsa, pico, cilantro-lime sour cream, serrano slaw, on flour tortillas $20 Mango Steak Tacos Grilled carne asada*, mango-pineapple salsa, serrano slaw, guajillo-chile sauce, Tajin $22 Ribeye Tacos Grilled ribeye, French fried onions, chimicurri mayo, avocado, grilled red pepper, cotija $22.5 Tacos Two tacos on flour or corn tortillas with Mexican black beans and rice Add a third taco $4 Topped with shredded lettuce, guajillo chile sauce, pico de gallo, garlic crema: Marinated Carne Asada* $19.5 Shredded Chicken Thigh $17 Beyond Picadillo $18.5 --- Topped with tomatillo salsa, pico de gallo, garlic crema, cotija cheese: Braised Pork Carnitas $17 Chile Sautéed Shrimp $18.5 Grilled Chicken Breast $17.5 Enchiladas Two enchiladas with Monterey Jack, pico de gallo, guacamole, cilantro-lime sour cream, Mexican black beans & rice Add a third enchilada $4 Enchiladas Two enchiladas with Monterey Jack, pico de gallo, guacamole, cilantro-lime sour cream, Mexican black beans & rice Add a third enchilada $4 Divorciadas Mild sweet and tangy salsa verde, medium smoky salsa roja, slow braised chicken thigh, corn tortillas [gf] Habanero Fiery hot habanero salsa, shredded chicken, flour tortillas Shredded Beef Medium and smoky salsa roja, shredded braised beef birria, flour tortillas Verde Carnitas Medium sweet and tangy salsa verde, braised carnitas, corn tortillas [gf] Burritos Flour tortilla filled with Mexican black beans & rice, Jack and cheddar cheeses, and sides of serrano slaw, pico de gallo, guacamole, cilantro-lime sour cream, garlic crema Cali style – add French fries, avocado, and hot sauce $3 Flour tortilla filled with Mexican black beans & rice, Jack and cheddar cheeses, and sides of serrano slaw, pico de gallo, guacamole, cilantro-lime sour cream, garlic crema Cali style – add French fries, avocado, and hot sauce $3 Poblano Carnitas Braised carnitas, rich and mild crema salsa Habanero Steak Grilled marinated steak*, picante habanero sauce Verde Chicken Braised chicken, chile verde sauce Beyond Burrito Plant-based protein, medium and smoky salsa roja, caramelized onions, roasted poblanos [v] Entrées Braised Carnitas Pork shoulder, guacamole, cilantro-lime sour cream, pico de gallo, pickled onions, salsa Maya, Mexican black beans & rice Choice of flour or corn tortillas $22.5 Skillet Seared Fajitas Sautéed peppers & onions, Mexican black beans, Jack & cheddar cheeses, romaine, pico de gallo, guacamole, cilantro-lime sour cream, flour or corn tortillas Choose from: Marinated Carne Asada* $31 Marinated Chicken Breast or Shrimp $27 Chile-Seasoned Ribeye* $32 Shrimp & Chorizo Paella Shrimp, house chorizo, sautéed fajita peppers, achiote-chile rice, saffron [gf] $23.5 Grilled Carne Asada* Street corn & leeks, grilled peppers, cotija, cilantro, Mexican black beans & rice [gf] Marinated Carne Asada* $30.5 Chile-Seasoned Ribeye* $31.5 Surf & Turf: Add habanero, Chile-garlic or poblano shrimp $5 additional Mango-Pineapple Mahi Mahi Chunky mango & pineapple salsa, fruity salsa verde, serrano slaw, chile-achiote rice, cilantro, lime $24 Roasted Chile Rellenos Poblanos stuffed with Mexican rice, Monterey Jack cheese, and tomatillo salsa, served with Mexican black beans, poblano crema, garlic crema, pico de gallo, and tortilla strips Shredded Chicken, Carnitas, or Beyond picadillo [gf] $23.5 *These items are served raw or undercooked, or contain (or may contain) raw or undercooked ingredients. Thoroughly cooking food or animal origin, including but no limited to beef, eggs, fish, lamb, milk, poultry or shellstock reduces the risk of food borne illness. Young children, the elderly and individuals with certain health conditions may be at a higher risk if these foods are consumed raw or undercooked. Kids Menu Available until 9pm, ages 12 and under. Includes entree and beverage for $9, add ice cream for $3 Entrées Served with choice of fries or rice Beverages Entrées Served with choice of fries or rice Cheese Quesadilla Serviced with sour cream and guacamole on flour tortilla Chicken Strips Served with ranch dressing Kid's Taco Spicy seasoned shredded chicken or ground beef, served with shredded lettuce, cheese, and sour cream Beverages Coke Sprite Lemonade Pineapple Juice Milk Seasonal Features Starting 2026 with a dry January? The Matador has got you covered. We’ve created a special menu featuring nothing but premium non-alcoholic spirits to kick off the new year. Starting 2026 with a dry January? The Matador has got you covered. We’ve created a special menu featuring nothing but premium non-alcoholic spirits to kick off the new year. SCRATCH MARGARITA Dhōs Blanco N/A tequila, Dhōs Orange N/A triple sec, fresh-muddled lime and orange, agave $12.5 MANGO-JALAPEÑO LIMEADE Dhōs Blanco N/A tequila, lime, mango, jalapeño, pineapple, Sprite $12.5 CRANBERRY PONCHE Dhōs Blanco N/A tequila, Dhōs Orange N/A triple sec, cranberry, pomegranate, hibiscus, tamarind, lemon, ginger, cinnamon, star anise, allspice, Sprite $13 Matador Margaritas *Contains Alcoholic* House* Lunazul Blanco, triple sec, lime, lemon, agave $12.5 Cadillac Lunazul Blanco, triple sec, lemon, lime, Grand Marnier $13.5 Smokey Ilegal Joven mezcal, triple sec, charred pineapple, lime, Tajin $14 Bartender's Olmeca Altos Reposado, triple sec, lime, lemon, agave, cranberry, Grand Marnier $14 Blood Orange Lalo Blanco, Solerno Blood Orange Liqueur, citrus, agave $15.5 Pineapple-Habanero Choose between Koch Elemental mezcal or Milagro Silver Triple sec, pineapple, lime, habanero, chile salt, Tajin $13.5 Dragonfruit* Olmeca Altos Reposado, triple sec, dragonfruit, lime, orange, spiced citrus sugar $14 Strawberry Mangonada* Corralejo Silver, triple sec, lime, mango, strawberry, lemon, chamoy, Tajin $14.5 Ginger-Orange Choose Código Blanco + Cointreau or Ilegal Joven mezcal + Solerno Blood Orange liqueur Ginger, orange, lime, spiced citrus sugar $15.5 Top Shelf Patrón Silver, Cointreau, lime, lemon, agave $16 Cucumber-Jalapeño Exotico Blanco, triple sec, cucumber, jalapeño, lemon, lime, agave, Tajin $13.5 Passionfruit Choose between Koch Elemental mezcal or Milagro Silver Passoã Passionfruit liqueur, lemon, lime, agave, chile salt $13.5 Gato Royalé Don Gato Blanco, Chambord, Spanish Cava, lime, lemon, agave, cranberry, spiced citrus sugar $16 Sangrias Spiced Red Burgundy, brandy, pisco, mango, ginger, orange, lemon, cinnamon $12.5 Spanish Rosé Spanish Rosé, Chablis, pineapple, orange, pisco, lime, cucumber, spice $12.5 Sparkling Strawberry Chablis, Spanish Cava, pisco, strawberry, pineapple, orange, hibiscus, spice $12.5 All tequilas and mezcals used in our cocktails are certified, 100% agave spirits. *Can be made as a non-alcoholic margarita using Dhōs N/A spirits. Every day 4pm to 6pm and 10pm to close $7 $8 $7 Romaine Salad Crispy Brussels Sprouts Black Bean Dip Fried Tacos (2) Chicken Tortilla Soup Quesadilla Cheese (no pico), Chicken, Carnitas, Chorizo, Ground Beef, or Beyond Picadillo, Steak* or Shrimp +2 $8 Grande Nachos Add chicken, Beyond Picadillo, House Chorizo, Carnitas, or Ground Beef $3.5 Marinated Steak* $5 Matador Guacamole Orange-habanero salsa Maya, tomatillo salsa, pico, queso fresco, cilantro Haba Prawns Steak* or Shrimp Tacos (2) Baja Fish Tacos (2) Queso Con Chorizo [gf] Melted three-cheese house blend, creamy habanero sauce, pico de gallo, cilantro, queso fresco Street Tacos Choice of: Chorizo, Beyond Picadillo, Ground Beef, Shredded Chicken, or Carnitas Three for $8, Five for $11 Allergy or dietary preference? Please ask your server! Allergy or dietary preference? Please ask your server! *Consuming raw or under-cooked food may increase your risk of food borne illness. Dessert Dessert Salted Caramel Brownie Bittersweet chocolate, salted dulce de leche, strawberry compote, vanilla ice cream $8 Fried Ice Cream Toasted coconut, whipped cream, reposado dulce de leche, cinnamon [gf] $8 Agave spirits, especially aged tequilas and mezcals, go great with dessert! Ask your server or bartender for a pairing suggestion. Bubbles Segura Viudas Brut Rosé Cava Pendés, Catalunya, Spain dry with well-balanced acidity; bright pink with fresh. intense strawberry, cherry, and a soft minerality $16 Freixenet Blanc De Blancs Brut Cava Penedès, Catalunya, Spain bright, creamy texture; crisp apple & light vanilla notes with velvety smooth bubbles and a clean, dry ﬁnish $13 | 48 Rosé & White Casillero Del Diablo Rosé Chile vibrantly fresh and crisp; sharp raspberry, strawberry, and floral aromas, red berry and stonefruit with firm acids $11 | 40 Trivento White Malbec Mendoza, Argentina crystal-clear and very light-bodied; apple and cherry on the nose with flavors of plum, red berry, tropical fruit, and subtle spice and earth on the clean, acidic finish $11 | 40 Ramón Bilbao Verdejo Rueda, Spain crisp, fresh, and aromatic; bright acid with ripe fruit, citrus, floral, and grass notes $12 | 44 Natura Sauvignon Blanc Central Valley, Chile light-bodied, fresh and bright, with vibrant and complex grapefruit, lime, herbs, and a well-balanced acidity $11 | 40 Josh Craftsman's Chardonnay North Coast, California gentle oak balanced with fresh, juicy tropical fruits, honey, ripe peach, and citrus flavors $12 | 44 Red Alamos Malbec Mendoza, Argentina deep concentrated plum, dark cherry and blackberry flavors; finishing with hints of brown spice and vanilla $11 | 40 Ontañón Natura Insolitós Tempranillo Rioja, Spain deep ruby color with a powerful bouquet of blackberry, blueberry, and sweet fig and full-bodied flavors of jammy black fruit, spice, smoke, and coffee with a strong, tannic, lingering finish $12 | 44 Josh Craftsman's Cabernet Sauvignon California full bodied with lush, dark fruit, cinnamon spice, light vanilla and toasty oak; long, soft tannic finish $13 | 48 Clos De Los Siete Blend, \"C7\" By Michel Rolland Mendoza, Argentina lush, fruit-forward plum, blackberry, and cherry with dark chocolate, ash, herbs, and oak; velvety tannins on a long, minerally finish $15 | 56 Browne Heritage Pinot Noir Williamette Valley, Oregon juicy, ripe fruit and berry notes with concentrated floral accents of violet and jasmine, citrus spice, rich loam and lingering, silky tannins $14 | 52 Top Shelf Tuesday A night to experiment Join us every Tuesday for 1/2 off all tequilas $16 and up, plus margarita specials featuring a rotating tequila each month! Join us every Tuesday for 1/2 off all tequilas $16 and up, plus margarita specials featuring a rotating tequila each month! Código Blanco Tequila of the Month, May 2024 Blanco (also called Silver, White, or Plata tequilas) Bottled either right from the still with no aging or allowed to brieﬂy mellow in stainless steel tanks for up to 60 days, blanco tequilas are fresh, bright, and agave forward. This expression is ideal when looking to experience the intense, pure aromas and ﬂavors of a tequila. Fruit & Citrus Crisp, hints of orange peel, grapefruit, pineapple, lemon Pepper & Spice Bold, hints of peppercorn, cinnamon, clove, long finish Earthy & Floral Clean, hints of herbs, clay, mint, fresh flowers, wood, licorice Fruit & Citrus Crisp, hints of orange peel, grapefruit, pineapple, lemon 1800 $10 Camarena $9 Chamucos $12 Chinaco $12 Cincoro $18 Clase Azul Plata $30 Don Julio $14 El Tequileño $9 El Tesoro $14 Fuenteseca Cosecha $28 Milagro $10 Milagro Select Barrel $14 Olmeca Altos Plata $9 Patrón $14 Patrón Gran Platinum $36 Siembra Azul $15 Teremana $11 Pepper & Spice Bold, hints of peppercorn, cinnamon, clove, long finish Casa Dragones $20 Casamigos $15 Centinela $11 Código $13 Don Fulano Fuerte $15 Don Ramon $11 El Mayor $10 Espolòn $10 Exotico $9 G4 $14 Gran Centenario $10 Grand Mayan $18 José Cuervo Reserva Platino $15 Lunazul $8 Siete Leguas $14 Terralta 110 $14 Earthy & Floral Clean, hints of herbs, clay, mint, fresh flowers, wood, licorice ArteNOM 1579 $15 Astral $14 Avión $12 Casa Noble $12 Cazadores $10 Cimmaron $9 Código \"Rosa\" $15 Corralejo $10 Don Fulano $14 Fortaleza $14 Fortaleza Still Strength $15 Herradura $14 Partida $14 Sauza Hornitos Plata $9 Siembra Valles $15 Tequila Ocho $14 Terralta $12 *House favorites Reposado (Rested tequilas) Aged between two months to one year in oak barrels, reposados show gentle amber colors and subtle, warm wood notes while still displaying some of the lighter characteristics of un-aged blancos. Honey & Caramel Hints of vanilla, chocolate, butter, toffee, cinnamon, toasted, sweet Smoke & Oak Hints of wood, agave, leather, heat, pepper Herbal & Floral Clean, hints of fresh cut grass, earthy, licorice, juniper, agave Honey & Caramel Hints of vanilla, chocolate, butter, toffee, cinnamon, toasted, sweet 1800 $10 Camarena $9 Campo Bravo $9 Casa Noble $12 Casamigos $16 Chinaco $14 Clase Azul $33 Código $15 Corralejo $10 Don Julio $14 Don Ramon $11 El Mayor $10 El Tequileño $10 Fortaleza $15 Hussongs $12 Milagro $10 Milagro Select Barrel $15 Smoke & Oak Hints of wood, agave, leather, heat, pepper Casa Dragones $32 Cazadores $10 Chamucos $14 Cincoro $22 Don Fulano $15 Grand Mayan $20 Herradura $14 Jose Cuervo Reserva de la Familia $20 Lobos $14 Olmeca Altos $9 Siete Leguas $14 Herbal & Floral Clean, hints of fresh cut grass, earthy, licorice, juniper, agave Arte NOM 1414 $15 Avión $14 Centinela $12 Cimmaron $9 El Tesoro $15 Espolòn $10 G4 $14 Gran Centenario $11 La Gritona $12 Partida $14 Patrón $14 Sauza Hornitos $9 Tequila Ocho $14 Teremana $11 *House favorites Añejo (Aged tequilas) Aged for one to three years in smaller oak barrels, which produces darker colors and smoother, complex flavors with strong wood influences. An excellent alternative to traditional whiskeys or cognacs. Vanilla & Toffee Hints of caramel, almond, warm, buttery, toasted Cinnamon & Spice Hints of peppercorn, orange peels, spice, chile pepper, heat Nutty & Smokey Hints of oak, wood, brandy, earthy, fruit, cocoa, suede Vanilla & Toffee Hints of caramel, almond, warm, buttery, toasted Avión $14 Casa Noble $14 Casamigos $17 Centinela $14 Chinaco $18 Cincoro $30 Don Julio $15 Don Julio 1942 $34 El Mayor $11 Herradura $15 Herradura Legend $30 Milagro $12 Milagro Select Barrel $22 Partida $15 Sauza Hornitos $10 Sauza Hornitos Black $11 Teremana $13 Cinnamon & Spice Hints of peppercorn, orange peels, spice, chile pepper, heat 1800 $12 Casa Dragones $35 Cazadores $11 Clase Azul $95 Código $28 Corralejo $12 Don Fulano $20 Fortaleza $20 Gran Centenatio $11 Patrón $16 Nutty & Smokey Hints of oak, wood, brandy, earthy, fruit, cocoa, suede Arte NOM 1146 $20 Camarena $10 Chamucos $14 Don Ramon $12 El Tesoro $20 Espolon $12 Grand Mayan $24 Siete Leguas $15 Tequila Ocho $18 *House favorites Extra Añejo Aged for at least three years in oak barrels no larger than 600 liters, extra añejos are incredibly rich and concentrated with heavy, almost syrupy flavors and intense wood notes. 1800 Milenio $45 Avión Reserva 44 $30 Cazadores $16 Centinela Tres Años $29 Cincoro $280 Clase Azul Ultra $300 Código Origen $60 Corralejo $30 Don Fulano Imperial $37 El Mayor $20 G4 $30 Gran Centenario Leyenda $30 Grand Mayan Ultra $40 Herradura Selección Suprema $62 Jose Cuervo Reserva de la Familia $34 Partida Elegante $75 Patrón $20 Patrón Gran Burdeos $85 Patrón Piedra $67 Rey Sol $55 Tears of Llorona $55 Tequila Ocho $38 Mezcal Made from a variety of different agaves and usually produced by fire-roasting piñas in underground pits, giving mezcals the smokiness they are known for. Mezcals are an older and more traditional form of agave spirit and tend to have stronger, more intense flavor profiles than tequilas. Approachable For the beginners. Espadín and other milder agaves produce mezcals with gentle charred agave sweetness, moderate citrus, tropical fruit, burnt hardwoods, and earth. Exotic For the curious. Wild-harvested agaves and single village bottlings have very unique flavor profiles and strongly express their terroir, producing varied notes of vegetation, earth, mineral, fruits, citrus, spice and herbs. Artisanal For the bold. Rare agaves and traditional production techniques produce incredibly complex mezcals with a wide array of pungent aromas and intense flavors. Approachable For the beginners. Espadín and other milder agaves produce mezcals with gentle charred agave sweetness, moderate citrus, tropical fruit, burnt hardwoods, and earth. 400 Conejos Joven $9 Casamigos Joven $16 Del Maguey Chichicapa $16 Del Maguey Vida $11 Fidencio Clássico $12 Ilegal Joven $14 Ilegal Reposado $15 Meteoro Espadín $12 Montelobos Espadín $12 Sombra $12 Exotic For the curious. Wild-harvested agaves and single village bottlings have very unique flavor profiles and strongly express their terroir, producing varied notes of vegetation, earth, mineral, fruits, citrus, spice and herbs. 400 Conejos Espadín, Cuishe $14 400 Conejos Espadín, Tobala $14 Banhez Espadín y Barril $11 Bozal Cuixe $15 Bozal Tobaische $15 Del Maguey Minero $16 Del Maguey Vida de Muertos $14 Koch Espadín San Baltazar Guélavila $15 Nuestra Soledad San Luis del Rio $14 Yola Espadín, Madrecuixe $15 Artisanal For the bold. Rare agaves and traditional production techniques produce incredibly complex mezcals with a wide array of pungent aromas and intense flavors. Bozal Coyote Ancestral Reserva $24 Bozal Pechuga Sacrificio $20 Código Ancestral Paplomé $33 Del Maguey Tobala $29 Real Minero Pechuga $37 Other Juice There are many other types of spirits besides tequila and mezcal that can be made from a variety of agaves and related species. These spirits can exhibit a wide array of exotic aromas and flavors. Other Juice There are many other types of spirits besides tequila and mezcal that can be made from a variety of agaves and related species. These spirits can exhibit a wide array of exotic aromas and flavors. Balam Raicilla Madurado Flor de Desierto Sotol Sierra La Higuera Wheeleri Sotol Pizcadores Bancanora Joven & Cristalino 100% agave Jovens are blancos blended with small amounts of reposados or añejos so that the intense agave notes found in a blanco are balanced by the deeper notes of an aged tequila. Cristalinos are aged tequilas that have been filtered to remove colors and heavier wood notes that come from barrel-aging, resulting in a tequila with the complexity of an añejo but with the bright notes and color of a blanco. Joven & Cristalino 100% agave Jovens are blancos blended with small amounts of reposados or añejos so that the intense agave notes found in a blanco are balanced by the deeper notes of an aged tequila. Cristalinos are aged tequilas that have been filtered to remove colors and heavier wood notes that come from barrel-aging, resulting in a tequila with the complexity of an añejo but with the bright notes and color of a blanco. 1800 $15 Avión Reserva $30 Casa Dragones Joven $68 Cazadores $12 Clase Azul Joven Gold $65 Don Julio 70th Anniversary $18 Espolón $18 Gran Centenario $20 Herradura Ultra $15 Lobos Joven $14 Maestro Dobel 50 $30 Partida $15 House Flights Try one of our curated \"expression\" flights as shown below or ask your server about a blanco, reposado, and añejo \"familia.\" Mezcal Ilegal Joven / Banhez Espadín y Barril / Del Maguey Vida de Muertos Classic Espadín notes of clean agave, citrus, & light smoke / Floral, fruity blend of Espadín & Barril agaves with balanced spice and citrus / Special high-proof, single-village expression with deep vegetal and citrus tones. $18 Blanco Blanco tequilas are the perfect way to taste and experience the terrior of a tequila - the effects that different growing regions have on agave fruit and the spirits made from them. Blanco I - El Valle Código / Partida / Jose Cuervo Reserva de la Familia Tequilas from \"the Valley\" tend to be a bit bolder and assertive, with earthy, vegetal, spicy, and herbal flavors $20 Blanco II - Los Altos Siete Leguas / El Tesoro / Patrón Tequilas from \"the Highlands\" tend to be somewhat sweeter and softer, with more tropical fruit, ﬂoral, and mineral notes $20 Reposado Milagro Select Barrel / Don Julio / Casamigos Single barrel expression with light oak, spice, & caramel / Mellow oak, vanilla, fruit, & smoke / Full-bodied agave expression, deep caramel & wood sugars $21 Añejo El Mayor / Gran Centenario / Herradura Soft, sweet, & buttery roasted agave / Honey-spiced rich, toasted oak / Deep roasted fruit, cocoa, wood, & vanilla $18 Extra Añejo Corralejo / Avión 44 / Jose Cuervo Reserva de la Familia Lush, intense fruit, caramel, & oak / Custom \"petite\" cask aging; rich & silky / Complex, rich, & nuanced private family reserve $45 El Presidente Centenario Leyenda / Herradura Selección Suprema / Partida Elegante Aged in French Limousin Oak; warm & velvety balance of vanilla, agave, & dark spice / Rich & ﬂoral with complex fruit & agave. Long ﬁnish of creamy, toasted oak / Deep wood, caramel, pepper, cocoa, & honey; elegant & reﬁned $80 Cristalino Herradura Ultra / Don Julio 70th Anniversary / Avión Reserva Dark vanilla, birthday cake, & dried fruit / Light oak, baking spice, & light vanilla-honey / Caramel, cinnamon, hints of mineral, citrus, & toasted nuts $30 Cocktails Matador Favorites Mezcalerita Koch Elemental Espadín, triple sec, orange, lemon, lime, agave, orange bitters, Tajin $13 Oaxacan Old Fashioned Ilegal Joven, aromatic bitters, agave, orange peel $15 Ancho Paloma Rosaluna Joven, Ancho Reyes Chile liqueur, lime, grapefruit, Squirt, sal de gusano $13.5 Pineapple-Habanero Margarita Koch Elemental Espadín, triple sec, pineapple, lime, habanero, chile salt, Tajin $13.5 Mezcal Negra Rosaluna Joven, Averna, orange bitters, cherry $15 Ginger-Orange Margarita Ilegal Joven, Solerno Blood Orange liqueur, ginger, orange, lime, spiced citrus sugar $15.5 Pineapple Mule Koch Elemental Espadín, grilled pineapple, ginger-orange syrup, lime, soda, served in a copper mug $13 Smokey Margarita Ilegal Joven, triple sec, charred pineapple, lime, Tajin $14 Chile Mango Margarita Rosaluna Joven, Ancho Reyes Chile liqueur, mango, agave, lime, spiced citrus sugar $15 Passionfruit Margaritas Koch Elemental Espadín, Passoã Passionfruit liqueur, lemon, lime, agave, chile salt $13.5 Bee Sting Ilegal Joven, honey, lemon, ancho chile $14 Mezcal Michelada Dos XX lager, Koch Elemental Espadín, spicy tomato, tamarind, lime, celery bitters, Tajin $12 Matador Favorites House* Lunazul Blanco, triple sec, lime, lemon, agave $12.5 Cadillac Lunazul Blanco, triple sec, lime, lemon, agave, Grand Marnier $13.5 Bartender's Olmeca Altos Reposado, triple sec, lime, lemon, agave, cranberry, Grand Marnier $14 Top Shelf Patrón Silver, Cointreau, lime, lemon, agave $16 Blood Orange Lalo Blanco, Solerno Blood Orange liqueur, citrus, agave $15.5 Cucumber-Jalapeńo Exotico Blanco, triple sec, cucumber, jalapeño, lemon, lime, agave, Tajin $13.5 FOOD Menu Menu Chips & Salsa (gf/veg) Freshly fried corn tortillas, house-roasted tomato salsa $4 Matador Guacamole (gf/veg) Orange-habanero salsa Maya, tomatillo salsa, pico, queso fresco, cilantro, fried corn tortillas $11 Dip Flight (gf/veg) Creamy three-cheese queso, fresh guacamole, and hearty black bean dip $15 Bacon Cheeseburger* Charbroiled steak burger, arugula, pico de gallo, bacon, French fried onions, Jack & cheddar cheeses, chipotle mayo, chipotle-garlic $17 Sauteed Prawns (gf) Roasted garlic & jalapeño polenta, hibiscus- pickled onion, cilantro Choice of sauce: Garlic-chile butter, poblano crema, fiery habanero $14 Baja Fish Tacos Panko crusted and fried mahi mahi, serrano slaw, guacamole, chipotle mayo, radish, cilantro, lime $11 Taco Flight Three large tacos on flour tortillas Shredded chicken, carnitas, and beef picadillo tacos topped with serrano slaw, tomatillo salsa, pico de gallo, garlic crema, cotija cheese $17 Flights Beginner I Ilegal Joven / Banhez Artesanal / Del Maguey Vida Puebla Classic Espadín notes of clean agave, citrus, & light smoke / Floral, fruity blend of Espadín & Barril agaves with balanced spice and citrus / Single-village expression from the base of the volcano Popocatépetl; green herb & vegetal notes with savory roasted agave $16 Beginner II Nuestra Soledad San Luis del Rio / Koch Espadín San Baltazar Guélavila / Don Amado Rustico High-mountain, single-village Espadín; balanced agave, mineral, citrus / From the Tlacolula district in the Valles Centrales region; subtle mineral, fruit, herbs, & brine / Clay pot-distilled Espadín from Santa Catarina Minas; deep, warm, floral $20 Advance I Real Minero Largo / Mezcales de Leyenda Guerrero / Tileño Tepextate Rare, wild agave from the Karwinskii family; sharp fruit, chocolate, dry ash & smoke / Cupreata agave wild-harvested from high-altitude oak forests; complex tropical & citrus notes with subtle spice / Seldom-distilled 25-year-old wild agave; deep fruit, intense mineral, spice & citrus $36 Advanced II Bozal Chino Verde Ancestral Reserva / Mezcales de Leyenda Durrango / Del Maguey Pechuga Rare agave foraged from the Sierra Madre del Sur mountains; pronounced herb and smoke, charred wood & desert soil / High-altitude desert maguey Cenizo; buttery, intense, exotic fruit, earth & clay / Espadín clay pot-distilled with chicken breast & wild-mountain apples, bananas, pineapples, & plums $41 Aficionada Chacolo Ixtero Amarillo / C ódigo Ancestral Papalomé / Coyote Sotol Vibora Maguey Ixtero Amarillo milled by hand with axes, naturally fermented in wooden tinas, and distilled in a Filipino still made of copper and a hollowed out tree trunk; creamy but dry, aggresive herbs, spice, salinity, & tropical fruit / Tobala agaves harvested from sub-tropical forests in mountain canyons & fermented in leather tanks; rustic & raw, intensely floral, aromatic, vegetal, & sweet / Pechuga-style Sotol distilled with rattlesnake meat & rattlesnake venom before a 2-month aging; savory & full-bodied with powerful mineral, herb, & salinity $41 Mezcal Made from a variety of different agaves and usually produced by fire-roasting piñas in underground pits, giving mezcals the smokiness they are known for. Mezcals are an older and more traditional form of agave spirit and tend to have stronger, more intense flavor profiles than tequilas. Approachable For the beginners. Espadín and other milder agaves produce mezcals with gentle charred agave sweetness, moderate citrus, tropical fruit, burnt hardwoods, and earth. Advanced For the curious. Wild-harvested agaves and single village bottlings have very unique flavor profiles and strongly express their terroir, producing varied notes of vegetation, earth, mineral, fruits, citrus, spice, and herbs. Exotic For the bold. Rare agaves and ancestral production techniques produce incredibly complex mezcals with a wide array of pungent aromas and intense flavors. Approachable For the beginners. Espadín and other milder agaves produce mezcals with gentle charred agave sweetness, moderate citrus, tropical fruit, burnt hardwoods, and earth. 400 Conejos Joven $10 Banhez Espadín y Barril $10 Casamigos Joven $16 Del Maguey Chichicapa $18 Del Maguey Vida $12 Del Maguey Vida Puebla $11 Fidencio Clásico $13 Ilegal Joven $13 Ilegal Reposado $15 Montelobos Espadín $12 Siete Misterios Doba-Yej $11 Sombra $12 Tileño Espadín $16 Union $11 Advanced For the curious. Wild-harvested agaves and single village bottlings have very unique flavor profiles and strongly express their terroir, producing varied notes of vegetation, earth, mineral, fruits, citrus, spice, and herbs. 400 Conejos Espadín y Cuishe $14 400 Conejos Espadín y Tobala $14 Bozal Cuixe $15 Bozal Tepeztate $16 Bozal Tobasiche $16 Del Maguey Minero $16 Del Maguey Santo Domingo Albarradas $16 Del Maguey Vida de Muertos $14 Derrumbes San Luis Potosi $15 Don Amado Rustico $15 Ilegal Añejo $25 Koch Espadín San Baltazar Guélavila $16 Los Nahuales Joven Mezcales De Leyenda Durango $20 Mezcales De Leyenda Guerrero $20 Mezcales De Leyenda Oaxaca $18 Nuestra Soledad Lachigui $14 Nuestra Soledad San Baltazar $14 Nuestra Soledad San Luis del Rio $14 Real Minero Barril $32 Real Minero Espadín $28 Real Minero Largo $32 Siete Misterios Espadín y Tepeztate $22 Siete Misterios Espadín y Tobala $24 Yola Espadín, Madrecuixe $15 Exotic For the bold. Rare agaves and ancestral production techniques produce incredibly complex mezcals with a wide array of pungent aromas and intense flavors. Banhez Pechuga $22 Banhez Tepeztate $22 Banhez Tobala $24 Bozal Borrego Sacrificio $26 Bozal Chino Verde Ancestral Reserva $26 Bozal Coyote Ancestral Reserva $26 Bozal Pechuga Sacrificio $24 Código Ancestral Papalomé $35 Del Maguey Pechuga $40 Del Maguey Tobala $29 Fidencio Pechuga $20 Derrumbes San Luis Potosi $12 Lost Explorer Tobala $29 Montelobos Pechuga $28 Montelobos Tobala $24 Real Minero Pechuga $38 Rey Campero Jabali $26 Scorpion 5 year $34 Siete Misterios Coyote $32 Siete Misterios Pechuga $55 Tileño Tepextate $25 Tileño Tobala $20 *House favorites OTHER JUICE There are many other types of spirits besides tequila and mezcal that can be made from a variety of agaves and related species. These spirits can exhibit a wide array of exotic aromas and flavors. OTHER JUICE There are many other types of spirits besides tequila and mezcal that can be made from a variety of agaves and related species. These spirits can exhibit a wide array of exotic aromas and flavors. Balam Raicilla Madurado $16 Chacolo Ixtero Amarillo $29 Coyote Sotol Vibora $20 Flor de Desierto Sotol Cascabel $20 Flor de Desierto Sotol Sierra $15 La Higuera Wheeleri Sotol $12 Pizcadores Bancanora $15 Pizcadores Raicilla $15 Rancho Tepúa Bacanora $16 Siempre Sotol $12 When you visit the Site, we automatically collect certain information about your device, including information about your web browser, IP address, time zone, and some of the cookies that are installed on your device. Privacy Policy Ok. I Agree",
      "hash": "77d2752ce829",
      "downloadedAt": "2026-01-18T16:54:32.261Z",
      "trimmedAt": "2026-01-18T17:04:52.423Z",
      "sizeReduction": "93.0%"
    },
    {
      "url": "https://www.matadorrestaurants.com/menus/charleston/tequila-2-2",
      "text": "More Menus Mezcaleria Main Menu Cocktails Happy Hour Dessert Wine Tequila Mezcaleria Mezcaleria Seasonal Features MIX & MATCH Available Monday to Friday, 11am - 3pm. Soup, choice of salad, and choice of entrée for $16! Seasonal Features PAPAS CON RAJAS veg/gf Fried chipotle-seasoned potato wedges, roasted poblano, fire-roasted corn, Monterey Jack cheese, avocado crema, molcajete salsa $9.5 SEARED AHI TUNA gf Tamari ponzu, guacamole, shaved serrano, chile seasoning, sesame seeds, fried corn tostadas $15 GRILLED CHICKEN LETTUCE WRAPS gf Butter lettuce, orange-agave marinated chicken, slaw, cucumber, avocado, molcajete salsa, queso fresco $13.5/18 *CHICKEN CHIMICHANGAS Two crispy fried chimichangas, braised chicken, black bean queso, Monterey Jack & cheddar cheeses, shredded lettuce, pico de gallo, avocado crema Served with choice of house-made enchilada sauce and Mexican rice Add a third Chimichanga +$6 *For every order of this entree, we'll donate $1 to St. Jude Children’s Research Hospital $19.5 MIX & MATCH Available Monday to Friday, 11am - 3pm. Soup, choice of salad, and choice of entrée for $16! CHOOSE YOUR SALAD Romain Salad Cilantro-pepita dressing, toasted pepitas, pico de gallo, cotija, lime House Salad Baby spring mixed green, blistered tomato and roasted pepper relish, hibiscus-pickled onion, cucumber, tajin, choice of dressing CHOOSE YOUR ENTRÉE Proteins: Chicken, Carnitas, Beyond Picadillo Add guacamole and cilantro-lime sour cream $3 Taco Serrano slaw, tomatillo salsa, garlic crema, pico de gallo, cotija Burrito Mexican rice and beans, Jack & cheddar cheeses Served divorciadas style with verde and roja sauces Quesadilla Monterey Jack cheese, pico de gallo, garlic crema, toasted pepitas, cilantro SOUP Chicken Tortilla Roasted chicken, fire-roasted corn, avocado, tortilla strips, cotija, cilantro Snacks Starters Snacks Dip Flight Creamy three-cheese queso, fresh guacamole, and hearty black bean dip [gf/v] $16 Matador Guacamole Orange-habanero salsa Maya, tomatillo salsa, pico, queso fresco, cilantro [gf] $12 Black Bean Dip Black beans, habanero, garlic crema, tomatillo salsa, green onion [gf/v] $10.5 Queso Con Chorizo Melted three-cheese house blend, creamy habanero sauce, pico de gallo, cilantro, queso fresco [gf] $12 Crispy Brussels Sprouts Fried brussels sprouts, peppers & onions, lime, agave, cotija [gf/v] $12 Fried Tacos Crispy fried corn tortillas, shredded chicken, black bean queso, shredded lettuce, pico de gallo, serrano vinaigrette, salsa Maya, chimichurri mayo $11.5 Street Tacos White onion, cilantro, housemade salsa, radish, cotija, and lime on corn tortillas [gf]: Carnitas, House Chorizo, Beyond Picadillo, Ground Beef or Shredded Chicken 3 for $11 5 for $16.5 Boulevard Style [add guacamole and pico de gallo] $3.5 Starters Grilled Stuffed Jalapeños Goat Cheese, smoked bacon, ranch dressing [gf] $14.5 Quesabirria Three corn tortillas, Monterey Jack cheese, roasted poblanos, beef birria, onions, cilantro, birria jus [gf] $16 Haba Prawns Fiery roasted habanero sauce, roasted garlic & jalapeño polenta, hibiscus-pickled onion, cilantro $15 Crispy Coconut Shrimp Shredded coconut, chile-flour batter, pickled jalapeño and Fresno chiles, salsa verde, chipotle ranch $14.5 Grande Nachos Cheddar, Monterey Jack, black beans, pico de gallo, guacamole, cilantro-lime sour cream [gf] $13.5 Add Shredded Chicken, Carnitas, House Chorizo, Ground Beef, or Beyond Picadillo $3.5 Add Marinated Steak* $6 Matador Quesadilla Monterey Jack, pico de gallo, garlic crema, toasted pepitas, guacamole, cilantro-lime sour cream Cheese (plain - no crema, pepitas, pico de gallo) $11.5 Shredded Chicken, Carnitas, House Chorizo, or Ground Beef $13.5 Carne Asada*, Shrimp, or Beyond Picadillo $14.5 Ahi Tuna Tostadas* Agave ponzu sauce, avocado, chipotle mayo, green onion, finishing salt [gf] $15 Soups & Salads Add to any salad: Grilled Chicken $5, Marinated Steak* $7, Sautéed Shrimp $6, or Mahi Mahi Fillet $8 Sandwiches All Sandwiches and wraps are served with chipotle-garlic salt seasoned French fries Soups & Salads Add to any salad: Grilled Chicken $5, Marinated Steak* $7, Sautéed Shrimp $6, or Mahi Mahi Fillet $8 Tortilla Chicken Soup Roasted chicken, fire-roasted corn, avocado, tortilla strips, cotija, cilantro [gf] $10 bowl, $6 cup Romaine Salad Cilantro-pepita dressing, toasted pepitas, pico de gallo, cotija, lime [gf/veg] $9.5 Chop Salad Fire-roasted corn, red bell pepper, Mexican black beans, pico de gallo, romaine lettuce, green and red cabbages, fried tortilla strips, chipotle ranch Chile-Sauteed Shrimp or Marinated Chicken Breast $18.5 Taco Salad Black beans, Monterey Jack, cotija, shredded lettuce, guacamole, pico de gallo, cilantro-lime sour cream, serrano vinaigrette, garlic crema, jalapeños en escabeche Choose from: Carnitas, Shredded Chicken, House Chorizo, or Ground Beef $16 Grilled Chicken Breast, Shrimp, or Beyond Picadillo $17.5 Grilled Steak* $20 Sandwiches All Sandwiches and wraps are served with chipotle-garlic salt seasoned French fries Carne Asada Sandwich* Grilled marinated steak*, French fried onions, serrano slaw, roasted poblano, pico de gallo, chimichurri mayo $19.5 Wagyu Bacon Cheeseburger* Mixed greens, pico de gallo, bacon, French fried onions, Jack & cheddar cheeses, chipotle mayo $18 Agave Chicken Wrap Agave-marinated chicken breast, bacon, avocado, cilantro-pepita dressing, pico de gallo, shredded lettuce, serrano vinaigrette, cotija $17 Matador Bowl Mexican black beans & rice, cheese blend, serrano slaw, pico de gallo, guacamole, radish, tortilla strips Choice of: roja, verde, habanero, or poblano crema Braised Chicken, Carnitas, Chorizo, Ground Beef, or Southwest Veg {gf} $17 Grilled Chicken, or Beyond Picadillo $18.5 Gaucho Bowl Sautéed peppers & onions, Mexican black beans & rice, Jack & cheddar cheeses, shredded lettuce, pico de gallo, guacamole, cilantro-lime sour cream, French fried onions Grilled Chicken or Sautéed Shrimp $20.5 Grilled Marinated Steak $21.5 Specialty Tacos Two tacos on flour tortillas with Mexican black beans and rice Add a third taco $6 Tacos Two tacos on flour or corn tortillas with Mexican black beans and rice Add a third taco $4 Specialty Tacos Two tacos on flour tortillas with Mexican black beans and rice Add a third taco $6 Baja Fish Tacos Panko-crusted and fried Mahi Mahi, serrano slaw, guacamole, chipotle mayo, radish, cilantro, lime $21 Coconut Shrimp Tacos Crispy coconut-breaded shrimp, mango-pineapple salsa, pico, cilantro-lime sour cream, serrano slaw, on flour tortillas $20 Mango Steak Tacos Grilled carne asada*, mango-pineapple salsa, serrano slaw, guajillo-chile sauce, Tajin $22 Ribeye Tacos Grilled ribeye, French fried onions, chimicurri mayo, avocado, grilled red pepper, cotija $22.5 Tacos Two tacos on flour or corn tortillas with Mexican black beans and rice Add a third taco $4 Topped with shredded lettuce, guajillo chile sauce, pico de gallo, garlic crema: Marinated Carne Asada* $19.5 Shredded Chicken Thigh $17 Beyond Picadillo $18.5 --- Topped with tomatillo salsa, pico de gallo, garlic crema, cotija cheese: Braised Pork Carnitas $17 Chile Sautéed Shrimp $18.5 Grilled Chicken Breast $17.5 Enchiladas Two enchiladas with Monterey Jack, pico de gallo, guacamole, cilantro-lime sour cream, Mexican black beans & rice Add a third enchilada $4 Enchiladas Two enchiladas with Monterey Jack, pico de gallo, guacamole, cilantro-lime sour cream, Mexican black beans & rice Add a third enchilada $4 Divorciadas Mild sweet and tangy salsa verde, medium smoky salsa roja, slow braised chicken thigh, corn tortillas [gf] Habanero Fiery hot habanero salsa, shredded chicken, flour tortillas Shredded Beef Medium and smoky salsa roja, shredded braised beef birria, flour tortillas Verde Carnitas Medium sweet and tangy salsa verde, braised carnitas, corn tortillas [gf] Burritos Flour tortilla filled with Mexican black beans & rice, Jack and cheddar cheeses, and sides of serrano slaw, pico de gallo, guacamole, cilantro-lime sour cream, garlic crema Cali style – add French fries, avocado, and hot sauce $3 Flour tortilla filled with Mexican black beans & rice, Jack and cheddar cheeses, and sides of serrano slaw, pico de gallo, guacamole, cilantro-lime sour cream, garlic crema Cali style – add French fries, avocado, and hot sauce $3 Poblano Carnitas Braised carnitas, rich and mild crema salsa Habanero Steak Grilled marinated steak*, picante habanero sauce Verde Chicken Braised chicken, chile verde sauce Beyond Burrito Plant-based protein, medium and smoky salsa roja, caramelized onions, roasted poblanos [v] Entrées Braised Carnitas Pork shoulder, guacamole, cilantro-lime sour cream, pico de gallo, pickled onions, salsa Maya, Mexican black beans & rice Choice of flour or corn tortillas $22.5 Skillet Seared Fajitas Sautéed peppers & onions, Mexican black beans, Jack & cheddar cheeses, romaine, pico de gallo, guacamole, cilantro-lime sour cream, flour or corn tortillas Choose from: Marinated Carne Asada* $31 Marinated Chicken Breast or Shrimp $27 Chile-Seasoned Ribeye* $32 Shrimp & Chorizo Paella Shrimp, house chorizo, sautéed fajita peppers, achiote-chile rice, saffron [gf] $23.5 Grilled Carne Asada* Street corn & leeks, grilled peppers, cotija, cilantro, Mexican black beans & rice [gf] Marinated Carne Asada* $30.5 Chile-Seasoned Ribeye* $31.5 Surf & Turf: Add habanero, Chile-garlic or poblano shrimp $5 additional Mango-Pineapple Mahi Mahi Chunky mango & pineapple salsa, fruity salsa verde, serrano slaw, chile-achiote rice, cilantro, lime $24 Roasted Chile Rellenos Poblanos stuffed with Mexican rice, Monterey Jack cheese, and tomatillo salsa, served with Mexican black beans, poblano crema, garlic crema, pico de gallo, and tortilla strips Shredded Chicken, Carnitas, or Beyond picadillo [gf] $23.5 *These items are served raw or undercooked, or contain (or may contain) raw or undercooked ingredients. Thoroughly cooking food or animal origin, including but no limited to beef, eggs, fish, lamb, milk, poultry or shellstock reduces the risk of food borne illness. Young children, the elderly and individuals with certain health conditions may be at a higher risk if these foods are consumed raw or undercooked. Kids Menu Available until 9pm, ages 12 and under. Includes entree and beverage for $9, add ice cream for $3 Entrées Served with choice of fries or rice Beverages Entrées Served with choice of fries or rice Cheese Quesadilla Serviced with sour cream and guacamole on flour tortilla Chicken Strips Served with ranch dressing Kid's Taco Spicy seasoned shredded chicken or ground beef, served with shredded lettuce, cheese, and sour cream Beverages Coke Sprite Lemonade Pineapple Juice Milk Seasonal Features Starting 2026 with a dry January? The Matador has got you covered. We’ve created a special menu featuring nothing but premium non-alcoholic spirits to kick off the new year. Starting 2026 with a dry January? The Matador has got you covered. We’ve created a special menu featuring nothing but premium non-alcoholic spirits to kick off the new year. SCRATCH MARGARITA Dhōs Blanco N/A tequila, Dhōs Orange N/A triple sec, fresh-muddled lime and orange, agave $12.5 MANGO-JALAPEÑO LIMEADE Dhōs Blanco N/A tequila, lime, mango, jalapeño, pineapple, Sprite $12.5 CRANBERRY PONCHE Dhōs Blanco N/A tequila, Dhōs Orange N/A triple sec, cranberry, pomegranate, hibiscus, tamarind, lemon, ginger, cinnamon, star anise, allspice, Sprite $13 Matador Margaritas *Contains Alcoholic* House* Lunazul Blanco, triple sec, lime, lemon, agave $12.5 Cadillac Lunazul Blanco, triple sec, lemon, lime, Grand Marnier $13.5 Smokey Ilegal Joven mezcal, triple sec, charred pineapple, lime, Tajin $14 Bartender's Olmeca Altos Reposado, triple sec, lime, lemon, agave, cranberry, Grand Marnier $14 Blood Orange Lalo Blanco, Solerno Blood Orange Liqueur, citrus, agave $15.5 Pineapple-Habanero Choose between Koch Elemental mezcal or Milagro Silver Triple sec, pineapple, lime, habanero, chile salt, Tajin $13.5 Dragonfruit* Olmeca Altos Reposado, triple sec, dragonfruit, lime, orange, spiced citrus sugar $14 Strawberry Mangonada* Corralejo Silver, triple sec, lime, mango, strawberry, lemon, chamoy, Tajin $14.5 Ginger-Orange Choose Código Blanco + Cointreau or Ilegal Joven mezcal + Solerno Blood Orange liqueur Ginger, orange, lime, spiced citrus sugar $15.5 Top Shelf Patrón Silver, Cointreau, lime, lemon, agave $16 Cucumber-Jalapeño Exotico Blanco, triple sec, cucumber, jalapeño, lemon, lime, agave, Tajin $13.5 Passionfruit Choose between Koch Elemental mezcal or Milagro Silver Passoã Passionfruit liqueur, lemon, lime, agave, chile salt $13.5 Gato Royalé Don Gato Blanco, Chambord, Spanish Cava, lime, lemon, agave, cranberry, spiced citrus sugar $16 Sangrias Spiced Red Burgundy, brandy, pisco, mango, ginger, orange, lemon, cinnamon $12.5 Spanish Rosé Spanish Rosé, Chablis, pineapple, orange, pisco, lime, cucumber, spice $12.5 Sparkling Strawberry Chablis, Spanish Cava, pisco, strawberry, pineapple, orange, hibiscus, spice $12.5 All tequilas and mezcals used in our cocktails are certified, 100% agave spirits. *Can be made as a non-alcoholic margarita using Dhōs N/A spirits. Every day 4pm to 6pm and 10pm to close $7 $8 $7 Romaine Salad Crispy Brussels Sprouts Black Bean Dip Fried Tacos (2) Chicken Tortilla Soup Quesadilla Cheese (no pico), Chicken, Carnitas, Chorizo, Ground Beef, or Beyond Picadillo, Steak* or Shrimp +2 $8 Grande Nachos Add chicken, Beyond Picadillo, House Chorizo, Carnitas, or Ground Beef $3.5 Marinated Steak* $5 Matador Guacamole Orange-habanero salsa Maya, tomatillo salsa, pico, queso fresco, cilantro Haba Prawns Steak* or Shrimp Tacos (2) Baja Fish Tacos (2) Queso Con Chorizo [gf] Melted three-cheese house blend, creamy habanero sauce, pico de gallo, cilantro, queso fresco Street Tacos Choice of: Chorizo, Beyond Picadillo, Ground Beef, Shredded Chicken, or Carnitas Three for $8, Five for $11 Allergy or dietary preference? Please ask your server! Allergy or dietary preference? Please ask your server! *Consuming raw or under-cooked food may increase your risk of food borne illness. Dessert Dessert Salted Caramel Brownie Bittersweet chocolate, salted dulce de leche, strawberry compote, vanilla ice cream $8 Fried Ice Cream Toasted coconut, whipped cream, reposado dulce de leche, cinnamon [gf] $8 Agave spirits, especially aged tequilas and mezcals, go great with dessert! Ask your server or bartender for a pairing suggestion. Bubbles Segura Viudas Brut Rosé Cava Pendés, Catalunya, Spain dry with well-balanced acidity; bright pink with fresh. intense strawberry, cherry, and a soft minerality $16 Freixenet Blanc De Blancs Brut Cava Penedès, Catalunya, Spain bright, creamy texture; crisp apple & light vanilla notes with velvety smooth bubbles and a clean, dry ﬁnish $13 | 48 Rosé & White Casillero Del Diablo Rosé Chile vibrantly fresh and crisp; sharp raspberry, strawberry, and floral aromas, red berry and stonefruit with firm acids $11 | 40 Trivento White Malbec Mendoza, Argentina crystal-clear and very light-bodied; apple and cherry on the nose with flavors of plum, red berry, tropical fruit, and subtle spice and earth on the clean, acidic finish $11 | 40 Ramón Bilbao Verdejo Rueda, Spain crisp, fresh, and aromatic; bright acid with ripe fruit, citrus, floral, and grass notes $12 | 44 Natura Sauvignon Blanc Central Valley, Chile light-bodied, fresh and bright, with vibrant and complex grapefruit, lime, herbs, and a well-balanced acidity $11 | 40 Josh Craftsman's Chardonnay North Coast, California gentle oak balanced with fresh, juicy tropical fruits, honey, ripe peach, and citrus flavors $12 | 44 Red Alamos Malbec Mendoza, Argentina deep concentrated plum, dark cherry and blackberry flavors; finishing with hints of brown spice and vanilla $11 | 40 Ontañón Natura Insolitós Tempranillo Rioja, Spain deep ruby color with a powerful bouquet of blackberry, blueberry, and sweet fig and full-bodied flavors of jammy black fruit, spice, smoke, and coffee with a strong, tannic, lingering finish $12 | 44 Josh Craftsman's Cabernet Sauvignon California full bodied with lush, dark fruit, cinnamon spice, light vanilla and toasty oak; long, soft tannic finish $13 | 48 Clos De Los Siete Blend, \"C7\" By Michel Rolland Mendoza, Argentina lush, fruit-forward plum, blackberry, and cherry with dark chocolate, ash, herbs, and oak; velvety tannins on a long, minerally finish $15 | 56 Browne Heritage Pinot Noir Williamette Valley, Oregon juicy, ripe fruit and berry notes with concentrated floral accents of violet and jasmine, citrus spice, rich loam and lingering, silky tannins $14 | 52 Top Shelf Tuesday A night to experiment Join us every Tuesday for 1/2 off all tequilas $16 and up, plus margarita specials featuring a rotating tequila each month! Join us every Tuesday for 1/2 off all tequilas $16 and up, plus margarita specials featuring a rotating tequila each month! Código Blanco Tequila of the Month, May 2024 Blanco (also called Silver, White, or Plata tequilas) Bottled either right from the still with no aging or allowed to brieﬂy mellow in stainless steel tanks for up to 60 days, blanco tequilas are fresh, bright, and agave forward. This expression is ideal when looking to experience the intense, pure aromas and ﬂavors of a tequila. Fruit & Citrus Crisp, hints of orange peel, grapefruit, pineapple, lemon Pepper & Spice Bold, hints of peppercorn, cinnamon, clove, long finish Earthy & Floral Clean, hints of herbs, clay, mint, fresh flowers, wood, licorice Fruit & Citrus Crisp, hints of orange peel, grapefruit, pineapple, lemon 1800 $10 Camarena $9 Chamucos $12 Chinaco $12 Cincoro $18 Clase Azul Plata $30 Don Julio $14 El Tequileño $9 El Tesoro $14 Fuenteseca Cosecha $28 Milagro $10 Milagro Select Barrel $14 Olmeca Altos Plata $9 Patrón $14 Patrón Gran Platinum $36 Siembra Azul $15 Teremana $11 Pepper & Spice Bold, hints of peppercorn, cinnamon, clove, long finish Casa Dragones $20 Casamigos $15 Centinela $11 Código $13 Don Fulano Fuerte $15 Don Ramon $11 El Mayor $10 Espolòn $10 Exotico $9 G4 $14 Gran Centenario $10 Grand Mayan $18 José Cuervo Reserva Platino $15 Lunazul $8 Siete Leguas $14 Terralta 110 $14 Earthy & Floral Clean, hints of herbs, clay, mint, fresh flowers, wood, licorice ArteNOM 1579 $15 Astral $14 Avión $12 Casa Noble $12 Cazadores $10 Cimmaron $9 Código \"Rosa\" $15 Corralejo $10 Don Fulano $14 Fortaleza $14 Fortaleza Still Strength $15 Herradura $14 Partida $14 Sauza Hornitos Plata $9 Siembra Valles $15 Tequila Ocho $14 Terralta $12 *House favorites Reposado (Rested tequilas) Aged between two months to one year in oak barrels, reposados show gentle amber colors and subtle, warm wood notes while still displaying some of the lighter characteristics of un-aged blancos. Honey & Caramel Hints of vanilla, chocolate, butter, toffee, cinnamon, toasted, sweet Smoke & Oak Hints of wood, agave, leather, heat, pepper Herbal & Floral Clean, hints of fresh cut grass, earthy, licorice, juniper, agave Honey & Caramel Hints of vanilla, chocolate, butter, toffee, cinnamon, toasted, sweet 1800 $10 Camarena $9 Campo Bravo $9 Casa Noble $12 Casamigos $16 Chinaco $14 Clase Azul $33 Código $15 Corralejo $10 Don Julio $14 Don Ramon $11 El Mayor $10 El Tequileño $10 Fortaleza $15 Hussongs $12 Milagro $10 Milagro Select Barrel $15 Smoke & Oak Hints of wood, agave, leather, heat, pepper Casa Dragones $32 Cazadores $10 Chamucos $14 Cincoro $22 Don Fulano $15 Grand Mayan $20 Herradura $14 Jose Cuervo Reserva de la Familia $20 Lobos $14 Olmeca Altos $9 Siete Leguas $14 Herbal & Floral Clean, hints of fresh cut grass, earthy, licorice, juniper, agave Arte NOM 1414 $15 Avión $14 Centinela $12 Cimmaron $9 El Tesoro $15 Espolòn $10 G4 $14 Gran Centenario $11 La Gritona $12 Partida $14 Patrón $14 Sauza Hornitos $9 Tequila Ocho $14 Teremana $11 *House favorites Añejo (Aged tequilas) Aged for one to three years in smaller oak barrels, which produces darker colors and smoother, complex flavors with strong wood influences. An excellent alternative to traditional whiskeys or cognacs. Vanilla & Toffee Hints of caramel, almond, warm, buttery, toasted Cinnamon & Spice Hints of peppercorn, orange peels, spice, chile pepper, heat Nutty & Smokey Hints of oak, wood, brandy, earthy, fruit, cocoa, suede Vanilla & Toffee Hints of caramel, almond, warm, buttery, toasted Avión $14 Casa Noble $14 Casamigos $17 Centinela $14 Chinaco $18 Cincoro $30 Don Julio $15 Don Julio 1942 $34 El Mayor $11 Herradura $15 Herradura Legend $30 Milagro $12 Milagro Select Barrel $22 Partida $15 Sauza Hornitos $10 Sauza Hornitos Black $11 Teremana $13 Cinnamon & Spice Hints of peppercorn, orange peels, spice, chile pepper, heat 1800 $12 Casa Dragones $35 Cazadores $11 Clase Azul $95 Código $28 Corralejo $12 Don Fulano $20 Fortaleza $20 Gran Centenatio $11 Patrón $16 Nutty & Smokey Hints of oak, wood, brandy, earthy, fruit, cocoa, suede Arte NOM 1146 $20 Camarena $10 Chamucos $14 Don Ramon $12 El Tesoro $20 Espolon $12 Grand Mayan $24 Siete Leguas $15 Tequila Ocho $18 *House favorites Extra Añejo Aged for at least three years in oak barrels no larger than 600 liters, extra añejos are incredibly rich and concentrated with heavy, almost syrupy flavors and intense wood notes. 1800 Milenio $45 Avión Reserva 44 $30 Cazadores $16 Centinela Tres Años $29 Cincoro $280 Clase Azul Ultra $300 Código Origen $60 Corralejo $30 Don Fulano Imperial $37 El Mayor $20 G4 $30 Gran Centenario Leyenda $30 Grand Mayan Ultra $40 Herradura Selección Suprema $62 Jose Cuervo Reserva de la Familia $34 Partida Elegante $75 Patrón $20 Patrón Gran Burdeos $85 Patrón Piedra $67 Rey Sol $55 Tears of Llorona $55 Tequila Ocho $38 Mezcal Made from a variety of different agaves and usually produced by fire-roasting piñas in underground pits, giving mezcals the smokiness they are known for. Mezcals are an older and more traditional form of agave spirit and tend to have stronger, more intense flavor profiles than tequilas. Approachable For the beginners. Espadín and other milder agaves produce mezcals with gentle charred agave sweetness, moderate citrus, tropical fruit, burnt hardwoods, and earth. Exotic For the curious. Wild-harvested agaves and single village bottlings have very unique flavor profiles and strongly express their terroir, producing varied notes of vegetation, earth, mineral, fruits, citrus, spice and herbs. Artisanal For the bold. Rare agaves and traditional production techniques produce incredibly complex mezcals with a wide array of pungent aromas and intense flavors. Approachable For the beginners. Espadín and other milder agaves produce mezcals with gentle charred agave sweetness, moderate citrus, tropical fruit, burnt hardwoods, and earth. 400 Conejos Joven $9 Casamigos Joven $16 Del Maguey Chichicapa $16 Del Maguey Vida $11 Fidencio Clássico $12 Ilegal Joven $14 Ilegal Reposado $15 Meteoro Espadín $12 Montelobos Espadín $12 Sombra $12 Exotic For the curious. Wild-harvested agaves and single village bottlings have very unique flavor profiles and strongly express their terroir, producing varied notes of vegetation, earth, mineral, fruits, citrus, spice and herbs. 400 Conejos Espadín, Cuishe $14 400 Conejos Espadín, Tobala $14 Banhez Espadín y Barril $11 Bozal Cuixe $15 Bozal Tobaische $15 Del Maguey Minero $16 Del Maguey Vida de Muertos $14 Koch Espadín San Baltazar Guélavila $15 Nuestra Soledad San Luis del Rio $14 Yola Espadín, Madrecuixe $15 Artisanal For the bold. Rare agaves and traditional production techniques produce incredibly complex mezcals with a wide array of pungent aromas and intense flavors. Bozal Coyote Ancestral Reserva $24 Bozal Pechuga Sacrificio $20 Código Ancestral Paplomé $33 Del Maguey Tobala $29 Real Minero Pechuga $37 Other Juice There are many other types of spirits besides tequila and mezcal that can be made from a variety of agaves and related species. These spirits can exhibit a wide array of exotic aromas and flavors. Other Juice There are many other types of spirits besides tequila and mezcal that can be made from a variety of agaves and related species. These spirits can exhibit a wide array of exotic aromas and flavors. Balam Raicilla Madurado Flor de Desierto Sotol Sierra La Higuera Wheeleri Sotol Pizcadores Bancanora Joven & Cristalino 100% agave Jovens are blancos blended with small amounts of reposados or añejos so that the intense agave notes found in a blanco are balanced by the deeper notes of an aged tequila. Cristalinos are aged tequilas that have been filtered to remove colors and heavier wood notes that come from barrel-aging, resulting in a tequila with the complexity of an añejo but with the bright notes and color of a blanco. Joven & Cristalino 100% agave Jovens are blancos blended with small amounts of reposados or añejos so that the intense agave notes found in a blanco are balanced by the deeper notes of an aged tequila. Cristalinos are aged tequilas that have been filtered to remove colors and heavier wood notes that come from barrel-aging, resulting in a tequila with the complexity of an añejo but with the bright notes and color of a blanco. 1800 $15 Avión Reserva $30 Casa Dragones Joven $68 Cazadores $12 Clase Azul Joven Gold $65 Don Julio 70th Anniversary $18 Espolón $18 Gran Centenario $20 Herradura Ultra $15 Lobos Joven $14 Maestro Dobel 50 $30 Partida $15 House Flights Try one of our curated \"expression\" flights as shown below or ask your server about a blanco, reposado, and añejo \"familia.\" Mezcal Ilegal Joven / Banhez Espadín y Barril / Del Maguey Vida de Muertos Classic Espadín notes of clean agave, citrus, & light smoke / Floral, fruity blend of Espadín & Barril agaves with balanced spice and citrus / Special high-proof, single-village expression with deep vegetal and citrus tones. $18 Blanco Blanco tequilas are the perfect way to taste and experience the terrior of a tequila - the effects that different growing regions have on agave fruit and the spirits made from them. Blanco I - El Valle Código / Partida / Jose Cuervo Reserva de la Familia Tequilas from \"the Valley\" tend to be a bit bolder and assertive, with earthy, vegetal, spicy, and herbal flavors $20 Blanco II - Los Altos Siete Leguas / El Tesoro / Patrón Tequilas from \"the Highlands\" tend to be somewhat sweeter and softer, with more tropical fruit, ﬂoral, and mineral notes $20 Reposado Milagro Select Barrel / Don Julio / Casamigos Single barrel expression with light oak, spice, & caramel / Mellow oak, vanilla, fruit, & smoke / Full-bodied agave expression, deep caramel & wood sugars $21 Añejo El Mayor / Gran Centenario / Herradura Soft, sweet, & buttery roasted agave / Honey-spiced rich, toasted oak / Deep roasted fruit, cocoa, wood, & vanilla $18 Extra Añejo Corralejo / Avión 44 / Jose Cuervo Reserva de la Familia Lush, intense fruit, caramel, & oak / Custom \"petite\" cask aging; rich & silky / Complex, rich, & nuanced private family reserve $45 El Presidente Centenario Leyenda / Herradura Selección Suprema / Partida Elegante Aged in French Limousin Oak; warm & velvety balance of vanilla, agave, & dark spice / Rich & ﬂoral with complex fruit & agave. Long ﬁnish of creamy, toasted oak / Deep wood, caramel, pepper, cocoa, & honey; elegant & reﬁned $80 Cristalino Herradura Ultra / Don Julio 70th Anniversary / Avión Reserva Dark vanilla, birthday cake, & dried fruit / Light oak, baking spice, & light vanilla-honey / Caramel, cinnamon, hints of mineral, citrus, & toasted nuts $30 Cocktails Matador Favorites Mezcalerita Koch Elemental Espadín, triple sec, orange, lemon, lime, agave, orange bitters, Tajin $13 Oaxacan Old Fashioned Ilegal Joven, aromatic bitters, agave, orange peel $15 Ancho Paloma Rosaluna Joven, Ancho Reyes Chile liqueur, lime, grapefruit, Squirt, sal de gusano $13.5 Pineapple-Habanero Margarita Koch Elemental Espadín, triple sec, pineapple, lime, habanero, chile salt, Tajin $13.5 Mezcal Negra Rosaluna Joven, Averna, orange bitters, cherry $15 Ginger-Orange Margarita Ilegal Joven, Solerno Blood Orange liqueur, ginger, orange, lime, spiced citrus sugar $15.5 Pineapple Mule Koch Elemental Espadín, grilled pineapple, ginger-orange syrup, lime, soda, served in a copper mug $13 Smokey Margarita Ilegal Joven, triple sec, charred pineapple, lime, Tajin $14 Chile Mango Margarita Rosaluna Joven, Ancho Reyes Chile liqueur, mango, agave, lime, spiced citrus sugar $15 Passionfruit Margaritas Koch Elemental Espadín, Passoã Passionfruit liqueur, lemon, lime, agave, chile salt $13.5 Bee Sting Ilegal Joven, honey, lemon, ancho chile $14 Mezcal Michelada Dos XX lager, Koch Elemental Espadín, spicy tomato, tamarind, lime, celery bitters, Tajin $12 Matador Favorites House* Lunazul Blanco, triple sec, lime, lemon, agave $12.5 Cadillac Lunazul Blanco, triple sec, lime, lemon, agave, Grand Marnier $13.5 Bartender's Olmeca Altos Reposado, triple sec, lime, lemon, agave, cranberry, Grand Marnier $14 Top Shelf Patrón Silver, Cointreau, lime, lemon, agave $16 Blood Orange Lalo Blanco, Solerno Blood Orange liqueur, citrus, agave $15.5 Cucumber-Jalapeńo Exotico Blanco, triple sec, cucumber, jalapeño, lemon, lime, agave, Tajin $13.5 FOOD Menu Menu Chips & Salsa (gf/veg) Freshly fried corn tortillas, house-roasted tomato salsa $4 Matador Guacamole (gf/veg) Orange-habanero salsa Maya, tomatillo salsa, pico, queso fresco, cilantro, fried corn tortillas $11 Dip Flight (gf/veg) Creamy three-cheese queso, fresh guacamole, and hearty black bean dip $15 Bacon Cheeseburger* Charbroiled steak burger, arugula, pico de gallo, bacon, French fried onions, Jack & cheddar cheeses, chipotle mayo, chipotle-garlic $17 Sauteed Prawns (gf) Roasted garlic & jalapeño polenta, hibiscus- pickled onion, cilantro Choice of sauce: Garlic-chile butter, poblano crema, fiery habanero $14 Baja Fish Tacos Panko crusted and fried mahi mahi, serrano slaw, guacamole, chipotle mayo, radish, cilantro, lime $11 Taco Flight Three large tacos on flour tortillas Shredded chicken, carnitas, and beef picadillo tacos topped with serrano slaw, tomatillo salsa, pico de gallo, garlic crema, cotija cheese $17 Flights Beginner I Ilegal Joven / Banhez Artesanal / Del Maguey Vida Puebla Classic Espadín notes of clean agave, citrus, & light smoke / Floral, fruity blend of Espadín & Barril agaves with balanced spice and citrus / Single-village expression from the base of the volcano Popocatépetl; green herb & vegetal notes with savory roasted agave $16 Beginner II Nuestra Soledad San Luis del Rio / Koch Espadín San Baltazar Guélavila / Don Amado Rustico High-mountain, single-village Espadín; balanced agave, mineral, citrus / From the Tlacolula district in the Valles Centrales region; subtle mineral, fruit, herbs, & brine / Clay pot-distilled Espadín from Santa Catarina Minas; deep, warm, floral $20 Advance I Real Minero Largo / Mezcales de Leyenda Guerrero / Tileño Tepextate Rare, wild agave from the Karwinskii family; sharp fruit, chocolate, dry ash & smoke / Cupreata agave wild-harvested from high-altitude oak forests; complex tropical & citrus notes with subtle spice / Seldom-distilled 25-year-old wild agave; deep fruit, intense mineral, spice & citrus $36 Advanced II Bozal Chino Verde Ancestral Reserva / Mezcales de Leyenda Durrango / Del Maguey Pechuga Rare agave foraged from the Sierra Madre del Sur mountains; pronounced herb and smoke, charred wood & desert soil / High-altitude desert maguey Cenizo; buttery, intense, exotic fruit, earth & clay / Espadín clay pot-distilled with chicken breast & wild-mountain apples, bananas, pineapples, & plums $41 Aficionada Chacolo Ixtero Amarillo / C ódigo Ancestral Papalomé / Coyote Sotol Vibora Maguey Ixtero Amarillo milled by hand with axes, naturally fermented in wooden tinas, and distilled in a Filipino still made of copper and a hollowed out tree trunk; creamy but dry, aggresive herbs, spice, salinity, & tropical fruit / Tobala agaves harvested from sub-tropical forests in mountain canyons & fermented in leather tanks; rustic & raw, intensely floral, aromatic, vegetal, & sweet / Pechuga-style Sotol distilled with rattlesnake meat & rattlesnake venom before a 2-month aging; savory & full-bodied with powerful mineral, herb, & salinity $41 Mezcal Made from a variety of different agaves and usually produced by fire-roasting piñas in underground pits, giving mezcals the smokiness they are known for. Mezcals are an older and more traditional form of agave spirit and tend to have stronger, more intense flavor profiles than tequilas. Approachable For the beginners. Espadín and other milder agaves produce mezcals with gentle charred agave sweetness, moderate citrus, tropical fruit, burnt hardwoods, and earth. Advanced For the curious. Wild-harvested agaves and single village bottlings have very unique flavor profiles and strongly express their terroir, producing varied notes of vegetation, earth, mineral, fruits, citrus, spice, and herbs. Exotic For the bold. Rare agaves and ancestral production techniques produce incredibly complex mezcals with a wide array of pungent aromas and intense flavors. Approachable For the beginners. Espadín and other milder agaves produce mezcals with gentle charred agave sweetness, moderate citrus, tropical fruit, burnt hardwoods, and earth. 400 Conejos Joven $10 Banhez Espadín y Barril $10 Casamigos Joven $16 Del Maguey Chichicapa $18 Del Maguey Vida $12 Del Maguey Vida Puebla $11 Fidencio Clásico $13 Ilegal Joven $13 Ilegal Reposado $15 Montelobos Espadín $12 Siete Misterios Doba-Yej $11 Sombra $12 Tileño Espadín $16 Union $11 Advanced For the curious. Wild-harvested agaves and single village bottlings have very unique flavor profiles and strongly express their terroir, producing varied notes of vegetation, earth, mineral, fruits, citrus, spice, and herbs. 400 Conejos Espadín y Cuishe $14 400 Conejos Espadín y Tobala $14 Bozal Cuixe $15 Bozal Tepeztate $16 Bozal Tobasiche $16 Del Maguey Minero $16 Del Maguey Santo Domingo Albarradas $16 Del Maguey Vida de Muertos $14 Derrumbes San Luis Potosi $15 Don Amado Rustico $15 Ilegal Añejo $25 Koch Espadín San Baltazar Guélavila $16 Los Nahuales Joven Mezcales De Leyenda Durango $20 Mezcales De Leyenda Guerrero $20 Mezcales De Leyenda Oaxaca $18 Nuestra Soledad Lachigui $14 Nuestra Soledad San Baltazar $14 Nuestra Soledad San Luis del Rio $14 Real Minero Barril $32 Real Minero Espadín $28 Real Minero Largo $32 Siete Misterios Espadín y Tepeztate $22 Siete Misterios Espadín y Tobala $24 Yola Espadín, Madrecuixe $15 Exotic For the bold. Rare agaves and ancestral production techniques produce incredibly complex mezcals with a wide array of pungent aromas and intense flavors. Banhez Pechuga $22 Banhez Tepeztate $22 Banhez Tobala $24 Bozal Borrego Sacrificio $26 Bozal Chino Verde Ancestral Reserva $26 Bozal Coyote Ancestral Reserva $26 Bozal Pechuga Sacrificio $24 Código Ancestral Papalomé $35 Del Maguey Pechuga $40 Del Maguey Tobala $29 Fidencio Pechuga $20 Derrumbes San Luis Potosi $12 Lost Explorer Tobala $29 Montelobos Pechuga $28 Montelobos Tobala $24 Real Minero Pechuga $38 Rey Campero Jabali $26 Scorpion 5 year $34 Siete Misterios Coyote $32 Siete Misterios Pechuga $55 Tileño Tepextate $25 Tileño Tobala $20 *House favorites OTHER JUICE There are many other types of spirits besides tequila and mezcal that can be made from a variety of agaves and related species. These spirits can exhibit a wide array of exotic aromas and flavors. OTHER JUICE There are many other types of spirits besides tequila and mezcal that can be made from a variety of agaves and related species. These spirits can exhibit a wide array of exotic aromas and flavors. Balam Raicilla Madurado $16 Chacolo Ixtero Amarillo $29 Coyote Sotol Vibora $20 Flor de Desierto Sotol Cascabel $20 Flor de Desierto Sotol Sierra $15 La Higuera Wheeleri Sotol $12 Pizcadores Bancanora $15 Pizcadores Raicilla $15 Rancho Tepúa Bacanora $16 Siempre Sotol $12 When you visit the Site, we automatically collect certain information about your device, including information about your web browser, IP address, time zone, and some of the cookies that are installed on your device. Privacy Policy Ok. I Agree",
      "hash": "a2cd64dbc8b1",
      "downloadedAt": "2026-01-18T16:54:36.241Z",
      "trimmedAt": "2026-01-18T17:04:52.542Z",
      "sizeReduction": "93.0%"
    },
    {
      "url": "https://www.matadorrestaurants.com/private-events?venue=charleston-event-spaces-charleston#private-events-form",
      "text": "Private Events Tucked away from the crowd, the Matador offers several unique private spaces for you and your group. We’ll help you with all the details for a perfect event, whether you’re planning a gathering of friends and family, a business luncheon, a professional workshop, or even a tequila tasting seminar. We have many wonderful options in the Seattle, Portland, Boise and South Carolina areas. See the venues available near you, and inquire about hosting your event with us! Mezcaleria & Ballroom • Ballard (Seattle, WA) 5410 Ballard Ave NW, Seattle, WA 98107 | (206) 297-2855 Whether you’re planning a private dinner with friends, a surprise birthday party for your loved ones or a meeting luncheon with AV capability, Ballard has the perfect space for you. The Ballroom and the Mezcaleria each offer their own unique style and amenities, providing the perfect backdrop for any occasion from meetings to celebrations. Choose from our many customized menus for sit-down dinners and buffet-style entertaining. We provide one or more servers for every gathering, so you can relax and enjoy the company of your guests, our delicious food and drinks, and the intimate, exciting and fun atmosphere of our Ballard location. BOOK WITH US ON TRIPLESEAT Book Mezcaleria & Ballroom, Ballard Charleston Event Spaces • Charleston, SC 235 Meeting St, Charleston, SC 29401 | (843)-789-4747 The Matador Charleston is the perfect place to host your next event, no matter the size or type. With our unique atmosphere and versatile event spaces, we can help you create a memorable and enjoyable experience for your guests. Our spaces can accommodate groups of all sizes, from intimate gatherings to large corporate parties. We offer a private bar, an outdoor patio, catering, and TVs to ensure that your event has everything you need. From appetizers and entrees to desserts and drinks, we offer a wide range of customizable menu options to suit any need or budget. Whether you're planning a small gathering or a large-scale event, we can work with you to create a food and beverage menu that your guests will love. We also happily work with any dietary preferences or restrictions you may have so that everyone can enjoy. We look forward to helping you create a truly unforgettable event at The Matador Charleston! BOOK WITH US ON TRIPLESEAT Book Charleston Event Spaces, Charleston The Añejo Room • Portland, OR 1438 NW 23rd Ave, Portland, OR 97210 | 503-228-2855 Whether you’re planning a private dinner with friends, a surprise birthday party for your loved ones, or a meeting luncheon--NW Matador has the perfect space for you. Our room can accommodate up to 30 guests, and when the weather is right, the large garage door opens to create a beautiful indoor-outdoor experience. Choose from our many customized menus for sit-down dinners and buffet-style entertaining. We provide one or more servers for every gathering, so you can relax and enjoy the company of your guests, our delicious food and drinks, and the intimate, exciting and fun atmosphere of our NW 23rd Avenue location. Please note that we are unable to rent out the Añejo room for dinner on Fridays and Saturdays. Book The Añejo Room, NW Portland The Blanco Room • Portland, OR 2424 E Burnside St. Portland, OR 97214 | 503-719-5757 Whether you’re planning a business meeting, celebration, or a surprise event, our private party room in East Portland is a comfortable venue for hosting up to 35 guests, ages 21 and over. Easily accessible for those with physical limitations, this modern, romantic space is an extension of our restaurant’s intimate, yet casual atmosphere. For an indoor-outdoor feel, the room’s large window installations can be opened like a garage door, giving your guests access to the side patio. Whether you prefer sit-down or buffet-style service, our staff is happy to help you plan every detail, from special bar items or individually ordered beverages, to appetizer, entree and dessert options curated by our house chef. Book The Blanco Room, East Portland The Mezzanine • Meridian, ID 3690 E Monarch Sky Ln #140, Meridian, ID 83646 | 208-893-6120 The Casa Del Matador in The Village at Meridian invites you to hold your gathering in a private Mezzanine space, up above the dining area and bar. Artisan-forged metal dividers, Spanish-style wallpaper, brickwork and handcrafted tables define this unique room, illuminated by flickering candlelight through hand-wrought sconces. An ideal venue for business meetings, parties, celebrations, and events of any kind, the mezzanine is above expectations, offering a very special point of view. Enjoy the openness and the view over the restaurant, or draw the curtains and revel in your privacy. Book The Mezzanine, Meridian Reposado Room • Portland, OR 4111 N Williams Ave, Portland, OR 97217 | (503) 841-6326 The North Williams location is sophisticated, yet casual and welcoming: the warm open fire pits, heavy red velvet drapes, candlelight, and handmade woodwork all make for a unique and comforting ambiance. This spacious room can be arranged to your liking and has the option of being closed off to provide a private setting or left open for a more casual gathering. The room is equipped with a high-definition television that can be turned to the channel of your choice. The Matador is ideal for your next corporate offsite meeting, wedding rehearsal dinner, birthday, sporting event party or any other occasion. Come join us and make your next party one to remember! Book Reposado Room, North Portland Book an Event Location* Please Select Mezcaleria & Ballroom (Ballard) Charleston Event Spaces (Charleston) The Añejo Room (NW Portland) The Blanco Room (East Portland) The Mezzanine (Meridian) Reposado Room (North Portland) Date of Event* Start Time Please Select 10:00 AM 10:30 AM 11:00 AM 11:30 AM 12:00 PM 12:30 PM 1:00 PM 1:30 PM 2:00 PM 2:30 PM 3:00 PM 3:30 PM 4:00 PM 4:30 PM 5:00 PM 5:30 PM 6:00 PM 6:30 PM 7:00 PM 7:30 PM 8:00 PM 8:30 PM 9:00 PM 9:30 PM 10:00 PM 10:30 PM 11:00 PM 11:30 PM 12:00 AM 12:30 AM 1:00 AM 1:30 AM End Time Please Select 10:00 AM 10:30 AM 11:00 AM 11:30 AM 12:00 PM 12:30 PM 1:00 PM 1:30 PM 2:00 PM 2:30 PM 3:00 PM 3:30 PM 4:00 PM 4:30 PM 5:00 PM 5:30 PM 6:00 PM 6:30 PM 7:00 PM 7:30 PM 8:00 PM 8:30 PM 9:00 PM 9:30 PM 10:00 PM 10:30 PM 11:00 PM 11:30 PM 12:00 AM 12:30 AM 1:00 AM 1:30 AM First Name* Last Name* Email* Company Phone Number* Extension Nature of Event Please Select Birthday Party Wedding Related Business Dinner/Lunch Presentation Other Style of Event Please Select Sit Down Dining Standup Cocktail Other Preferred Method of Communication Please Select Telephone Email Number of Guests (Max ) 60 Notes and Requests When you visit the Site, we automatically collect certain information about your device, including information about your web browser, IP address, time zone, and some of the cookies that are installed on your device. Privacy Policy Ok. I Agree",
      "hash": "a3952ca95c86",
      "downloadedAt": "2026-01-18T16:54:38.469Z",
      "trimmedAt": "2026-01-18T17:04:52.555Z",
      "sizeReduction": "91.7%"
    },
    {
      "url": "https://www.matadorrestaurants.com/menus/charleston/cocktails",
      "text": "More Menus Cocktails Main Menu Cocktails Happy Hour Dessert Wine Tequila Mezcaleria Cocktails Seasonal Features MIX & MATCH Available Monday to Friday, 11am - 3pm. Soup, choice of salad, and choice of entrée for $16! Seasonal Features PAPAS CON RAJAS veg/gf Fried chipotle-seasoned potato wedges, roasted poblano, fire-roasted corn, Monterey Jack cheese, avocado crema, molcajete salsa $9.5 SEARED AHI TUNA gf Tamari ponzu, guacamole, shaved serrano, chile seasoning, sesame seeds, fried corn tostadas $15 GRILLED CHICKEN LETTUCE WRAPS gf Butter lettuce, orange-agave marinated chicken, slaw, cucumber, avocado, molcajete salsa, queso fresco $13.5/18 *CHICKEN CHIMICHANGAS Two crispy fried chimichangas, braised chicken, black bean queso, Monterey Jack & cheddar cheeses, shredded lettuce, pico de gallo, avocado crema Served with choice of house-made enchilada sauce and Mexican rice Add a third Chimichanga +$6 *For every order of this entree, we'll donate $1 to St. Jude Children’s Research Hospital $19.5 MIX & MATCH Available Monday to Friday, 11am - 3pm. Soup, choice of salad, and choice of entrée for $16! CHOOSE YOUR SALAD Romain Salad Cilantro-pepita dressing, toasted pepitas, pico de gallo, cotija, lime House Salad Baby spring mixed green, blistered tomato and roasted pepper relish, hibiscus-pickled onion, cucumber, tajin, choice of dressing CHOOSE YOUR ENTRÉE Proteins: Chicken, Carnitas, Beyond Picadillo Add guacamole and cilantro-lime sour cream $3 Taco Serrano slaw, tomatillo salsa, garlic crema, pico de gallo, cotija Burrito Mexican rice and beans, Jack & cheddar cheeses Served divorciadas style with verde and roja sauces Quesadilla Monterey Jack cheese, pico de gallo, garlic crema, toasted pepitas, cilantro SOUP Chicken Tortilla Roasted chicken, fire-roasted corn, avocado, tortilla strips, cotija, cilantro Snacks Starters Snacks Dip Flight Creamy three-cheese queso, fresh guacamole, and hearty black bean dip [gf/v] $16 Matador Guacamole Orange-habanero salsa Maya, tomatillo salsa, pico, queso fresco, cilantro [gf] $12 Black Bean Dip Black beans, habanero, garlic crema, tomatillo salsa, green onion [gf/v] $10.5 Queso Con Chorizo Melted three-cheese house blend, creamy habanero sauce, pico de gallo, cilantro, queso fresco [gf] $12 Crispy Brussels Sprouts Fried brussels sprouts, peppers & onions, lime, agave, cotija [gf/v] $12 Fried Tacos Crispy fried corn tortillas, shredded chicken, black bean queso, shredded lettuce, pico de gallo, serrano vinaigrette, salsa Maya, chimichurri mayo $11.5 Street Tacos White onion, cilantro, housemade salsa, radish, cotija, and lime on corn tortillas [gf]: Carnitas, House Chorizo, Beyond Picadillo, Ground Beef or Shredded Chicken 3 for $11 5 for $16.5 Boulevard Style [add guacamole and pico de gallo] $3.5 Starters Grilled Stuffed Jalapeños Goat Cheese, smoked bacon, ranch dressing [gf] $14.5 Quesabirria Three corn tortillas, Monterey Jack cheese, roasted poblanos, beef birria, onions, cilantro, birria jus [gf] $16 Haba Prawns Fiery roasted habanero sauce, roasted garlic & jalapeño polenta, hibiscus-pickled onion, cilantro $15 Crispy Coconut Shrimp Shredded coconut, chile-flour batter, pickled jalapeño and Fresno chiles, salsa verde, chipotle ranch $14.5 Grande Nachos Cheddar, Monterey Jack, black beans, pico de gallo, guacamole, cilantro-lime sour cream [gf] $13.5 Add Shredded Chicken, Carnitas, House Chorizo, Ground Beef, or Beyond Picadillo $3.5 Add Marinated Steak* $6 Matador Quesadilla Monterey Jack, pico de gallo, garlic crema, toasted pepitas, guacamole, cilantro-lime sour cream Cheese (plain - no crema, pepitas, pico de gallo) $11.5 Shredded Chicken, Carnitas, House Chorizo, or Ground Beef $13.5 Carne Asada*, Shrimp, or Beyond Picadillo $14.5 Ahi Tuna Tostadas* Agave ponzu sauce, avocado, chipotle mayo, green onion, finishing salt [gf] $15 Soups & Salads Add to any salad: Grilled Chicken $5, Marinated Steak* $7, Sautéed Shrimp $6, or Mahi Mahi Fillet $8 Sandwiches All Sandwiches and wraps are served with chipotle-garlic salt seasoned French fries Soups & Salads Add to any salad: Grilled Chicken $5, Marinated Steak* $7, Sautéed Shrimp $6, or Mahi Mahi Fillet $8 Tortilla Chicken Soup Roasted chicken, fire-roasted corn, avocado, tortilla strips, cotija, cilantro [gf] $10 bowl, $6 cup Romaine Salad Cilantro-pepita dressing, toasted pepitas, pico de gallo, cotija, lime [gf/veg] $9.5 Chop Salad Fire-roasted corn, red bell pepper, Mexican black beans, pico de gallo, romaine lettuce, green and red cabbages, fried tortilla strips, chipotle ranch Chile-Sauteed Shrimp or Marinated Chicken Breast $18.5 Taco Salad Black beans, Monterey Jack, cotija, shredded lettuce, guacamole, pico de gallo, cilantro-lime sour cream, serrano vinaigrette, garlic crema, jalapeños en escabeche Choose from: Carnitas, Shredded Chicken, House Chorizo, or Ground Beef $16 Grilled Chicken Breast, Shrimp, or Beyond Picadillo $17.5 Grilled Steak* $20 Sandwiches All Sandwiches and wraps are served with chipotle-garlic salt seasoned French fries Carne Asada Sandwich* Grilled marinated steak*, French fried onions, serrano slaw, roasted poblano, pico de gallo, chimichurri mayo $19.5 Wagyu Bacon Cheeseburger* Mixed greens, pico de gallo, bacon, French fried onions, Jack & cheddar cheeses, chipotle mayo $18 Agave Chicken Wrap Agave-marinated chicken breast, bacon, avocado, cilantro-pepita dressing, pico de gallo, shredded lettuce, serrano vinaigrette, cotija $17 Matador Bowl Mexican black beans & rice, cheese blend, serrano slaw, pico de gallo, guacamole, radish, tortilla strips Choice of: roja, verde, habanero, or poblano crema Braised Chicken, Carnitas, Chorizo, Ground Beef, or Southwest Veg {gf} $17 Grilled Chicken, or Beyond Picadillo $18.5 Gaucho Bowl Sautéed peppers & onions, Mexican black beans & rice, Jack & cheddar cheeses, shredded lettuce, pico de gallo, guacamole, cilantro-lime sour cream, French fried onions Grilled Chicken or Sautéed Shrimp $20.5 Grilled Marinated Steak $21.5 Specialty Tacos Two tacos on flour tortillas with Mexican black beans and rice Add a third taco $6 Tacos Two tacos on flour or corn tortillas with Mexican black beans and rice Add a third taco $4 Specialty Tacos Two tacos on flour tortillas with Mexican black beans and rice Add a third taco $6 Baja Fish Tacos Panko-crusted and fried Mahi Mahi, serrano slaw, guacamole, chipotle mayo, radish, cilantro, lime $21 Coconut Shrimp Tacos Crispy coconut-breaded shrimp, mango-pineapple salsa, pico, cilantro-lime sour cream, serrano slaw, on flour tortillas $20 Mango Steak Tacos Grilled carne asada*, mango-pineapple salsa, serrano slaw, guajillo-chile sauce, Tajin $22 Ribeye Tacos Grilled ribeye, French fried onions, chimicurri mayo, avocado, grilled red pepper, cotija $22.5 Tacos Two tacos on flour or corn tortillas with Mexican black beans and rice Add a third taco $4 Topped with shredded lettuce, guajillo chile sauce, pico de gallo, garlic crema: Marinated Carne Asada* $19.5 Shredded Chicken Thigh $17 Beyond Picadillo $18.5 --- Topped with tomatillo salsa, pico de gallo, garlic crema, cotija cheese: Braised Pork Carnitas $17 Chile Sautéed Shrimp $18.5 Grilled Chicken Breast $17.5 Enchiladas Two enchiladas with Monterey Jack, pico de gallo, guacamole, cilantro-lime sour cream, Mexican black beans & rice Add a third enchilada $4 Enchiladas Two enchiladas with Monterey Jack, pico de gallo, guacamole, cilantro-lime sour cream, Mexican black beans & rice Add a third enchilada $4 Divorciadas Mild sweet and tangy salsa verde, medium smoky salsa roja, slow braised chicken thigh, corn tortillas [gf] Habanero Fiery hot habanero salsa, shredded chicken, flour tortillas Shredded Beef Medium and smoky salsa roja, shredded braised beef birria, flour tortillas Verde Carnitas Medium sweet and tangy salsa verde, braised carnitas, corn tortillas [gf] Burritos Flour tortilla filled with Mexican black beans & rice, Jack and cheddar cheeses, and sides of serrano slaw, pico de gallo, guacamole, cilantro-lime sour cream, garlic crema Cali style – add French fries, avocado, and hot sauce $3 Flour tortilla filled with Mexican black beans & rice, Jack and cheddar cheeses, and sides of serrano slaw, pico de gallo, guacamole, cilantro-lime sour cream, garlic crema Cali style – add French fries, avocado, and hot sauce $3 Poblano Carnitas Braised carnitas, rich and mild crema salsa Habanero Steak Grilled marinated steak*, picante habanero sauce Verde Chicken Braised chicken, chile verde sauce Beyond Burrito Plant-based protein, medium and smoky salsa roja, caramelized onions, roasted poblanos [v] Entrées Braised Carnitas Pork shoulder, guacamole, cilantro-lime sour cream, pico de gallo, pickled onions, salsa Maya, Mexican black beans & rice Choice of flour or corn tortillas $22.5 Skillet Seared Fajitas Sautéed peppers & onions, Mexican black beans, Jack & cheddar cheeses, romaine, pico de gallo, guacamole, cilantro-lime sour cream, flour or corn tortillas Choose from: Marinated Carne Asada* $31 Marinated Chicken Breast or Shrimp $27 Chile-Seasoned Ribeye* $32 Shrimp & Chorizo Paella Shrimp, house chorizo, sautéed fajita peppers, achiote-chile rice, saffron [gf] $23.5 Grilled Carne Asada* Street corn & leeks, grilled peppers, cotija, cilantro, Mexican black beans & rice [gf] Marinated Carne Asada* $30.5 Chile-Seasoned Ribeye* $31.5 Surf & Turf: Add habanero, Chile-garlic or poblano shrimp $5 additional Mango-Pineapple Mahi Mahi Chunky mango & pineapple salsa, fruity salsa verde, serrano slaw, chile-achiote rice, cilantro, lime $24 Roasted Chile Rellenos Poblanos stuffed with Mexican rice, Monterey Jack cheese, and tomatillo salsa, served with Mexican black beans, poblano crema, garlic crema, pico de gallo, and tortilla strips Shredded Chicken, Carnitas, or Beyond picadillo [gf] $23.5 *These items are served raw or undercooked, or contain (or may contain) raw or undercooked ingredients. Thoroughly cooking food or animal origin, including but no limited to beef, eggs, fish, lamb, milk, poultry or shellstock reduces the risk of food borne illness. Young children, the elderly and individuals with certain health conditions may be at a higher risk if these foods are consumed raw or undercooked. Kids Menu Available until 9pm, ages 12 and under. Includes entree and beverage for $9, add ice cream for $3 Entrées Served with choice of fries or rice Beverages Entrées Served with choice of fries or rice Cheese Quesadilla Serviced with sour cream and guacamole on flour tortilla Chicken Strips Served with ranch dressing Kid's Taco Spicy seasoned shredded chicken or ground beef, served with shredded lettuce, cheese, and sour cream Beverages Coke Sprite Lemonade Pineapple Juice Milk Seasonal Features Starting 2026 with a dry January? The Matador has got you covered. We’ve created a special menu featuring nothing but premium non-alcoholic spirits to kick off the new year. Starting 2026 with a dry January? The Matador has got you covered. We’ve created a special menu featuring nothing but premium non-alcoholic spirits to kick off the new year. SCRATCH MARGARITA Dhōs Blanco N/A tequila, Dhōs Orange N/A triple sec, fresh-muddled lime and orange, agave $12.5 MANGO-JALAPEÑO LIMEADE Dhōs Blanco N/A tequila, lime, mango, jalapeño, pineapple, Sprite $12.5 CRANBERRY PONCHE Dhōs Blanco N/A tequila, Dhōs Orange N/A triple sec, cranberry, pomegranate, hibiscus, tamarind, lemon, ginger, cinnamon, star anise, allspice, Sprite $13 Matador Margaritas *Contains Alcoholic* House* Lunazul Blanco, triple sec, lime, lemon, agave $12.5 Cadillac Lunazul Blanco, triple sec, lemon, lime, Grand Marnier $13.5 Smokey Ilegal Joven mezcal, triple sec, charred pineapple, lime, Tajin $14 Bartender's Olmeca Altos Reposado, triple sec, lime, lemon, agave, cranberry, Grand Marnier $14 Blood Orange Lalo Blanco, Solerno Blood Orange Liqueur, citrus, agave $15.5 Pineapple-Habanero Choose between Koch Elemental mezcal or Milagro Silver Triple sec, pineapple, lime, habanero, chile salt, Tajin $13.5 Dragonfruit* Olmeca Altos Reposado, triple sec, dragonfruit, lime, orange, spiced citrus sugar $14 Strawberry Mangonada* Corralejo Silver, triple sec, lime, mango, strawberry, lemon, chamoy, Tajin $14.5 Ginger-Orange Choose Código Blanco + Cointreau or Ilegal Joven mezcal + Solerno Blood Orange liqueur Ginger, orange, lime, spiced citrus sugar $15.5 Top Shelf Patrón Silver, Cointreau, lime, lemon, agave $16 Cucumber-Jalapeño Exotico Blanco, triple sec, cucumber, jalapeño, lemon, lime, agave, Tajin $13.5 Passionfruit Choose between Koch Elemental mezcal or Milagro Silver Passoã Passionfruit liqueur, lemon, lime, agave, chile salt $13.5 Gato Royalé Don Gato Blanco, Chambord, Spanish Cava, lime, lemon, agave, cranberry, spiced citrus sugar $16 Sangrias Spiced Red Burgundy, brandy, pisco, mango, ginger, orange, lemon, cinnamon $12.5 Spanish Rosé Spanish Rosé, Chablis, pineapple, orange, pisco, lime, cucumber, spice $12.5 Sparkling Strawberry Chablis, Spanish Cava, pisco, strawberry, pineapple, orange, hibiscus, spice $12.5 All tequilas and mezcals used in our cocktails are certified, 100% agave spirits. *Can be made as a non-alcoholic margarita using Dhōs N/A spirits. Every day 4pm to 6pm and 10pm to close $7 $8 $7 Romaine Salad Crispy Brussels Sprouts Black Bean Dip Fried Tacos (2) Chicken Tortilla Soup Quesadilla Cheese (no pico), Chicken, Carnitas, Chorizo, Ground Beef, or Beyond Picadillo, Steak* or Shrimp +2 $8 Grande Nachos Add chicken, Beyond Picadillo, House Chorizo, Carnitas, or Ground Beef $3.5 Marinated Steak* $5 Matador Guacamole Orange-habanero salsa Maya, tomatillo salsa, pico, queso fresco, cilantro Haba Prawns Steak* or Shrimp Tacos (2) Baja Fish Tacos (2) Queso Con Chorizo [gf] Melted three-cheese house blend, creamy habanero sauce, pico de gallo, cilantro, queso fresco Street Tacos Choice of: Chorizo, Beyond Picadillo, Ground Beef, Shredded Chicken, or Carnitas Three for $8, Five for $11 Allergy or dietary preference? Please ask your server! Allergy or dietary preference? Please ask your server! *Consuming raw or under-cooked food may increase your risk of food borne illness. Dessert Dessert Salted Caramel Brownie Bittersweet chocolate, salted dulce de leche, strawberry compote, vanilla ice cream $8 Fried Ice Cream Toasted coconut, whipped cream, reposado dulce de leche, cinnamon [gf] $8 Agave spirits, especially aged tequilas and mezcals, go great with dessert! Ask your server or bartender for a pairing suggestion. Bubbles Segura Viudas Brut Rosé Cava Pendés, Catalunya, Spain dry with well-balanced acidity; bright pink with fresh. intense strawberry, cherry, and a soft minerality $16 Freixenet Blanc De Blancs Brut Cava Penedès, Catalunya, Spain bright, creamy texture; crisp apple & light vanilla notes with velvety smooth bubbles and a clean, dry ﬁnish $13 | 48 Rosé & White Casillero Del Diablo Rosé Chile vibrantly fresh and crisp; sharp raspberry, strawberry, and floral aromas, red berry and stonefruit with firm acids $11 | 40 Trivento White Malbec Mendoza, Argentina crystal-clear and very light-bodied; apple and cherry on the nose with flavors of plum, red berry, tropical fruit, and subtle spice and earth on the clean, acidic finish $11 | 40 Ramón Bilbao Verdejo Rueda, Spain crisp, fresh, and aromatic; bright acid with ripe fruit, citrus, floral, and grass notes $12 | 44 Natura Sauvignon Blanc Central Valley, Chile light-bodied, fresh and bright, with vibrant and complex grapefruit, lime, herbs, and a well-balanced acidity $11 | 40 Josh Craftsman's Chardonnay North Coast, California gentle oak balanced with fresh, juicy tropical fruits, honey, ripe peach, and citrus flavors $12 | 44 Red Alamos Malbec Mendoza, Argentina deep concentrated plum, dark cherry and blackberry flavors; finishing with hints of brown spice and vanilla $11 | 40 Ontañón Natura Insolitós Tempranillo Rioja, Spain deep ruby color with a powerful bouquet of blackberry, blueberry, and sweet fig and full-bodied flavors of jammy black fruit, spice, smoke, and coffee with a strong, tannic, lingering finish $12 | 44 Josh Craftsman's Cabernet Sauvignon California full bodied with lush, dark fruit, cinnamon spice, light vanilla and toasty oak; long, soft tannic finish $13 | 48 Clos De Los Siete Blend, \"C7\" By Michel Rolland Mendoza, Argentina lush, fruit-forward plum, blackberry, and cherry with dark chocolate, ash, herbs, and oak; velvety tannins on a long, minerally finish $15 | 56 Browne Heritage Pinot Noir Williamette Valley, Oregon juicy, ripe fruit and berry notes with concentrated floral accents of violet and jasmine, citrus spice, rich loam and lingering, silky tannins $14 | 52 Top Shelf Tuesday A night to experiment Join us every Tuesday for 1/2 off all tequilas $16 and up, plus margarita specials featuring a rotating tequila each month! Join us every Tuesday for 1/2 off all tequilas $16 and up, plus margarita specials featuring a rotating tequila each month! Código Blanco Tequila of the Month, May 2024 Blanco (also called Silver, White, or Plata tequilas) Bottled either right from the still with no aging or allowed to brieﬂy mellow in stainless steel tanks for up to 60 days, blanco tequilas are fresh, bright, and agave forward. This expression is ideal when looking to experience the intense, pure aromas and ﬂavors of a tequila. Fruit & Citrus Crisp, hints of orange peel, grapefruit, pineapple, lemon Pepper & Spice Bold, hints of peppercorn, cinnamon, clove, long finish Earthy & Floral Clean, hints of herbs, clay, mint, fresh flowers, wood, licorice Fruit & Citrus Crisp, hints of orange peel, grapefruit, pineapple, lemon 1800 $10 Camarena $9 Chamucos $12 Chinaco $12 Cincoro $18 Clase Azul Plata $30 Don Julio $14 El Tequileño $9 El Tesoro $14 Fuenteseca Cosecha $28 Milagro $10 Milagro Select Barrel $14 Olmeca Altos Plata $9 Patrón $14 Patrón Gran Platinum $36 Siembra Azul $15 Teremana $11 Pepper & Spice Bold, hints of peppercorn, cinnamon, clove, long finish Casa Dragones $20 Casamigos $15 Centinela $11 Código $13 Don Fulano Fuerte $15 Don Ramon $11 El Mayor $10 Espolòn $10 Exotico $9 G4 $14 Gran Centenario $10 Grand Mayan $18 José Cuervo Reserva Platino $15 Lunazul $8 Siete Leguas $14 Terralta 110 $14 Earthy & Floral Clean, hints of herbs, clay, mint, fresh flowers, wood, licorice ArteNOM 1579 $15 Astral $14 Avión $12 Casa Noble $12 Cazadores $10 Cimmaron $9 Código \"Rosa\" $15 Corralejo $10 Don Fulano $14 Fortaleza $14 Fortaleza Still Strength $15 Herradura $14 Partida $14 Sauza Hornitos Plata $9 Siembra Valles $15 Tequila Ocho $14 Terralta $12 *House favorites Reposado (Rested tequilas) Aged between two months to one year in oak barrels, reposados show gentle amber colors and subtle, warm wood notes while still displaying some of the lighter characteristics of un-aged blancos. Honey & Caramel Hints of vanilla, chocolate, butter, toffee, cinnamon, toasted, sweet Smoke & Oak Hints of wood, agave, leather, heat, pepper Herbal & Floral Clean, hints of fresh cut grass, earthy, licorice, juniper, agave Honey & Caramel Hints of vanilla, chocolate, butter, toffee, cinnamon, toasted, sweet 1800 $10 Camarena $9 Campo Bravo $9 Casa Noble $12 Casamigos $16 Chinaco $14 Clase Azul $33 Código $15 Corralejo $10 Don Julio $14 Don Ramon $11 El Mayor $10 El Tequileño $10 Fortaleza $15 Hussongs $12 Milagro $10 Milagro Select Barrel $15 Smoke & Oak Hints of wood, agave, leather, heat, pepper Casa Dragones $32 Cazadores $10 Chamucos $14 Cincoro $22 Don Fulano $15 Grand Mayan $20 Herradura $14 Jose Cuervo Reserva de la Familia $20 Lobos $14 Olmeca Altos $9 Siete Leguas $14 Herbal & Floral Clean, hints of fresh cut grass, earthy, licorice, juniper, agave Arte NOM 1414 $15 Avión $14 Centinela $12 Cimmaron $9 El Tesoro $15 Espolòn $10 G4 $14 Gran Centenario $11 La Gritona $12 Partida $14 Patrón $14 Sauza Hornitos $9 Tequila Ocho $14 Teremana $11 *House favorites Añejo (Aged tequilas) Aged for one to three years in smaller oak barrels, which produces darker colors and smoother, complex flavors with strong wood influences. An excellent alternative to traditional whiskeys or cognacs. Vanilla & Toffee Hints of caramel, almond, warm, buttery, toasted Cinnamon & Spice Hints of peppercorn, orange peels, spice, chile pepper, heat Nutty & Smokey Hints of oak, wood, brandy, earthy, fruit, cocoa, suede Vanilla & Toffee Hints of caramel, almond, warm, buttery, toasted Avión $14 Casa Noble $14 Casamigos $17 Centinela $14 Chinaco $18 Cincoro $30 Don Julio $15 Don Julio 1942 $34 El Mayor $11 Herradura $15 Herradura Legend $30 Milagro $12 Milagro Select Barrel $22 Partida $15 Sauza Hornitos $10 Sauza Hornitos Black $11 Teremana $13 Cinnamon & Spice Hints of peppercorn, orange peels, spice, chile pepper, heat 1800 $12 Casa Dragones $35 Cazadores $11 Clase Azul $95 Código $28 Corralejo $12 Don Fulano $20 Fortaleza $20 Gran Centenatio $11 Patrón $16 Nutty & Smokey Hints of oak, wood, brandy, earthy, fruit, cocoa, suede Arte NOM 1146 $20 Camarena $10 Chamucos $14 Don Ramon $12 El Tesoro $20 Espolon $12 Grand Mayan $24 Siete Leguas $15 Tequila Ocho $18 *House favorites Extra Añejo Aged for at least three years in oak barrels no larger than 600 liters, extra añejos are incredibly rich and concentrated with heavy, almost syrupy flavors and intense wood notes. 1800 Milenio $45 Avión Reserva 44 $30 Cazadores $16 Centinela Tres Años $29 Cincoro $280 Clase Azul Ultra $300 Código Origen $60 Corralejo $30 Don Fulano Imperial $37 El Mayor $20 G4 $30 Gran Centenario Leyenda $30 Grand Mayan Ultra $40 Herradura Selección Suprema $62 Jose Cuervo Reserva de la Familia $34 Partida Elegante $75 Patrón $20 Patrón Gran Burdeos $85 Patrón Piedra $67 Rey Sol $55 Tears of Llorona $55 Tequila Ocho $38 Mezcal Made from a variety of different agaves and usually produced by fire-roasting piñas in underground pits, giving mezcals the smokiness they are known for. Mezcals are an older and more traditional form of agave spirit and tend to have stronger, more intense flavor profiles than tequilas. Approachable For the beginners. Espadín and other milder agaves produce mezcals with gentle charred agave sweetness, moderate citrus, tropical fruit, burnt hardwoods, and earth. Exotic For the curious. Wild-harvested agaves and single village bottlings have very unique flavor profiles and strongly express their terroir, producing varied notes of vegetation, earth, mineral, fruits, citrus, spice and herbs. Artisanal For the bold. Rare agaves and traditional production techniques produce incredibly complex mezcals with a wide array of pungent aromas and intense flavors. Approachable For the beginners. Espadín and other milder agaves produce mezcals with gentle charred agave sweetness, moderate citrus, tropical fruit, burnt hardwoods, and earth. 400 Conejos Joven $9 Casamigos Joven $16 Del Maguey Chichicapa $16 Del Maguey Vida $11 Fidencio Clássico $12 Ilegal Joven $14 Ilegal Reposado $15 Meteoro Espadín $12 Montelobos Espadín $12 Sombra $12 Exotic For the curious. Wild-harvested agaves and single village bottlings have very unique flavor profiles and strongly express their terroir, producing varied notes of vegetation, earth, mineral, fruits, citrus, spice and herbs. 400 Conejos Espadín, Cuishe $14 400 Conejos Espadín, Tobala $14 Banhez Espadín y Barril $11 Bozal Cuixe $15 Bozal Tobaische $15 Del Maguey Minero $16 Del Maguey Vida de Muertos $14 Koch Espadín San Baltazar Guélavila $15 Nuestra Soledad San Luis del Rio $14 Yola Espadín, Madrecuixe $15 Artisanal For the bold. Rare agaves and traditional production techniques produce incredibly complex mezcals with a wide array of pungent aromas and intense flavors. Bozal Coyote Ancestral Reserva $24 Bozal Pechuga Sacrificio $20 Código Ancestral Paplomé $33 Del Maguey Tobala $29 Real Minero Pechuga $37 Other Juice There are many other types of spirits besides tequila and mezcal that can be made from a variety of agaves and related species. These spirits can exhibit a wide array of exotic aromas and flavors. Other Juice There are many other types of spirits besides tequila and mezcal that can be made from a variety of agaves and related species. These spirits can exhibit a wide array of exotic aromas and flavors. Balam Raicilla Madurado Flor de Desierto Sotol Sierra La Higuera Wheeleri Sotol Pizcadores Bancanora Joven & Cristalino 100% agave Jovens are blancos blended with small amounts of reposados or añejos so that the intense agave notes found in a blanco are balanced by the deeper notes of an aged tequila. Cristalinos are aged tequilas that have been filtered to remove colors and heavier wood notes that come from barrel-aging, resulting in a tequila with the complexity of an añejo but with the bright notes and color of a blanco. Joven & Cristalino 100% agave Jovens are blancos blended with small amounts of reposados or añejos so that the intense agave notes found in a blanco are balanced by the deeper notes of an aged tequila. Cristalinos are aged tequilas that have been filtered to remove colors and heavier wood notes that come from barrel-aging, resulting in a tequila with the complexity of an añejo but with the bright notes and color of a blanco. 1800 $15 Avión Reserva $30 Casa Dragones Joven $68 Cazadores $12 Clase Azul Joven Gold $65 Don Julio 70th Anniversary $18 Espolón $18 Gran Centenario $20 Herradura Ultra $15 Lobos Joven $14 Maestro Dobel 50 $30 Partida $15 House Flights Try one of our curated \"expression\" flights as shown below or ask your server about a blanco, reposado, and añejo \"familia.\" Mezcal Ilegal Joven / Banhez Espadín y Barril / Del Maguey Vida de Muertos Classic Espadín notes of clean agave, citrus, & light smoke / Floral, fruity blend of Espadín & Barril agaves with balanced spice and citrus / Special high-proof, single-village expression with deep vegetal and citrus tones. $18 Blanco Blanco tequilas are the perfect way to taste and experience the terrior of a tequila - the effects that different growing regions have on agave fruit and the spirits made from them. Blanco I - El Valle Código / Partida / Jose Cuervo Reserva de la Familia Tequilas from \"the Valley\" tend to be a bit bolder and assertive, with earthy, vegetal, spicy, and herbal flavors $20 Blanco II - Los Altos Siete Leguas / El Tesoro / Patrón Tequilas from \"the Highlands\" tend to be somewhat sweeter and softer, with more tropical fruit, ﬂoral, and mineral notes $20 Reposado Milagro Select Barrel / Don Julio / Casamigos Single barrel expression with light oak, spice, & caramel / Mellow oak, vanilla, fruit, & smoke / Full-bodied agave expression, deep caramel & wood sugars $21 Añejo El Mayor / Gran Centenario / Herradura Soft, sweet, & buttery roasted agave / Honey-spiced rich, toasted oak / Deep roasted fruit, cocoa, wood, & vanilla $18 Extra Añejo Corralejo / Avión 44 / Jose Cuervo Reserva de la Familia Lush, intense fruit, caramel, & oak / Custom \"petite\" cask aging; rich & silky / Complex, rich, & nuanced private family reserve $45 El Presidente Centenario Leyenda / Herradura Selección Suprema / Partida Elegante Aged in French Limousin Oak; warm & velvety balance of vanilla, agave, & dark spice / Rich & ﬂoral with complex fruit & agave. Long ﬁnish of creamy, toasted oak / Deep wood, caramel, pepper, cocoa, & honey; elegant & reﬁned $80 Cristalino Herradura Ultra / Don Julio 70th Anniversary / Avión Reserva Dark vanilla, birthday cake, & dried fruit / Light oak, baking spice, & light vanilla-honey / Caramel, cinnamon, hints of mineral, citrus, & toasted nuts $30 Cocktails Matador Favorites Mezcalerita Koch Elemental Espadín, triple sec, orange, lemon, lime, agave, orange bitters, Tajin $13 Oaxacan Old Fashioned Ilegal Joven, aromatic bitters, agave, orange peel $15 Ancho Paloma Rosaluna Joven, Ancho Reyes Chile liqueur, lime, grapefruit, Squirt, sal de gusano $13.5 Pineapple-Habanero Margarita Koch Elemental Espadín, triple sec, pineapple, lime, habanero, chile salt, Tajin $13.5 Mezcal Negra Rosaluna Joven, Averna, orange bitters, cherry $15 Ginger-Orange Margarita Ilegal Joven, Solerno Blood Orange liqueur, ginger, orange, lime, spiced citrus sugar $15.5 Pineapple Mule Koch Elemental Espadín, grilled pineapple, ginger-orange syrup, lime, soda, served in a copper mug $13 Smokey Margarita Ilegal Joven, triple sec, charred pineapple, lime, Tajin $14 Chile Mango Margarita Rosaluna Joven, Ancho Reyes Chile liqueur, mango, agave, lime, spiced citrus sugar $15 Passionfruit Margaritas Koch Elemental Espadín, Passoã Passionfruit liqueur, lemon, lime, agave, chile salt $13.5 Bee Sting Ilegal Joven, honey, lemon, ancho chile $14 Mezcal Michelada Dos XX lager, Koch Elemental Espadín, spicy tomato, tamarind, lime, celery bitters, Tajin $12 Matador Favorites House* Lunazul Blanco, triple sec, lime, lemon, agave $12.5 Cadillac Lunazul Blanco, triple sec, lime, lemon, agave, Grand Marnier $13.5 Bartender's Olmeca Altos Reposado, triple sec, lime, lemon, agave, cranberry, Grand Marnier $14 Top Shelf Patrón Silver, Cointreau, lime, lemon, agave $16 Blood Orange Lalo Blanco, Solerno Blood Orange liqueur, citrus, agave $15.5 Cucumber-Jalapeńo Exotico Blanco, triple sec, cucumber, jalapeño, lemon, lime, agave, Tajin $13.5 FOOD Menu Menu Chips & Salsa (gf/veg) Freshly fried corn tortillas, house-roasted tomato salsa $4 Matador Guacamole (gf/veg) Orange-habanero salsa Maya, tomatillo salsa, pico, queso fresco, cilantro, fried corn tortillas $11 Dip Flight (gf/veg) Creamy three-cheese queso, fresh guacamole, and hearty black bean dip $15 Bacon Cheeseburger* Charbroiled steak burger, arugula, pico de gallo, bacon, French fried onions, Jack & cheddar cheeses, chipotle mayo, chipotle-garlic $17 Sauteed Prawns (gf) Roasted garlic & jalapeño polenta, hibiscus- pickled onion, cilantro Choice of sauce: Garlic-chile butter, poblano crema, fiery habanero $14 Baja Fish Tacos Panko crusted and fried mahi mahi, serrano slaw, guacamole, chipotle mayo, radish, cilantro, lime $11 Taco Flight Three large tacos on flour tortillas Shredded chicken, carnitas, and beef picadillo tacos topped with serrano slaw, tomatillo salsa, pico de gallo, garlic crema, cotija cheese $17 Flights Beginner I Ilegal Joven / Banhez Artesanal / Del Maguey Vida Puebla Classic Espadín notes of clean agave, citrus, & light smoke / Floral, fruity blend of Espadín & Barril agaves with balanced spice and citrus / Single-village expression from the base of the volcano Popocatépetl; green herb & vegetal notes with savory roasted agave $16 Beginner II Nuestra Soledad San Luis del Rio / Koch Espadín San Baltazar Guélavila / Don Amado Rustico High-mountain, single-village Espadín; balanced agave, mineral, citrus / From the Tlacolula district in the Valles Centrales region; subtle mineral, fruit, herbs, & brine / Clay pot-distilled Espadín from Santa Catarina Minas; deep, warm, floral $20 Advance I Real Minero Largo / Mezcales de Leyenda Guerrero / Tileño Tepextate Rare, wild agave from the Karwinskii family; sharp fruit, chocolate, dry ash & smoke / Cupreata agave wild-harvested from high-altitude oak forests; complex tropical & citrus notes with subtle spice / Seldom-distilled 25-year-old wild agave; deep fruit, intense mineral, spice & citrus $36 Advanced II Bozal Chino Verde Ancestral Reserva / Mezcales de Leyenda Durrango / Del Maguey Pechuga Rare agave foraged from the Sierra Madre del Sur mountains; pronounced herb and smoke, charred wood & desert soil / High-altitude desert maguey Cenizo; buttery, intense, exotic fruit, earth & clay / Espadín clay pot-distilled with chicken breast & wild-mountain apples, bananas, pineapples, & plums $41 Aficionada Chacolo Ixtero Amarillo / C ódigo Ancestral Papalomé / Coyote Sotol Vibora Maguey Ixtero Amarillo milled by hand with axes, naturally fermented in wooden tinas, and distilled in a Filipino still made of copper and a hollowed out tree trunk; creamy but dry, aggresive herbs, spice, salinity, & tropical fruit / Tobala agaves harvested from sub-tropical forests in mountain canyons & fermented in leather tanks; rustic & raw, intensely floral, aromatic, vegetal, & sweet / Pechuga-style Sotol distilled with rattlesnake meat & rattlesnake venom before a 2-month aging; savory & full-bodied with powerful mineral, herb, & salinity $41 Mezcal Made from a variety of different agaves and usually produced by fire-roasting piñas in underground pits, giving mezcals the smokiness they are known for. Mezcals are an older and more traditional form of agave spirit and tend to have stronger, more intense flavor profiles than tequilas. Approachable For the beginners. Espadín and other milder agaves produce mezcals with gentle charred agave sweetness, moderate citrus, tropical fruit, burnt hardwoods, and earth. Advanced For the curious. Wild-harvested agaves and single village bottlings have very unique flavor profiles and strongly express their terroir, producing varied notes of vegetation, earth, mineral, fruits, citrus, spice, and herbs. Exotic For the bold. Rare agaves and ancestral production techniques produce incredibly complex mezcals with a wide array of pungent aromas and intense flavors. Approachable For the beginners. Espadín and other milder agaves produce mezcals with gentle charred agave sweetness, moderate citrus, tropical fruit, burnt hardwoods, and earth. 400 Conejos Joven $10 Banhez Espadín y Barril $10 Casamigos Joven $16 Del Maguey Chichicapa $18 Del Maguey Vida $12 Del Maguey Vida Puebla $11 Fidencio Clásico $13 Ilegal Joven $13 Ilegal Reposado $15 Montelobos Espadín $12 Siete Misterios Doba-Yej $11 Sombra $12 Tileño Espadín $16 Union $11 Advanced For the curious. Wild-harvested agaves and single village bottlings have very unique flavor profiles and strongly express their terroir, producing varied notes of vegetation, earth, mineral, fruits, citrus, spice, and herbs. 400 Conejos Espadín y Cuishe $14 400 Conejos Espadín y Tobala $14 Bozal Cuixe $15 Bozal Tepeztate $16 Bozal Tobasiche $16 Del Maguey Minero $16 Del Maguey Santo Domingo Albarradas $16 Del Maguey Vida de Muertos $14 Derrumbes San Luis Potosi $15 Don Amado Rustico $15 Ilegal Añejo $25 Koch Espadín San Baltazar Guélavila $16 Los Nahuales Joven Mezcales De Leyenda Durango $20 Mezcales De Leyenda Guerrero $20 Mezcales De Leyenda Oaxaca $18 Nuestra Soledad Lachigui $14 Nuestra Soledad San Baltazar $14 Nuestra Soledad San Luis del Rio $14 Real Minero Barril $32 Real Minero Espadín $28 Real Minero Largo $32 Siete Misterios Espadín y Tepeztate $22 Siete Misterios Espadín y Tobala $24 Yola Espadín, Madrecuixe $15 Exotic For the bold. Rare agaves and ancestral production techniques produce incredibly complex mezcals with a wide array of pungent aromas and intense flavors. Banhez Pechuga $22 Banhez Tepeztate $22 Banhez Tobala $24 Bozal Borrego Sacrificio $26 Bozal Chino Verde Ancestral Reserva $26 Bozal Coyote Ancestral Reserva $26 Bozal Pechuga Sacrificio $24 Código Ancestral Papalomé $35 Del Maguey Pechuga $40 Del Maguey Tobala $29 Fidencio Pechuga $20 Derrumbes San Luis Potosi $12 Lost Explorer Tobala $29 Montelobos Pechuga $28 Montelobos Tobala $24 Real Minero Pechuga $38 Rey Campero Jabali $26 Scorpion 5 year $34 Siete Misterios Coyote $32 Siete Misterios Pechuga $55 Tileño Tepextate $25 Tileño Tobala $20 *House favorites OTHER JUICE There are many other types of spirits besides tequila and mezcal that can be made from a variety of agaves and related species. These spirits can exhibit a wide array of exotic aromas and flavors. OTHER JUICE There are many other types of spirits besides tequila and mezcal that can be made from a variety of agaves and related species. These spirits can exhibit a wide array of exotic aromas and flavors. Balam Raicilla Madurado $16 Chacolo Ixtero Amarillo $29 Coyote Sotol Vibora $20 Flor de Desierto Sotol Cascabel $20 Flor de Desierto Sotol Sierra $15 La Higuera Wheeleri Sotol $12 Pizcadores Bancanora $15 Pizcadores Raicilla $15 Rancho Tepúa Bacanora $16 Siempre Sotol $12 When you visit the Site, we automatically collect certain information about your device, including information about your web browser, IP address, time zone, and some of the cookies that are installed on your device. Privacy Policy Ok. I Agree",
      "hash": "a50e3fd4b4e6",
      "downloadedAt": "2026-01-18T16:54:32.905Z",
      "trimmedAt": "2026-01-18T17:04:52.675Z",
      "sizeReduction": "93.0%"
    },
    {
      "url": "https://www.matadorrestaurants.com/menus/charleston/wine",
      "text": "More Menus Wine Main Menu Cocktails Happy Hour Dessert Wine Tequila Mezcaleria Wine Seasonal Features MIX & MATCH Available Monday to Friday, 11am - 3pm. Soup, choice of salad, and choice of entrée for $16! Seasonal Features PAPAS CON RAJAS veg/gf Fried chipotle-seasoned potato wedges, roasted poblano, fire-roasted corn, Monterey Jack cheese, avocado crema, molcajete salsa $9.5 SEARED AHI TUNA gf Tamari ponzu, guacamole, shaved serrano, chile seasoning, sesame seeds, fried corn tostadas $15 GRILLED CHICKEN LETTUCE WRAPS gf Butter lettuce, orange-agave marinated chicken, slaw, cucumber, avocado, molcajete salsa, queso fresco $13.5/18 *CHICKEN CHIMICHANGAS Two crispy fried chimichangas, braised chicken, black bean queso, Monterey Jack & cheddar cheeses, shredded lettuce, pico de gallo, avocado crema Served with choice of house-made enchilada sauce and Mexican rice Add a third Chimichanga +$6 *For every order of this entree, we'll donate $1 to St. Jude Children’s Research Hospital $19.5 MIX & MATCH Available Monday to Friday, 11am - 3pm. Soup, choice of salad, and choice of entrée for $16! CHOOSE YOUR SALAD Romain Salad Cilantro-pepita dressing, toasted pepitas, pico de gallo, cotija, lime House Salad Baby spring mixed green, blistered tomato and roasted pepper relish, hibiscus-pickled onion, cucumber, tajin, choice of dressing CHOOSE YOUR ENTRÉE Proteins: Chicken, Carnitas, Beyond Picadillo Add guacamole and cilantro-lime sour cream $3 Taco Serrano slaw, tomatillo salsa, garlic crema, pico de gallo, cotija Burrito Mexican rice and beans, Jack & cheddar cheeses Served divorciadas style with verde and roja sauces Quesadilla Monterey Jack cheese, pico de gallo, garlic crema, toasted pepitas, cilantro SOUP Chicken Tortilla Roasted chicken, fire-roasted corn, avocado, tortilla strips, cotija, cilantro Snacks Starters Snacks Dip Flight Creamy three-cheese queso, fresh guacamole, and hearty black bean dip [gf/v] $16 Matador Guacamole Orange-habanero salsa Maya, tomatillo salsa, pico, queso fresco, cilantro [gf] $12 Black Bean Dip Black beans, habanero, garlic crema, tomatillo salsa, green onion [gf/v] $10.5 Queso Con Chorizo Melted three-cheese house blend, creamy habanero sauce, pico de gallo, cilantro, queso fresco [gf] $12 Crispy Brussels Sprouts Fried brussels sprouts, peppers & onions, lime, agave, cotija [gf/v] $12 Fried Tacos Crispy fried corn tortillas, shredded chicken, black bean queso, shredded lettuce, pico de gallo, serrano vinaigrette, salsa Maya, chimichurri mayo $11.5 Street Tacos White onion, cilantro, housemade salsa, radish, cotija, and lime on corn tortillas [gf]: Carnitas, House Chorizo, Beyond Picadillo, Ground Beef or Shredded Chicken 3 for $11 5 for $16.5 Boulevard Style [add guacamole and pico de gallo] $3.5 Starters Grilled Stuffed Jalapeños Goat Cheese, smoked bacon, ranch dressing [gf] $14.5 Quesabirria Three corn tortillas, Monterey Jack cheese, roasted poblanos, beef birria, onions, cilantro, birria jus [gf] $16 Haba Prawns Fiery roasted habanero sauce, roasted garlic & jalapeño polenta, hibiscus-pickled onion, cilantro $15 Crispy Coconut Shrimp Shredded coconut, chile-flour batter, pickled jalapeño and Fresno chiles, salsa verde, chipotle ranch $14.5 Grande Nachos Cheddar, Monterey Jack, black beans, pico de gallo, guacamole, cilantro-lime sour cream [gf] $13.5 Add Shredded Chicken, Carnitas, House Chorizo, Ground Beef, or Beyond Picadillo $3.5 Add Marinated Steak* $6 Matador Quesadilla Monterey Jack, pico de gallo, garlic crema, toasted pepitas, guacamole, cilantro-lime sour cream Cheese (plain - no crema, pepitas, pico de gallo) $11.5 Shredded Chicken, Carnitas, House Chorizo, or Ground Beef $13.5 Carne Asada*, Shrimp, or Beyond Picadillo $14.5 Ahi Tuna Tostadas* Agave ponzu sauce, avocado, chipotle mayo, green onion, finishing salt [gf] $15 Soups & Salads Add to any salad: Grilled Chicken $5, Marinated Steak* $7, Sautéed Shrimp $6, or Mahi Mahi Fillet $8 Sandwiches All Sandwiches and wraps are served with chipotle-garlic salt seasoned French fries Soups & Salads Add to any salad: Grilled Chicken $5, Marinated Steak* $7, Sautéed Shrimp $6, or Mahi Mahi Fillet $8 Tortilla Chicken Soup Roasted chicken, fire-roasted corn, avocado, tortilla strips, cotija, cilantro [gf] $10 bowl, $6 cup Romaine Salad Cilantro-pepita dressing, toasted pepitas, pico de gallo, cotija, lime [gf/veg] $9.5 Chop Salad Fire-roasted corn, red bell pepper, Mexican black beans, pico de gallo, romaine lettuce, green and red cabbages, fried tortilla strips, chipotle ranch Chile-Sauteed Shrimp or Marinated Chicken Breast $18.5 Taco Salad Black beans, Monterey Jack, cotija, shredded lettuce, guacamole, pico de gallo, cilantro-lime sour cream, serrano vinaigrette, garlic crema, jalapeños en escabeche Choose from: Carnitas, Shredded Chicken, House Chorizo, or Ground Beef $16 Grilled Chicken Breast, Shrimp, or Beyond Picadillo $17.5 Grilled Steak* $20 Sandwiches All Sandwiches and wraps are served with chipotle-garlic salt seasoned French fries Carne Asada Sandwich* Grilled marinated steak*, French fried onions, serrano slaw, roasted poblano, pico de gallo, chimichurri mayo $19.5 Wagyu Bacon Cheeseburger* Mixed greens, pico de gallo, bacon, French fried onions, Jack & cheddar cheeses, chipotle mayo $18 Agave Chicken Wrap Agave-marinated chicken breast, bacon, avocado, cilantro-pepita dressing, pico de gallo, shredded lettuce, serrano vinaigrette, cotija $17 Matador Bowl Mexican black beans & rice, cheese blend, serrano slaw, pico de gallo, guacamole, radish, tortilla strips Choice of: roja, verde, habanero, or poblano crema Braised Chicken, Carnitas, Chorizo, Ground Beef, or Southwest Veg {gf} $17 Grilled Chicken, or Beyond Picadillo $18.5 Gaucho Bowl Sautéed peppers & onions, Mexican black beans & rice, Jack & cheddar cheeses, shredded lettuce, pico de gallo, guacamole, cilantro-lime sour cream, French fried onions Grilled Chicken or Sautéed Shrimp $20.5 Grilled Marinated Steak $21.5 Specialty Tacos Two tacos on flour tortillas with Mexican black beans and rice Add a third taco $6 Tacos Two tacos on flour or corn tortillas with Mexican black beans and rice Add a third taco $4 Specialty Tacos Two tacos on flour tortillas with Mexican black beans and rice Add a third taco $6 Baja Fish Tacos Panko-crusted and fried Mahi Mahi, serrano slaw, guacamole, chipotle mayo, radish, cilantro, lime $21 Coconut Shrimp Tacos Crispy coconut-breaded shrimp, mango-pineapple salsa, pico, cilantro-lime sour cream, serrano slaw, on flour tortillas $20 Mango Steak Tacos Grilled carne asada*, mango-pineapple salsa, serrano slaw, guajillo-chile sauce, Tajin $22 Ribeye Tacos Grilled ribeye, French fried onions, chimicurri mayo, avocado, grilled red pepper, cotija $22.5 Tacos Two tacos on flour or corn tortillas with Mexican black beans and rice Add a third taco $4 Topped with shredded lettuce, guajillo chile sauce, pico de gallo, garlic crema: Marinated Carne Asada* $19.5 Shredded Chicken Thigh $17 Beyond Picadillo $18.5 --- Topped with tomatillo salsa, pico de gallo, garlic crema, cotija cheese: Braised Pork Carnitas $17 Chile Sautéed Shrimp $18.5 Grilled Chicken Breast $17.5 Enchiladas Two enchiladas with Monterey Jack, pico de gallo, guacamole, cilantro-lime sour cream, Mexican black beans & rice Add a third enchilada $4 Enchiladas Two enchiladas with Monterey Jack, pico de gallo, guacamole, cilantro-lime sour cream, Mexican black beans & rice Add a third enchilada $4 Divorciadas Mild sweet and tangy salsa verde, medium smoky salsa roja, slow braised chicken thigh, corn tortillas [gf] Habanero Fiery hot habanero salsa, shredded chicken, flour tortillas Shredded Beef Medium and smoky salsa roja, shredded braised beef birria, flour tortillas Verde Carnitas Medium sweet and tangy salsa verde, braised carnitas, corn tortillas [gf] Burritos Flour tortilla filled with Mexican black beans & rice, Jack and cheddar cheeses, and sides of serrano slaw, pico de gallo, guacamole, cilantro-lime sour cream, garlic crema Cali style – add French fries, avocado, and hot sauce $3 Flour tortilla filled with Mexican black beans & rice, Jack and cheddar cheeses, and sides of serrano slaw, pico de gallo, guacamole, cilantro-lime sour cream, garlic crema Cali style – add French fries, avocado, and hot sauce $3 Poblano Carnitas Braised carnitas, rich and mild crema salsa Habanero Steak Grilled marinated steak*, picante habanero sauce Verde Chicken Braised chicken, chile verde sauce Beyond Burrito Plant-based protein, medium and smoky salsa roja, caramelized onions, roasted poblanos [v] Entrées Braised Carnitas Pork shoulder, guacamole, cilantro-lime sour cream, pico de gallo, pickled onions, salsa Maya, Mexican black beans & rice Choice of flour or corn tortillas $22.5 Skillet Seared Fajitas Sautéed peppers & onions, Mexican black beans, Jack & cheddar cheeses, romaine, pico de gallo, guacamole, cilantro-lime sour cream, flour or corn tortillas Choose from: Marinated Carne Asada* $31 Marinated Chicken Breast or Shrimp $27 Chile-Seasoned Ribeye* $32 Shrimp & Chorizo Paella Shrimp, house chorizo, sautéed fajita peppers, achiote-chile rice, saffron [gf] $23.5 Grilled Carne Asada* Street corn & leeks, grilled peppers, cotija, cilantro, Mexican black beans & rice [gf] Marinated Carne Asada* $30.5 Chile-Seasoned Ribeye* $31.5 Surf & Turf: Add habanero, Chile-garlic or poblano shrimp $5 additional Mango-Pineapple Mahi Mahi Chunky mango & pineapple salsa, fruity salsa verde, serrano slaw, chile-achiote rice, cilantro, lime $24 Roasted Chile Rellenos Poblanos stuffed with Mexican rice, Monterey Jack cheese, and tomatillo salsa, served with Mexican black beans, poblano crema, garlic crema, pico de gallo, and tortilla strips Shredded Chicken, Carnitas, or Beyond picadillo [gf] $23.5 *These items are served raw or undercooked, or contain (or may contain) raw or undercooked ingredients. Thoroughly cooking food or animal origin, including but no limited to beef, eggs, fish, lamb, milk, poultry or shellstock reduces the risk of food borne illness. Young children, the elderly and individuals with certain health conditions may be at a higher risk if these foods are consumed raw or undercooked. Kids Menu Available until 9pm, ages 12 and under. Includes entree and beverage for $9, add ice cream for $3 Entrées Served with choice of fries or rice Beverages Entrées Served with choice of fries or rice Cheese Quesadilla Serviced with sour cream and guacamole on flour tortilla Chicken Strips Served with ranch dressing Kid's Taco Spicy seasoned shredded chicken or ground beef, served with shredded lettuce, cheese, and sour cream Beverages Coke Sprite Lemonade Pineapple Juice Milk Seasonal Features Starting 2026 with a dry January? The Matador has got you covered. We’ve created a special menu featuring nothing but premium non-alcoholic spirits to kick off the new year. Starting 2026 with a dry January? The Matador has got you covered. We’ve created a special menu featuring nothing but premium non-alcoholic spirits to kick off the new year. SCRATCH MARGARITA Dhōs Blanco N/A tequila, Dhōs Orange N/A triple sec, fresh-muddled lime and orange, agave $12.5 MANGO-JALAPEÑO LIMEADE Dhōs Blanco N/A tequila, lime, mango, jalapeño, pineapple, Sprite $12.5 CRANBERRY PONCHE Dhōs Blanco N/A tequila, Dhōs Orange N/A triple sec, cranberry, pomegranate, hibiscus, tamarind, lemon, ginger, cinnamon, star anise, allspice, Sprite $13 Matador Margaritas *Contains Alcoholic* House* Lunazul Blanco, triple sec, lime, lemon, agave $12.5 Cadillac Lunazul Blanco, triple sec, lemon, lime, Grand Marnier $13.5 Smokey Ilegal Joven mezcal, triple sec, charred pineapple, lime, Tajin $14 Bartender's Olmeca Altos Reposado, triple sec, lime, lemon, agave, cranberry, Grand Marnier $14 Blood Orange Lalo Blanco, Solerno Blood Orange Liqueur, citrus, agave $15.5 Pineapple-Habanero Choose between Koch Elemental mezcal or Milagro Silver Triple sec, pineapple, lime, habanero, chile salt, Tajin $13.5 Dragonfruit* Olmeca Altos Reposado, triple sec, dragonfruit, lime, orange, spiced citrus sugar $14 Strawberry Mangonada* Corralejo Silver, triple sec, lime, mango, strawberry, lemon, chamoy, Tajin $14.5 Ginger-Orange Choose Código Blanco + Cointreau or Ilegal Joven mezcal + Solerno Blood Orange liqueur Ginger, orange, lime, spiced citrus sugar $15.5 Top Shelf Patrón Silver, Cointreau, lime, lemon, agave $16 Cucumber-Jalapeño Exotico Blanco, triple sec, cucumber, jalapeño, lemon, lime, agave, Tajin $13.5 Passionfruit Choose between Koch Elemental mezcal or Milagro Silver Passoã Passionfruit liqueur, lemon, lime, agave, chile salt $13.5 Gato Royalé Don Gato Blanco, Chambord, Spanish Cava, lime, lemon, agave, cranberry, spiced citrus sugar $16 Sangrias Spiced Red Burgundy, brandy, pisco, mango, ginger, orange, lemon, cinnamon $12.5 Spanish Rosé Spanish Rosé, Chablis, pineapple, orange, pisco, lime, cucumber, spice $12.5 Sparkling Strawberry Chablis, Spanish Cava, pisco, strawberry, pineapple, orange, hibiscus, spice $12.5 All tequilas and mezcals used in our cocktails are certified, 100% agave spirits. *Can be made as a non-alcoholic margarita using Dhōs N/A spirits. Every day 4pm to 6pm and 10pm to close $7 $8 $7 Romaine Salad Crispy Brussels Sprouts Black Bean Dip Fried Tacos (2) Chicken Tortilla Soup Quesadilla Cheese (no pico), Chicken, Carnitas, Chorizo, Ground Beef, or Beyond Picadillo, Steak* or Shrimp +2 $8 Grande Nachos Add chicken, Beyond Picadillo, House Chorizo, Carnitas, or Ground Beef $3.5 Marinated Steak* $5 Matador Guacamole Orange-habanero salsa Maya, tomatillo salsa, pico, queso fresco, cilantro Haba Prawns Steak* or Shrimp Tacos (2) Baja Fish Tacos (2) Queso Con Chorizo [gf] Melted three-cheese house blend, creamy habanero sauce, pico de gallo, cilantro, queso fresco Street Tacos Choice of: Chorizo, Beyond Picadillo, Ground Beef, Shredded Chicken, or Carnitas Three for $8, Five for $11 Allergy or dietary preference? Please ask your server! Allergy or dietary preference? Please ask your server! *Consuming raw or under-cooked food may increase your risk of food borne illness. Dessert Dessert Salted Caramel Brownie Bittersweet chocolate, salted dulce de leche, strawberry compote, vanilla ice cream $8 Fried Ice Cream Toasted coconut, whipped cream, reposado dulce de leche, cinnamon [gf] $8 Agave spirits, especially aged tequilas and mezcals, go great with dessert! Ask your server or bartender for a pairing suggestion. Bubbles Segura Viudas Brut Rosé Cava Pendés, Catalunya, Spain dry with well-balanced acidity; bright pink with fresh. intense strawberry, cherry, and a soft minerality $16 Freixenet Blanc De Blancs Brut Cava Penedès, Catalunya, Spain bright, creamy texture; crisp apple & light vanilla notes with velvety smooth bubbles and a clean, dry ﬁnish $13 | 48 Rosé & White Casillero Del Diablo Rosé Chile vibrantly fresh and crisp; sharp raspberry, strawberry, and floral aromas, red berry and stonefruit with firm acids $11 | 40 Trivento White Malbec Mendoza, Argentina crystal-clear and very light-bodied; apple and cherry on the nose with flavors of plum, red berry, tropical fruit, and subtle spice and earth on the clean, acidic finish $11 | 40 Ramón Bilbao Verdejo Rueda, Spain crisp, fresh, and aromatic; bright acid with ripe fruit, citrus, floral, and grass notes $12 | 44 Natura Sauvignon Blanc Central Valley, Chile light-bodied, fresh and bright, with vibrant and complex grapefruit, lime, herbs, and a well-balanced acidity $11 | 40 Josh Craftsman's Chardonnay North Coast, California gentle oak balanced with fresh, juicy tropical fruits, honey, ripe peach, and citrus flavors $12 | 44 Red Alamos Malbec Mendoza, Argentina deep concentrated plum, dark cherry and blackberry flavors; finishing with hints of brown spice and vanilla $11 | 40 Ontañón Natura Insolitós Tempranillo Rioja, Spain deep ruby color with a powerful bouquet of blackberry, blueberry, and sweet fig and full-bodied flavors of jammy black fruit, spice, smoke, and coffee with a strong, tannic, lingering finish $12 | 44 Josh Craftsman's Cabernet Sauvignon California full bodied with lush, dark fruit, cinnamon spice, light vanilla and toasty oak; long, soft tannic finish $13 | 48 Clos De Los Siete Blend, \"C7\" By Michel Rolland Mendoza, Argentina lush, fruit-forward plum, blackberry, and cherry with dark chocolate, ash, herbs, and oak; velvety tannins on a long, minerally finish $15 | 56 Browne Heritage Pinot Noir Williamette Valley, Oregon juicy, ripe fruit and berry notes with concentrated floral accents of violet and jasmine, citrus spice, rich loam and lingering, silky tannins $14 | 52 Top Shelf Tuesday A night to experiment Join us every Tuesday for 1/2 off all tequilas $16 and up, plus margarita specials featuring a rotating tequila each month! Join us every Tuesday for 1/2 off all tequilas $16 and up, plus margarita specials featuring a rotating tequila each month! Código Blanco Tequila of the Month, May 2024 Blanco (also called Silver, White, or Plata tequilas) Bottled either right from the still with no aging or allowed to brieﬂy mellow in stainless steel tanks for up to 60 days, blanco tequilas are fresh, bright, and agave forward. This expression is ideal when looking to experience the intense, pure aromas and ﬂavors of a tequila. Fruit & Citrus Crisp, hints of orange peel, grapefruit, pineapple, lemon Pepper & Spice Bold, hints of peppercorn, cinnamon, clove, long finish Earthy & Floral Clean, hints of herbs, clay, mint, fresh flowers, wood, licorice Fruit & Citrus Crisp, hints of orange peel, grapefruit, pineapple, lemon 1800 $10 Camarena $9 Chamucos $12 Chinaco $12 Cincoro $18 Clase Azul Plata $30 Don Julio $14 El Tequileño $9 El Tesoro $14 Fuenteseca Cosecha $28 Milagro $10 Milagro Select Barrel $14 Olmeca Altos Plata $9 Patrón $14 Patrón Gran Platinum $36 Siembra Azul $15 Teremana $11 Pepper & Spice Bold, hints of peppercorn, cinnamon, clove, long finish Casa Dragones $20 Casamigos $15 Centinela $11 Código $13 Don Fulano Fuerte $15 Don Ramon $11 El Mayor $10 Espolòn $10 Exotico $9 G4 $14 Gran Centenario $10 Grand Mayan $18 José Cuervo Reserva Platino $15 Lunazul $8 Siete Leguas $14 Terralta 110 $14 Earthy & Floral Clean, hints of herbs, clay, mint, fresh flowers, wood, licorice ArteNOM 1579 $15 Astral $14 Avión $12 Casa Noble $12 Cazadores $10 Cimmaron $9 Código \"Rosa\" $15 Corralejo $10 Don Fulano $14 Fortaleza $14 Fortaleza Still Strength $15 Herradura $14 Partida $14 Sauza Hornitos Plata $9 Siembra Valles $15 Tequila Ocho $14 Terralta $12 *House favorites Reposado (Rested tequilas) Aged between two months to one year in oak barrels, reposados show gentle amber colors and subtle, warm wood notes while still displaying some of the lighter characteristics of un-aged blancos. Honey & Caramel Hints of vanilla, chocolate, butter, toffee, cinnamon, toasted, sweet Smoke & Oak Hints of wood, agave, leather, heat, pepper Herbal & Floral Clean, hints of fresh cut grass, earthy, licorice, juniper, agave Honey & Caramel Hints of vanilla, chocolate, butter, toffee, cinnamon, toasted, sweet 1800 $10 Camarena $9 Campo Bravo $9 Casa Noble $12 Casamigos $16 Chinaco $14 Clase Azul $33 Código $15 Corralejo $10 Don Julio $14 Don Ramon $11 El Mayor $10 El Tequileño $10 Fortaleza $15 Hussongs $12 Milagro $10 Milagro Select Barrel $15 Smoke & Oak Hints of wood, agave, leather, heat, pepper Casa Dragones $32 Cazadores $10 Chamucos $14 Cincoro $22 Don Fulano $15 Grand Mayan $20 Herradura $14 Jose Cuervo Reserva de la Familia $20 Lobos $14 Olmeca Altos $9 Siete Leguas $14 Herbal & Floral Clean, hints of fresh cut grass, earthy, licorice, juniper, agave Arte NOM 1414 $15 Avión $14 Centinela $12 Cimmaron $9 El Tesoro $15 Espolòn $10 G4 $14 Gran Centenario $11 La Gritona $12 Partida $14 Patrón $14 Sauza Hornitos $9 Tequila Ocho $14 Teremana $11 *House favorites Añejo (Aged tequilas) Aged for one to three years in smaller oak barrels, which produces darker colors and smoother, complex flavors with strong wood influences. An excellent alternative to traditional whiskeys or cognacs. Vanilla & Toffee Hints of caramel, almond, warm, buttery, toasted Cinnamon & Spice Hints of peppercorn, orange peels, spice, chile pepper, heat Nutty & Smokey Hints of oak, wood, brandy, earthy, fruit, cocoa, suede Vanilla & Toffee Hints of caramel, almond, warm, buttery, toasted Avión $14 Casa Noble $14 Casamigos $17 Centinela $14 Chinaco $18 Cincoro $30 Don Julio $15 Don Julio 1942 $34 El Mayor $11 Herradura $15 Herradura Legend $30 Milagro $12 Milagro Select Barrel $22 Partida $15 Sauza Hornitos $10 Sauza Hornitos Black $11 Teremana $13 Cinnamon & Spice Hints of peppercorn, orange peels, spice, chile pepper, heat 1800 $12 Casa Dragones $35 Cazadores $11 Clase Azul $95 Código $28 Corralejo $12 Don Fulano $20 Fortaleza $20 Gran Centenatio $11 Patrón $16 Nutty & Smokey Hints of oak, wood, brandy, earthy, fruit, cocoa, suede Arte NOM 1146 $20 Camarena $10 Chamucos $14 Don Ramon $12 El Tesoro $20 Espolon $12 Grand Mayan $24 Siete Leguas $15 Tequila Ocho $18 *House favorites Extra Añejo Aged for at least three years in oak barrels no larger than 600 liters, extra añejos are incredibly rich and concentrated with heavy, almost syrupy flavors and intense wood notes. 1800 Milenio $45 Avión Reserva 44 $30 Cazadores $16 Centinela Tres Años $29 Cincoro $280 Clase Azul Ultra $300 Código Origen $60 Corralejo $30 Don Fulano Imperial $37 El Mayor $20 G4 $30 Gran Centenario Leyenda $30 Grand Mayan Ultra $40 Herradura Selección Suprema $62 Jose Cuervo Reserva de la Familia $34 Partida Elegante $75 Patrón $20 Patrón Gran Burdeos $85 Patrón Piedra $67 Rey Sol $55 Tears of Llorona $55 Tequila Ocho $38 Mezcal Made from a variety of different agaves and usually produced by fire-roasting piñas in underground pits, giving mezcals the smokiness they are known for. Mezcals are an older and more traditional form of agave spirit and tend to have stronger, more intense flavor profiles than tequilas. Approachable For the beginners. Espadín and other milder agaves produce mezcals with gentle charred agave sweetness, moderate citrus, tropical fruit, burnt hardwoods, and earth. Exotic For the curious. Wild-harvested agaves and single village bottlings have very unique flavor profiles and strongly express their terroir, producing varied notes of vegetation, earth, mineral, fruits, citrus, spice and herbs. Artisanal For the bold. Rare agaves and traditional production techniques produce incredibly complex mezcals with a wide array of pungent aromas and intense flavors. Approachable For the beginners. Espadín and other milder agaves produce mezcals with gentle charred agave sweetness, moderate citrus, tropical fruit, burnt hardwoods, and earth. 400 Conejos Joven $9 Casamigos Joven $16 Del Maguey Chichicapa $16 Del Maguey Vida $11 Fidencio Clássico $12 Ilegal Joven $14 Ilegal Reposado $15 Meteoro Espadín $12 Montelobos Espadín $12 Sombra $12 Exotic For the curious. Wild-harvested agaves and single village bottlings have very unique flavor profiles and strongly express their terroir, producing varied notes of vegetation, earth, mineral, fruits, citrus, spice and herbs. 400 Conejos Espadín, Cuishe $14 400 Conejos Espadín, Tobala $14 Banhez Espadín y Barril $11 Bozal Cuixe $15 Bozal Tobaische $15 Del Maguey Minero $16 Del Maguey Vida de Muertos $14 Koch Espadín San Baltazar Guélavila $15 Nuestra Soledad San Luis del Rio $14 Yola Espadín, Madrecuixe $15 Artisanal For the bold. Rare agaves and traditional production techniques produce incredibly complex mezcals with a wide array of pungent aromas and intense flavors. Bozal Coyote Ancestral Reserva $24 Bozal Pechuga Sacrificio $20 Código Ancestral Paplomé $33 Del Maguey Tobala $29 Real Minero Pechuga $37 Other Juice There are many other types of spirits besides tequila and mezcal that can be made from a variety of agaves and related species. These spirits can exhibit a wide array of exotic aromas and flavors. Other Juice There are many other types of spirits besides tequila and mezcal that can be made from a variety of agaves and related species. These spirits can exhibit a wide array of exotic aromas and flavors. Balam Raicilla Madurado Flor de Desierto Sotol Sierra La Higuera Wheeleri Sotol Pizcadores Bancanora Joven & Cristalino 100% agave Jovens are blancos blended with small amounts of reposados or añejos so that the intense agave notes found in a blanco are balanced by the deeper notes of an aged tequila. Cristalinos are aged tequilas that have been filtered to remove colors and heavier wood notes that come from barrel-aging, resulting in a tequila with the complexity of an añejo but with the bright notes and color of a blanco. Joven & Cristalino 100% agave Jovens are blancos blended with small amounts of reposados or añejos so that the intense agave notes found in a blanco are balanced by the deeper notes of an aged tequila. Cristalinos are aged tequilas that have been filtered to remove colors and heavier wood notes that come from barrel-aging, resulting in a tequila with the complexity of an añejo but with the bright notes and color of a blanco. 1800 $15 Avión Reserva $30 Casa Dragones Joven $68 Cazadores $12 Clase Azul Joven Gold $65 Don Julio 70th Anniversary $18 Espolón $18 Gran Centenario $20 Herradura Ultra $15 Lobos Joven $14 Maestro Dobel 50 $30 Partida $15 House Flights Try one of our curated \"expression\" flights as shown below or ask your server about a blanco, reposado, and añejo \"familia.\" Mezcal Ilegal Joven / Banhez Espadín y Barril / Del Maguey Vida de Muertos Classic Espadín notes of clean agave, citrus, & light smoke / Floral, fruity blend of Espadín & Barril agaves with balanced spice and citrus / Special high-proof, single-village expression with deep vegetal and citrus tones. $18 Blanco Blanco tequilas are the perfect way to taste and experience the terrior of a tequila - the effects that different growing regions have on agave fruit and the spirits made from them. Blanco I - El Valle Código / Partida / Jose Cuervo Reserva de la Familia Tequilas from \"the Valley\" tend to be a bit bolder and assertive, with earthy, vegetal, spicy, and herbal flavors $20 Blanco II - Los Altos Siete Leguas / El Tesoro / Patrón Tequilas from \"the Highlands\" tend to be somewhat sweeter and softer, with more tropical fruit, ﬂoral, and mineral notes $20 Reposado Milagro Select Barrel / Don Julio / Casamigos Single barrel expression with light oak, spice, & caramel / Mellow oak, vanilla, fruit, & smoke / Full-bodied agave expression, deep caramel & wood sugars $21 Añejo El Mayor / Gran Centenario / Herradura Soft, sweet, & buttery roasted agave / Honey-spiced rich, toasted oak / Deep roasted fruit, cocoa, wood, & vanilla $18 Extra Añejo Corralejo / Avión 44 / Jose Cuervo Reserva de la Familia Lush, intense fruit, caramel, & oak / Custom \"petite\" cask aging; rich & silky / Complex, rich, & nuanced private family reserve $45 El Presidente Centenario Leyenda / Herradura Selección Suprema / Partida Elegante Aged in French Limousin Oak; warm & velvety balance of vanilla, agave, & dark spice / Rich & ﬂoral with complex fruit & agave. Long ﬁnish of creamy, toasted oak / Deep wood, caramel, pepper, cocoa, & honey; elegant & reﬁned $80 Cristalino Herradura Ultra / Don Julio 70th Anniversary / Avión Reserva Dark vanilla, birthday cake, & dried fruit / Light oak, baking spice, & light vanilla-honey / Caramel, cinnamon, hints of mineral, citrus, & toasted nuts $30 Cocktails Matador Favorites Mezcalerita Koch Elemental Espadín, triple sec, orange, lemon, lime, agave, orange bitters, Tajin $13 Oaxacan Old Fashioned Ilegal Joven, aromatic bitters, agave, orange peel $15 Ancho Paloma Rosaluna Joven, Ancho Reyes Chile liqueur, lime, grapefruit, Squirt, sal de gusano $13.5 Pineapple-Habanero Margarita Koch Elemental Espadín, triple sec, pineapple, lime, habanero, chile salt, Tajin $13.5 Mezcal Negra Rosaluna Joven, Averna, orange bitters, cherry $15 Ginger-Orange Margarita Ilegal Joven, Solerno Blood Orange liqueur, ginger, orange, lime, spiced citrus sugar $15.5 Pineapple Mule Koch Elemental Espadín, grilled pineapple, ginger-orange syrup, lime, soda, served in a copper mug $13 Smokey Margarita Ilegal Joven, triple sec, charred pineapple, lime, Tajin $14 Chile Mango Margarita Rosaluna Joven, Ancho Reyes Chile liqueur, mango, agave, lime, spiced citrus sugar $15 Passionfruit Margaritas Koch Elemental Espadín, Passoã Passionfruit liqueur, lemon, lime, agave, chile salt $13.5 Bee Sting Ilegal Joven, honey, lemon, ancho chile $14 Mezcal Michelada Dos XX lager, Koch Elemental Espadín, spicy tomato, tamarind, lime, celery bitters, Tajin $12 Matador Favorites House* Lunazul Blanco, triple sec, lime, lemon, agave $12.5 Cadillac Lunazul Blanco, triple sec, lime, lemon, agave, Grand Marnier $13.5 Bartender's Olmeca Altos Reposado, triple sec, lime, lemon, agave, cranberry, Grand Marnier $14 Top Shelf Patrón Silver, Cointreau, lime, lemon, agave $16 Blood Orange Lalo Blanco, Solerno Blood Orange liqueur, citrus, agave $15.5 Cucumber-Jalapeńo Exotico Blanco, triple sec, cucumber, jalapeño, lemon, lime, agave, Tajin $13.5 FOOD Menu Menu Chips & Salsa (gf/veg) Freshly fried corn tortillas, house-roasted tomato salsa $4 Matador Guacamole (gf/veg) Orange-habanero salsa Maya, tomatillo salsa, pico, queso fresco, cilantro, fried corn tortillas $11 Dip Flight (gf/veg) Creamy three-cheese queso, fresh guacamole, and hearty black bean dip $15 Bacon Cheeseburger* Charbroiled steak burger, arugula, pico de gallo, bacon, French fried onions, Jack & cheddar cheeses, chipotle mayo, chipotle-garlic $17 Sauteed Prawns (gf) Roasted garlic & jalapeño polenta, hibiscus- pickled onion, cilantro Choice of sauce: Garlic-chile butter, poblano crema, fiery habanero $14 Baja Fish Tacos Panko crusted and fried mahi mahi, serrano slaw, guacamole, chipotle mayo, radish, cilantro, lime $11 Taco Flight Three large tacos on flour tortillas Shredded chicken, carnitas, and beef picadillo tacos topped with serrano slaw, tomatillo salsa, pico de gallo, garlic crema, cotija cheese $17 Flights Beginner I Ilegal Joven / Banhez Artesanal / Del Maguey Vida Puebla Classic Espadín notes of clean agave, citrus, & light smoke / Floral, fruity blend of Espadín & Barril agaves with balanced spice and citrus / Single-village expression from the base of the volcano Popocatépetl; green herb & vegetal notes with savory roasted agave $16 Beginner II Nuestra Soledad San Luis del Rio / Koch Espadín San Baltazar Guélavila / Don Amado Rustico High-mountain, single-village Espadín; balanced agave, mineral, citrus / From the Tlacolula district in the Valles Centrales region; subtle mineral, fruit, herbs, & brine / Clay pot-distilled Espadín from Santa Catarina Minas; deep, warm, floral $20 Advance I Real Minero Largo / Mezcales de Leyenda Guerrero / Tileño Tepextate Rare, wild agave from the Karwinskii family; sharp fruit, chocolate, dry ash & smoke / Cupreata agave wild-harvested from high-altitude oak forests; complex tropical & citrus notes with subtle spice / Seldom-distilled 25-year-old wild agave; deep fruit, intense mineral, spice & citrus $36 Advanced II Bozal Chino Verde Ancestral Reserva / Mezcales de Leyenda Durrango / Del Maguey Pechuga Rare agave foraged from the Sierra Madre del Sur mountains; pronounced herb and smoke, charred wood & desert soil / High-altitude desert maguey Cenizo; buttery, intense, exotic fruit, earth & clay / Espadín clay pot-distilled with chicken breast & wild-mountain apples, bananas, pineapples, & plums $41 Aficionada Chacolo Ixtero Amarillo / C ódigo Ancestral Papalomé / Coyote Sotol Vibora Maguey Ixtero Amarillo milled by hand with axes, naturally fermented in wooden tinas, and distilled in a Filipino still made of copper and a hollowed out tree trunk; creamy but dry, aggresive herbs, spice, salinity, & tropical fruit / Tobala agaves harvested from sub-tropical forests in mountain canyons & fermented in leather tanks; rustic & raw, intensely floral, aromatic, vegetal, & sweet / Pechuga-style Sotol distilled with rattlesnake meat & rattlesnake venom before a 2-month aging; savory & full-bodied with powerful mineral, herb, & salinity $41 Mezcal Made from a variety of different agaves and usually produced by fire-roasting piñas in underground pits, giving mezcals the smokiness they are known for. Mezcals are an older and more traditional form of agave spirit and tend to have stronger, more intense flavor profiles than tequilas. Approachable For the beginners. Espadín and other milder agaves produce mezcals with gentle charred agave sweetness, moderate citrus, tropical fruit, burnt hardwoods, and earth. Advanced For the curious. Wild-harvested agaves and single village bottlings have very unique flavor profiles and strongly express their terroir, producing varied notes of vegetation, earth, mineral, fruits, citrus, spice, and herbs. Exotic For the bold. Rare agaves and ancestral production techniques produce incredibly complex mezcals with a wide array of pungent aromas and intense flavors. Approachable For the beginners. Espadín and other milder agaves produce mezcals with gentle charred agave sweetness, moderate citrus, tropical fruit, burnt hardwoods, and earth. 400 Conejos Joven $10 Banhez Espadín y Barril $10 Casamigos Joven $16 Del Maguey Chichicapa $18 Del Maguey Vida $12 Del Maguey Vida Puebla $11 Fidencio Clásico $13 Ilegal Joven $13 Ilegal Reposado $15 Montelobos Espadín $12 Siete Misterios Doba-Yej $11 Sombra $12 Tileño Espadín $16 Union $11 Advanced For the curious. Wild-harvested agaves and single village bottlings have very unique flavor profiles and strongly express their terroir, producing varied notes of vegetation, earth, mineral, fruits, citrus, spice, and herbs. 400 Conejos Espadín y Cuishe $14 400 Conejos Espadín y Tobala $14 Bozal Cuixe $15 Bozal Tepeztate $16 Bozal Tobasiche $16 Del Maguey Minero $16 Del Maguey Santo Domingo Albarradas $16 Del Maguey Vida de Muertos $14 Derrumbes San Luis Potosi $15 Don Amado Rustico $15 Ilegal Añejo $25 Koch Espadín San Baltazar Guélavila $16 Los Nahuales Joven Mezcales De Leyenda Durango $20 Mezcales De Leyenda Guerrero $20 Mezcales De Leyenda Oaxaca $18 Nuestra Soledad Lachigui $14 Nuestra Soledad San Baltazar $14 Nuestra Soledad San Luis del Rio $14 Real Minero Barril $32 Real Minero Espadín $28 Real Minero Largo $32 Siete Misterios Espadín y Tepeztate $22 Siete Misterios Espadín y Tobala $24 Yola Espadín, Madrecuixe $15 Exotic For the bold. Rare agaves and ancestral production techniques produce incredibly complex mezcals with a wide array of pungent aromas and intense flavors. Banhez Pechuga $22 Banhez Tepeztate $22 Banhez Tobala $24 Bozal Borrego Sacrificio $26 Bozal Chino Verde Ancestral Reserva $26 Bozal Coyote Ancestral Reserva $26 Bozal Pechuga Sacrificio $24 Código Ancestral Papalomé $35 Del Maguey Pechuga $40 Del Maguey Tobala $29 Fidencio Pechuga $20 Derrumbes San Luis Potosi $12 Lost Explorer Tobala $29 Montelobos Pechuga $28 Montelobos Tobala $24 Real Minero Pechuga $38 Rey Campero Jabali $26 Scorpion 5 year $34 Siete Misterios Coyote $32 Siete Misterios Pechuga $55 Tileño Tepextate $25 Tileño Tobala $20 *House favorites OTHER JUICE There are many other types of spirits besides tequila and mezcal that can be made from a variety of agaves and related species. These spirits can exhibit a wide array of exotic aromas and flavors. OTHER JUICE There are many other types of spirits besides tequila and mezcal that can be made from a variety of agaves and related species. These spirits can exhibit a wide array of exotic aromas and flavors. Balam Raicilla Madurado $16 Chacolo Ixtero Amarillo $29 Coyote Sotol Vibora $20 Flor de Desierto Sotol Cascabel $20 Flor de Desierto Sotol Sierra $15 La Higuera Wheeleri Sotol $12 Pizcadores Bancanora $15 Pizcadores Raicilla $15 Rancho Tepúa Bacanora $16 Siempre Sotol $12 When you visit the Site, we automatically collect certain information about your device, including information about your web browser, IP address, time zone, and some of the cookies that are installed on your device. Privacy Policy Ok. I Agree",
      "hash": "cbfb7f38ff41",
      "downloadedAt": "2026-01-18T16:54:34.849Z",
      "trimmedAt": "2026-01-18T17:04:52.794Z",
      "sizeReduction": "93.0%"
    },
    {
      "url": "https://www.matadorrestaurants.com/menus/charleston/happy-hour",
      "text": "More Menus Happy Hour Main Menu Cocktails Happy Hour Dessert Wine Tequila Mezcaleria Happy Hour Seasonal Features MIX & MATCH Available Monday to Friday, 11am - 3pm. Soup, choice of salad, and choice of entrée for $16! Seasonal Features PAPAS CON RAJAS veg/gf Fried chipotle-seasoned potato wedges, roasted poblano, fire-roasted corn, Monterey Jack cheese, avocado crema, molcajete salsa $9.5 SEARED AHI TUNA gf Tamari ponzu, guacamole, shaved serrano, chile seasoning, sesame seeds, fried corn tostadas $15 GRILLED CHICKEN LETTUCE WRAPS gf Butter lettuce, orange-agave marinated chicken, slaw, cucumber, avocado, molcajete salsa, queso fresco $13.5/18 *CHICKEN CHIMICHANGAS Two crispy fried chimichangas, braised chicken, black bean queso, Monterey Jack & cheddar cheeses, shredded lettuce, pico de gallo, avocado crema Served with choice of house-made enchilada sauce and Mexican rice Add a third Chimichanga +$6 *For every order of this entree, we'll donate $1 to St. Jude Children’s Research Hospital $19.5 MIX & MATCH Available Monday to Friday, 11am - 3pm. Soup, choice of salad, and choice of entrée for $16! CHOOSE YOUR SALAD Romain Salad Cilantro-pepita dressing, toasted pepitas, pico de gallo, cotija, lime House Salad Baby spring mixed green, blistered tomato and roasted pepper relish, hibiscus-pickled onion, cucumber, tajin, choice of dressing CHOOSE YOUR ENTRÉE Proteins: Chicken, Carnitas, Beyond Picadillo Add guacamole and cilantro-lime sour cream $3 Taco Serrano slaw, tomatillo salsa, garlic crema, pico de gallo, cotija Burrito Mexican rice and beans, Jack & cheddar cheeses Served divorciadas style with verde and roja sauces Quesadilla Monterey Jack cheese, pico de gallo, garlic crema, toasted pepitas, cilantro SOUP Chicken Tortilla Roasted chicken, fire-roasted corn, avocado, tortilla strips, cotija, cilantro Snacks Starters Snacks Dip Flight Creamy three-cheese queso, fresh guacamole, and hearty black bean dip [gf/v] $16 Matador Guacamole Orange-habanero salsa Maya, tomatillo salsa, pico, queso fresco, cilantro [gf] $12 Black Bean Dip Black beans, habanero, garlic crema, tomatillo salsa, green onion [gf/v] $10.5 Queso Con Chorizo Melted three-cheese house blend, creamy habanero sauce, pico de gallo, cilantro, queso fresco [gf] $12 Crispy Brussels Sprouts Fried brussels sprouts, peppers & onions, lime, agave, cotija [gf/v] $12 Fried Tacos Crispy fried corn tortillas, shredded chicken, black bean queso, shredded lettuce, pico de gallo, serrano vinaigrette, salsa Maya, chimichurri mayo $11.5 Street Tacos White onion, cilantro, housemade salsa, radish, cotija, and lime on corn tortillas [gf]: Carnitas, House Chorizo, Beyond Picadillo, Ground Beef or Shredded Chicken 3 for $11 5 for $16.5 Boulevard Style [add guacamole and pico de gallo] $3.5 Starters Grilled Stuffed Jalapeños Goat Cheese, smoked bacon, ranch dressing [gf] $14.5 Quesabirria Three corn tortillas, Monterey Jack cheese, roasted poblanos, beef birria, onions, cilantro, birria jus [gf] $16 Haba Prawns Fiery roasted habanero sauce, roasted garlic & jalapeño polenta, hibiscus-pickled onion, cilantro $15 Crispy Coconut Shrimp Shredded coconut, chile-flour batter, pickled jalapeño and Fresno chiles, salsa verde, chipotle ranch $14.5 Grande Nachos Cheddar, Monterey Jack, black beans, pico de gallo, guacamole, cilantro-lime sour cream [gf] $13.5 Add Shredded Chicken, Carnitas, House Chorizo, Ground Beef, or Beyond Picadillo $3.5 Add Marinated Steak* $6 Matador Quesadilla Monterey Jack, pico de gallo, garlic crema, toasted pepitas, guacamole, cilantro-lime sour cream Cheese (plain - no crema, pepitas, pico de gallo) $11.5 Shredded Chicken, Carnitas, House Chorizo, or Ground Beef $13.5 Carne Asada*, Shrimp, or Beyond Picadillo $14.5 Ahi Tuna Tostadas* Agave ponzu sauce, avocado, chipotle mayo, green onion, finishing salt [gf] $15 Soups & Salads Add to any salad: Grilled Chicken $5, Marinated Steak* $7, Sautéed Shrimp $6, or Mahi Mahi Fillet $8 Sandwiches All Sandwiches and wraps are served with chipotle-garlic salt seasoned French fries Soups & Salads Add to any salad: Grilled Chicken $5, Marinated Steak* $7, Sautéed Shrimp $6, or Mahi Mahi Fillet $8 Tortilla Chicken Soup Roasted chicken, fire-roasted corn, avocado, tortilla strips, cotija, cilantro [gf] $10 bowl, $6 cup Romaine Salad Cilantro-pepita dressing, toasted pepitas, pico de gallo, cotija, lime [gf/veg] $9.5 Chop Salad Fire-roasted corn, red bell pepper, Mexican black beans, pico de gallo, romaine lettuce, green and red cabbages, fried tortilla strips, chipotle ranch Chile-Sauteed Shrimp or Marinated Chicken Breast $18.5 Taco Salad Black beans, Monterey Jack, cotija, shredded lettuce, guacamole, pico de gallo, cilantro-lime sour cream, serrano vinaigrette, garlic crema, jalapeños en escabeche Choose from: Carnitas, Shredded Chicken, House Chorizo, or Ground Beef $16 Grilled Chicken Breast, Shrimp, or Beyond Picadillo $17.5 Grilled Steak* $20 Sandwiches All Sandwiches and wraps are served with chipotle-garlic salt seasoned French fries Carne Asada Sandwich* Grilled marinated steak*, French fried onions, serrano slaw, roasted poblano, pico de gallo, chimichurri mayo $19.5 Wagyu Bacon Cheeseburger* Mixed greens, pico de gallo, bacon, French fried onions, Jack & cheddar cheeses, chipotle mayo $18 Agave Chicken Wrap Agave-marinated chicken breast, bacon, avocado, cilantro-pepita dressing, pico de gallo, shredded lettuce, serrano vinaigrette, cotija $17 Matador Bowl Mexican black beans & rice, cheese blend, serrano slaw, pico de gallo, guacamole, radish, tortilla strips Choice of: roja, verde, habanero, or poblano crema Braised Chicken, Carnitas, Chorizo, Ground Beef, or Southwest Veg {gf} $17 Grilled Chicken, or Beyond Picadillo $18.5 Gaucho Bowl Sautéed peppers & onions, Mexican black beans & rice, Jack & cheddar cheeses, shredded lettuce, pico de gallo, guacamole, cilantro-lime sour cream, French fried onions Grilled Chicken or Sautéed Shrimp $20.5 Grilled Marinated Steak $21.5 Specialty Tacos Two tacos on flour tortillas with Mexican black beans and rice Add a third taco $6 Tacos Two tacos on flour or corn tortillas with Mexican black beans and rice Add a third taco $4 Specialty Tacos Two tacos on flour tortillas with Mexican black beans and rice Add a third taco $6 Baja Fish Tacos Panko-crusted and fried Mahi Mahi, serrano slaw, guacamole, chipotle mayo, radish, cilantro, lime $21 Coconut Shrimp Tacos Crispy coconut-breaded shrimp, mango-pineapple salsa, pico, cilantro-lime sour cream, serrano slaw, on flour tortillas $20 Mango Steak Tacos Grilled carne asada*, mango-pineapple salsa, serrano slaw, guajillo-chile sauce, Tajin $22 Ribeye Tacos Grilled ribeye, French fried onions, chimicurri mayo, avocado, grilled red pepper, cotija $22.5 Tacos Two tacos on flour or corn tortillas with Mexican black beans and rice Add a third taco $4 Topped with shredded lettuce, guajillo chile sauce, pico de gallo, garlic crema: Marinated Carne Asada* $19.5 Shredded Chicken Thigh $17 Beyond Picadillo $18.5 --- Topped with tomatillo salsa, pico de gallo, garlic crema, cotija cheese: Braised Pork Carnitas $17 Chile Sautéed Shrimp $18.5 Grilled Chicken Breast $17.5 Enchiladas Two enchiladas with Monterey Jack, pico de gallo, guacamole, cilantro-lime sour cream, Mexican black beans & rice Add a third enchilada $4 Enchiladas Two enchiladas with Monterey Jack, pico de gallo, guacamole, cilantro-lime sour cream, Mexican black beans & rice Add a third enchilada $4 Divorciadas Mild sweet and tangy salsa verde, medium smoky salsa roja, slow braised chicken thigh, corn tortillas [gf] Habanero Fiery hot habanero salsa, shredded chicken, flour tortillas Shredded Beef Medium and smoky salsa roja, shredded braised beef birria, flour tortillas Verde Carnitas Medium sweet and tangy salsa verde, braised carnitas, corn tortillas [gf] Burritos Flour tortilla filled with Mexican black beans & rice, Jack and cheddar cheeses, and sides of serrano slaw, pico de gallo, guacamole, cilantro-lime sour cream, garlic crema Cali style – add French fries, avocado, and hot sauce $3 Flour tortilla filled with Mexican black beans & rice, Jack and cheddar cheeses, and sides of serrano slaw, pico de gallo, guacamole, cilantro-lime sour cream, garlic crema Cali style – add French fries, avocado, and hot sauce $3 Poblano Carnitas Braised carnitas, rich and mild crema salsa Habanero Steak Grilled marinated steak*, picante habanero sauce Verde Chicken Braised chicken, chile verde sauce Beyond Burrito Plant-based protein, medium and smoky salsa roja, caramelized onions, roasted poblanos [v] Entrées Braised Carnitas Pork shoulder, guacamole, cilantro-lime sour cream, pico de gallo, pickled onions, salsa Maya, Mexican black beans & rice Choice of flour or corn tortillas $22.5 Skillet Seared Fajitas Sautéed peppers & onions, Mexican black beans, Jack & cheddar cheeses, romaine, pico de gallo, guacamole, cilantro-lime sour cream, flour or corn tortillas Choose from: Marinated Carne Asada* $31 Marinated Chicken Breast or Shrimp $27 Chile-Seasoned Ribeye* $32 Shrimp & Chorizo Paella Shrimp, house chorizo, sautéed fajita peppers, achiote-chile rice, saffron [gf] $23.5 Grilled Carne Asada* Street corn & leeks, grilled peppers, cotija, cilantro, Mexican black beans & rice [gf] Marinated Carne Asada* $30.5 Chile-Seasoned Ribeye* $31.5 Surf & Turf: Add habanero, Chile-garlic or poblano shrimp $5 additional Mango-Pineapple Mahi Mahi Chunky mango & pineapple salsa, fruity salsa verde, serrano slaw, chile-achiote rice, cilantro, lime $24 Roasted Chile Rellenos Poblanos stuffed with Mexican rice, Monterey Jack cheese, and tomatillo salsa, served with Mexican black beans, poblano crema, garlic crema, pico de gallo, and tortilla strips Shredded Chicken, Carnitas, or Beyond picadillo [gf] $23.5 *These items are served raw or undercooked, or contain (or may contain) raw or undercooked ingredients. Thoroughly cooking food or animal origin, including but no limited to beef, eggs, fish, lamb, milk, poultry or shellstock reduces the risk of food borne illness. Young children, the elderly and individuals with certain health conditions may be at a higher risk if these foods are consumed raw or undercooked. Kids Menu Available until 9pm, ages 12 and under. Includes entree and beverage for $9, add ice cream for $3 Entrées Served with choice of fries or rice Beverages Entrées Served with choice of fries or rice Cheese Quesadilla Serviced with sour cream and guacamole on flour tortilla Chicken Strips Served with ranch dressing Kid's Taco Spicy seasoned shredded chicken or ground beef, served with shredded lettuce, cheese, and sour cream Beverages Coke Sprite Lemonade Pineapple Juice Milk Seasonal Features Starting 2026 with a dry January? The Matador has got you covered. We’ve created a special menu featuring nothing but premium non-alcoholic spirits to kick off the new year. Starting 2026 with a dry January? The Matador has got you covered. We’ve created a special menu featuring nothing but premium non-alcoholic spirits to kick off the new year. SCRATCH MARGARITA Dhōs Blanco N/A tequila, Dhōs Orange N/A triple sec, fresh-muddled lime and orange, agave $12.5 MANGO-JALAPEÑO LIMEADE Dhōs Blanco N/A tequila, lime, mango, jalapeño, pineapple, Sprite $12.5 CRANBERRY PONCHE Dhōs Blanco N/A tequila, Dhōs Orange N/A triple sec, cranberry, pomegranate, hibiscus, tamarind, lemon, ginger, cinnamon, star anise, allspice, Sprite $13 Matador Margaritas *Contains Alcoholic* House* Lunazul Blanco, triple sec, lime, lemon, agave $12.5 Cadillac Lunazul Blanco, triple sec, lemon, lime, Grand Marnier $13.5 Smokey Ilegal Joven mezcal, triple sec, charred pineapple, lime, Tajin $14 Bartender's Olmeca Altos Reposado, triple sec, lime, lemon, agave, cranberry, Grand Marnier $14 Blood Orange Lalo Blanco, Solerno Blood Orange Liqueur, citrus, agave $15.5 Pineapple-Habanero Choose between Koch Elemental mezcal or Milagro Silver Triple sec, pineapple, lime, habanero, chile salt, Tajin $13.5 Dragonfruit* Olmeca Altos Reposado, triple sec, dragonfruit, lime, orange, spiced citrus sugar $14 Strawberry Mangonada* Corralejo Silver, triple sec, lime, mango, strawberry, lemon, chamoy, Tajin $14.5 Ginger-Orange Choose Código Blanco + Cointreau or Ilegal Joven mezcal + Solerno Blood Orange liqueur Ginger, orange, lime, spiced citrus sugar $15.5 Top Shelf Patrón Silver, Cointreau, lime, lemon, agave $16 Cucumber-Jalapeño Exotico Blanco, triple sec, cucumber, jalapeño, lemon, lime, agave, Tajin $13.5 Passionfruit Choose between Koch Elemental mezcal or Milagro Silver Passoã Passionfruit liqueur, lemon, lime, agave, chile salt $13.5 Gato Royalé Don Gato Blanco, Chambord, Spanish Cava, lime, lemon, agave, cranberry, spiced citrus sugar $16 Sangrias Spiced Red Burgundy, brandy, pisco, mango, ginger, orange, lemon, cinnamon $12.5 Spanish Rosé Spanish Rosé, Chablis, pineapple, orange, pisco, lime, cucumber, spice $12.5 Sparkling Strawberry Chablis, Spanish Cava, pisco, strawberry, pineapple, orange, hibiscus, spice $12.5 All tequilas and mezcals used in our cocktails are certified, 100% agave spirits. *Can be made as a non-alcoholic margarita using Dhōs N/A spirits. Every day 4pm to 6pm and 10pm to close $7 $8 $7 Romaine Salad Crispy Brussels Sprouts Black Bean Dip Fried Tacos (2) Chicken Tortilla Soup Quesadilla Cheese (no pico), Chicken, Carnitas, Chorizo, Ground Beef, or Beyond Picadillo, Steak* or Shrimp +2 $8 Grande Nachos Add chicken, Beyond Picadillo, House Chorizo, Carnitas, or Ground Beef $3.5 Marinated Steak* $5 Matador Guacamole Orange-habanero salsa Maya, tomatillo salsa, pico, queso fresco, cilantro Haba Prawns Steak* or Shrimp Tacos (2) Baja Fish Tacos (2) Queso Con Chorizo [gf] Melted three-cheese house blend, creamy habanero sauce, pico de gallo, cilantro, queso fresco Street Tacos Choice of: Chorizo, Beyond Picadillo, Ground Beef, Shredded Chicken, or Carnitas Three for $8, Five for $11 Allergy or dietary preference? Please ask your server! Allergy or dietary preference? Please ask your server! *Consuming raw or under-cooked food may increase your risk of food borne illness. Dessert Dessert Salted Caramel Brownie Bittersweet chocolate, salted dulce de leche, strawberry compote, vanilla ice cream $8 Fried Ice Cream Toasted coconut, whipped cream, reposado dulce de leche, cinnamon [gf] $8 Agave spirits, especially aged tequilas and mezcals, go great with dessert! Ask your server or bartender for a pairing suggestion. Bubbles Segura Viudas Brut Rosé Cava Pendés, Catalunya, Spain dry with well-balanced acidity; bright pink with fresh. intense strawberry, cherry, and a soft minerality $16 Freixenet Blanc De Blancs Brut Cava Penedès, Catalunya, Spain bright, creamy texture; crisp apple & light vanilla notes with velvety smooth bubbles and a clean, dry ﬁnish $13 | 48 Rosé & White Casillero Del Diablo Rosé Chile vibrantly fresh and crisp; sharp raspberry, strawberry, and floral aromas, red berry and stonefruit with firm acids $11 | 40 Trivento White Malbec Mendoza, Argentina crystal-clear and very light-bodied; apple and cherry on the nose with flavors of plum, red berry, tropical fruit, and subtle spice and earth on the clean, acidic finish $11 | 40 Ramón Bilbao Verdejo Rueda, Spain crisp, fresh, and aromatic; bright acid with ripe fruit, citrus, floral, and grass notes $12 | 44 Natura Sauvignon Blanc Central Valley, Chile light-bodied, fresh and bright, with vibrant and complex grapefruit, lime, herbs, and a well-balanced acidity $11 | 40 Josh Craftsman's Chardonnay North Coast, California gentle oak balanced with fresh, juicy tropical fruits, honey, ripe peach, and citrus flavors $12 | 44 Red Alamos Malbec Mendoza, Argentina deep concentrated plum, dark cherry and blackberry flavors; finishing with hints of brown spice and vanilla $11 | 40 Ontañón Natura Insolitós Tempranillo Rioja, Spain deep ruby color with a powerful bouquet of blackberry, blueberry, and sweet fig and full-bodied flavors of jammy black fruit, spice, smoke, and coffee with a strong, tannic, lingering finish $12 | 44 Josh Craftsman's Cabernet Sauvignon California full bodied with lush, dark fruit, cinnamon spice, light vanilla and toasty oak; long, soft tannic finish $13 | 48 Clos De Los Siete Blend, \"C7\" By Michel Rolland Mendoza, Argentina lush, fruit-forward plum, blackberry, and cherry with dark chocolate, ash, herbs, and oak; velvety tannins on a long, minerally finish $15 | 56 Browne Heritage Pinot Noir Williamette Valley, Oregon juicy, ripe fruit and berry notes with concentrated floral accents of violet and jasmine, citrus spice, rich loam and lingering, silky tannins $14 | 52 Top Shelf Tuesday A night to experiment Join us every Tuesday for 1/2 off all tequilas $16 and up, plus margarita specials featuring a rotating tequila each month! Join us every Tuesday for 1/2 off all tequilas $16 and up, plus margarita specials featuring a rotating tequila each month! Código Blanco Tequila of the Month, May 2024 Blanco (also called Silver, White, or Plata tequilas) Bottled either right from the still with no aging or allowed to brieﬂy mellow in stainless steel tanks for up to 60 days, blanco tequilas are fresh, bright, and agave forward. This expression is ideal when looking to experience the intense, pure aromas and ﬂavors of a tequila. Fruit & Citrus Crisp, hints of orange peel, grapefruit, pineapple, lemon Pepper & Spice Bold, hints of peppercorn, cinnamon, clove, long finish Earthy & Floral Clean, hints of herbs, clay, mint, fresh flowers, wood, licorice Fruit & Citrus Crisp, hints of orange peel, grapefruit, pineapple, lemon 1800 $10 Camarena $9 Chamucos $12 Chinaco $12 Cincoro $18 Clase Azul Plata $30 Don Julio $14 El Tequileño $9 El Tesoro $14 Fuenteseca Cosecha $28 Milagro $10 Milagro Select Barrel $14 Olmeca Altos Plata $9 Patrón $14 Patrón Gran Platinum $36 Siembra Azul $15 Teremana $11 Pepper & Spice Bold, hints of peppercorn, cinnamon, clove, long finish Casa Dragones $20 Casamigos $15 Centinela $11 Código $13 Don Fulano Fuerte $15 Don Ramon $11 El Mayor $10 Espolòn $10 Exotico $9 G4 $14 Gran Centenario $10 Grand Mayan $18 José Cuervo Reserva Platino $15 Lunazul $8 Siete Leguas $14 Terralta 110 $14 Earthy & Floral Clean, hints of herbs, clay, mint, fresh flowers, wood, licorice ArteNOM 1579 $15 Astral $14 Avión $12 Casa Noble $12 Cazadores $10 Cimmaron $9 Código \"Rosa\" $15 Corralejo $10 Don Fulano $14 Fortaleza $14 Fortaleza Still Strength $15 Herradura $14 Partida $14 Sauza Hornitos Plata $9 Siembra Valles $15 Tequila Ocho $14 Terralta $12 *House favorites Reposado (Rested tequilas) Aged between two months to one year in oak barrels, reposados show gentle amber colors and subtle, warm wood notes while still displaying some of the lighter characteristics of un-aged blancos. Honey & Caramel Hints of vanilla, chocolate, butter, toffee, cinnamon, toasted, sweet Smoke & Oak Hints of wood, agave, leather, heat, pepper Herbal & Floral Clean, hints of fresh cut grass, earthy, licorice, juniper, agave Honey & Caramel Hints of vanilla, chocolate, butter, toffee, cinnamon, toasted, sweet 1800 $10 Camarena $9 Campo Bravo $9 Casa Noble $12 Casamigos $16 Chinaco $14 Clase Azul $33 Código $15 Corralejo $10 Don Julio $14 Don Ramon $11 El Mayor $10 El Tequileño $10 Fortaleza $15 Hussongs $12 Milagro $10 Milagro Select Barrel $15 Smoke & Oak Hints of wood, agave, leather, heat, pepper Casa Dragones $32 Cazadores $10 Chamucos $14 Cincoro $22 Don Fulano $15 Grand Mayan $20 Herradura $14 Jose Cuervo Reserva de la Familia $20 Lobos $14 Olmeca Altos $9 Siete Leguas $14 Herbal & Floral Clean, hints of fresh cut grass, earthy, licorice, juniper, agave Arte NOM 1414 $15 Avión $14 Centinela $12 Cimmaron $9 El Tesoro $15 Espolòn $10 G4 $14 Gran Centenario $11 La Gritona $12 Partida $14 Patrón $14 Sauza Hornitos $9 Tequila Ocho $14 Teremana $11 *House favorites Añejo (Aged tequilas) Aged for one to three years in smaller oak barrels, which produces darker colors and smoother, complex flavors with strong wood influences. An excellent alternative to traditional whiskeys or cognacs. Vanilla & Toffee Hints of caramel, almond, warm, buttery, toasted Cinnamon & Spice Hints of peppercorn, orange peels, spice, chile pepper, heat Nutty & Smokey Hints of oak, wood, brandy, earthy, fruit, cocoa, suede Vanilla & Toffee Hints of caramel, almond, warm, buttery, toasted Avión $14 Casa Noble $14 Casamigos $17 Centinela $14 Chinaco $18 Cincoro $30 Don Julio $15 Don Julio 1942 $34 El Mayor $11 Herradura $15 Herradura Legend $30 Milagro $12 Milagro Select Barrel $22 Partida $15 Sauza Hornitos $10 Sauza Hornitos Black $11 Teremana $13 Cinnamon & Spice Hints of peppercorn, orange peels, spice, chile pepper, heat 1800 $12 Casa Dragones $35 Cazadores $11 Clase Azul $95 Código $28 Corralejo $12 Don Fulano $20 Fortaleza $20 Gran Centenatio $11 Patrón $16 Nutty & Smokey Hints of oak, wood, brandy, earthy, fruit, cocoa, suede Arte NOM 1146 $20 Camarena $10 Chamucos $14 Don Ramon $12 El Tesoro $20 Espolon $12 Grand Mayan $24 Siete Leguas $15 Tequila Ocho $18 *House favorites Extra Añejo Aged for at least three years in oak barrels no larger than 600 liters, extra añejos are incredibly rich and concentrated with heavy, almost syrupy flavors and intense wood notes. 1800 Milenio $45 Avión Reserva 44 $30 Cazadores $16 Centinela Tres Años $29 Cincoro $280 Clase Azul Ultra $300 Código Origen $60 Corralejo $30 Don Fulano Imperial $37 El Mayor $20 G4 $30 Gran Centenario Leyenda $30 Grand Mayan Ultra $40 Herradura Selección Suprema $62 Jose Cuervo Reserva de la Familia $34 Partida Elegante $75 Patrón $20 Patrón Gran Burdeos $85 Patrón Piedra $67 Rey Sol $55 Tears of Llorona $55 Tequila Ocho $38 Mezcal Made from a variety of different agaves and usually produced by fire-roasting piñas in underground pits, giving mezcals the smokiness they are known for. Mezcals are an older and more traditional form of agave spirit and tend to have stronger, more intense flavor profiles than tequilas. Approachable For the beginners. Espadín and other milder agaves produce mezcals with gentle charred agave sweetness, moderate citrus, tropical fruit, burnt hardwoods, and earth. Exotic For the curious. Wild-harvested agaves and single village bottlings have very unique flavor profiles and strongly express their terroir, producing varied notes of vegetation, earth, mineral, fruits, citrus, spice and herbs. Artisanal For the bold. Rare agaves and traditional production techniques produce incredibly complex mezcals with a wide array of pungent aromas and intense flavors. Approachable For the beginners. Espadín and other milder agaves produce mezcals with gentle charred agave sweetness, moderate citrus, tropical fruit, burnt hardwoods, and earth. 400 Conejos Joven $9 Casamigos Joven $16 Del Maguey Chichicapa $16 Del Maguey Vida $11 Fidencio Clássico $12 Ilegal Joven $14 Ilegal Reposado $15 Meteoro Espadín $12 Montelobos Espadín $12 Sombra $12 Exotic For the curious. Wild-harvested agaves and single village bottlings have very unique flavor profiles and strongly express their terroir, producing varied notes of vegetation, earth, mineral, fruits, citrus, spice and herbs. 400 Conejos Espadín, Cuishe $14 400 Conejos Espadín, Tobala $14 Banhez Espadín y Barril $11 Bozal Cuixe $15 Bozal Tobaische $15 Del Maguey Minero $16 Del Maguey Vida de Muertos $14 Koch Espadín San Baltazar Guélavila $15 Nuestra Soledad San Luis del Rio $14 Yola Espadín, Madrecuixe $15 Artisanal For the bold. Rare agaves and traditional production techniques produce incredibly complex mezcals with a wide array of pungent aromas and intense flavors. Bozal Coyote Ancestral Reserva $24 Bozal Pechuga Sacrificio $20 Código Ancestral Paplomé $33 Del Maguey Tobala $29 Real Minero Pechuga $37 Other Juice There are many other types of spirits besides tequila and mezcal that can be made from a variety of agaves and related species. These spirits can exhibit a wide array of exotic aromas and flavors. Other Juice There are many other types of spirits besides tequila and mezcal that can be made from a variety of agaves and related species. These spirits can exhibit a wide array of exotic aromas and flavors. Balam Raicilla Madurado Flor de Desierto Sotol Sierra La Higuera Wheeleri Sotol Pizcadores Bancanora Joven & Cristalino 100% agave Jovens are blancos blended with small amounts of reposados or añejos so that the intense agave notes found in a blanco are balanced by the deeper notes of an aged tequila. Cristalinos are aged tequilas that have been filtered to remove colors and heavier wood notes that come from barrel-aging, resulting in a tequila with the complexity of an añejo but with the bright notes and color of a blanco. Joven & Cristalino 100% agave Jovens are blancos blended with small amounts of reposados or añejos so that the intense agave notes found in a blanco are balanced by the deeper notes of an aged tequila. Cristalinos are aged tequilas that have been filtered to remove colors and heavier wood notes that come from barrel-aging, resulting in a tequila with the complexity of an añejo but with the bright notes and color of a blanco. 1800 $15 Avión Reserva $30 Casa Dragones Joven $68 Cazadores $12 Clase Azul Joven Gold $65 Don Julio 70th Anniversary $18 Espolón $18 Gran Centenario $20 Herradura Ultra $15 Lobos Joven $14 Maestro Dobel 50 $30 Partida $15 House Flights Try one of our curated \"expression\" flights as shown below or ask your server about a blanco, reposado, and añejo \"familia.\" Mezcal Ilegal Joven / Banhez Espadín y Barril / Del Maguey Vida de Muertos Classic Espadín notes of clean agave, citrus, & light smoke / Floral, fruity blend of Espadín & Barril agaves with balanced spice and citrus / Special high-proof, single-village expression with deep vegetal and citrus tones. $18 Blanco Blanco tequilas are the perfect way to taste and experience the terrior of a tequila - the effects that different growing regions have on agave fruit and the spirits made from them. Blanco I - El Valle Código / Partida / Jose Cuervo Reserva de la Familia Tequilas from \"the Valley\" tend to be a bit bolder and assertive, with earthy, vegetal, spicy, and herbal flavors $20 Blanco II - Los Altos Siete Leguas / El Tesoro / Patrón Tequilas from \"the Highlands\" tend to be somewhat sweeter and softer, with more tropical fruit, ﬂoral, and mineral notes $20 Reposado Milagro Select Barrel / Don Julio / Casamigos Single barrel expression with light oak, spice, & caramel / Mellow oak, vanilla, fruit, & smoke / Full-bodied agave expression, deep caramel & wood sugars $21 Añejo El Mayor / Gran Centenario / Herradura Soft, sweet, & buttery roasted agave / Honey-spiced rich, toasted oak / Deep roasted fruit, cocoa, wood, & vanilla $18 Extra Añejo Corralejo / Avión 44 / Jose Cuervo Reserva de la Familia Lush, intense fruit, caramel, & oak / Custom \"petite\" cask aging; rich & silky / Complex, rich, & nuanced private family reserve $45 El Presidente Centenario Leyenda / Herradura Selección Suprema / Partida Elegante Aged in French Limousin Oak; warm & velvety balance of vanilla, agave, & dark spice / Rich & ﬂoral with complex fruit & agave. Long ﬁnish of creamy, toasted oak / Deep wood, caramel, pepper, cocoa, & honey; elegant & reﬁned $80 Cristalino Herradura Ultra / Don Julio 70th Anniversary / Avión Reserva Dark vanilla, birthday cake, & dried fruit / Light oak, baking spice, & light vanilla-honey / Caramel, cinnamon, hints of mineral, citrus, & toasted nuts $30 Cocktails Matador Favorites Mezcalerita Koch Elemental Espadín, triple sec, orange, lemon, lime, agave, orange bitters, Tajin $13 Oaxacan Old Fashioned Ilegal Joven, aromatic bitters, agave, orange peel $15 Ancho Paloma Rosaluna Joven, Ancho Reyes Chile liqueur, lime, grapefruit, Squirt, sal de gusano $13.5 Pineapple-Habanero Margarita Koch Elemental Espadín, triple sec, pineapple, lime, habanero, chile salt, Tajin $13.5 Mezcal Negra Rosaluna Joven, Averna, orange bitters, cherry $15 Ginger-Orange Margarita Ilegal Joven, Solerno Blood Orange liqueur, ginger, orange, lime, spiced citrus sugar $15.5 Pineapple Mule Koch Elemental Espadín, grilled pineapple, ginger-orange syrup, lime, soda, served in a copper mug $13 Smokey Margarita Ilegal Joven, triple sec, charred pineapple, lime, Tajin $14 Chile Mango Margarita Rosaluna Joven, Ancho Reyes Chile liqueur, mango, agave, lime, spiced citrus sugar $15 Passionfruit Margaritas Koch Elemental Espadín, Passoã Passionfruit liqueur, lemon, lime, agave, chile salt $13.5 Bee Sting Ilegal Joven, honey, lemon, ancho chile $14 Mezcal Michelada Dos XX lager, Koch Elemental Espadín, spicy tomato, tamarind, lime, celery bitters, Tajin $12 Matador Favorites House* Lunazul Blanco, triple sec, lime, lemon, agave $12.5 Cadillac Lunazul Blanco, triple sec, lime, lemon, agave, Grand Marnier $13.5 Bartender's Olmeca Altos Reposado, triple sec, lime, lemon, agave, cranberry, Grand Marnier $14 Top Shelf Patrón Silver, Cointreau, lime, lemon, agave $16 Blood Orange Lalo Blanco, Solerno Blood Orange liqueur, citrus, agave $15.5 Cucumber-Jalapeńo Exotico Blanco, triple sec, cucumber, jalapeño, lemon, lime, agave, Tajin $13.5 FOOD Menu Menu Chips & Salsa (gf/veg) Freshly fried corn tortillas, house-roasted tomato salsa $4 Matador Guacamole (gf/veg) Orange-habanero salsa Maya, tomatillo salsa, pico, queso fresco, cilantro, fried corn tortillas $11 Dip Flight (gf/veg) Creamy three-cheese queso, fresh guacamole, and hearty black bean dip $15 Bacon Cheeseburger* Charbroiled steak burger, arugula, pico de gallo, bacon, French fried onions, Jack & cheddar cheeses, chipotle mayo, chipotle-garlic $17 Sauteed Prawns (gf) Roasted garlic & jalapeño polenta, hibiscus- pickled onion, cilantro Choice of sauce: Garlic-chile butter, poblano crema, fiery habanero $14 Baja Fish Tacos Panko crusted and fried mahi mahi, serrano slaw, guacamole, chipotle mayo, radish, cilantro, lime $11 Taco Flight Three large tacos on flour tortillas Shredded chicken, carnitas, and beef picadillo tacos topped with serrano slaw, tomatillo salsa, pico de gallo, garlic crema, cotija cheese $17 Flights Beginner I Ilegal Joven / Banhez Artesanal / Del Maguey Vida Puebla Classic Espadín notes of clean agave, citrus, & light smoke / Floral, fruity blend of Espadín & Barril agaves with balanced spice and citrus / Single-village expression from the base of the volcano Popocatépetl; green herb & vegetal notes with savory roasted agave $16 Beginner II Nuestra Soledad San Luis del Rio / Koch Espadín San Baltazar Guélavila / Don Amado Rustico High-mountain, single-village Espadín; balanced agave, mineral, citrus / From the Tlacolula district in the Valles Centrales region; subtle mineral, fruit, herbs, & brine / Clay pot-distilled Espadín from Santa Catarina Minas; deep, warm, floral $20 Advance I Real Minero Largo / Mezcales de Leyenda Guerrero / Tileño Tepextate Rare, wild agave from the Karwinskii family; sharp fruit, chocolate, dry ash & smoke / Cupreata agave wild-harvested from high-altitude oak forests; complex tropical & citrus notes with subtle spice / Seldom-distilled 25-year-old wild agave; deep fruit, intense mineral, spice & citrus $36 Advanced II Bozal Chino Verde Ancestral Reserva / Mezcales de Leyenda Durrango / Del Maguey Pechuga Rare agave foraged from the Sierra Madre del Sur mountains; pronounced herb and smoke, charred wood & desert soil / High-altitude desert maguey Cenizo; buttery, intense, exotic fruit, earth & clay / Espadín clay pot-distilled with chicken breast & wild-mountain apples, bananas, pineapples, & plums $41 Aficionada Chacolo Ixtero Amarillo / C ódigo Ancestral Papalomé / Coyote Sotol Vibora Maguey Ixtero Amarillo milled by hand with axes, naturally fermented in wooden tinas, and distilled in a Filipino still made of copper and a hollowed out tree trunk; creamy but dry, aggresive herbs, spice, salinity, & tropical fruit / Tobala agaves harvested from sub-tropical forests in mountain canyons & fermented in leather tanks; rustic & raw, intensely floral, aromatic, vegetal, & sweet / Pechuga-style Sotol distilled with rattlesnake meat & rattlesnake venom before a 2-month aging; savory & full-bodied with powerful mineral, herb, & salinity $41 Mezcal Made from a variety of different agaves and usually produced by fire-roasting piñas in underground pits, giving mezcals the smokiness they are known for. Mezcals are an older and more traditional form of agave spirit and tend to have stronger, more intense flavor profiles than tequilas. Approachable For the beginners. Espadín and other milder agaves produce mezcals with gentle charred agave sweetness, moderate citrus, tropical fruit, burnt hardwoods, and earth. Advanced For the curious. Wild-harvested agaves and single village bottlings have very unique flavor profiles and strongly express their terroir, producing varied notes of vegetation, earth, mineral, fruits, citrus, spice, and herbs. Exotic For the bold. Rare agaves and ancestral production techniques produce incredibly complex mezcals with a wide array of pungent aromas and intense flavors. Approachable For the beginners. Espadín and other milder agaves produce mezcals with gentle charred agave sweetness, moderate citrus, tropical fruit, burnt hardwoods, and earth. 400 Conejos Joven $10 Banhez Espadín y Barril $10 Casamigos Joven $16 Del Maguey Chichicapa $18 Del Maguey Vida $12 Del Maguey Vida Puebla $11 Fidencio Clásico $13 Ilegal Joven $13 Ilegal Reposado $15 Montelobos Espadín $12 Siete Misterios Doba-Yej $11 Sombra $12 Tileño Espadín $16 Union $11 Advanced For the curious. Wild-harvested agaves and single village bottlings have very unique flavor profiles and strongly express their terroir, producing varied notes of vegetation, earth, mineral, fruits, citrus, spice, and herbs. 400 Conejos Espadín y Cuishe $14 400 Conejos Espadín y Tobala $14 Bozal Cuixe $15 Bozal Tepeztate $16 Bozal Tobasiche $16 Del Maguey Minero $16 Del Maguey Santo Domingo Albarradas $16 Del Maguey Vida de Muertos $14 Derrumbes San Luis Potosi $15 Don Amado Rustico $15 Ilegal Añejo $25 Koch Espadín San Baltazar Guélavila $16 Los Nahuales Joven Mezcales De Leyenda Durango $20 Mezcales De Leyenda Guerrero $20 Mezcales De Leyenda Oaxaca $18 Nuestra Soledad Lachigui $14 Nuestra Soledad San Baltazar $14 Nuestra Soledad San Luis del Rio $14 Real Minero Barril $32 Real Minero Espadín $28 Real Minero Largo $32 Siete Misterios Espadín y Tepeztate $22 Siete Misterios Espadín y Tobala $24 Yola Espadín, Madrecuixe $15 Exotic For the bold. Rare agaves and ancestral production techniques produce incredibly complex mezcals with a wide array of pungent aromas and intense flavors. Banhez Pechuga $22 Banhez Tepeztate $22 Banhez Tobala $24 Bozal Borrego Sacrificio $26 Bozal Chino Verde Ancestral Reserva $26 Bozal Coyote Ancestral Reserva $26 Bozal Pechuga Sacrificio $24 Código Ancestral Papalomé $35 Del Maguey Pechuga $40 Del Maguey Tobala $29 Fidencio Pechuga $20 Derrumbes San Luis Potosi $12 Lost Explorer Tobala $29 Montelobos Pechuga $28 Montelobos Tobala $24 Real Minero Pechuga $38 Rey Campero Jabali $26 Scorpion 5 year $34 Siete Misterios Coyote $32 Siete Misterios Pechuga $55 Tileño Tepextate $25 Tileño Tobala $20 *House favorites OTHER JUICE There are many other types of spirits besides tequila and mezcal that can be made from a variety of agaves and related species. These spirits can exhibit a wide array of exotic aromas and flavors. OTHER JUICE There are many other types of spirits besides tequila and mezcal that can be made from a variety of agaves and related species. These spirits can exhibit a wide array of exotic aromas and flavors. Balam Raicilla Madurado $16 Chacolo Ixtero Amarillo $29 Coyote Sotol Vibora $20 Flor de Desierto Sotol Cascabel $20 Flor de Desierto Sotol Sierra $15 La Higuera Wheeleri Sotol $12 Pizcadores Bancanora $15 Pizcadores Raicilla $15 Rancho Tepúa Bacanora $16 Siempre Sotol $12 When you visit the Site, we automatically collect certain information about your device, including information about your web browser, IP address, time zone, and some of the cookies that are installed on your device. Privacy Policy Ok. I Agree",
      "hash": "e10af30e4ffd",
      "downloadedAt": "2026-01-18T16:54:33.558Z",
      "trimmedAt": "2026-01-18T17:04:52.912Z",
      "sizeReduction": "93.0%"
    },
    {
      "url": "https://www.matadorrestaurants.com/locations/charleston-sc",
      "text": "Matador Charleston The Matador is located in the heart of downtown Charleston. Here, we celebrate Mexico's flavors and the world of tequila and agave spirits. The menu features scratch-made dishes using the freshest seasonal produce, seafoods, and meats and the tequila list is extensive, with something to suit every taste. The restaurant's interior is stylish, sophisticated, warm, and inviting. On weekends, experience our upstairs Mezcaleria bar or grab a seat on our rooftop patio. The staff is knowledgeable about tequila and Mexican-inspired cuisine, and they are ready to guide your experience to help you find your perfect drink and dish. Whether you're a tequila connoisseur or just looking for a delicious meal, The Matador is the perfect place to experience the best of Mexico! Book your Matador reservation on Resy Order Online Private Events Purchase Gift Card Location& Hours Located in downtown Charleston's historic district 235 Meeting St Charleston, SC 29401 843-789-4747 Get Directions Regular Hours: Monday - Sunday: 11am -12am Happy Hour: Daily 4-6pm and 10pm-Last Call Happy Hour + Late Night Family-Style Meal Kits Mezcaleria Food and Drink Menu View Menus Main Dine-In Menu Cocktails Happy Hour Tequila Wine Mezcaleria Dessert Private Events Our spaces can accommodate groups of all sizes, from intimate gatherings to large corporate parties. We offer a private bar, an outdoor patio, catering, and TVs to ensure that your event has everything you need. We offer a wide range of customizable menu options to suit any need or budget. Whether you're planning a small gathering or a large-scale event, we can work with you to create a food and beverage menu that your guests will love. We also happily work with any dietary preferences or restrictions you may have so that everyone can enjoy. We look forward to helping you create a truly unforgettable event! BOOK WITH US ON TRIPLESEAT Book an Event Join Our Team We are always looking for passionate people who want to help us create an extraordinary experience for our guests. If that sounds like you, you’ll love it here, and we want to meet you. Follow the link below to tell us something about yourself below, or just call or stop by one of our restaurants to set up an interview. Apply Now When you visit the Site, we automatically collect certain information about your device, including information about your web browser, IP address, time zone, and some of the cookies that are installed on your device. Privacy Policy Ok. I Agree",
      "hash": "fa645d776555",
      "downloadedAt": "2026-01-18T16:54:31.485Z",
      "trimmedAt": "2026-01-18T17:04:52.919Z",
      "sizeReduction": "94.9%"
    }
  ],
  "sizeReduction": "93.1%"
}