{
  "venueId": "ChIJS-Xt4Fl8_ogRqbb-LugpDWo",
  "venueName": "Chick-fil-A",
  "venueArea": "West Ashley",
  "website": "https://www.chick-fil-a.com/locations/sc/ashley-crossing?utm_source=yext&utm_medium=link",
  "scrapedAt": "2026-01-18T17:04:26.430Z",
  "trimmedAt": "2026-01-18T17:08:00.399Z",
  "pages": [
    {
      "url": "https://www.chick-fil-a.com/menu/sides",
      "text": "Skip to content Sides Price and availability may vary by location. Waffle Potato Fries Chick-fil-A ® 420 Cal per Serving Order now Fruit Cup 70 Cal per Serving Order now Side Salad 470 Cal per Serving Order now Mac & Cheese 450 Cal per Serving Order now Chicken Noodle Soup 190 Cal per Serving Order now Chicken Tortilla Soup 350 Cal per Serving Order now Original Flavor Waffle Potato Chips 220 Cal per Serving Order now Sauce Flavored Waffle Potato Chips Chick-fil-A ® 210 Cal per Serving Order now Buddy Fruits Apple Sauce ® 45 Cal per Container Order now Kale Crunch Side 170 Cal per Serving Order now Berry Parfait 270 Cal per Serving Order now What's next Explore kid's meals View kid's meals Find a restaurant Enter your address, city and state, or zip, or use your current location. Please enter an address Use my location Search View details Sign in with Chick-fil-A One™ to favorite this location Earn points, redeem rewards and reach new tiers with increasing benefits. Access your order history to make quick reorders and edits to existing orders. Sign in with Chick-fil-A One™ See You Soon! You're Leaving Chick-fil-A.com. Continue Cancel What type of order can we get started for you? Order ahead for pickup or let us deliver to your location Order Pickup Order Delivery",
      "hash": "032ad26931b9",
      "downloadedAt": "2026-01-18T17:02:08.171Z",
      "trimmedAt": "2026-01-18T17:08:00.175Z",
      "sizeReduction": "99.5%"
    },
    {
      "url": "https://www.chick-fil-a.com/menu/entrees",
      "text": "Skip to content Entrées Price and availability may vary by location. Chick-fil-AChicken Sandwich Meal ® Try this new spin on classics – a Chick-fil-AChicken Sandwich with your favorite side and Frosted Soda or Float. Cold and fizzy. Warm and crispy. ® Order now Chicken Sandwich Chick-fil-A ® 420 Cal per Sandwich Order now Spicy Deluxe Sandwich 540 Cal per Sandwich Order now Spicy Chicken Sandwich 450 Cal per Sandwich Order now Nuggets Chick-fil-A ® 250 Cal per Entree Order now Grilled Nuggets 130 Cal per Entree Order now Deluxe Sandwich Chick-fil-A ® 490 Cal per Sandwich Order now Cool Wrap Chick-fil-A ® 660 Cal per Entree Order now Chick-n-Strips Chick-fil-A ® 310 Cal per Entree Order now Grilled Chicken Sandwich 390 Cal per Sandwich Order now Grilled Chicken Club Sandwich Chick-fil-A ® 520 Cal per Sandwich Order now What's next Explore salads View salads Find a restaurant Enter your address, city and state, or zip, or use your current location. Please enter an address Use my location Search View details Sign in with Chick-fil-A One™ to favorite this location Earn points, redeem rewards and reach new tiers with increasing benefits. Access your order history to make quick reorders and edits to existing orders. Sign in with Chick-fil-A One™ See You Soon! You're Leaving Chick-fil-A.com. Continue Cancel What type of order can we get started for you? Order ahead for pickup or let us deliver to your location Order Pickup Order Delivery",
      "hash": "16bd33ebf06f",
      "downloadedAt": "2026-01-18T17:02:07.066Z",
      "trimmedAt": "2026-01-18T17:08:00.200Z",
      "sizeReduction": "99.3%"
    },
    {
      "url": "https://www.chick-fil-a.com/menu/beverages",
      "text": "Skip to content Beverages Price and availability may vary by location. Lemonade Chick-fil-A ® 260 Cal per Container Order now Diet Lemonade Chick-fil-A ® 60 Cal per Container Order now Sunjoy (1/2 Sweet Tea, 1/2 Lemonade) ® 240 Cal per Container Order now Sunjoy (1/2 Sweet Tea, 1/2 Diet Lemonade) ® 110 Cal per Container Order now Sunjoy (1/2 Unsweet Tea, 1/2 Lemonade) ® 160 Cal per Container Order now Sunjoy (1/2 Unsweet Tea, 1/2 Diet Lemonade) ® 35 Cal per Container Order now Freshly-Brewed Iced Tea Sweetened 120 Cal per Container Order now Freshly-Brewed Iced Tea Unsweetened 0 Cal per Container Order now Iced Coffee 200 Cal per Container Order now DASANI Bottled Water ® 0 Cal per Bottle Order now Honest Kids Apple Juice ® 35 Cal per Container Order now Simply Orange ® 160 Cal per Container Order now 1% Chocolate Milk 140 Cal per Container Order now 1% Milk 90 Cal per Container Order now Dr Pepper ® 170 Cal per Container Order now Gallon Beverages 2190 Cal per Gallon Order now Coca-Cola ® 170 Cal per Container Order now Coffee 0 Cal per Container Order now What's next Explore dipping sauces and dressings View dipping sauces and dressings Find a restaurant Enter your address, city and state, or zip, or use your current location. Please enter an address Use my location Search View details Sign in with Chick-fil-A One™ to favorite this location Earn points, redeem rewards and reach new tiers with increasing benefits. Access your order history to make quick reorders and edits to existing orders. Sign in with Chick-fil-A One™ See You Soon! You're Leaving Chick-fil-A.com. Continue Cancel What type of order can we get started for you? Order ahead for pickup or let us deliver to your location Order Pickup Order Delivery",
      "hash": "1c0b0d5b703a",
      "downloadedAt": "2026-01-18T17:02:10.395Z",
      "trimmedAt": "2026-01-18T17:08:00.228Z",
      "sizeReduction": "99.2%"
    },
    {
      "url": "https://www.chick-fil-a.com/menu/dipping-sauces-and-dressings",
      "text": "Skip to content Dipping Sauces and Dressings Price and availability may vary by location. Barbeque Sauce 45 Cal per Container Sauce Chick-fil-A ® 140 Cal per Container Garden Herb Ranch Sauce 100 Cal per Container Honey Mustard Sauce 50 Cal per Container Polynesian Sauce 110 Cal per Container Sweet & Spicy Sriracha Sauce 45 Cal per Container Zesty Buffalo Sauce 25 Cal per Container Honey Roasted BBQ Sauce 60 Cal per Packet Avocado Lime Ranch Dressing 310 Cal per Packet Creamy Salsa Dressing 290 Cal per Packet Fat-Free Honey Mustard Dressing 90 Cal per Packet Garden Herb Ranch Dressing 280 Cal per Packet Light Balsamic Vinaigrette Dressing 80 Cal per Packet Light Italian Dressing 25 Cal per Packet Zesty Apple Cider Vinaigrette Dressing 230 Cal per Packet What's next Explore breakfast View breakfast Find a restaurant Enter your address, city and state, or zip, or use your current location. Please enter an address Use my location Search View details Sign in with Chick-fil-A One™ to favorite this location Earn points, redeem rewards and reach new tiers with increasing benefits. Access your order history to make quick reorders and edits to existing orders. Sign in with Chick-fil-A One™ See You Soon! You're Leaving Chick-fil-A.com. Continue Cancel What type of order can we get started for you? Order ahead for pickup or let us deliver to your location Order Pickup Order Delivery",
      "hash": "24d47764cb7d",
      "downloadedAt": "2026-01-18T17:02:11.667Z",
      "trimmedAt": "2026-01-18T17:08:00.247Z",
      "sizeReduction": "99.3%"
    },
    {
      "url": "https://www.chick-fil-a.com/menu/family-style-meals",
      "text": "Skip to content Family Style Meals Price and availability may vary by location. Chick-n-Strips Family Style Meal Chick-fil-A ® 430 Cal per Serving Order now Nuggets Family Style Meal Chick-fil-A ® 430 Cal per Serving Order now Grilled Nuggets Family Style Meal 430 Cal per Serving Order now What's next Explore entrées View entrées Find a restaurant Enter your address, city and state, or zip, or use your current location. Please enter an address Use my location Search View details Sign in with Chick-fil-A One™ to favorite this location Earn points, redeem rewards and reach new tiers with increasing benefits. Access your order history to make quick reorders and edits to existing orders. Sign in with Chick-fil-A One™ See You Soon! You're Leaving Chick-fil-A.com. Continue Cancel What type of order can we get started for you? Order ahead for pickup or let us deliver to your location Order Pickup Order Delivery",
      "hash": "9bbdd484600a",
      "downloadedAt": "2026-01-18T17:02:09.282Z",
      "trimmedAt": "2026-01-18T17:08:00.260Z",
      "sizeReduction": "99.5%"
    },
    {
      "url": "https://www.chick-fil-a.com/menu/treats",
      "text": "Skip to content Treats Price and availability may vary by location. A new spin on handspun Frosted Sodas and Floats Treat yourself to something sweet with our new Frosted Sodas and Floats, available in your choice of fountain beverage. View products Frosted Lemonade 350 Cal per Serving Order now Frosted Sodas 320 Cal per Serving Order now Floats 320 Cal per Serving Order now Vanilla Milkshake 580 Cal per Milkshake Order now Cookies & Cream Milkshake 630 Cal per Milkshake Order now Chocolate Milkshake 600 Cal per Milkshake Order now Strawberry Milkshake 560 Cal per Milkshake Order now Icedream Cup Chick-fil-A ® ® 140 Cal per Cup Order now Icedream Cone Chick-fil-A ® ® 180 Cal per Cone Order now Chocolate Chunk Cookie 370 Cal per Cookie Order now Chocolate Fudge Brownie 370 Cal per Brownie Order now Frosted Coffee 260 Cal per Serving Order now What's next Explore beverages View beverages Find a restaurant Enter your address, city and state, or zip, or use your current location. Please enter an address Use my location Search View details Sign in with Chick-fil-A One™ to favorite this location Earn points, redeem rewards and reach new tiers with increasing benefits. Access your order history to make quick reorders and edits to existing orders. Sign in with Chick-fil-A One™ See You Soon! You're Leaving Chick-fil-A.com. Continue Cancel What type of order can we get started for you? Order ahead for pickup or let us deliver to your location Order Pickup Order Delivery",
      "hash": "c2acab9055bd",
      "downloadedAt": "2026-01-18T17:02:09.836Z",
      "trimmedAt": "2026-01-18T17:08:00.289Z",
      "sizeReduction": "99.5%"
    },
    {
      "url": "https://www.chick-fil-a.com/menu",
      "text": "Skip to content Language: English Español Menu Chick-fil-A ® Price and availability may vary by location. Breakfast Chicken for breakfast? Yes, please. If you’ve only visited us for lunch or dinner, you’re missing our Hashbrowns, Burritos, Berry Parfait and more. View all breakfast items Chick-n-Minis Chick-fil-A ® Order now Spicy Chicken Biscuit Order now Entrées From our Original Chick-fil-AChicken Sandwich to our new Frosted Sodas and Floats, we have something for everyone. ® View all entrées Chicken Sandwich Chick-fil-A ® Order now Nuggets Chick-fil-A ® Order now Salads Go green with these options, prepared fresh daily, and perk them up with our variety of dressings. View all salads Sides An entrée without a side is like a day without sunshine. Whether you choose an old favorite like Waffle Fries or mix it up with something new like Mac & Cheese, make it a meal by adding a side. View all sides Entrées From our Original Chick-fil-AChicken Sandwich to our new Frosted Sodas and Floats, we have something for everyone. ® View all entrées Chicken Sandwich Chick-fil-A ® Order now 8 ct Nuggets Chick-fil-A ® Order now Breakfast Chicken for breakfast? Yes, please. If you’ve only visited us for lunch or dinner, you’re missing our Hashbrowns, Burritos, Berry Parfait and more. View all breakfast items Chick-n-Minis Chick-fil-A ® Order now Spicy Chicken Biscuit Order now Kid’s Meals From Grilled Nuggets to Fruit Cups, we have several options for our youngest guests. View all Kid’s Meals Beverages Satisfy your thirst with a Sunjoy, Lemonade, Iced Tea and more. ® View all beverages Treats You deserve a little something sweet. How does a Frosted Soda, Chocolate Chunk Cookie or Fudge Brownie sound? View all treats Catering Make any occasion special by ordering a catered feast. From Nugget Trays to boxed meals, we handle the prep so you can enjoy the party. Chick-fil-A ® View catering menu Find a restaurant Enter your address, city and state, or zip, or use your current location. Please enter an address Use my location Search View details Sign in with Chick-fil-A One™ to favorite this location Earn points, redeem rewards and reach new tiers with increasing benefits. Access your order history to make quick reorders and edits to existing orders. Sign in with Chick-fil-A One™ See You Soon! You're Leaving Chick-fil-A.com. Continue Cancel What type of order can we get started for you? Order ahead for pickup or let us deliver to your location Order Pickup Order Delivery",
      "hash": "cec45c69610f",
      "downloadedAt": "2026-01-18T17:02:12.237Z",
      "trimmedAt": "2026-01-18T17:08:00.317Z",
      "sizeReduction": "99.0%"
    },
    {
      "url": "https://www.chick-fil-a.com/locations/sc/ashley-crossing?utm_source=yext&utm_medium=link",
      "text": "Skip to content Restaurant Details Restaurant Details About us Community Careers Hours Monday - Saturday 6:00 AM-10:00 PM EST Sunday Closed Service Options and Hours Dine-in Monday - Saturday 6:00 AM-10:00 PM EST Curbside Pickup Monday - Saturday 7:00 AM-8:00 PM EST Carry-out Monday - Saturday 6:00 AM-10:00 PM EST Drive-thru Monday - Saturday 6:00 AM-10:00 PM EST Delivery Monday - Saturday 6:15 AM-9:45 PM EST Rewards One membership benefits Chick-fil-A ® When you join our tiered membership program One, you can start earning points every time you order the food you love. Chick-fil-A Join One® Chick-fil-A Sign in Additional Delivery Partners Available Amenities at this restaurant Mobile Ordering Drive-thru Catering Pickup Catering Delivery Breakfast Limited amenities available, please contact Restaurant with any questions. About us Friendly faces, clean spaces and flowers on the tables are just a few ways we try to make your visit pleasant. Learn more Community More than just chicken, we strive to support local causes and look for ways to give back to the community. Learn more Careers We’re looking for friendly faces to join our team. Find out what it’s like to work here and browse our careers. Learn more Follow us on social Connect with Ashley Crossing Find a restaurant Enter your address, city and state, or zip, or use your current location. Please enter an address Use my location Search View details Sign in with Chick-fil-A One™ to favorite this location Earn points, redeem rewards and reach new tiers with increasing benefits. Access your order history to make quick reorders and edits to existing orders. Sign in with Chick-fil-A One™ See You Soon! You're Leaving Chick-fil-A.com. Continue Cancel Choose delivery type Delivery Partners We’ve partnered with your favorite delivery services to bring food right to your doorstep. Ashley Crossing map, address and directions 2013 Magwood Dr Charleston, SC 29414 Directions Close",
      "hash": "db8aff420047",
      "downloadedAt": "2026-01-18T17:02:06.441Z",
      "trimmedAt": "2026-01-18T17:08:00.344Z",
      "sizeReduction": "99.5%"
    },
    {
      "url": "https://www.chick-fil-a.com/menu/kidsmeals",
      "text": "Skip to content Kid’s Meals Price and availability may vary by location. 5 Ct Nuggets Kid’s Meal 160 Cal per Entree Order now 2 Ct Chick-n-Strips Kid’s Meal ® 200 Cal per Entree Order now 5 Ct Grilled Nuggets Kid’s Meal 80 Cal per Entree Order now What's next Explore treats View treats Ages 4 and up ™ Legends of Evergreen Hills Celebrate the magic of the holiday season with four different interactive card games inspired by the Evergreen Hills universe. Test your memory with a fun matching game, enjoy a twist on Old Maid, trade and collect your favorite apprentices and characters, and dive into an immersive adventure where you help restore the sparks of Evergreen. These games are perfect for fun with friends and family! Collect all four titles: , ,, and Memory Quest My Apprentice Save the Spark Spark Tree. Available from participating restaurant locations, while supplies last. Ages 3 and under You’re My Little Celebrate the special bond between parent and child with these sweet and colorful rhyming board books. Part of a best-selling series, they feature adorable pictures and simple ideas that help little ones learn about love and sharing joy together. Perfect for early childhood fun! Collect all four titles: You’re My Little Bookworm, You’re My Little Honey Bunny, You’re My Little Snuggle Bear, and You’re My Little Sunshine. Available from participating restaurant locations, while supplies last. Discover the Chick-fil-A Play™ App The Chick-fil-A Play App is your home for free, family-friendly shows, games and activities designed to create more time with your favorite people. Make meaningful moments together while you watch, play, create, listen, and read. Learn more about Chick-fil-A Play Find a restaurant Enter your address, city and state, or zip, or use your current location. Please enter an address Use my location Search View details Sign in with Chick-fil-A One™ to favorite this location Earn points, redeem rewards and reach new tiers with increasing benefits. Access your order history to make quick reorders and edits to existing orders. Sign in with Chick-fil-A One™ See You Soon! You're Leaving Chick-fil-A.com. Continue Cancel What type of order can we get started for you? Order ahead for pickup or let us deliver to your location Order Pickup Order Delivery",
      "hash": "e6eaa05f7025",
      "downloadedAt": "2026-01-18T17:02:08.731Z",
      "trimmedAt": "2026-01-18T17:08:00.362Z",
      "sizeReduction": "98.9%"
    },
    {
      "url": "https://www.chick-fil-a.com/menu/salads",
      "text": "Skip to content Salads Price and availability may vary by location. Cobb Salad 830 Cal per Salad (includes toppings and dressing) Order now Spicy Southwest Salad 680 Cal per Salad (includes toppings and dressing) Order now Market Salad 550 Cal per Salad (includes toppings and dressing) Order now What's next Explore sides View sides Find a restaurant Enter your address, city and state, or zip, or use your current location. Please enter an address Use my location Search View details Sign in with Chick-fil-A One™ to favorite this location Earn points, redeem rewards and reach new tiers with increasing benefits. Access your order history to make quick reorders and edits to existing orders. Sign in with Chick-fil-A One™ See You Soon! You're Leaving Chick-fil-A.com. Continue Cancel What type of order can we get started for you? Order ahead for pickup or let us deliver to your location Order Pickup Order Delivery",
      "hash": "f966eba117b3",
      "downloadedAt": "2026-01-18T17:02:07.616Z",
      "trimmedAt": "2026-01-18T17:08:00.375Z",
      "sizeReduction": "99.5%"
    },
    {
      "url": "https://www.chick-fil-a.com/menu/breakfast",
      "text": "Skip to content Breakfast Price and availability may vary by location. Chicken Biscuit Chick-fil-A ® 460 Cal per Biscuit Order now Spicy Chicken Biscuit 450 Cal per Biscuit Order now Chick-n-Minis Chick-fil-A ® 360 Cal per 4 Chick-n-Minis Order now Egg White Grill 300 Cal per Sandwich Order now Hash Brown Scramble Burrito 700 Cal per Burrito Order now Hash Brown Scramble Bowl 470 Cal per Bowl Order now Chicken, Egg & Cheese Biscuit 550 Cal per Biscuit Order now Bacon, Egg & Cheese Biscuit 420 Cal per Biscuit Order now Sausage, Egg & Cheese Biscuit 620 Cal per Biscuit Order now Chicken, Egg & Cheese Muffin 410 Cal per Sandwich Order now Bacon, Egg & Cheese Muffin 300 Cal per Sandwich Order now Sausage, Egg & Cheese Muffin 490 Cal per Sandwich Order now Hash Browns 270 Cal per Serving Order now Berry Parfait 270 Cal per Serving Order now Fruit Cup 70 Cal per Serving Order now What's next Explore entrées View entrées Find a restaurant Enter your address, city and state, or zip, or use your current location. Please enter an address Use my location Search View details Sign in with Chick-fil-A One™ to favorite this location Earn points, redeem rewards and reach new tiers with increasing benefits. Access your order history to make quick reorders and edits to existing orders. Sign in with Chick-fil-A One™ See You Soon! You're Leaving Chick-fil-A.com. Continue Cancel What type of order can we get started for you? Order ahead for pickup or let us deliver to your location Order Pickup Order Delivery",
      "hash": "fbb485c014d7",
      "downloadedAt": "2026-01-18T17:02:06.523Z",
      "trimmedAt": "2026-01-18T17:08:00.399Z",
      "sizeReduction": "99.3%"
    }
  ],
  "sizeReduction": "99.3%"
}