{
  "venueId": "ChIJl6_JCTJ7_ogRIauRHOYdIQo",
  "venueName": "Park & Grove",
  "venueArea": "West Ashley",
  "website": "http://www.parkandgrovechs.com/",
  "scrapedAt": "2026-01-18T17:04:29.099Z",
  "trimmedAt": "2026-01-18T17:11:38.560Z",
  "pages": [
    {
      "url": "http://www.parkandgrovechs.com/events/",
      "text": "Main content starts here, tab to start navigating Park & Groove hosts an annual Fall, Holiday, and Spring Edition Market series on Thursdays from 5:30–8:30pm in October, December, and April. Calling all vendors, shoppers, & friends who love to eat, drink, & move with the seasons! Please fill out the form below to apply as a vendor! We will reach out if your application is accepted. Cheers! Apply to Be a Vendor Tuesday is 1/2 Price Bottles of Wine – all night! Wednesday is Neighborhood Burger Night Happy Hour Park & Groove | New Year Market Load More Events Reservations Email Signup Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Park & Grove | American Restaurant in Charleston, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "06a36ef5bad3",
      "downloadedAt": "2026-01-18T17:03:08.677Z",
      "trimmedAt": "2026-01-18T17:11:38.449Z",
      "sizeReduction": "95.8%"
    },
    {
      "url": "http://www.parkandgrovechs.com/",
      "text": "Home Main content starts here, tab to start navigating Slide 1 of 8 Slide 2 of 8 Slide 3 of 8 Slide 4 of 8 Slide 5 of 8 Slide 6 of 8 Slide 7 of 8 Slide 8 of 8 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Make a Reservation PARKING: You can access free parking in the lot across the street as well as street parking along Rutledge & Grove Street. Reservations For reservations of 9 to 12 guests, please call us at: 843-410-1070 To book parties of 13 or more, please submit . this inquiry form 730 Rutledge Avenue Charleston, SC 29403 843-410-1070 Park & Grove Menus View Menus Our Story About Us We Promise to Keep it Fresh! Newsletter Sign Up Reservations Email Signup Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Park & Grove | American Restaurant in Charleston, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "295b8780a473",
      "downloadedAt": "2026-01-18T17:03:07.506Z",
      "trimmedAt": "2026-01-18T17:11:38.456Z",
      "sizeReduction": "96.1%"
    },
    {
      "url": "http://www.parkandgrovechs.com/menus/",
      "text": "Main content starts here, tab to start navigating Menus Slide 1 of 10 Slide 2 of 10 Slide 3 of 10 Slide 4 of 10 Slide 5 of 10 Slide 6 of 10 Slide 7 of 10 Slide 8 of 10 Slide 9 of 10 Slide 10 of 10 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides NIGHTLY SPECIALS Happy Hour • 3-6 pm WEEKDAYS TUESDAY 1/2 price select wine bottles Neighborhood Burger Night WEDNESDAY $10 smash burgers // $6 kid's burger Dinner Lunch Brunch Happy Hour Cocktails & More Kids Menu Restaurant Week Menu | Winter 2026 dinner • 5 - 9 monday thru saturday Small Plates Clammer Dave's Clams coconut curry, butterkin squash, tajín, fried pita 22 $ Crab Cake Succotash chilled succotash, herb vin, avocado crema 23 $ Crispy Pumpkin whipped ricotta, salsa macha, pear butter, pickled mushrooms 15 $ Butter Bean Hummus marinated tomatoes, pickled red onion, annie mae's pita, crudité 15 $ Salads Caesar Salad gem lettuce, spicy caesar, croutons, parmesan, boquerones 18 $ Apple & Kale Salad pickled fennel, manchego, candied walnuts, spiced orange vin 17 $ Entrées Blackened Market Fish braised collard greens, miso & sweet potato pureé, lemon oil 32 $ Ricotta Gnocchi mushroom walnut ragù, salsa verde, wilted baby kale, country fried oyster mushrooms 25 $ Chicken Milanese parmesan-crusted chicken, fennel & arugula salad with italian-style garlic dressing 23 $ Grilled Porkchop bok choy, pepper relish, sweet and sour 29 $ P&G Smash Burger double patty, cheddar, special sauce, lettuce, pickles, onion, fries • sub parmesan truffle fries $3 20 $ Braised Short Rib seared daikon, soy jus, radish slaw 32 $ Dessert Sticky Banana Toffee Pudding chocolate drizzle, caramel gelato 10 $ Sweet Potato Cheesecake toasted meringue, granola 10 $ Flourless Fudge Brownie vanilla gelato, caramel sauce 10 $ Gelato vanilla or salted caramel 4 $ Affogato espresso, choice of ice cream 8 $ Seasonal Sorbet 4 $ Monday - Friday Happy Hour • 3 to 6 food & drink offerings Tuesday no bottle left behind 1/2 price select bottles of wine Wednesday “hey neighbor” burger night $10 single patty smash burger, $6 kid’s burger • dine-in only lunch • 11 - 3 monday thru friday Starters & Salads Crispy Pumpkin whipped ricotta, salsa macha, pear butter, pickled mushrooms 15 $ Butter Bean Hummus marinated tomatoes, pickled red onion, annie mae's pita, crudité 15 $ Apple & Kale Salad pickled fennel, manchego, candied walnuts, spiced orange vin 17 $ Caesar Salad gem lettuce, spicy caesar, croutons, parmesan, boquerones 18 $ Seasonal Soup 10 $ Burger P&G Smash Burger double patty, cheddar, special sauce, lettuce, pickles, onion, fries served with fries • sub parmesan truffle fries $3 20 $ served with a side salad; sub fries +2, sub truffle fries +3, sub side soup +3 Sandwiches Braised Short Rib Grilled Cheese normandy farms sourdough, cheddar, fontal, pickled red onions, au jus 24 $ Crab Cake lump & claw meat, remoulade, shredded lettuce, pickled red onion, annie mae's sesame bun 23 $ Crispy Chicken Sandwich hatch chili aioli, bacon, shredded lettuce, focaccia 22 $ Cuban mojo pulled pork, ham, swiss, mojo dijonnaise, pickles, foccacia 20 $ Falafel Pita cucumber tomato salad, tzatziki, annie mae's pita 18 $ Fried Egg Sandwich bacon, avocado smash, sunny egg, cheddar, special sauce, annie mae's sesame bun 17 $ Plates Veggie Bowl carolina gold rice, seasonal vegetables, benne seeds, saba, cilantro 16 $ Fried Chicken braised collards, crispy potatoes, hot honey, garlic aioli 18 $ Additions Avocado 5 $ Local Grilled Shrimp 9 $ Chicken 9 $ Lump & Claw Crab Cake 20 $ Coffee Charleston Fog earl grey latte, lavender marshmallow 7 $ Eastwood coconut, nutella, cold brew 7 $ Orange Mocha Latte orange, chocolate, orange zest 7 $ Oatmeal Cookie Latte fall spices, vanilla, oatmilk 8 $ Latte 6 $ Espresso 4 $ Cappuccino 6 $ brunch • 9 - 2:30 saturday & sunday Shareable Sweets Cinnamon Rolls cream cheese icing, candied nuts 12 $ Banana Bread dark chocolate drizzle, dates, whipped honey butter 10 $ Buttermilk Biscuits with your choice of mushroom gravy or cinnamon butter 11 $ Brunch Plates Fried Egg Sandwich bacon, avocado smash, sunny egg, cheddar, special sauce, sesame bun, side of grapefruit 16 $ Benedict crab cake, poached eggs, hollandaise, english muffin 28 $ Croque Madame black forest ham, gruyère, sunny egg, dijon, mornay sauce, sunny egg, arugula salad 18 $ Pancakes berry compote, whipped cream 14 $ Huevos Rancheros braised & ground beef, great northern beans, corn tortilla, hominy, queso, avocado smash, sour cream, tomatillo salsa, sunny eggs 18 $ Fried Chicken housemade biscuit, hot honey, mushroom gravy 18 $ Brunch Burger smash patty, bacon, cheddar, special sauce, sunny egg, spicy breakfast potatoes 18 $ add a second patty 4 $ Avocado Toast smashed avocado, sunny egg, za'atar spice, chili oil, lemon zest, arugula salad 17 $ Seasonal Veggie Sautée grilled halloumi, poached eggs, balsamic • add grilled chicken or grilled shrimp $9 • add avocado $5 20 $ Walk in the Park eggs any style, breakfast potatoes, bacon, grapefruit 16 $ Coffee Oatmeal Cookie Latte fall spices, vanilla, oatmilk 8 $ Charleston Fog earl grey latte, lavender marshmallow 7 $ Eastwood cold brew, coconut, nutella 7 $ Orange Mocha house orange syrup, chocolate, orange zest 7 $ Westwood bourbon, cold brew, coconut, nutella 13 $ Monday - Friday Happy Hour • 3 to 6 food & drink offerings Tuesday Tuesday no bottle left behind 1/2 price select bottles of wine Wednesday Wednesday “hey neighbor” burger night $10 single patty smash burger, $6 kid’s burger • dine-in only happy hour • snacks 3 - 6 weekdays Drinks Garden Gimlet gin, seasonal berry, celery, lime, simple 9 $ Golden Hour bourbon, lemon, honey syrup, lavender, rhubarb bitters 9 $ Grove Negroni gin, antica, campari, orange bitters 9 $ Garden Cosmo tito's vodka, lime, agave, cranberry, orange bitters 9 $ Wine white • grüner veltliner rosé • rosato red • gamay 8 $ Beer sour • edmund's oast n/a beer • untitled art 5 $ Spirit Free Choices october sky / blood orange, simple, ginger beer fall breeze / pomegranate, lemon, simple, soda cherry picking / cherry shrub, lemon, simple, ginger beer 5 $ Shareable Punch Bowls Punch Bowls (Serves 3 – 4) ask your server for current seasonal selections 36 $ Snacks P&G Smash Burger double patty, cheddar, special sauce, lettuce, pickles, onion, fries served with fries • sub parmesan truffle fries $3 20 $ Side of Fries add white truffle oil, parmigiano, parsley, aioli +3 8 $ Fritto Misto polenta fried fish, peppers, & onions, aioli 8 $ Butter Bean Hummus marinated tomatoes, pickled red onion, annie mae's pita, crudité 15 $ Sip into something delectable with our curated cocktails & spirit-free options with something smooth for every palette! Seasonal Cocktails cherry bomb tito’s, cherry shrub, limoncello, lime, soda 14 $ queen bee house-infused brown butter gin, lemon, honey 15 $ persephone tequila, pomegranate, blood orange, agave, black salt rim 15 $ harvest moon tito's, cherry-infused cacao liqueur, licor 43 chocolate cream, mole bitters, egg white 16 $ in equal measure white rum, domaine de canton, amaro montenegro, lime, candied pineapple 16 $ Spirit-Free october sky blood orange, simple, ginger beer 8 $ cherry picking cherry shrub, lemon, simple, ginger beer 8 $ fall breeze pomegranate, lemon, simple, soda 8 $ Untitled Art non-alcoholic beer 6 $ Kid's Menu Mac & Cheese add veggies +$4 add grilled chicken +$9 add grilled shrimp +$9 9 $ Grilled Chicken & Veggies 12 $ Kid-Size Cheeseburger choose a side: fries or small salad 11 $ Grilled Cheese & Fries 9 $ 3 courses for $45 Additionally enjoy Wine Pairings & Spirit Free Pairings Available for dinner Thursday, January 8th - Saturday, January 17th Download PDF Reservations Email Signup Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Park & Grove | American Restaurant in Charleston, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "3d69fd64b146",
      "downloadedAt": "2026-01-18T17:03:08.128Z",
      "trimmedAt": "2026-01-18T17:11:38.501Z",
      "sizeReduction": "92.9%"
    },
    {
      "url": "http://www.parkandgrovechs.com/events-1-1/",
      "text": "Main content starts here, tab to start navigating Special Events Inquire Today! Explore Event Spaces View Weekly Happenings Slide 1 of 9 Slide 2 of 9 Slide 3 of 9 Slide 4 of 9 Slide 5 of 9 Slide 6 of 9 Slide 7 of 9 Slide 8 of 9 Slide 9 of 9 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides To book a reservation f or parties of 13 or more, please submit an inquiry form below. For reservations of 9-12 guests, please call us at (843)-410-1070 . For parties of 8 or fewer, make a reservation today on Resy! Special Events Inquire directly to host your next special event with us. Inquire Today Explore Event Spaces for Booking Below! Host your next special event at Park & Grove—the perfect setting for everything from intimate dinners to larger celebrations. Every gathering is thoughtfully curated to create unforgettable moments. With customizable menus, flexible event spaces, and a dedicated team, we’ll help bring your vision to life. Contact us today to inquire about hosting your private event in the heart of Charleston’s vibrant North Central neighborhood. Full Restaurant Buyout For larger gatherings, a Full Restaurant Buyout provides a complete venue experience with indoor seating for 70 and an additional 30 guests in the outdoor patio area. View More Back Dining Room The Back Dining Room is perfect for semi-private events, accommodating 15-30 guests with options for community-style seating and family-style or pre-set menus. View More Covered Patio Our private Covered Patio offers an exclusive space for 15-30 guests, with seating at a long community table and the option for indoor seating in the Back Dining Room as backup. View More Inquire Today Galleries Past Events Reservations Email Signup Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Park & Grove | American Restaurant in Charleston, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "88208665a6e1",
      "downloadedAt": "2026-01-18T17:03:09.222Z",
      "trimmedAt": "2026-01-18T17:11:38.510Z",
      "sizeReduction": "94.3%"
    },
    {
      "url": "http://www.parkandgrovechs.com/location/park-and-grove/",
      "text": "Main content starts here, tab to start navigating Hours & Location 730 Rutledge Ave, Charleston, SC 29403 Parking: You can access free parking in the lot across the street as well as street parking along Rutledge & Grove Street. Brunch: Saturday & Sundays | 9 am – 2:30 pm Lunch: Monday-Friday | 11 am – 3 pm Happy Hour: Monday-Friday | 3 pm – 6 pm Dinner: Monday-Saturday | 5 pm – 9 pm Get Directions Reservations Email Signup Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Park & Grove | American Restaurant in Charleston, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "acb9c3e9c972",
      "downloadedAt": "2026-01-18T17:03:07.569Z",
      "trimmedAt": "2026-01-18T17:11:38.516Z",
      "sizeReduction": "95.8%"
    },
    {
      "url": "http://www.parkandgrovechs.com/menus",
      "text": "Main content starts here, tab to start navigating Menus Slide 1 of 10 Slide 2 of 10 Slide 3 of 10 Slide 4 of 10 Slide 5 of 10 Slide 6 of 10 Slide 7 of 10 Slide 8 of 10 Slide 9 of 10 Slide 10 of 10 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides NIGHTLY SPECIALS Happy Hour • 3-6 pm WEEKDAYS TUESDAY 1/2 price select wine bottles Neighborhood Burger Night WEDNESDAY $10 smash burgers // $6 kid's burger Dinner Lunch Brunch Happy Hour Cocktails & More Kids Menu Restaurant Week Menu | Winter 2026 dinner • 5 - 9 monday thru saturday Small Plates Clammer Dave's Clams coconut curry, butterkin squash, tajín, fried pita 22 $ Crab Cake Succotash chilled succotash, herb vin, avocado crema 23 $ Crispy Pumpkin whipped ricotta, salsa macha, pear butter, pickled mushrooms 15 $ Butter Bean Hummus marinated tomatoes, pickled red onion, annie mae's pita, crudité 15 $ Salads Caesar Salad gem lettuce, spicy caesar, croutons, parmesan, boquerones 18 $ Apple & Kale Salad pickled fennel, manchego, candied walnuts, spiced orange vin 17 $ Entrées Blackened Market Fish braised collard greens, miso & sweet potato pureé, lemon oil 32 $ Ricotta Gnocchi mushroom walnut ragù, salsa verde, wilted baby kale, country fried oyster mushrooms 25 $ Chicken Milanese parmesan-crusted chicken, fennel & arugula salad with italian-style garlic dressing 23 $ Grilled Porkchop bok choy, pepper relish, sweet and sour 29 $ P&G Smash Burger double patty, cheddar, special sauce, lettuce, pickles, onion, fries • sub parmesan truffle fries $3 20 $ Braised Short Rib seared daikon, soy jus, radish slaw 32 $ Dessert Sticky Banana Toffee Pudding chocolate drizzle, caramel gelato 10 $ Sweet Potato Cheesecake toasted meringue, granola 10 $ Flourless Fudge Brownie vanilla gelato, caramel sauce 10 $ Gelato vanilla or salted caramel 4 $ Affogato espresso, choice of ice cream 8 $ Seasonal Sorbet 4 $ Monday - Friday Happy Hour • 3 to 6 food & drink offerings Tuesday no bottle left behind 1/2 price select bottles of wine Wednesday “hey neighbor” burger night $10 single patty smash burger, $6 kid’s burger • dine-in only lunch • 11 - 3 monday thru friday Starters & Salads Crispy Pumpkin whipped ricotta, salsa macha, pear butter, pickled mushrooms 15 $ Butter Bean Hummus marinated tomatoes, pickled red onion, annie mae's pita, crudité 15 $ Apple & Kale Salad pickled fennel, manchego, candied walnuts, spiced orange vin 17 $ Caesar Salad gem lettuce, spicy caesar, croutons, parmesan, boquerones 18 $ Seasonal Soup 10 $ Burger P&G Smash Burger double patty, cheddar, special sauce, lettuce, pickles, onion, fries served with fries • sub parmesan truffle fries $3 20 $ served with a side salad; sub fries +2, sub truffle fries +3, sub side soup +3 Sandwiches Braised Short Rib Grilled Cheese normandy farms sourdough, cheddar, fontal, pickled red onions, au jus 24 $ Crab Cake lump & claw meat, remoulade, shredded lettuce, pickled red onion, annie mae's sesame bun 23 $ Crispy Chicken Sandwich hatch chili aioli, bacon, shredded lettuce, focaccia 22 $ Cuban mojo pulled pork, ham, swiss, mojo dijonnaise, pickles, foccacia 20 $ Falafel Pita cucumber tomato salad, tzatziki, annie mae's pita 18 $ Fried Egg Sandwich bacon, avocado smash, sunny egg, cheddar, special sauce, annie mae's sesame bun 17 $ Plates Veggie Bowl carolina gold rice, seasonal vegetables, benne seeds, saba, cilantro 16 $ Fried Chicken braised collards, crispy potatoes, hot honey, garlic aioli 18 $ Additions Avocado 5 $ Local Grilled Shrimp 9 $ Chicken 9 $ Lump & Claw Crab Cake 20 $ Coffee Charleston Fog earl grey latte, lavender marshmallow 7 $ Eastwood coconut, nutella, cold brew 7 $ Orange Mocha Latte orange, chocolate, orange zest 7 $ Oatmeal Cookie Latte fall spices, vanilla, oatmilk 8 $ Latte 6 $ Espresso 4 $ Cappuccino 6 $ brunch • 9 - 2:30 saturday & sunday Shareable Sweets Cinnamon Rolls cream cheese icing, candied nuts 12 $ Banana Bread dark chocolate drizzle, dates, whipped honey butter 10 $ Buttermilk Biscuits with your choice of mushroom gravy or cinnamon butter 11 $ Brunch Plates Fried Egg Sandwich bacon, avocado smash, sunny egg, cheddar, special sauce, sesame bun, side of grapefruit 16 $ Benedict crab cake, poached eggs, hollandaise, english muffin 28 $ Croque Madame black forest ham, gruyère, sunny egg, dijon, mornay sauce, sunny egg, arugula salad 18 $ Pancakes berry compote, whipped cream 14 $ Huevos Rancheros braised & ground beef, great northern beans, corn tortilla, hominy, queso, avocado smash, sour cream, tomatillo salsa, sunny eggs 18 $ Fried Chicken housemade biscuit, hot honey, mushroom gravy 18 $ Brunch Burger smash patty, bacon, cheddar, special sauce, sunny egg, spicy breakfast potatoes 18 $ add a second patty 4 $ Avocado Toast smashed avocado, sunny egg, za'atar spice, chili oil, lemon zest, arugula salad 17 $ Seasonal Veggie Sautée grilled halloumi, poached eggs, balsamic • add grilled chicken or grilled shrimp $9 • add avocado $5 20 $ Walk in the Park eggs any style, breakfast potatoes, bacon, grapefruit 16 $ Coffee Oatmeal Cookie Latte fall spices, vanilla, oatmilk 8 $ Charleston Fog earl grey latte, lavender marshmallow 7 $ Eastwood cold brew, coconut, nutella 7 $ Orange Mocha house orange syrup, chocolate, orange zest 7 $ Westwood bourbon, cold brew, coconut, nutella 13 $ Monday - Friday Happy Hour • 3 to 6 food & drink offerings Tuesday Tuesday no bottle left behind 1/2 price select bottles of wine Wednesday Wednesday “hey neighbor” burger night $10 single patty smash burger, $6 kid’s burger • dine-in only happy hour • snacks 3 - 6 weekdays Drinks Garden Gimlet gin, seasonal berry, celery, lime, simple 9 $ Golden Hour bourbon, lemon, honey syrup, lavender, rhubarb bitters 9 $ Grove Negroni gin, antica, campari, orange bitters 9 $ Garden Cosmo tito's vodka, lime, agave, cranberry, orange bitters 9 $ Wine white • grüner veltliner rosé • rosato red • gamay 8 $ Beer sour • edmund's oast n/a beer • untitled art 5 $ Spirit Free Choices october sky / blood orange, simple, ginger beer fall breeze / pomegranate, lemon, simple, soda cherry picking / cherry shrub, lemon, simple, ginger beer 5 $ Shareable Punch Bowls Punch Bowls (Serves 3 – 4) ask your server for current seasonal selections 36 $ Snacks P&G Smash Burger double patty, cheddar, special sauce, lettuce, pickles, onion, fries served with fries • sub parmesan truffle fries $3 20 $ Side of Fries add white truffle oil, parmigiano, parsley, aioli +3 8 $ Fritto Misto polenta fried fish, peppers, & onions, aioli 8 $ Butter Bean Hummus marinated tomatoes, pickled red onion, annie mae's pita, crudité 15 $ Sip into something delectable with our curated cocktails & spirit-free options with something smooth for every palette! Seasonal Cocktails cherry bomb tito’s, cherry shrub, limoncello, lime, soda 14 $ queen bee house-infused brown butter gin, lemon, honey 15 $ persephone tequila, pomegranate, blood orange, agave, black salt rim 15 $ harvest moon tito's, cherry-infused cacao liqueur, licor 43 chocolate cream, mole bitters, egg white 16 $ in equal measure white rum, domaine de canton, amaro montenegro, lime, candied pineapple 16 $ Spirit-Free october sky blood orange, simple, ginger beer 8 $ cherry picking cherry shrub, lemon, simple, ginger beer 8 $ fall breeze pomegranate, lemon, simple, soda 8 $ Untitled Art non-alcoholic beer 6 $ Kid's Menu Mac & Cheese add veggies +$4 add grilled chicken +$9 add grilled shrimp +$9 9 $ Grilled Chicken & Veggies 12 $ Kid-Size Cheeseburger choose a side: fries or small salad 11 $ Grilled Cheese & Fries 9 $ 3 courses for $45 Additionally enjoy Wine Pairings & Spirit Free Pairings Available for dinner Thursday, January 8th - Saturday, January 17th Download PDF Reservations Email Signup Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Park & Grove | American Restaurant in Charleston, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "d27da6597ae5",
      "downloadedAt": "2026-01-18T17:03:09.998Z",
      "trimmedAt": "2026-01-18T17:11:38.560Z",
      "sizeReduction": "92.9%"
    }
  ],
  "sizeReduction": "93.9%"
}