{
  "venueId": "ChIJqZ9r7Zdx_ogRBBwzTMH-Opk",
  "venueName": "VFW Post 10624",
  "venueArea": "Mount Pleasant",
  "website": "https://mtpleasantvfw.org/",
  "scrapedAt": "2026-01-19T02:45:57.815Z",
  "trimmedAt": "2026-01-19T02:53:28.570Z",
  "pages": [
    {
      "url": "https://mtpleasantvfw.org/",
      "text": "[Page Title: Mt Pleasant VFW – Post 10624 & Auxillary]\n\nSkip to content Welcome to VFW Post 10624 & Auxillary About Us No one does more for Veterans \nWe understand the unique bond you share with other veterans of overseas conflicts because we, too, have been there. No matter which conflict called you to service, we invite you to join us as we continue to fight for all that’s good FOR VETERANS.\nLearn more Still Serving \nThe Mount Pleasant, SC VFW Post 10624 is deeply committed to serving those who have bravely served their country. This dedication stems from a profound sense of camaraderie and a shared understanding of the sacrifices made by veterans. The post recognizes that the transition from military to civilian life can be challenging, and it strives to ease this process by offering support and advocacy for veterans and their families. By providing assistance in filing applications for benefits from the Department of Veterans Affairs, the post ensures that veterans receive the recognition and support they deserve. Moreover, the VFW post acts as a pillar of community, fostering an environment where veterans can find solidarity, access resources, and engage in activities that contribute to their well-being. Their tireless efforts are a testament to the belief that those who have served their nation deserve unwavering support and the opportunity to lead fulfilling lives post-service.\n\nCommunity Outreach\n\nWe are the voice of veterans in the Lowcountry. We remember the sacrifices and honor their memory through service. Everyday is an outreach for us.\n\nLeadership and Guidance\n\nOur activities often involve local R.O.T.C. cadets and other youth volunteers. We provide opportunities for service and to earn distinction through actions.\n\nEvent Space\n\nLet us be your host! From community oyster roasts to private events. The Mt. Pleasant VFW can be your event venue with full kitchen for up to 125 people.\n\nSign up for updates delivered to your inbox.\n\n!\n\n!\nSubscribe \nSomething went wrong. Please check your entries and try again.\n\nLATEST NEWS\nRack ‘Em Up! VFW Pool Tournament Raises Over $1,600! November 2, 2025 \nWhat a day! The Mt. Pleasant VFW Post recently hosted the Scotch APA 8-Ball Doubles Tournament that was a smashing success, bringing our community together for some friendly competition and raising a significant amount of money for our Post. We are thrilled to announce that the event successfully raised over $1,600 for the VFW! Thank […]\nRead More about Rack ‘Em Up! VFW Pool Tournament Raises Over $1,600! Help Feed Our Heroes: Mount Pleasant VFW Post 10624’s National Day of Service Event April 4, 2025 \nVFW Post 10624 in Mount Pleasant is proud to announce its participation in the National Day of Service by hosting a food drop-off event to support the V.A. Food bank on Sunday, May 4, 2025. Members of the community are warmly invited to contribute non-perishable food items at VFW Post 10624, located at 1411 Stuart […]\nRead More about Help Feed Our Heroes: Mount Pleasant VFW Post 10624’s National Day of Service Event December 7th Pearl Harbor Remembrance ceremony December 3, 2024 \nVFW Post 10624 invites you to honor our heroes at the 83rd Annual Pearl Harbor Remembrance Day. The ceremony will take place aboard the historic USS Yorktown in Charleston Harbor, beginning at 11 AM. Following the ceremony, join us for lunch at VFW Post 10624. Free parking is available in the old parking lot from […]\nRead More about December 7th Pearl Harbor Remembrance ceremony Post 10624 visits the Vietnam Veterans Memorial Replica Traveling Wall November 4, 2024 \n“The Wall that Heals and mobile education center” The Wall That Heals is a half-scale replica of the Vietnam Veterans Memorial in Washington, D.C. It travels across the United States, providing communities with the opportunity to honor and remember the veterans who served in the Vietnam War. The wall bears the names of the over […]\nRead More about Post 10624 visits the Vietnam Veterans Memorial Replica Traveling Wall Veteran Benefits & Assistance September 14, 2024 \nOriginally founded in 1899 as the American Veterans of Foreign Service, the Veterans of Foreign Wars continues to be a voice for returning and currently deployed service members and their families. The Veterans of Foreign Wars is dedicated to supporting those who sacrifice so much for this country, veterans, service members in the US Armed […]\nRead More about Veteran Benefits & Assistance VFW Post 10624 Annual Memorial Remembrance Day 2024 May 25, 2024 \nVFW Post 10624 commemorated Memorial Day with a heartfelt mission to honor fallen veterans. Despite a rainy start, a dedicated group of volunteers, including veterans, families, and JROTC Cadets, came together to ensure each veteran’s gravestone at Mt. Pleasant Memorial Gardens received an American flag as a symbol of recognition for their service to our […]\nRead More about VFW Post 10624 Annual Memorial Remembrance Day 2024 VFW Post 10624 National Day of Service wrap-up May 2024 May 8, 2024 \nVFW Post 10624’s National Day of Service on May 4th, 2024 was a heartwarming display of community spirit, overcoming a rainy morning to collect a significant donation for local veterans. Over 800 pounds of non-perishable goods were collected through a drive-thru drop off event and donation boxes placed at participating businesses throughout Mount Pleasant. But […]\nRead More about VFW Post 10624 National Day of Service wrap-up May 2024 National Day of Service April 22, 2024 \nVFW Post 10624 Glen L. Jeffers welcomes you to join our National Day of Service with a drive-through food drop off. We will be accepting non-perishable foodstuffs and donating them to the VA Food Bank.\nRead More about National Day of Service Friday Dinners \nFirday nights the Mount Pleasant VFW Post 10624 and Auxiliary bring you great food and a wonderful experience for everyone, and are Dinners start at 6pm and limited quantities may be available.\nopen to the public! \n2026-01-09\n\n2026-01-16\n\n2026-01-23\n\n2026-01-30\n\n2026-02-06\n\n2026-02-13\n\n2026-02-20\n\n2026-02-27\n\n2026-03-06\n\n2026-03-13\n\n2026-03-20\n\n2026-03-27\n\n2026-04-03\n\n2026-04-10\n\n2026-04-17\n\n2026-04-24\n\n2026-05-01\n\n2026-05-08\n\n2026-05-15\n\n2026-05-22\n\nJanuary 9th\n\nBeef Pot Roast\n\nJanuary 16th\n\nSteve’s Pulled Pork Dinner or Sandwich Platter\n\nJanuary 23rd\n\nSteak Dinner\n\nJanuary 30th\n\nLasagna with 2 Large Meatballs\n\nFebruary 6th\n\nGrilled Pork Chops\n\nFebruary 13th\n\nDavid’s Brisket (for Lovers)\n\nFebruary 20th\n\nMeatloaf\n\nFebruary 27th\n\nSteak\n\nMarch 6th\n\nLasagna with 2 Large Meatballs\n\nMarch 13th\n\nCorn Beef and Cabbage Dinner (or) Ruben Sandwich andChips\n\nMarch 20th\n\nBeef Pot Roast\n\nMarch 27th\n\nSteak Night with Potato and Salad\n\nApril 3rd\n\nFried Shrimp with Crab Cake, Fries and Kelly’s Hushpuppies\n\nApril 10th\n\nShrimp and Grits\n\nApril 17th\n\nNo Dinner (Special Function)\n\nApril 24th\n\nSteak Night with Potato and Salad\n\nMay 1st\n\nBaby Back Ribs\n\nMay 8th\n\nPork Pot Roast w/ Apple Sauce\n\nMay 15th\n\nSteak Dinner\n\nMay 22nd\n\nBrisket",
      "hash": "6ac484b890b6",
      "downloadedAt": "2026-01-19T02:13:21.866Z",
      "trimmedAt": "2026-01-19T02:53:28.570Z",
      "sizeReduction": "97.9%"
    }
  ],
  "sizeReduction": "97.9%"
}