{
  "venueId": "ChIJLZJ22ih7_ogRVk6LEiudEFk",
  "venueName": "Charleston Distilling Co",
  "venueArea": "West Ashley",
  "website": "https://charlestondistilling.com/",
  "scrapedAt": "2026-01-18T17:04:25.466Z",
  "trimmedAt": "2026-01-18T17:07:12.497Z",
  "pages": [
    {
      "url": "https://charlestondistilling.com/menu",
      "text": "0 Share Plates Crab Pretzel 15 Md style crab dip, lump crab, cedar & jack cheese, pretzel Spring Rolls 8 Hand ground pork, cabbage, carrot, onion, clear noodles, wood ear mushrooms, Thai dipping sauce Pigs on a Date Bacon wrapped dates, bourbon maple glaze Sticky Wings 12 Double fried, Korean sauce, house-made kimchi and picked vegetables *Tuna Pops 13 Seared rare, smoked soy sauce, wasabi mayo, sriracha Greek Fries 7 Shoestring fries, feta, rosemary, oregano, tzatziki sauce Fried Green Tomatoes 15 Lump crab, remoulade, relish Buns & Greens Shrimp Roll 14 Marinated Frenched bone thigh, Korean sauce, arugula, brioche, pickled vegetables 4 oz custom blend burger, pickles, onion, topped with a 3 oz crab cake Smash Burger 14 Two 4 oz custom blend patties, pickles, onion, mustard, ketchup, cooper sharp cheese, Add Bourbon Maple Bacon $ 2 Chef Kiet’s Fried Chicken Sandwich 15 Marinated Frenched bone thigh, Korean sauce, arugula, brioche, pickled vegetables Chef’s Seasonal Rice Bowl (market price) Chef selection of fish, seafood or meat, served with Jasmine rice and vegetable toppings, Please see bartender for details Farmers Market Salad 7 add chicken 8 shrimp 9 seared tuna 10 Please See Staff About Weekly Entrée Specials 10 Kid’s Menu Cheese Burger Chicken Tenders Hot Dog 4 Sides Fries Kimchi Seasonal Pickled Vegetable Vegan Options Available Upon Request Chef will accommodate with available options Rotating Local Ice Cream $6",
      "hash": "087be4e5a85e",
      "downloadedAt": "2026-01-18T17:02:05.113Z",
      "trimmedAt": "2026-01-18T17:07:12.458Z",
      "sizeReduction": "99.2%"
    },
    {
      "url": "https://charlestondistilling.com/cocktails",
      "text": "0 12 $ SPECIALTY COCKTAILS 12 $ KOKOMO Blue 80 / Coconut Cream / Lime / Ginger Simple Syrup / Grand Marnier / Sprinkle Nutmeg, Lime Wheel & Coconut THE FRESH DUDE White Point Vodka / Mocha Cream / Haft & Haft / Fresh Mint IN VOGUE Jasper Gin / Lemon / Lavender Simple Syrup / Orange Bitters / Blueberry Lemongrass Bitters/ Topped with Prosecco / Orange Twist PURPLE RAIN Jasper Gin / Blackberry Puree / Lavender Simple Syrup / Fresh Squeezed Lemon / Lemon Twist & Lavender Petals SMOKED PECAN OLD FASHIONED Vesey’ Bourbon / Grimball Farms Smoked Pecan Liqueur / Demerara Simple Syrup / Black Walnut & Chamomile Bitters COCKTAIL OF THE MOMENT Bartender’s seasonal creation, please see service DON’T STOP ME NOW East Bay Rum / Banana Liqueur / Blackberry Liqueur / Fresh Squeezed Lime / Grenadine / Lime THE CURE East Bay Rum / Pineapple / Fresh Squeezed Orange / Coco Cream/ Lemon / Angostura Aromatic/ Nutmeg BLACKBERRY CRISP Grimball Farms Smoked Pecan Liqueur/ Blackberry Liqueur / Fresh Lemon Juice / Demerara Simple Syrup / Lemon Twist ESCAPE Tolerance Liqueur / Pineapple Juice / Fresh Lime Juice / Coconut Cream / Vanilla / Lime Wheel Garnish LADY IN RED Crosstown Bottled in Bond Rye / Blackberry Liqueur / Grapefruit Juice / Classic Simple Syrup / Prosecco / Orange Twist BLUEBERRY THYME MOJITO East Bay White Rum / Fresh Lime Juice / Mint Simple Syrup / Blueberry Juice / Fresh Thyme Leaves / Topped w Soda TASTING FLIGHTS White Point Vodka / Jasper’s Gin / Vesey’s Bourbon / Crosstown Bottled in Bond Rye / Tolerance Cinnamon Ginger Liqueur / Grimball Farms Liqueur / Carolina Reaper Pepper Vodka / Blue 80 Agave Spirit / East Bay Rum 15 $ BYO Your choice of Six ¼ oz Pours 15 $ 12 $ DRAM FLIGHT Three ½ oz Pours of Our Brown Liquors 12 $ 12 $ CLEAR DRAM Three ½ oz Pours of Our Clear Liquors 12 $ 12 $ AGAVE Three ½ oz Agave Blanco, Reposado & Anejo 12 $ 12 $ CREAM FLIGHT Three ½ oz Bourbon, Peach & Mocha 12 $ 14 $ MARTINI’S 14 $ WHITE POINT VODKA 3 oz Vodka Martini / Dirty / Dry / Gibson / Up or On the Rocks JASPER’S GIN 3 oz Gin Martini / Dirty / Dry / Gibson / Up or On the Rocks COSMOPOLITAN White Point Vodka / Grand Marnier / Fresh Squeezed Lime Juice / Splash Cranberry 12 $ CLASSIC COCKTAILS 12 $ OLD FASHIONED Vesey's Bourbon or Crosstown Bottled in Bond Rye / Demerara Simple Syrup / Angostura Aromatic Bitters / Orange Twist / Bourbon Cherry / Bourbon Cherry / Up or On the Rocks MANHATTAN Vesey's Bourbon or Crosstown Bottled in Bond Rye / Dolin Rouge Sweet Vermouth / Angostura Aromatic Bitters / Bourbon Cherry / Up or On the Rocks SAZARAC Crosstown Bottled in Bond Rye / Absinthe / Simple Syrup / Angostura Aromatic Bitters / Peychaud's Bitters NEGRONI Jasper's Gin / Campari / Dolin Rouge Sweet Vermouth / Orange Twist BOULEVARDIER Vesey’s Bourbon / Campari / Dolin Rouge Sweet Vermouth / Orange Twist MARGARITA Blue 80 Agave Spirit / Grand Marnier / Agave Nectar / Fresh Squeezed Lime Juice FRENCH ’75 Jasper’s Gin / Fresh Lemon / Simple Syrup / Brut Sparkling BLOODY MARY White Point Vodka or Carolina Reaper Pepper Vodka / Charleston Fresh Veggie, Green Olive, Pepperoncini & Pickle Garnish / Sea Salt & Tajin Rim 9 $ SHOOTERS 9 $ Lemon Drop Vodka, sugar, lemon wedge Cinnamon Toast Rum cream, cinnamon liquor Pecan Pie Pecan liquor, pecan rum cream Peaches & Cream Peach cream, vodka Pickle Back Bourbon, pickle juice Espresso Coffee liquor, bourbon 14 $ MAKE IT A MARTINI Other cocktails available on request 14 $ 15 $ ADULTS FLOATS 15 $ Floating Peach Cobbler Cream liquor, tolerance cinnamon ginger glaze, vanilla ice cream, short bread crumble Pecan Pie House cream liquor, Crosstown Rye, pecan ice cream Dark & Stormy Float House-made ginger beer, rum, lime, vanilla ice cream, lime zest Bourbon Root Beer Float House RB, Vesey, vanilla, ice cream BEER 5 $ Coors Light (4.2%) 5 $ 6 $ Munkle Pils (5.1%) 6 $ 7 $ Estuary Noche De Mar(5%) 7 $ 7 $ Rainbow Sherbet(5.2%) 7 $ 7 $ Edmunds Oast Something Cold(5%) 7 $ 7 $ 1906 Special Reserve Bock(6.5%) 7 $ 8 $ Edmunds Oast Sour Cranberry(5.5%) 8 $ 8 $ Burlington Wizard Dbl IPA(8%) 8 $ 5 *Contains Alcohol* $ House Brewed Ginger Beer 5 *Contains Alcohol* $ WINE 12 $ LaLuca Prosecco D.O.C Extra Dry, Italy 12 $ 12 / 36 $ $ Longmeadow Ranch Sauvignon Blanc 2019 Napa Valley, CA 12 / 36 $ $ 10.50 / 32 $ $ Broadside Chardonnay 2019 Central Coast, CA 10.50 / 32 $ $ 12 / 36 $ $ Triennes Rose 2021 Provence, France 12 / 36 $ $ 14 / 42 $ $ Planet Oregon Pinot Noir 2019 Willamette Valley, OR 14 / 42 $ $ 14 / 42 $ $ Matias Cabernet 2019 Napa Valley, CA 14 / 42 $ $ 6 $ SELTZER 6 $ Charleston Distilling Cranberry mango 7 $ MOCKTAILS 7 $ Sherly Temple Sprite, grenadine, cherry Chicha Morada Peruvian purple corn drink with ice & mint Boardwalk Lemonade Fresh juice, agave, shaken with ice & mint Peach Sweet Tea Loaded with citrus and blue berries",
      "hash": "82f20b006aab",
      "downloadedAt": "2026-01-18T17:02:05.667Z",
      "trimmedAt": "2026-01-18T17:07:12.490Z",
      "sizeReduction": "97.6%"
    },
    {
      "url": "https://charlestondistilling.com/",
      "text": "0 Charleston Distilling Co. is more than a distillery — it’s a destination. Located on scenic Johns Island, we invite you to experience the craft firsthand in our spacious tasting room. Surrounded by gleaming copper stills and soaring ceilings, guests can sample our handcrafted spirits or relax outdoors by the fire pit with a cocktail in hand. Our commitment to quality begins with the land itself. We source our grains locally and manage every step of production — from milling and mashing to fermentation and distillation — right here on-site. This farm-to-bottle approach ensures that the unique character of the Lowcountry shines through in every batch. Whether you’re joining a tour to see the process up close or simply unwinding with friends and a bite from a local food truck, Charleston Distilling Co. offers a true taste of South Carolina hospitality — where craftsmanship, community, and the spirit of the Lowcountry come together. C",
      "hash": "e057356ae0ba",
      "downloadedAt": "2026-01-18T17:02:05.052Z",
      "trimmedAt": "2026-01-18T17:07:12.497Z",
      "sizeReduction": "99.4%"
    }
  ],
  "sizeReduction": "98.7%"
}