{
  "venueId": "ChIJSbCyvApx_ogRuTmUVxkB33M",
  "venueName": "Sullivan's Fish Camp",
  "venueArea": "Sullivan's Island",
  "website": "https://www.sullivansfishcamp.com/",
  "scrapedAt": "2026-01-18T17:04:26.538Z",
  "trimmedAt": "2026-01-18T17:08:01.584Z",
  "pages": [
    {
      "url": "https://www.sullivansfishcamp.com/hours-and-location/",
      "text": "× Reservations Location - Required Location Sullivan's Fish Camp | Seafood Restaurant in Sullivan's Island, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service Main content starts here, tab to start navigating Hours & Location 2019 Middle Street,Sullivan's Island, SC 29482 Open All Day Monday - Thursday 12:00 PM - 9:00 PM Friday 12:00 PM - 10:00 PM Saturday 11:00 AM - 10:00 PM Sunday 11:00 AM - 9:00 PM Brunch Saturday & Sunday 11:00 AM - 3:00 PM Send us a message below or to info@sullivansfishcamp.com and we’ll get back to you as soon as possible. You can also reach us by phone at (843) 883-2100. We look forward to hearing from you. Please, enter a valid name Name - Required Please, enter a valid email Email - Required Please, enter a valid phone number Phone Number - Required What are you getting in touch about? - Optional What are you getting in touch about? General Inquiry Press Inquiry Please, enter a valid your message Your Message - Required Send Please check errors in the form above Thank you for your inquiry. We’ll be in touch shortly. and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service",
      "hash": "09d32dafec9e",
      "downloadedAt": "2026-01-18T17:01:51.353Z",
      "trimmedAt": "2026-01-18T17:08:01.494Z",
      "sizeReduction": "95.2%"
    },
    {
      "url": "https://www.sullivansfishcamp.com/past-events/",
      "text": "× Reservations Location - Required Location Sullivan's Fish Camp | Seafood Restaurant in Sullivan's Island, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service Main content starts here, tab to start navigating Past Events 10.22 Don Gato Cocktail Tasting We are introducing our newest cocktail, THE NINE LIVES, in collaboration with Don Gato Tequila 🎉🌮💀 Join us for Día de los Muertos, where you can sample this unique drink and enjoy face painting, delicious food, and a lively atmosphere. Whether you're a tequila aficionado or just looking to try something new, THE NINE LIVES promises to be a delightful addition to your evening. 10.9 Friends at the Beach w/ Mike Lata 🌴🐟 We are so excited to kick off our guest chef series, Friends at the Beach, with a one-night-only dinner where Chef Jason Stanhope will be joined in the kitchen by his mentor and longtime friend Mike Lata from Fig. They share a love of simple yet flavorful food, a dedication to supporting local farmers and purveyors, and a passion for having a good time. Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service",
      "hash": "14c4cbb83e19",
      "downloadedAt": "2026-01-18T17:01:53.055Z",
      "trimmedAt": "2026-01-18T17:08:01.501Z",
      "sizeReduction": "94.9%"
    },
    {
      "url": "https://www.sullivansfishcamp.com/menu-overview/",
      "text": "× Reservations Location - Required Location Sullivan's Fish Camp | Seafood Restaurant in Sullivan's Island, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service Main content starts here, tab to start navigating Book A Table Dinner Menu Lunch Menu Drink Menu Wine List Brunch Menu Dessert Menu Sunday - Thursday 12pm-9pm Friday - Saturday 4pm-10pm Download PDF (opens in a new tab) Beachy Beginnings DAILY OYSTERS (EA)* classic garnishes 4.00 $ CRAB TOSTADA aji dulce, green harissa 18.00 $ CEVICHE MIXTO* leche de trigre, sweet potato, saltines 22.00 $ PEEL & EAT SHRIMP cocktail sauce, spicy horseradish 24.00 $ SICILIAN CRUDO* pistachio, castelvetrano, fennel 22.00 $ SMOKED FISH DIP pickles + crackers 16.00 $ SULLY'S HUSH PUPPY TOTS honey butter, Edisto cornmeal 12.00 $ BROILED OYSTERS (6) fermented chili butter 24.00 $ CRISPY SHRIMP jeow som 16.00 $ ICED FISH SHACK STACK dozen raw oysters, cocktail crab claws, peel & eat shrimp 96.00 $ Salads & Such CITRUS & BEET SALAD blue cheese dressing, chives 15.00 $ CELERY SALAD walnuts, cheddar, dates 17.00 $ \"SIDE SALAD\" gem lettuces, tomato, cucumber, croutons, green goddess dressing 12.00 $ APPALACHIAN POTATO FRITTERS salt fish, waygu mayo 12.00 $ CLAM & FISH CHOWDER fall vegetables, croutons 16.00 $ ROASTED DELICATA SQUASH citrus butter, pepita 15.00 $ BUTTERBEAN & FARRO SALAD jalapeño vinaigrette 14.00 $ Main Events WARM BUTTERED LOBSTER ROLL waffle cut chips, Hawaiian roll 34.00 $ CRISPY FISH SANDWICH cubano bread, lettuce, tomato, garlic mayo, fries 24.00 $ CATCH OF THE DAY celery root, arugula pesto 39.00 $ DOUBLE CHEESEBURGER b&b pickles, caramelized onions, sully sauce, fries 24.00 $ STEAK FRITES Brasstown Butcher's Steak, parisian steak sauce, fries 44.00 $ LOWCOUNTRY BOIL shrimp, andouille, potato, corn 34.00 $ FRESH OFF THE BOAT Food by JASON STANHOPE *Contains ingredients that are raw or undercooked. Consuming raw or undercooked meats, poultry, seafood, shellfish, or eggs may increase your risk of food-borne illness. Monday - Friday 12pm-4pm Saturday - Sunday 11am-4pm Download PDF (opens in a new tab) Good Beginnings DAILY OYSTERS (EA)* classic garnishes 4.00 $ CRAB TOSTADA aji dulce, green harissa 18.00 $ BROILED OYSTERS (6) fermented chili butter 24.00 $ CEVICHE MIXTO* leche de trigre, sweet potato, saltines 22.00 $ PEEL & EAT SHRIMP cocktail sauce, spicy horseradish 24.00 $ SULLY'S HUSH PUPPY TOTS honey butter, Edisto cornmeal 12.00 $ SPICY TUNA & RICE BOWL* CGR middlins, avocado, popped sorghum, benne 19.00 $ SMOKED FISH DIP pickles + crackers 16.00 $ ICED FISH SHACK STACK dozen raw oysters, cocktail crab claws, peel & eat shrimp 96.00 $ Salads & Such \"SIDE SALAD\" gem lettuces, tomato, cucumber, croutons, green goddess dressing 12.00 $ CITRUS & BEET SALAD blue cheese dressing, chives 15.00 $ ROASTED DELICATA SQUASH citrus butter, pepita 15.00 $ CLAM & FISH CHOWDER fall vegetables, croutons 16.00 $ BUTTERBEAN & FARRO SALAD jalapeño vinaigrette 14.00 $ CELERY SALAD walnuts, cheddar, dates 17.00 $ Main Events WARM BUTTERED LOBSTER ROLL waffle cut chips, Hawaiian roll 34.00 $ AL PASTOR FISH TACOS charred pineapple salsa, corn tortillas 19.00 $ FRIED FISH SANDWICH cubano bread, lettuce, tomato, garlic mayo, fries 24.00 $ DOUBLE CHEESEBURGER b&b pickles, caramelized onions, sully sauce, fries 24.00 $ BLACKENED FISH gem lettuces, winter veg., sherry vinaigrette 26.00 $ SULLY'S BASKETS cornmeal dusted fish & shrimp, coleslaw, fries, tartar 29.00 $ Food by JASON STANHOPE *Contains ingredients that are raw or undercooked. Consuming raw or undercooked meats, poultry, seafood, shellfish, or eggs may increase your risk of food-borne illness. Download PDF (opens in a new tab) SPECIALTY Cocktails OCEAN EYES St George citrus vodka, melon, cucumber, lime, prosecco, club soda 15.00 $ ONE BATANGA, TWO BATANGA tequila, lime, ginger, coke, salt rim 15.00 $ SEA LEGS french gin, vodka, lillet blanc, mignonette, basil eu de vie 15.00 $ NINE LIVES Don Gato tequila, carolina gold rice horchata syrup, hibiscus, lime, chipotle salt rim 15.00 $ PAIN KILLER Pusser's rum, pineapple, orange, coconut, nutmeg 15.00 $ SOME LIKE IT HOT tequila, mezcal, passionfruit, habanero, lime 15.00 $ BLESS UP aged rum, jamacian rum, campari, sweet vermouth, banana, allspice 15.00 $ DRAFT Beer \"CRAB CLAW\" LAGER westbrook brewed for us (available in 16oz to go) 8.00 $ \"SOMETHING COLD\" BLONDE edmund's oast brewing 8.00 $ \"LEFTY LOOSEY\" IPA revelry brewing 8.00 $ \"LUNCH\" IPA maine brewing co. 10.00 $ IRISH STOUT Guinness 8.00 $ BOTTLED & CANNED Beer MILLER LIGHT the GOAT light beer 4.2% 5.00 $ PACIFICO the ultimate beach beer 4.5% 6.00 $ NON-ALCOHOLIC Beverage N/A DEVILS FOOT / EDMUND'S OAST MARGARITA crisp, tangy, and refreshing 0.0% 12.00 $ N/A ST AGRESTIS PHONY WHITE NEGRONI a lemon is all that's needed 0.0% 13.00 $ N/A ATHLETIC IPA citrus, piney IPA 0.5% 7.00 $ N/A CEEBO \"PILSNER\" german style pilsner 0.5% 7.00 $ NON-SPIRITED CAT TALES hibiscus, horchata, lime, ginger beer 10.00 $ HICH C'S cucumber, coconut, lime, mint 10.00 $ FROZEN Cocktails PINA COLADA frozen, rum, coconut, pineappe juice, add a floater of coconut or pineapple rum 15.00 $ vodka, tomato, lemon, a little spicy stuff + an oyster on the half shell, mignonette, chives OYSTER SHOOTER glass/bottle WINE MONT MARCAL BRUT CAVA Cataluna, SP apples, crisp bubbles - 48.00 12.00 $ $ MAîTRE DE CHAI SPARKLING CHENIN BLANC Yolo County, CA, US bright, savory, dry and crisp minerality - 94.00 24.00 $ $ LOUIS DE GRENELLE BRUT ROSE Loire, FR dry, light, pink bubbles - 66.00 17.00 $ $ VIN DE SAVOIE JACQUERE Chignin, FR refreshing acidity, white flowers - 57.00 15.00 $ $ UPWELL SAUV BLANC Napa, CA bright acidity, fresh herbs - 45.00 12.00 $ $ BIG SALT WHITE BLEND Dundee, OR, US day at the beach in a bottle - 62.00 16.00 $ $ CHERRIER-FRERES SANCERRE Loire Valley, FR vibrant acidity, strong minerlaity - 78.00 20.00 $ $ FAMILLE PERRACHON CHARDONNAY Bourgogne, FR white flower, creamy, clean finish - 54.00 14.00 $ $ TRIENNES ROSE Cotes de Provence, FR light cherry and minerals, tanins - 62.00 16.00 $ $ MONTE RIO ‘THE BENCH’ ORANGE VERMENTINO Lodi, CA, US apricot blossoms, black tea, balanced acidity - 58.00 15.00 $ $ ROTTENSTEINER PINOT NOIR Alto Adige, IT rige cherry, fig, light spice - 70.00 18.00 $ $ DOM. LA GUICHARD CDR Cotes du Rhone, FR fresh fruit, lavender, forest floor - 50.00 13.00 $ $ THE PARING CAB SAUV California, US bright red fruit, black plum, dusty tanins - 62.00 16.00 $ $ LIQUID CATCH O' THE DAY ESPRESS YOURSELF tequila, sherry, cynar, espresso 15.00 $ CRUSE WINE CO. Eaglepoint Sparkling White Zinfandel 2023 - 80.00 20.00 $ $ Download PDF (opens in a new tab) glass/bottle SPARKLING MONT MARCAL Cava Cataluna, SP - 48.00 12.00 $ $ LOUIS DE GRENELLE Brut Rose Loire, FR - 66.00 17.00 $ $ CARBONISTE, \"Octopus\" Extra Brut Albariño Andrus Island, CA, US 75.00 $ MAITRE DE CHAI, Sparkling Chenin Blanc Yolo County, CA, US - 94.00 24.00 $ $ LAHERTE FRERES Brut Champagne, FR 118.00 $ glass/bottle WHITE “LA GRENOUILLE” Muscadet Loire, FR 50.00 $ VIN DE SAVOIE Jacquère Chignin, FR - 57.00 15.00 $ $ TATOMER Gruner Veltliner Central Coast, CA, US 57.00 $ REICHSRAT VON BUHL Reisling Pfalz, GER 68.00 $ ERNÉ Vermentino Tuscany, IT 60.00 $ UPWELL Sauvignon Blanc Napa, CA - 45.00 12.00 $ $ BIG SALT White Blend Dundee, OR - 62.00 16.00 $ $ CHERRIER-FRERES Sancerre Sauvignon Blanc Loire Valley, FR - 78.00 20.00 $ $ RONCHI DI CIALLA Ribolla Gialla Fruili, IT 60.00 $ DOM GUIBERTEAU Saumur Blanc Loire Valley, FR 65.00 $ FAMILLE PERRACHON Chardonnay Bourgogne, FR - 54.00 14.00 $ $ LULI Chardonnay Santa Lucia Highlands, Monterey, CA, US 72.00 $ glass/bottle PINK & ORANGE TRIENNES Rosé Côtes de Provence, FR - 62.00 16.00 $ $ LIEU DIT Rosé Santa Barbara, CA, US 73.00 $ MONTE RIO Orange Vermentino Lodi, CA, US - 58.00 15.00 $ $ glass/bottle RED WILD SOUL Beaujolais-Villages Burgandy, FR 70.00 $ L 'ENJOUÉE ROUGE Anjou, Loire, FR 72.00 $ ROTTENSTEINER Pinot Noir Alto Adige, IT - 70.00 18.00 $ $ DOSTERRAS Granatxa Montsant, SP 62.00 $ DOMAINE LA GUICHARDE Grenache, Syrah Côtes du Rhône, Rhone, FR - 50.00 13.00 $ $ ROBERT SINSKEY Pinot Noir Los Carneros, CA, US 162.00 $ LA QUERCIA Aglianico Puglia, IT 56.00 $ DOM GUIBERTEAU Saumur Les Moulins Loire Valley, FR 68.00 $ THE PARING Cabernet Sauvignon California, US - 62.00 16.00 $ $ TURLEY Zinfandel Napa Valley, CA, US 97.00 $ MATTHIASSON \"Village\" Cabernet Sauvignon Napa Valley, CA, US 130.00 $ Saturday - Sunday 11am-3pm Download PDF (opens in a new tab) BRUNCH Additions RICOTTA PANCAKES apple, honey butter & syrup 16.00 $ BOURDAIN BREAKFAST SANDWICH mortadella, provolone, fried egg, fries 18.00 $ CHEESY EGGS ON TOAST soft scramble farm eggs, bacon, chives 19.00 $ SHRIMP & GRITS Marsh Hen Mills grits, Tarvin shrimp, collard greens, bacon lardons 22.00 $ BRUNCH Cocktails BLOODY MARY vodka, charleston bloody mary mix, lemon - 45.00 12.00 $ $ MIMOSA fresh squeezed orange juice, prosecco - 35.00 9.00 $ $ ESPRESS YOURSELF tequila, sherry, cynar, espresso 15.00 $ MICHELADA pacifico, clamato juice, lime juice, hot sauce 8.00 $ Download PDF (opens in a new tab) DESSERTS ANNIE MAE'S KEY LIME PIE graham cracker crust, whipped cream 13.00 $ BUTTERMILK PANNA COTTA citrus + Scicilian pistachio 12.00 $ SULLIVAN'S SOFT SERVE in a cup or cone, for here or to go add chocolate or caramel sauce $2 5.00 $ BUY THE KITCHEN A BURGER show the cooks some love and we'll match your purchase! 5.00 $ DESSERT Cocktails ESPRESS YOURSELF tequila, sherry, cynar, espresso 15.00 $ PINA COLADA frozen, rum, coconut, pineappe juice, add a floater of coconut or pineapple rum 15.00 $ Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service",
      "hash": "292018126b97",
      "downloadedAt": "2026-01-18T17:01:51.893Z",
      "trimmedAt": "2026-01-18T17:08:01.570Z",
      "sizeReduction": "94.1%"
    },
    {
      "url": "https://www.sullivansfishcamp.com/",
      "text": "× Reservations Location - Required Location Sullivan's Fish Camp | Seafood Restaurant in Sullivan's Island, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service Homepage Main content starts here, tab to start navigating Book A Table Slide 1 of 13 Slide 2 of 13 Slide 3 of 13 Slide 4 of 13 Slide 5 of 13 Slide 6 of 13 Slide 7 of 13 Slide 8 of 13 Slide 9 of 13 Slide 10 of 13 Slide 11 of 13 Slide 12 of 13 Slide 13 of 13 Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service",
      "hash": "54a7dacec1dd",
      "downloadedAt": "2026-01-18T17:01:51.314Z",
      "trimmedAt": "2026-01-18T17:08:01.577Z",
      "sizeReduction": "97.0%"
    },
    {
      "url": "https://www.sullivansfishcamp.com/events/",
      "text": "× Reservations Location - Required Location Sullivan's Fish Camp | Seafood Restaurant in Sullivan's Island, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service Main content starts here, tab to start navigating Events Calendar Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service",
      "hash": "7026df6dbeb6",
      "downloadedAt": "2026-01-18T17:01:52.421Z",
      "trimmedAt": "2026-01-18T17:08:01.584Z",
      "sizeReduction": "96.8%"
    }
  ],
  "sizeReduction": "95.0%"
}