{
  "venueId": "ChIJDXCe83F7_ogRpr0PwjtZ1Ug",
  "venueName": "Ms. Rose's Fine Food & Cocktails",
  "venueArea": "West Ashley",
  "website": "http://msroses.com/",
  "scrapedAt": "2026-01-18T17:04:24.340Z",
  "trimmedAt": "2026-01-18T17:05:20.319Z",
  "pages": [
    {
      "url": "http://msroses.com/charleston-west-ashley-ms-rose-s-fine-food-and-cocktails-rewards",
      "text": "Rewards Rewards Sign Up Check Your Balance",
      "hash": "2b87e38bbf45",
      "downloadedAt": "2026-01-18T17:03:00.851Z",
      "trimmedAt": "2026-01-18T17:05:20.286Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "http://msroses.com/",
      "text": "× Order your favorite dishes in seconds! Order Online 1090 Sam Rittenberg Boulevard, Charleston, SC 29407 map marker pin About us Customers, Friends & Family At Ms. Rose’s, our mission is to be the favorite place to eat and drink in West Ashley and the surrounding Charleston area. We accomplish this through great food and drink, dependable friendly service and a fun, family-friendly environment. Read more about us Parties Book your next party with us! Ms. Rose's Fine Food and Cocktails has the perfect space for birthday bashes, holiday parties, corporate events, wedding festivities, and more! Book a party book now Reservations Join us today Click the button below to make a reservation Reservations Order online Pick up your favorite food Don't feel like cooking today? We got you covered - order now! Order Reviews review by - Yelp Hosea B: I truly wish I could explain how good this food is. I'm from Charleston so I know good red rice. Growing up here I also know good seafood. THIS PLACE IS KILL'N IT!!!! And God forbid I tell you about the dessert!!! review by - Yelp Daniel G: PHENOMENAL! SERVICE WAS AMAZING and FOOD WAS TO DIE FOR. Brisket fries, fried chicken and patty melt.. I would highly recommend anyone to come here. review by - Yelp David Q: Great fried chicken. Family friendly spot and kids eat free. This is a great deal in Joe Biden's America where we have to watch our pennies. In all seriousness the food is great, servers are so nice and they have movies playing everywhere. Great music selection. review by - Yelp La'Maurice S: Best food we've had in a long time! Everything was delicious! Really glad we decided to choose this restaurant! Highly recommended! Outstanding customer service ! review by - Yelp Ken K: Great meal and service! I loved my burger melt and red wine! The menu options were excellent! I look forward to my next visit. The staff was friendly and professional! Stop reviews carousel Play reviews carousel 1st place Southern Fried Chicken Challenge Our Menu 1st place Shrimp & Grits Festival Order Specialty cocktails Drinks Private parties Book a party Dot slide navigation number 1 Dot slide navigation number 2 Dot slide navigation number 3 Dot slide navigation number 4 slideshow start stop playing Newsletter Location 1090 Sam Rittenberg Boulevard Charleston, SC 29407 Hours Lunch : Monday thru Friday 11 am to 3 pm Dinner: Monday thru Saturday 4 pm to 9 pm Brunch; Saturday and Sunday 10 am to 3 pm Find us on... Facebook page Instagram page Contact us (843)-766-0223 amanee@relishgroupinc.com Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "371df6294186",
      "downloadedAt": "2026-01-18T17:02:58.633Z",
      "trimmedAt": "2026-01-18T17:05:20.301Z",
      "sizeReduction": "98.0%"
    },
    {
      "url": "http://msroses.com/charleston-west-ashley-ms-rose-s-fine-food-and-cocktails-about",
      "text": "Ms. Rose's Fine Food and Cocktails Dot slide navigation number 1 Dot slide navigation number 2 Dot slide navigation number 3 slideshow start stop playing Ms. Rose's Fine Food and Cocktails About us At Ms. Rose’s, our mission is to be the favorite place to eat and drink in West Ashley and the surrounding Charleston area. We accomplish this through great food and drink, dependable friendly service and a fun, family-friendly environment. Our top priority is to assure safe service and provide our customers with a comfortable space to dine while complying with the CDC guidelines for face masks and social distancing. We ask for your continued patience and kindness as we operate our establishment appropriately to suit these times. Stay safe, be good to each other, wash your hands, wear your mask, and we look forward to seeing you again soon! -Your Ms. Rose’s Family Contact us: (843)-766-0223, by phone amanee@relishgroupinc.com by email",
      "hash": "56e454112dd6",
      "downloadedAt": "2026-01-18T17:03:01.523Z",
      "trimmedAt": "2026-01-18T17:05:20.305Z",
      "sizeReduction": "98.8%"
    },
    {
      "url": "http://msroses.com/charleston-west-ashley-ms-rose-s-fine-food-and-cocktails-drink-menu",
      "text": "Our Drinks Beer Wine Cocktails Happy Hour Drink Menu Brunch Cocktails",
      "hash": "a488ab6fcb37",
      "downloadedAt": "2026-01-18T17:02:59.369Z",
      "trimmedAt": "2026-01-18T17:05:20.309Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "http://msroses.com/charleston-west-ashley-ms-rose-s-fine-food-and-cocktails-food-menu",
      "text": "Our Menu All Day Menu Brunch Menu Happy Hour Thanksgiving Menu Weeknight Specials",
      "hash": "a4a9c00d81c5",
      "downloadedAt": "2026-01-18T17:02:58.745Z",
      "trimmedAt": "2026-01-18T17:05:20.315Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "http://msroses.com/charleston-west-ashley-ms-rose-s-fine-food-and-cocktails-events",
      "text": "Events Valentine's Day Saturday February 14th Join us on Valentine's Day for the perfect romantic evening! 11:00 AM - 10:00 PM 2026-02-14 11:00:00 2026-02-14 22:00:00 America/New_York Valentine's Day Join us on Valentine's Day for the perfect romantic evening! Ms. Rose's Fine Food & Cocktails Ms. Rose's Fine Food & Cocktails amanee@relishgroupinc.com National Margarita Day Sunday February 22nd Come celebrate National Margarita day with us on February 22nd. 11:00 AM - 03:00 PM 2026-02-22 11:00:00 2026-02-22 15:00:00 America/New_York National Margarita Day Come celebrate National Margarita day with us on February 22nd. Ms. Rose's Fine Food & Cocktails Ms. Rose's Fine Food & Cocktails amanee@relishgroupinc.com",
      "hash": "e8a3fc8ab2e4",
      "downloadedAt": "2026-01-18T17:03:00.156Z",
      "trimmedAt": "2026-01-18T17:05:20.319Z",
      "sizeReduction": "99.0%"
    }
  ],
  "sizeReduction": "99.2%"
}