{
  "venueId": "ChIJlwZatQ16_ogRLsafLmYEc40",
  "venueName": "Pavilion Bar",
  "venueArea": "Downtown Charleston",
  "website": "http://www.marketpavilion.com/pavilionbar.cfm",
  "scrapedAt": "2026-01-18T17:04:29.175Z",
  "trimmedAt": "2026-01-18T17:11:39.421Z",
  "pages": [
    {
      "url": "http://www.marketpavilion.com/information_request_pavilion_bar.cfm",
      "text": "Facebook Twitter Reservations: 843-723-0500 Home Our Home Page Accommodations Browse Guestrooms Grill 225 Premier Prime Steakhouse Pavilion Bar Infinite Celebrations VIP Tables Food Menu Drink Menu Wine and Champagne Request Information Events and Meetings Plan the Very Best Contact Get in Touch Home Pavilion Bar Information Request Pavilion Bar Information Request Pavilion Bar Information Request First name: * Approximate date of event: Last name: * Number of attendees anticipated: Address: How did you hear of Pavilion Bar? Company Area of Interest? Pavilion Bar Pavilion Wedding City: State: Zip code: Country: What specific information would you like to receive? Email address: * Daytime Phone number: Evening Phone number: Hotel Reservations Grill 225 Reservations Information Request Events © Copyright 2026 Market Pavilion Hotel - All Rights Reserved. Design by Palas Software Systems Accommodations Grill 225 Pavilion Bar Events Gifts Contact Policies Careers Top",
      "hash": "03b1ebcd2e03",
      "downloadedAt": "2026-01-18T16:54:40.233Z",
      "trimmedAt": "2026-01-18T17:11:39.398Z",
      "sizeReduction": "97.2%"
    },
    {
      "url": "http://www.marketpavilion.com/paviliondrink.cfm",
      "text": "Reservations: 843-723-0500 Home Our Home Page Accommodations Browse Guestrooms Grill 225 Premier Prime Steakhouse Pavilion Bar Infinite Celebrations VIP Tables Food Menu Drink Menu Wine and Champagne Request Information Events and Meetings Plan the Very Best Contact Get in Touch Home > Pavilion Bar Food/Drink Pavilion Bar Food/Drink Links VIP Tables Food Menu Drink Menu Wine and Champagne Request Information Savor Enjoy the casual but superb fare from the Pavilion Bar. Pavilion - Full Menu Hotel Reservations Grill 225 Reservations Information Request Events © Copyright 2026 Market Pavilion Hotel - All Rights Reserved. Design by Palas Software Systems Accommodations Grill 225 Pavilion Bar Events Gifts Contact Policies Careers Top",
      "hash": "1ffb23b0f6cc",
      "downloadedAt": "2026-01-18T16:54:41.506Z",
      "trimmedAt": "2026-01-18T17:11:39.403Z",
      "sizeReduction": "96.8%"
    },
    {
      "url": "http://www.marketpavilion.com/pavilionwine.cfm",
      "text": "Reservations: 843-723-0500 Home Our Home Page Accommodations Browse Guestrooms Grill 225 Premier Prime Steakhouse Pavilion Bar Infinite Celebrations VIP Tables Food Menu Drink Menu Wine and Champagne Request Information Events and Meetings Plan the Very Best Contact Get in Touch Home > Pavilion Bar Food/Drink Pavilion Bar Food/Drink Links VIP Tables Food Menu Drink Menu Wine and Champagne Request Information Savor Enjoy the casual but superb fare from the Pavilion Bar. Pavilion - Full Menu Hotel Reservations Grill 225 Reservations Information Request Events © Copyright 2026 Market Pavilion Hotel - All Rights Reserved. Design by Palas Software Systems Accommodations Grill 225 Pavilion Bar Events Gifts Contact Policies Careers Top",
      "hash": "420a61a8bd33",
      "downloadedAt": "2026-01-18T16:54:42.127Z",
      "trimmedAt": "2026-01-18T17:11:39.408Z",
      "sizeReduction": "96.8%"
    },
    {
      "url": "http://www.marketpavilion.com/pavilionfood.cfm",
      "text": "Reservations: 843-723-0500 Home Our Home Page Accommodations Browse Guestrooms Grill 225 Premier Prime Steakhouse Pavilion Bar Infinite Celebrations VIP Tables Food Menu Drink Menu Wine and Champagne Request Information Events and Meetings Plan the Very Best Contact Get in Touch Home > Pavilion Bar Food/Drink Pavilion Bar Food/Drink Links VIP Tables Food Menu Drink Menu Wine and Champagne Request Information Savor Enjoy the casual but superb fare from the Pavilion Bar. Pavilion - Full Menu Hotel Reservations Grill 225 Reservations Information Request Events © Copyright 2026 Market Pavilion Hotel - All Rights Reserved. Design by Palas Software Systems Accommodations Grill 225 Pavilion Bar Events Gifts Contact Policies Careers Top",
      "hash": "7895a469f43b",
      "downloadedAt": "2026-01-18T16:54:40.884Z",
      "trimmedAt": "2026-01-18T17:11:39.412Z",
      "sizeReduction": "96.8%"
    },
    {
      "url": "http://www.marketpavilion.com/events.cfm",
      "text": "Reservations: 843-723-0500 Home Our Home Page Accommodations Browse Guestrooms Grill 225 Premier Prime Steakhouse Pavilion Bar Infinite Celebrations Events and Meetings Plan the Very Best Contact Get in Touch Request Information How may we be of service? Your next social gathering or corporate event deserves the very best, which is just what you'll find at the Market Pavilion Hotel. As a venue, we offer a one-of-a-kind, historic Charleston setting. As a top hotel with two world-class restaurants, Grill 225 and the Pavilion Bar, we ensure a pristine experience and the finest cuisine for your guests. . Special Occasions Of course you want your guests to eat, drink and be merry, so host your next special occasion at the Market Pavilion Hotel. Perfect for intimate showers, sophisticated luncheons, cocktail receptions, or lavish weddings, we have the indoor or outdoor venue that's just right for you. Corporate Events Host your next meeting or corporate event with the latest advanced technology and a sense of style at the Market Pavilion Hotel. Want to make it memorable? Let us customize it for you with creative ideas to energize and surprise your guests with all that is bespoke Charleston. Private Event Dining The private and semi-private areas of Market Pavilion Hotel, Grill 225, and the Pavilion atop the Market Pavilion Hotel are the perfect place to celebrate all of life's happy occassions, from an engagement party to an unforgettable 50th anniversary soiree. Hotel Reservations Grill 225 Reservations Information Request Events © Copyright 2026 Market Pavilion Hotel - All Rights Reserved. Design by Palas Software Systems Accommodations Grill 225 Pavilion Bar Events Contact Careers Top",
      "hash": "9b5f8ca8114f",
      "downloadedAt": "2026-01-18T16:54:42.698Z",
      "trimmedAt": "2026-01-18T17:11:39.417Z",
      "sizeReduction": "92.9%"
    },
    {
      "url": "http://www.marketpavilion.com/pavilionbar.cfm",
      "text": "Reservations: 843-723-0500 Home Our Home Page Accommodations Browse Guestrooms Grill 225 Premier Prime Steakhouse Pavilion Bar Infinite Celebrations VIP Tables Food Menu Drink Menu Wine and Champagne Request Information Events and Meetings Plan the Very Best Contact Get in Touch Infinite Celebrations The Pavilion Bar is a rooftop must-do, complete with views of historic Charleston, a cascading pool, signature cocktails, eclectic cuisine offerings and the city's most spectacular sunsets. The Pavilion Bar maintains a sophisticated and stylish atmosphere for its guests. Opens daily at Noon. Cheers Truly the lap of luxury, retreat to Charleston's only rooftop cascading pool. Sip on one of our signature cocktails, or enjoy a selection from our extensive champagne menu or wine list. View our Drink Menu Savor Enjoy the casual but superb fare from the Pavilion Bar. It features only the finest 100% USDA Prime Beef and freshest seafood, as well as an eclectic assortment of inspired local salads, flatbreads, shareable bites, and curated cocktails. View our Food Menu VIP Tables Enjoy a private table reservation that includes an array of amenities such as: beverages from our renowned wine, cocktail and champagne menus as well as cuisine from the Pavilion Bar menu. VIP Tables Hotel Reservations Grill 225 Reservations Information Request Events © Copyright 2026 Market Pavilion Hotel - All Rights Reserved. Design by Palas Software Systems Accommodations Grill 225 Pavilion Bar Events Gifts Contact Policies Careers Top",
      "hash": "e1c9968afa25",
      "downloadedAt": "2026-01-18T16:54:40.161Z",
      "trimmedAt": "2026-01-18T17:11:39.421Z",
      "sizeReduction": "93.9%"
    }
  ],
  "sizeReduction": "95.8%"
}