{
  "venueId": "ChIJidlfpWt8_ogRfppfkRPhf88",
  "venueName": "Taste of Thai",
  "venueArea": "West Ashley",
  "website": "https://tasteofthaiorleansrd.com/",
  "scrapedAt": "2026-01-18T17:04:28.896Z",
  "trimmedAt": "2026-01-18T17:11:33.241Z",
  "pages": [
    {
      "url": "https://tasteofthaiorleansrd.com/charleston-taste-of-thai-events",
      "text": "Events We are updating our events Please stay tuned",
      "hash": "28a17ced2b8e",
      "downloadedAt": "2026-01-18T17:03:22.755Z",
      "trimmedAt": "2026-01-18T17:11:33.215Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "https://tasteofthaiorleansrd.com/charleston-taste-of-thai-drink-menu",
      "text": "Our Drinks Beverages",
      "hash": "2c227474bed3",
      "downloadedAt": "2026-01-18T17:03:21.524Z",
      "trimmedAt": "2026-01-18T17:11:33.218Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "https://tasteofthaiorleansrd.com/charleston-taste-of-thai-food-menu",
      "text": "Our Menu Menu Sushi Menu Lunch menu",
      "hash": "708c9bdc0286",
      "downloadedAt": "2026-01-18T17:03:20.918Z",
      "trimmedAt": "2026-01-18T17:11:33.224Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "https://tasteofthaiorleansrd.com/",
      "text": "Reservations - Book your table with us today! Call to Inquire Reservations - Book your table with us today! Parties & Groups - Host your next party or get together with us! Book your party Parties & Groups - Host your next party or get together with us! Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! Job Listings Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! 874 Orleans Road Unit 6, Charleston, SC 29407 map marker pin About us All items on our menu are made from scratch daily. We hand select each ingredient to make each plate explodes with flavor. Our menu is uniquely ours and features amazing recipes from our family gatherings. Whatever you order, you'll quickly see why we're known for our modern interpretation of classic dishes and our insistence on using only fresh, high-quality ingredients. We are able to customize many items on our menu to ensure your food experience is amazing. We offer take-out and dine-in options and are able to cater to large parties with advance notice. Menu food Order Online Your favorite food is just a click away. Order online and enjoy. Order order now Best food, Great value Menu Your favorite food just a click away Order Now Dot slide navigation number 1 Dot slide navigation number 2 slideshow start stop playing Parties Need the space for your event? Search no more we have a perfect place for you! Book a party Reviews review by - Yelp Cheryl M: Food and service were awesome. We had the best beef Pad See Ew. We wished we lived closer as we would be here every week! Yummy. review by - Yelp Madison R: Amazing! This is my go-go when I am sick or just in the mood for some comfort food. We LOVE the green curry! review by - Yelp John B: This is the best Thai place in the area. I have been to Thailand 7 times and this place is closest to authentic taste in my opinion. Overall good Thai food and excellent service. review by - Yelp Saint S: I love you Taste of Thai never change. Best pad Thai and coconut soup in the city. Been a fan for years. Never had a bad experience. review by - Yelp Jessica B: I loved everything I got 5/5 most definitely. The yellow curry, curry poppers and the stir fry was so good my family loved it definitely will be returning Stop reviews carousel Play reviews carousel Newsletter Locations 874 Orleans Road Unit 6 Charleston, SC 29407 Thai House #2 9086 Old Number Six Highway Santee, SC 29142 803-854-9060 Hours Mon, Tue, Wed, Thur 11:00 AM - 9:00 PM Fri 11:00 AM - 10:00 PM Sat 12:00 PM - 10:00 PM Sun 12:00 PM - 9:00 PM Find us on... Facebook page Yelp page Contact us (843)-573-8825 arunmaneejen@gmail.com Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "8325e44a95f0",
      "downloadedAt": "2026-01-18T17:03:20.827Z",
      "trimmedAt": "2026-01-18T17:11:33.238Z",
      "sizeReduction": "97.8%"
    },
    {
      "url": "https://tasteofthaiorleansrd.com/charleston-taste-of-thai-happy-hours-specials",
      "text": "Specials We are updating our specials Please stay tuned",
      "hash": "99f182c361be",
      "downloadedAt": "2026-01-18T17:03:22.143Z",
      "trimmedAt": "2026-01-18T17:11:33.241Z",
      "sizeReduction": "99.9%"
    }
  ],
  "sizeReduction": "99.4%"
}