{
  "venueId": "ChIJeSdpeGd__ogRElCKwoPUCIA",
  "venueName": "The Natural",
  "venueArea": "West Ashley",
  "website": "http://www.thenaturalchs.com/",
  "scrapedAt": "2026-01-18T17:04:28.539Z",
  "trimmedAt": "2026-01-18T17:11:22.189Z",
  "pages": [
    {
      "url": "http://www.thenaturalchs.com/johns-island-the-natural-food-menu",
      "text": "Our Menu Food Menu Happy Hour Menu",
      "hash": "242cdc6d1eed",
      "downloadedAt": "2026-01-18T17:04:00.758Z",
      "trimmedAt": "2026-01-18T17:11:22.166Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://www.thenaturalchs.com/johns-island-the-natural-happy-hours-specials",
      "text": "Specials Monday January 19th Trivia at & 7:00 07:00 PM - 09:00 PM Tuesday January 20th 1/2 price burgers all day 11:00 AM - 11:00 PM Wednesday January 21st 1/2 price Chicken Sandwiches and all drafts $5 11:00 AM - 11:00 PM Thursday January 22nd Half Price Pizza and WINE 11:00 AM - 11:00 PM",
      "hash": "8c7631352af3",
      "downloadedAt": "2026-01-18T17:04:02.174Z",
      "trimmedAt": "2026-01-18T17:11:22.169Z",
      "sizeReduction": "99.6%"
    },
    {
      "url": "http://www.thenaturalchs.com/johns-island-the-natural-drink-menu",
      "text": "Our Drinks Beer Wine Cocktails",
      "hash": "9034fbb3dc66",
      "downloadedAt": "2026-01-18T17:04:01.401Z",
      "trimmedAt": "2026-01-18T17:11:22.172Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://www.thenaturalchs.com/",
      "text": "NFL Playoffs - Come watch the NFL Playoffs with us! Call to Inquire NFL Playoffs - Come watch the NFL Playoffs with us! Parties & Groups - Host your next party or get together Book your party Parties & Groups - Host your next party or get together Reservations - We recommend making a reservation ahead of time. Book your table today! Call to Inquire Reservations - We recommend making a reservation ahead of time. Book your table today! Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! Job Listings Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! 3297 Maybank Highway 301, Johns Island, SC 29455 map marker pin Order online Take us to go! Enjoy your favorites anywhere! Order Online About us We are The Natural restaurant. Come visit us and enjoy our delicious cuisine. We will be happy to serve you! Our menu Private parties The Natural has the perfect space for birthday bashes, holiday parties, corporate events, wedding festivities, and more! Private Parties Reviews review by - Yelp Deborah B: This gem is a great addition to Johns Island. The staff is courteous, efficient and friendly. The food is outstanding and there are a variety of options for cocktails. The atmosphere is perfect for every member of the family to enjoy from the televisions with sports to the amusements for both adults and children. The Natural is definitely a great experience for locals and guests. review by - Google Chris R: I am blown away by this place. Everything from the plaza it is located in and the patio to the interior - the bar, the arcade area, the seating - everything is exquisitely clean, fresh, and a great vibe. The place is massive with countless … review by - Google Russell C: Had the wings with tribute sauce, the cheese steak, and the Margherita pizza. Everything was delicious! Sara served us and she did an awesome job. Highly recommend this place! review by - Google Robin D: The food was delicious recommend arcade was the best part review by - Google Octavia S: ason was awesome!! Food was great!! Stop reviews carousel Play reviews carousel Great Food, Made From Scratch Packed With Flavor Our Menu Your Private Party Spot Bring The Whole Family! Parties Dot slide navigation number 1 Dot slide navigation number 2 Dot slide navigation number 3 slideshow start stop playing Newsletter Location 3297 Maybank Highway 301 Johns Island, SC 29455 Hours Sun, Mon, Tue, Wed, Thur, Fri, Sat 11:00 AM - 12:00 AM Find us on... Facebook page Yelp page Contact us (854)-444-2851 infothenatural@gmail.com Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "b0609be15f1b",
      "downloadedAt": "2026-01-18T17:04:00.661Z",
      "trimmedAt": "2026-01-18T17:11:22.189Z",
      "sizeReduction": "98.0%"
    }
  ],
  "sizeReduction": "99.2%"
}