{
  "venueId": "ChIJA2O3RxJj_ogRBD0_BB_xEhs",
  "venueName": "Seafood Pot",
  "venueArea": "North Charleston",
  "website": "http://www.seafood-pot.com/",
  "scrapedAt": "2026-01-18T17:04:23.974Z",
  "trimmedAt": "2026-01-18T17:05:07.311Z",
  "pages": [
    {
      "url": "http://www.seafood-pot.com/price-list",
      "text": "Order your favorite seafood dishes online and enjoy Seafood Pot from the comfort of your home! Order Now Best Sellers (4) Daily Special $13.99 Learn more Jumbo Shrimp $8.99 View options Learn more Shrimp (5) & Chicken Wings (4) $16.99 Learn more Garlic Butter BBQ Ribs $19.99 Learn more LOW COUNTRY BOIL Daily Special $13.99 Order Your choice of shrimp, crab, or mussels. Served with corn, potatoes, and sausage. Add eggs: $2.99 Seafood Lovers (1 Person) $31.99 Order Your choice of shrimp, crab, or mussels. Comes with 1 snow crab cluster, corn, potatoes, and sausage. 2 eggs for $2.99 Seafood Pot (2 People) $57.99 Order 2 snow crab clusters, shrimp, and crawfish. Served with corn, potatoes, and sausage. Add 2 eggs for $2.99 Seafood Madness (3–4 People) $75.99 Order 2 snow crab clusters, shrimp, mussels, 2 lbs black mussels, 1 lb crawfish. Served with corn, potatoes, and sausage. Add 2 eggs for $2.99 FRIED SEAFOOD PLATES Catfish $8.99 Order Jumbo Shrimp $8.99 Order Popcorn Shrimp $8.99 Order Oysters $8.99 Order Pork Chop $8.99 Order COMBO FRIED PLATTERS Shrimp (5) & Fish (2) All plates come with one side: White rice with garlic butter Corn Boiled potatoes Seasoned fries Shrimp (5) & Oysters (5) All plates come with one side: White rice with garlic butter Corn Boiled potatoes Seasoned fries Shrimp (5) & Chicken Wings (4) All plates come with one side: White rice with garlic butter Corn Boiled potatoes Seasoned fries Fish (2) & Oysters (5) All plates come with one side: White rice with garlic butter Corn Boiled potatoes Seasoned fries Fish (2) & Chicken Wings (4) All plates come with one side: White rice with garlic butter Corn Boiled potatoes Seasoned fries Seafood Platter (5 Shrimp, 2 Fish, 5 Oysters) All plates come with one side: White rice with garlic butter Corn Boiled potatoes Seasoned fries KT Special (1 Snow Crab Cluster, 5 Jumbo Shrimp) All plates come with one side: White rice with garlic butter Corn Boiled potatoes Seasoned fries CHICKEN WINGS 3 Wings $6.99 Order All plates come with one side: Corn White rice with garlic butter Boiled potatoes Seasoned fries Coleslaw 5 Wings $9.99 Order All plates come with one side: Corn White rice with garlic butter Boiled potatoes Seasoned fries Coleslaw 8 Wings $12.99 Order All plates come with one side: Corn White rice with garlic butter Boiled potatoes Seasoned fries Coleslaw 10 Wings $15.99 Order All plates come with one side: Corn White rice with garlic butter Boiled potatoes Seasoned fries Coleslaw 15 Wings $19.99 Order All plates come with one side: Corn White rice with garlic butter Boiled potatoes Seasoned fries Coleslaw 3 Tenders $7.99 Order All plates come with one side: Corn White rice with garlic butter Boiled potatoes Seasoned fries Coleslaw Add 1 tender for $2.49 Add 1 wing for $1.69 GRILLED PLATE Garlic Grilled Pork Chop + Fried Rice with Egg $17.99 Order (Served with cucumber and cherry tomatoes or salad and soy sauce) Garlic Butter BBQ Ribs $19.99 Order (Served with cucumber and tomatoes or salad and soy sauce) Garlic Grilled Shrimp + Fried Rice with Egg $17.99 Order (Served with cucumber and tomatoes or salad and soy sauce) SALAD / GUMBO Fried Chicken or Shrimp Salad $9.99 Order Grilled Chicken or Shrimp Salad $9.99 Order Seafood Gumbo (Onion, bell pepper, celery, chicken, sausage, shrimp, and white rice) Noodle Soup $15.99 Order (Beef broth with rice noodles, beef meatballs and rare steak) SIDE ITEMS Soft Shell Crab (2) $13.99 Order 1 for $7.99 Crab Cake (2) $13.99 Order 1 for $7.99 Mozzarella $3.99 Order Cheese Sticks (4) $3.99 Order Hush Puppies (5) $2.99 Order Eggroll (2) $4.99 Order Jalapeño with Cheese $3.99 Order Fried Okra $5.99 Order Fried Oreo with Cookie $5.99 Order Butter or Chocolate ADD-ONS Egg $2.99 Order Extra Corn $1.99 Order Extra Sausage $2.99 Order Soda or Drink $1.99 Order Sweet Tea $2.99 Order Peach Tea with Boba $3.99 Order Thai Tea with Boba $3.99 Order Reviews Tori Brown The food was all very fresh, hot, and delicious. The staff were all very kind and helpful. We were a table of 5 and we got all of our food within 20 minutes. Clean, friendly place. Definitely recommend! Payton Miracol Food was absolutely amazing!!! Super friendly staff! We were visiting from Tennessee and really wanted a good seafood place. This place definitely did NOT disappoint! We may need to make another trip here before we head back home! Even the chicken and fries my kids got was a pretty good serving size! All the way around it was a great place!!! Tera Williams This restaurant was nice and clean and it had a wide variety of items to choose from. The customer service was great with recommending items that was sure to please our taste buds. Even though we did not get the highly recommended gumbo, the items we did choose were fantastic. Our food came out nice and hot and the portion sizes were great. Delicious and filling, what a winning combination. Naarin Jakkor I truly enjoyed the seafood pot; it was bursting with flavor and clearly prepared with fresh ingredients. It was also served hot, which made it all the more delightful. I must say, the owner was incredibly friendly and made the experience even more special. It's always nice to be welcomed with such warmth! Tori Brown The food was all very fresh, hot, and delicious. The staff were all very kind and helpful. We were a table of 5 and we got all of our food within 20 minutes. Clean, friendly place. Definitely recommend! Payton Miracol Food was absolutely amazing!!! Super friendly staff! We were visiting from Tennessee and really wanted a good seafood place. This place definitely did NOT disappoint! We may need to make another trip here before we head back home! Even the chicken and fries my kids got was a pretty good serving size! All the way around it was a great place!!! Tera Williams This restaurant was nice and clean and it had a wide variety of items to choose from. The customer service was great with recommending items that was sure to please our taste buds. Even though we did not get the highly recommended gumbo, the items we did choose were fantastic. Our food came out nice and hot and the portion sizes were great. Delicious and filling, what a winning combination. Naarin Jakkor I truly enjoyed the seafood pot; it was bursting with flavor and clearly prepared with fresh ingredients. It was also served hot, which made it all the more delightful. I must say, the owner was incredibly friendly and made the experience even more special. It's always nice to be welcomed with such warmth! Tori Brown The food was all very fresh, hot, and delicious. The staff were all very kind and helpful. We were a table of 5 and we got all of our food within 20 minutes. Clean, friendly place. Definitely recommend! Payton Miracol Food was absolutely amazing!!! Super friendly staff! We were visiting from Tennessee and really wanted a good seafood place. This place definitely did NOT disappoint! We may need to make another trip here before we head back home! Even the chicken and fries my kids got was a pretty good serving size! All the way around it was a great place!!! Tera Williams This restaurant was nice and clean and it had a wide variety of items to choose from. The customer service was great with recommending items that was sure to please our taste buds. Even though we did not get the highly recommended gumbo, the items we did choose were fantastic. Our food came out nice and hot and the portion sizes were great. Delicious and filling, what a winning combination. Naarin Jakkor I truly enjoyed the seafood pot; it was bursting with flavor and clearly prepared with fresh ingredients. It was also served hot, which made it all the more delightful. I must say, the owner was incredibly friendly and made the experience even more special. It's always nice to be welcomed with such warmth! Merchant Policies Legal Notice Powered by",
      "hash": "55106f323b5e",
      "downloadedAt": "2026-01-18T17:00:23.106Z",
      "trimmedAt": "2026-01-18T17:05:07.148Z",
      "sizeReduction": "99.6%"
    },
    {
      "url": "http://www.seafood-pot.com/",
      "text": "Order your favorite seafood dishes online and enjoy Seafood Pot from the comfort of your home! Order Now 5629 Rivers Ave, North Charleston, South Carolina, 29406 Seafood Pot, LLC All Flavor, No Compromise—Seafood the Southern Way (843) 737-5173 Contact Us Now At , we bring bold, Southern-style seafood to life right here in North Charleston. Specializing in fresh, flavorful dishes like gumbo and low country boils, we offer a taste of New Orleans to locals craving authentic coastal comfort food. Whether you're dining in or taking out, our seafood-only focus and warm, down-home approach make us the go-to spot for those who appreciate tradition done right. Seafood Pot, LLC Flavorful Seafood Excellence in North Charleston At Seafood Pot, LLC, we bring authentic New Orleans flavor to the heart of North Charleston. As a seafood-only restaurant, we’re proud to offer a menu that celebrates the bold, savory essence of Southern coastal cuisine. From our beloved Shrimp and Fish Plates to our hearty, flavor-packed Seafood Gumbo, we’re ... Read more Rooted in Tradition, Seasoned by the Sea Seafood Pot, LLC was born from a love of authentic Southern seafood and a mission to share the flavors of New Orleans with our North Charleston community. What started as a dream to bring something special to the neighborhood has grown into a local favorite, known not only for our gumbo but for the energy and ... Read more Highlights From Our Table Locals have spoken, and with a customer rating of 4.4, it’s clear that Seafood Pot, LLC has carved out a special place in the North Charleston dining landscape. We’re proud to serve up seafood that’s not only fresh but full of heart—and it shows in the plates that leave our kitchen and the stories our guests share.... Read more Signature Seafood Gumbo Known as the best gumbo in town, this dish is a cornerstone of our menu and a true taste of New Orleans. Rich, hearty, and packed with flavor—it’s a customer favorite for a reason. Low Country Boil Experience Our Low Country Boil is a celebration of Southern seafood tradition, featuring boiled crawfish, shrimp, and snow crab. It’s a must-try for anyone craving a bold and authentic coastal feast. Seafood-Only Concept At Seafood Pot, we do one thing and we do it well—seafood. By focusing exclusively on ocean-inspired dishes, we deliver quality, consistency, and deep flavor in every bite. Reviews Tori Brown The food was all very fresh, hot, and delicious. The staff were all very kind and helpful. We were a table of 5 and we got all of our food within 20 minutes. Clean, friendly place. Definitely recommend! Payton Miracol Food was absolutely amazing!!! Super friendly staff! We were visiting from Tennessee and really wanted a good seafood place. This place definitely did NOT disappoint! We may need to make another trip here before we head back home! Even the chicken and fries my kids got was a pretty good serving size! All the way around it was a great place!!! Tera Williams This restaurant was nice and clean and it had a wide variety of items to choose from. The customer service was great with recommending items that was sure to please our taste buds. Even though we did not get the highly recommended gumbo, the items we did choose were fantastic. Our food came out nice and hot and the portion sizes were great. Delicious and filling, what a winning combination. Naarin Jakkor I truly enjoyed the seafood pot; it was bursting with flavor and clearly prepared with fresh ingredients. It was also served hot, which made it all the more delightful. I must say, the owner was incredibly friendly and made the experience even more special. It's always nice to be welcomed with such warmth! Tori Brown The food was all very fresh, hot, and delicious. The staff were all very kind and helpful. We were a table of 5 and we got all of our food within 20 minutes. Clean, friendly place. Definitely recommend! Payton Miracol Food was absolutely amazing!!! Super friendly staff! We were visiting from Tennessee and really wanted a good seafood place. This place definitely did NOT disappoint! We may need to make another trip here before we head back home! Even the chicken and fries my kids got was a pretty good serving size! All the way around it was a great place!!! Tera Williams This restaurant was nice and clean and it had a wide variety of items to choose from. The customer service was great with recommending items that was sure to please our taste buds. Even though we did not get the highly recommended gumbo, the items we did choose were fantastic. Our food came out nice and hot and the portion sizes were great. Delicious and filling, what a winning combination. Naarin Jakkor I truly enjoyed the seafood pot; it was bursting with flavor and clearly prepared with fresh ingredients. It was also served hot, which made it all the more delightful. I must say, the owner was incredibly friendly and made the experience even more special. It's always nice to be welcomed with such warmth! Tori Brown The food was all very fresh, hot, and delicious. The staff were all very kind and helpful. We were a table of 5 and we got all of our food within 20 minutes. Clean, friendly place. Definitely recommend! Payton Miracol Food was absolutely amazing!!! Super friendly staff! We were visiting from Tennessee and really wanted a good seafood place. This place definitely did NOT disappoint! We may need to make another trip here before we head back home! Even the chicken and fries my kids got was a pretty good serving size! All the way around it was a great place!!! Tera Williams This restaurant was nice and clean and it had a wide variety of items to choose from. The customer service was great with recommending items that was sure to please our taste buds. Even though we did not get the highly recommended gumbo, the items we did choose were fantastic. Our food came out nice and hot and the portion sizes were great. Delicious and filling, what a winning combination. Naarin Jakkor I truly enjoyed the seafood pot; it was bursting with flavor and clearly prepared with fresh ingredients. It was also served hot, which made it all the more delightful. I must say, the owner was incredibly friendly and made the experience even more special. It's always nice to be welcomed with such warmth! Menu Slideshow 2.0 Contact Us Office location 5629 Rivers Ave, North Charleston, South Carolina, 29406 Give us a call (843) 737-5173 Send us an email [email protected] Follow Us Merchant Policies Legal Notice Powered by",
      "hash": "7aad53615520",
      "downloadedAt": "2026-01-18T17:00:22.807Z",
      "trimmedAt": "2026-01-18T17:05:07.311Z",
      "sizeReduction": "99.7%"
    }
  ],
  "sizeReduction": "99.6%"
}