{
  "venueId": "ChIJ26yp1Cp9_ogRozYNdBhwx_o",
  "venueName": "Villa Cantina",
  "venueArea": "West Ashley",
  "website": "http://villacantinawestashley.com/",
  "scrapedAt": "2026-01-18T17:04:23.159Z",
  "trimmedAt": "2026-01-18T17:04:47.245Z",
  "pages": [
    {
      "url": "http://villacantinawestashley.com/charleston-villa-cantina-cocktail-and-lounge-food-menu",
      "text": "Our Menu Menu",
      "hash": "2dba080a3c1e",
      "downloadedAt": "2026-01-18T17:04:11.738Z",
      "trimmedAt": "2026-01-18T17:04:47.222Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://villacantinawestashley.com/charleston-villa-cantina-cocktail-and-lounge-drink-menu",
      "text": "Our Drinks Cocktails Sodas and Drinks Wine",
      "hash": "363010a5f5b6",
      "downloadedAt": "2026-01-18T17:04:12.398Z",
      "trimmedAt": "2026-01-18T17:04:47.225Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "http://villacantinawestashley.com/",
      "text": "× Order your favorite dishes in seconds! Order Online × Did you know we do catering? Whatever your occasion, however big or small, we have the perfect options to choose from. Cater your birthday party, holiday party, corporate events, wedding festivities and more! Call to Inquire × Let us host your special event! Whether a birthday party, office function or any other special occasion - we take care of all the fine details, bringing your event to life, just as you imagined. Host your next party or get together Call to Inquire Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! Job Listings Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! 1940 Sam Rittenberg Boulevard, Charleston, SC 29407 Visit us at map marker pin slideshow start stop playing Slide 1 content Slide 2 content Slide 3 content previous slide next slide Take us home with you! Order here Let us handle the catering Inquire about catering Tailored events for all occasions Book a Party Catering Planning An Event? Leave the catering to us and enjoy a stress-free event with exceptional quality and service. Contact us today to elevate your next gathering with the exquisite flavors. Inquire about catering Groups & Parties Impress Your Guests Celebrate your special occasions with us in a unique and vibrant setting. Whether it's a birthday bash, corporate event, engagement party, or any other reason to gather and have a good time, our private party space is ideal for creating unforgettable memories. Book now a private party About us Family Owned Mexican Restaurant Group Villa Cantina was built on the concept that great Mexican food can be fast and fresh, and our customers have loved the fact that they can come in for a speedy, delicious and authentic meal. Our menu Order online From Our Restaurant To You Order your favorite dishes from the comfort of your own home with our easy online ordering system. Order Skip Gallery Carousel Start stop gallery carousel Newsletter Location 1940 Sam Rittenberg Boulevard Charleston, SC 29407 Hours Mon-Thur: 11am-10pm Friday-Saturday: 11am-9:00pm Sunday:11am-9:30pm Find us on... Contact us (843)-225-1144 Call us at thevillacocktaillounge@gmail.com Write us at Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "41a187d1a184",
      "downloadedAt": "2026-01-18T17:04:11.635Z",
      "trimmedAt": "2026-01-18T17:04:47.239Z",
      "sizeReduction": "98.5%"
    },
    {
      "url": "http://villacantinawestashley.com/charleston-villa-cantina-cocktail-and-lounge-happy-hours-specials",
      "text": "Specials Sunday January 18th Grab your group it's time for Brunch! 👇 - All your favorites from Birria toast to Mimosa specials -Happy Hour Daily 4-8 pm 10:30 AM - 10:00 PM Tuesday January 20th Taco Tuesday! 11:00 AM - 10:00 PM",
      "hash": "4ed3fbf8f522",
      "downloadedAt": "2026-01-18T17:04:13.018Z",
      "trimmedAt": "2026-01-18T17:04:47.242Z",
      "sizeReduction": "99.7%"
    },
    {
      "url": "http://villacantinawestashley.com/charleston-villa-cantina-cocktail-and-lounge-events",
      "text": "Events Valentine's Day Saturday February 14th Join us on Valentine's Day for the perfect romantic evening! 11:00 AM - 11:30 PM National Margarita Day Sunday February 22nd Come celebrate National Margarita day with us on February 22nd. 11:00 AM - 09:30 PM",
      "hash": "f6173264468e",
      "downloadedAt": "2026-01-18T17:04:13.646Z",
      "trimmedAt": "2026-01-18T17:04:47.245Z",
      "sizeReduction": "99.6%"
    }
  ],
  "sizeReduction": "99.4%"
}