{
  "venueId": "ChIJWzwFkHpx_ogRjGXACa1ibxc",
  "venueName": "Sunsets Creekside Bar",
  "venueArea": "Mount Pleasant",
  "website": "https://sunsetswaterfrontdining.com/",
  "scrapedAt": "2026-01-19T02:19:34.497Z",
  "trimmedAt": "2026-01-19T02:23:04.705Z",
  "pages": [
    {
      "url": "https://sunsetswaterfrontdining.com/",
      "text": "[Page Title: Sunsets Creekside Bar | Shem Creek | 97 Ronnie Boals Blvd, Mount Pleasant, SC, USA]\n\ntop of page FOR THE SHEM CREEK SHUFFLERS \nJoin us weekly for\n\nLIVE MUSIC, TRIVIA, AND MORE!\nVIEW CALENDAR ABOUT CREEKSIDE bites - and views, too! As sure as the fact that the sun will set, you can count on us - for good drinks, good food, good times, and good views, too! \nSunsets is nestled along Shem Creek's quaint, yet vibrant waterfront. Guests are welcome to join by land or dock it and kick back with seafood baskets and craft cocktails.\nABOUT CREEKSIDE bites - and views, too! As sure as the fact that the sun will set, you can count on us - for good drinks, good food, good times, and good views, too! \nSunsets is nestled along Shem Creek's quaint, yet vibrant waterfront. Guests are welcome to join by land or dock it and kick back with seafood baskets and craft cocktails.\nbar & Bites FISH CAMP FAVORITES At Sunsets, you can chow down on coastal classics like , or explore fresh sushi rolls like our crowd-favorite Nikkei Burrito or the sweet and spicy Mango Roll. Peel n' Eat Shrimp, Crab Legs, and Oysters We take familiar low country staples and step them up a notch. VIEW OUR MENUS bar & Bites TAKING LOW COUNTRY TO THE NEXT LEVEL \nAt Sunsets, you can chow down on coastal classics like , or explore fresh sushi rolls like our crowd favorite Nikkei Burrito or the sweet and spicy Mango Roll.\nPeel n' Eat Shrimp, Crab Legs, and Oysters We take familiar low country stapes, and step them up a notch. VIEW OUR MENUS Don't Be Shellfish! Sign up for our newsletter: SIGN UP Creekside\nbar bottom of page",
      "hash": "53f0fd4b663b",
      "downloadedAt": "2026-01-19T02:12:25.507Z",
      "trimmedAt": "2026-01-19T02:23:04.705Z",
      "sizeReduction": "99.9%"
    }
  ],
  "sizeReduction": "99.9%"
}