{
  "venueId": "ChIJr0BpYSV7_ogRkzbsA7DcjIQ",
  "venueName": "Blackenese Soul Food Hibachi Food Truck Pop up and Catering",
  "venueArea": "North Charleston",
  "website": "http://www.blackenesehibachi.com/",
  "scrapedAt": "2026-01-19T02:19:37.976Z",
  "trimmedAt": "2026-01-19T02:27:25.214Z",
  "pages": [
    {
      "url": "https://www.blackenesehibachi.com/menu",
      "text": "[Page Title: Catering Menu | Blackenese Hibachi]\n\ntop of page Healthy and Delicious! Catering Menu Call 843-425-9965 if your ordering for next-day delivery or pick up CREOLE HIBACHI BAR CATERING DROP OFF Creole Hibachi Bar serves 10 to 15 pp\nBourbon Chicken, Blackened Steak, Blackened Shrimp\nServed with Dirty rice and Hibachi soul veggies. Blackened Steak Hibachi Blackened Ribeye Steak served with, Greens, green beans, carrots,broccoli, cauliflower, Collards, and served with beef dirty rice. $15.95 \nGluten free\nHibachi Soul Bourbon St Chicken Blackened chicken tossed in bourbon St sauce and served with Greens, green beans, carrots,broccoli, Collards, cauliflower, served with beef dirty rice. $13.95 \nGluten free\nHibachi Soul Blackened Shrimp Blackened or fried Shrimp served with Greens, green beans, carrots, broccoli, cauliflower, Collard. and beef dirty rice. $14.95 \nGluten free\nBourbon St BBQ Pot Stickers 5 Chicken and vegetable pot sticker’s fried and tossed with our homemade Bourbon sauce. $6 \nGluten free\nSTARTERS Bourbon St BBQ Pot Stickers 5 Chicken and vegetable pot sticker’s fried and tossed with our homemade Bourbon sauce. $6 \nGluten free\nCollards Green Egg Rolls Slow Cooked Collards with herbs and spices rolled in egg roll wrap. Served with Bourbon St Sauce $6 \nVegetarian\nMAINS Our Hibachi section. 100% Customizable Blackened Steak Hibachi Blackened Ribeye Steak served with, Greens, green beans, carrots,broccoli, cauliflower, Collards, and served with beef dirty rice. $15.95 \nGluten free\nHibachi Soul Bourbon St Chicken Blackened chicken tossed in bourbon St sauce and served with Greens, green beans, carrots,broccoli, Collards, cauliflower, served with beef dirty rice. $13.95 \nGluten free\nHibachi Soul Blackened Shrimp Blackened or fried Shrimp served with Greens, green beans, carrots, broccoli, cauliflower, Collard. and beef dirty rice. $14.95 \nGluten free\nCreole Combo Hibachi Mix your favorite meats! Pick 2 Chicken, steak and shrimp. $18.95 \nGluten free\nVeggie Hibachi Seasonal vegetables Stir fry, Served with Perlo rice. $12.95 \nVegetarian\n\nVegan\nBourbon St Pot Stickers Chicken or veggie pot stickers fried and tossed in a slap your mama bourbon sauce. $8 \nVegetarian\nSouthern Stir Fry Crab Rice Rice stir fried with Fresh blue crab, onions, bell peppers, southern spices and veggies $18.95 My New Option Shrimp $5 Charleston Ham Rice Smoked ham tossed with yellow rice, onions, bells, and Gullah spices, and served with Cajun veggies. $11.95 bottom of page",
      "hash": "a8dd6b3a2a3a",
      "downloadedAt": "2026-01-19T02:13:27.385Z",
      "trimmedAt": "2026-01-19T02:27:25.148Z",
      "sizeReduction": "99.8%"
    },
    {
      "url": "http://www.blackenesehibachi.com/",
      "text": "[Page Title: Hibachi | Blackenese Soul Food Hibachi | United States]\n\ntop of page Catering | Blackenese Soul Food Hibachi Food Truck Charleston SC Creole Soul Food Our Cuisine We source only the highest quality, seasonal, ingredients to create our delicious meals. Individual servings are packed in recyclable boxes CUSTOMIZE YOUR ORDER WE STRIVE TO PROVIDE A SOLUTION FOR ALL DIETARY NEEDS ​ Hibachi Soul Blackened Chicken ​ Creole blackened chicken seared to perfection tossed in a bourbon sauce served with collard, green beans, carrots, broccoli, cauliflower, and Perlo yellow rice ​ ​ ​ Hibachi Soul Blackened Ribeye Steak ​ Blackened Ribeye served with Fresh collard,  green beans, carrots, broccoli, cauliflower, and Perlo rice ​ ​ ​ ​ Hibachi Soul Blackened Shrimp ​ Blackened  shrimp served with collard , green beans, carrots, broccoli, cauliflower, and Perlo rice ​ ​ Contact Contact Us Food truck service Minimum is $750 BLACKENESEHIBACHI@GMAIL.COM TEL: 704 891 9222 Fill out this short contact form. Our of our planners will contact you shorlty Submit Thanks for submitting! bottom of page",
      "hash": "fc71403e797b",
      "downloadedAt": "2026-01-19T02:13:27.289Z",
      "trimmedAt": "2026-01-19T02:27:25.214Z",
      "sizeReduction": "99.8%"
    }
  ],
  "sizeReduction": "99.8%"
}