{
  "venueId": "ChIJr3IjcyB5_ogRPWFiNgzB5wQ",
  "venueName": "Coastal Crust James Island",
  "venueArea": "James Island",
  "website": "http://www.coastalcrust.com/",
  "scrapedAt": "2026-01-19T02:19:37.992Z",
  "trimmedAt": "2026-01-19T02:27:25.402Z",
  "pages": [
    {
      "url": "https://www.coastalcrust.com/events",
      "text": "[Page Title: EVENTS | Coastal Crust]\n\ntop of page private events Coastal Crust was created to cater pizza in the most unique style possible. We combine a beautifully restored early 1950's classic truck with a handcrafted, wood-fired Valoriani pizza oven to bring Neapolitan style pizza to you and your guests at any location for private parties at your home, corporate events, rehearsal dinners, weddings and so much more. ​ To accompany our gourmet pizza, we offer fresh, seasonal salads with locally sourced ingredients, homemade wood-fired focaccia bread, and a wide variety of antipasto and additional entrée options. Cannolis are always a special treat at the end of your event that come standard with our private event catering packages as well. ​ Our trucks also come equipped with beer taps built right in so you and your guests can enjoy cold, local or domestic beer options. We also offer fine wines in our beverage packages, and have full liquor bar set ups available! ​ Our mobile eateries are outfitted with everything needed to roll up, set up, and serve up any number of guests with availability in the Charleston and Greenville areas. ​ If you would like to get the planning process started for your private event or wedding, please fill out an inquiry form by clicking your location's button below and we will be in touch soon! ALL PIZZA TRUCK INQUIRIES MOUNT PLEASANT CAR PORT RENTAL WILD DUNES PRIVATE PARTIES get on the phone (843) 654 - 9606 bottom of page",
      "hash": "0c65fa24ad64",
      "downloadedAt": "2026-01-19T02:10:06.605Z",
      "trimmedAt": "2026-01-19T02:27:25.299Z",
      "sizeReduction": "99.7%"
    },
    {
      "url": "http://www.coastalcrust.com/",
      "text": "[Page Title: Coastal Crust | Wood-fired Pizza & Caterer]\n\ntop of page LOCAL INGREDIENTS FAMILY OWNED COMMUNITY DRIVEN our mission Enjoying a quality meal with family and friends has been the frame work of our business. We pride ourselves on delivering an unforgettable experience, whether that be on sight at any of our locations, or by bringing our vintage mobile eatery to you for your upcoming private event or wedding. We believe in sourcing local ingredients whenever possible, supporting local breweries, and perfecting our craft by hiring talented and passionate culinary professionals who want to be a bigger part of what we do; making all feel welcome and wanting to come back for more while indulging in our cuisine in an elevated, family-friendly atmosphere. NEAPOLITAN WOOD-FIRED PIZZA MADE FROM SCRATCH ITALIAN INSPIRED ​ Our pizzas are hand stretched and baked in a custom built 700+ degree oven. We source kiln dried Oak wood that offers a bright smoky aroma to our pizzas. Aside from offering our well-known wood-fired pizzas, we also provide an assortment of Italian inspired antipasto options and dishes ranging from house-made meatballs to locally sourced pastas and desserts. Our dough is made with the finest ingredients and rolled by hand daily to provide you with the freshest tasting crust. You can expect to savor a high quality product every time you visit us. locations Currently serving Mount Pleasant, James Island, Greenville, Isle of Palms in Wild Dunes Resort and Travelers Rest, SC. Our brick & mortar locations are an inviting place to bring the whole family where you can find something to enjoy for everyone in your party. All locations offer our famous wood-fired Neapolitan style pizzas, fresh salads, shared plates, fine wine, local craft beer & so much more. To find out more about the location nearest you, just click below! MORE INFO mobile eatery Coastal Crust was created to cater pizza in the most unique style possible. We combine a beautifully restored early 1950's classic truck with a custom designed wood-fired Valoriani pizza oven to bring Neapolitan style pizza to you and your guests at any location. If you're planning to have a private party at your home, a corporate event, rehearsal dinner, wedding, birthday celebration or any other occasion where you would like to sit back, relax, and enjoy your guests, we have it all covered for you! To get more information, click the button below! INQUIRE rent our space At our Pizza Bar location in Mount Pleasant, we have a Car Port space that can be rented out for your private event. This is an open-air covered space that comfortably fits up to 40 guests for your rehearsal dinner, birthday party or any other special occasion . This is a great option for larger parties that want to enjoy all that we have to offer on site, while enjoying their own private space. If you would like to inquire about reserving this space and get more details for your upcoming event, click the button below! coastal crust design Aside from operating Coastal Crust's brick & mortar locations and catering services, we also fully restore vintage trucks and turn them into state of the art rolling pizza ovens. Think you're ready to dive into your own mobile catering business? Click the button below to learn more about what we can do to help bring your dreams to fruition. MORE INFO MORE INFO Anchor 1 bottom of page",
      "hash": "76d966eb8cd0",
      "downloadedAt": "2026-01-19T02:10:06.525Z",
      "trimmedAt": "2026-01-19T02:27:25.364Z",
      "sizeReduction": "99.4%"
    },
    {
      "url": "https://www.coastalcrust.com/locations",
      "text": "[Page Title: LOCATIONS | Coastal Crust]\n\ntop of page CLICK WHERE YOU WANNA GO MOUNT PLEASANT GREENVILLE JAMES ISLAND WILD DUNES ON ISLE OF PALMS TRAVELERS REST bottom of page",
      "hash": "7ed2292972a9",
      "downloadedAt": "2026-01-19T02:10:07.161Z",
      "trimmedAt": "2026-01-19T02:27:25.402Z",
      "sizeReduction": "100.0%"
    }
  ],
  "sizeReduction": "99.7%"
}