{
  "venueId": "ChIJvZBpvBN8_ogRJTyMz2Jj4IE",
  "venueName": "Boxcar Betty's",
  "venueArea": "West Ashley",
  "website": "http://www.boxcarbetty.com/",
  "scrapedAt": "2026-01-18T17:04:31.800Z",
  "trimmedAt": "2026-01-18T17:12:56.549Z",
  "pages": [
    {
      "url": "http://www.boxcarbetty.com/locations",
      "text": "All Locations Boxcar Betty's is growing! Click on your area below for maps, contact info, news and details about specific locations nearest to you. South Carolina 3 locations View South Carolina Chicago 1 location View Chicago Cart () 0",
      "hash": "3883cd380784",
      "downloadedAt": "2026-01-18T17:02:02.384Z",
      "trimmedAt": "2026-01-18T17:12:56.477Z",
      "sizeReduction": "99.7%"
    },
    {
      "url": "http://www.boxcarbetty.com/",
      "text": "Order Online Now Get a Gift Card Purveyor of gourmet fried chicken sandwiches. Boxcar Betty's started with a picture of a fried chicken sandwich and developed into a desire to bring high-end fried chicken sandwiches to Charleston. The process evolved into an experience for our customers from the incredible award winning chicken, to attentive customer service and a unique space. We craft our sandwiches with great care using the best chicken and locally sourced ingredients. hours & contact To find details for specific locations, please visit our locations section and choose the area nearest to you. We're growing! Locations LOCAL HERO DISCOUNT Boxcar Betty’s is proud to offer teachers, nurses, police officers, firefighters, and military personnel 10% off their in-store purchase with proof of ID at participating locations. follow us It’s so easy. Download the for easy online ordering and curbside pickup! Toast Takeout App Cart () 0",
      "hash": "7d08cec226a3",
      "downloadedAt": "2026-01-18T17:02:00.306Z",
      "trimmedAt": "2026-01-18T17:12:56.498Z",
      "sizeReduction": "99.3%"
    },
    {
      "url": "http://www.boxcarbetty.com/chicago/#chicago-menu",
      "text": "Hours Menu Catering Our List Order Ogilvie Address 500 W Madison StreetChicago, IL 60661 (312) 496-3450 Hours 11am -3pm M-FClosed - Sat-Sun Chicago Menu Sandwiches All-natural, cage-free, antibiotic-free fried or grilled chicken breast, or Pimiento cheese stuffed, fried Portobello mushroom cap. Boxcar Pimiento Cheese, Peach Slaw, House Pickles, Spicy Mayo Fried Chicken Grilled Chicken Pimiento Stuffed Portobello Chicken \"Not So Waffle\" Bacon Jam, Maple Syrup, Pimiento Cheese, Tomato Fried Chicken Grilled Chicken Pimiento Stuffed Portobello Buffalo Blue Cheese Sauce, Tomato, Bibb Lettuce Fried Chicken Grilled Chicken Pimiento Stuffed Portobello The Betty Lettuce, Tomato, Mayo, Pickles Fried Chicken Grilled Chicken Pimiento Stuffed Portobello Build Your Own Chicken or Mushroom Sandwich Fried or Grilled chicken or Pimiento Cheese Stuffed Mushroom Cap. Choose as many toppings as you'd like. Choice of Protein Fried Chicken Grilled Chicken Pimiento Stuffed Portobello Toppings Cheddar, Swiss, Pimiento, Kentucky Beer Cheese, Bibb Lettuce, Tomato, Housemade Pickles, Shallots, Peach Coleslaw, Pickled Green Tomato, Pickled Fried Green Tomato Sauces Agave Buttermilk, Ranch, Blue Cheese, Bacon Jam, Spicy Mayo, Honey Mustard, Buffalo, Sweet Chili, Mayo, BBQ Salad Choice of Protein Fried Chicken Grilled Chicken Pimiento Stuffed Portobello Includes: Bibb Lettuce, Shallots, Pickled Green Tomatoes, candied pecans and choice of Lime Vinaigrette or Agave Buttermilk dressing Dressings: Agave Buttermilk, Ranch, Blue Cheese, Honey Mustard, Vinaigrette Sides Handcut Fries Small / Large Chicken Nuggets Peach Coleslaw Catering Please fill out an inquiry form or call us at to place a catering or food truck order. (312) 496-3450 Inquiry Form Order Catering Get on the list Email Address Sign Up We respect your privacy. Thank you! Cart () 0",
      "hash": "7d51ba61eb29",
      "downloadedAt": "2026-01-18T17:02:01.745Z",
      "trimmedAt": "2026-01-18T17:12:56.518Z",
      "sizeReduction": "98.5%"
    },
    {
      "url": "http://www.boxcarbetty.com/south-carolina/#sc-menu",
      "text": "locations Map Locations Menu Catering West Ashley Address 1922 Savannah Hwy Charleston, SC 29407 Phone 843-225-7470 Hours 11am–8p M-Sun North Charleston Address 7800 Rivers Avenue, North Charleston, SC 29406 Phone 843-990-9804 Hours 11am–8p M-Sun Mt. Pleasant address 1701 Shoremeade Road Mt. Pleasant, SC 29464 phone 854-227-5198 HOURS 11am–8p M-Sun South Carolina Menu Chicken Sandwiches All-natural, cage-free, antibiotic-free fried or grilled chicken breast, or Pimiento cheese stuffed, fried Portobello mushroom cap. Boxcar Pimiento Cheese, Peach Slaw, House Pickles, Spicy Mayo Fried Chicken Grilled Chicken Pimiento Stuffed Portobello Chicken \"Not So Waffle\" Bacon Jam, Maple Syrup, Pimiento Cheese, Tomato Fried Chicken Grilled Chicken Pimiento Stuffed Portobello Buffalo Blue Cheese Sauce, Tomato, Bibb Lettuce Fried Chicken Grilled Chicken Pimiento Stuffed Portobello Smash Burger Two smashed patties with melty American cheese, pickles, tomato, lettuce, onion and special sauce Jalapeno Cheddar Burger Two smashed patties with BBQ sauce, pickled jalapeños, melted cheddar and crispy fried onions Bacon Jam Swiss Burger Two smashed patties with homemade ranch, swiss cheese, bacon jam and white onions Build Your Own Sandwich Fried or Grilled chicken, Pimiento Cheese Stuffed Mushroom Cap or Smash Burger. Choose as many toppings as you'd like. Choice of Protein Fried Chicken Grilled Chicken Pimiento Stuffed Portobello Toppings Cheddar, Swiss, Pimiento, Kentucky Beer Cheese, Bibb Lettuce, Tomato, Housemade Pickles, Shallots, Peach Coleslaw, Pickled Green Tomato Pickled Fried Green Tomato Sauces Agave Buttermilk, Ranch, Blue Cheese, Bacon Jam, Spicy Mayo, Honey Mustard, Buffalo, Sweet Chili, Mayo, BBQ Nuggets 8 Piece or 12 Piece white Meat Nuggets with choice of dipping sauce. Tenders 3 or 4 Piece Chicken Tenders with choice of dipping sauce. Kids Meal Choice of: Chicken Tenders, 5 Piece Nuggets or Single Burger with Juice box and fruit cup Sub French fries Sub Small drink Salad Choice of Protein Fried Chicken Grilled Chicken Pimiento Stuffed Portobello House Mixed Greens, Shallots, Pickled Green Tomatoes, Candied Pecans Sides Handcut Fries Small / Large Handcut Sweet Potato Fries Fried Pickles with Ranch Fried Pickled Green Tomatoes Peach Coleslaw Desserts Macarons Exclusive flavors by Almond Dust Patisserie: Red Velvet S'More Fruity Pebbles Key Lime Catering Order Catering Online Cart () 0",
      "hash": "c0816740e969",
      "downloadedAt": "2026-01-18T17:02:01.148Z",
      "trimmedAt": "2026-01-18T17:12:56.545Z",
      "sizeReduction": "98.2%"
    },
    {
      "url": "http://www.boxcarbetty.com/menu",
      "text": "view our MENUs South Carolina Chicago Cart () 0",
      "hash": "f184adb408e2",
      "downloadedAt": "2026-01-18T17:02:00.502Z",
      "trimmedAt": "2026-01-18T17:12:56.549Z",
      "sizeReduction": "99.9%"
    }
  ],
  "sizeReduction": "99.0%"
}