{
  "venueId": "ChIJA7VaZbJl_ogRDZ8SIdth9V8",
  "venueName": "Bar Polari",
  "venueArea": "North Charleston",
  "website": "https://www.barpolari.com/",
  "scrapedAt": "2026-01-18T17:04:23.995Z",
  "trimmedAt": "2026-01-18T17:05:07.556Z",
  "pages": [
    {
      "url": "https://www.barpolari.com/",
      "text": "top of page BAR POLARI ABOUT US What do you know about Polari? Polari, a form of slang that evolved into a kind of secret language, was used by various marginalized groups and popularized by the gay community in the 19th century. With this idea in mind, owner Brent Compagni created Bar Polari as an intimate setting where you and your friends or lovers can kick back and kiki with us. Tucked away on Reynolds Ave., Bar Polari is a special hideaway for the LGBTQ+ community in Charleston. At Bar Polari, we're redefining what it means to be a gay bar. Our cozy indoor space provides a sensual and ambient atmosphere for friends, wanderers, and adventurers to share a drink and a story together as equals. While our community may be under attack, we can gather as our authentic selves to share our dreams, fears, and plans over our favorite libations. Fundamentally, Bar Polari is a space where you can come for a drink and a chat. We want to be exclusive in the best way possible. Everyone is invited, but only some are in the know. Now that you’re in the know, join us for refreshingly unique and carefully curated drinks. Our cocktail menu may have some unfamiliar ingredients. To get in the know, all you have to do is ask. If you’re not into making decisions or don’t know what you want, ask for a Bespoke cocktail. We’ll ask you a few questions and then make a specific cocktail just for you. We want you to feel welcome here. We invite you to pull up a chair or a stool and chat with us about your day or about last night… Bring your friends and your stories, and get in the know! HAND CRAFTED COCKTAILS COCKTAILS EVENT CALENDAR Event Title Event Time Event Date Change the event description to include your own content. Adjust the settings to customize the style. January 2026 SUN MON TUE WED THU FRI SAT OPEN EVERY DAY bottom of page",
      "hash": "44b29c74bf5c",
      "downloadedAt": "2026-01-18T16:58:09.995Z",
      "trimmedAt": "2026-01-18T17:05:07.437Z",
      "sizeReduction": "99.8%"
    },
    {
      "url": "https://www.barpolari.com/drinks",
      "text": "top of page COCKTAILS • $12 REEF Gin, Midori, Strega, Velvet Falernum, Lime TOBER Rum, Apple Jack, Creme de Mure, Lemon, Sprite NANTI Bourbon, Raspberry Shrub, Orange Bitters FORTUNI Fontbonne, Velvet Falernum, Pineapple, Lime ARVA Vodka, St. Germain, Lemon, Strawberry BIBI Tequila, Aperol, Grapefruit, Lime, Strawberry, Soda MOCKTAILS • $10 WALLOP Raspberry Shrub, Coconut Water, Peach Tea BIJOU Blueberry Syrup, Lemonade, Mint BEER/SELTZER/WINE/D9 BEER Michelob Ultra - $5 Narragansett - $5 Stone Buenavesa - $6 Stone Delicious IPA - $8 Wicked Weed Burst Blue Razz Sour- $8 Untitled Arts Italian Style Pilsner N/A beer - $7 Truly Wild Berry - $7 Sunboy Passionfruit - $8 SELTZER WINE Prisma Sauvignon Blanc - $10 Prisma Pinot Noir - $10 High Rise Blueberry - $10 DELTA 9 WINE Prisma Sauvignon Blanc - $10 Prisma Pinot Noir - $10 WINE Prisma Sauvignon Blanc - $10 Prisma Pinot Noir - $10 BEER Michelob Ultra - $5 Narragansett - $5 Stone Buenavesa - $6 Stone Delicious IPA - $8 Wicked Weed Burst Blue Razz Sour - $8 Untitled Arts Italian Style Pilsner N/A beer - $7 SELTZER Truly Wild Berry - $7 Sunboy Passionfruit - $8 WINE Prisma Sauvignon Blanc - $10 Prisma Pinot Noir - $10 DELTA-9 High Rise Blueberry - $10 FOOD GRILLED CHEESE - $8 PEPPERONI PIZZA - $8 ASSORTED SNACKS - $1.50 bottom of page",
      "hash": "d9c86c00f730",
      "downloadedAt": "2026-01-18T16:58:10.135Z",
      "trimmedAt": "2026-01-18T17:05:07.556Z",
      "sizeReduction": "99.9%"
    }
  ],
  "sizeReduction": "99.9%"
}