{
  "venueId": "ChIJ_Se-G1dj_ogRe0o3hdZbgG8",
  "venueName": "Rusty Bull Brewing Co. (North Charleston)",
  "venueArea": "North Charleston",
  "website": "https://rustybullbrewing.com/north-charleston/",
  "scrapedAt": "2026-01-18T17:04:28.051Z",
  "trimmedAt": "2026-01-18T17:11:14.362Z",
  "pages": [
    {
      "url": "https://rustybullbrewing.com/north-charleston/menu",
      "text": "× Checking IDs! Are You Over 21 Years Old? Yes No We've got fabulous food - from burgers and wings to great vegetarian options. A brewery with great food in North Charleston? With Axe Throwing!? Yup. Join us. North Charleston Restaurant Menu & Beer List Having a party? Host your next event at the coolest brewery in Charleston! We have great beer, approachable food with vegetarian options, outdoor patios, and axe throwing. What more could your party need? and let us know what you're looking for and we'll help you set it all up. Reach out © 2026 Rusty Bull Brewing Co. All rights reserved. . Website Design + Integrations by Taps + Tables",
      "hash": "0f4e3abf1b60",
      "downloadedAt": "2026-01-18T17:01:18.034Z",
      "trimmedAt": "2026-01-18T17:11:14.319Z",
      "sizeReduction": "97.8%"
    },
    {
      "url": "https://rustybullbrewing.com/north-charleston/beer-list",
      "text": "× Checking IDs! Are You Over 21 Years Old? Yes No We've got fabulous food - from burgers and wings to great vegetarian options. A brewery with great food in North Charleston? With Axe Throwing!? Yup. Join us. North Charleston Restaurant Menu & Beer List Having a party? Host your next event at the coolest brewery in Charleston! We have great beer, approachable food with vegetarian options, outdoor patios, and axe throwing. What more could your party need? and let us know what you're looking for and we'll help you set it all up. Reach out © 2026 Rusty Bull Brewing Co. All rights reserved. . Website Design + Integrations by Taps + Tables",
      "hash": "18971468258b",
      "downloadedAt": "2026-01-18T17:01:18.853Z",
      "trimmedAt": "2026-01-18T17:11:14.320Z",
      "sizeReduction": "97.9%"
    },
    {
      "url": "https://rustybullbrewing.com/north-charleston/",
      "text": "THE BEST RESTAURANT + BREWERY IN NORTH CHARLESTON. Bring a friend and share a great local beer in a relaxed environment. Eat an amazing burger. Wander next door for some activities (including axe throwing) if you're so inclined. #notKidding Restaurant Menu Beer List The North Charleston Restaurant + Production Brewery 3005 W. Montague Ave. Head up to our production brewery in North Charleston for a great beer! Grab a cold beer and some great food seven days a week at our production brewery near Park Circle. Connected to Chucktown Axe Throwing! The Main Event Shuck & Shield Oyster Roast Benefiting Defenders of Children & Sponsored by Tito's Handmade Vodka All Events Featured Beer Rusty Bull's Bearded Tiger Amber Ale Our amber ale has great mouthfeel, refreshing balance of ginger and hop, and caramel notes to round this beer out nicely. Beer List The Big Dish The Uncle Doug Tripple Decker Burger with Cheddar, Swiss, American cheeses. Complimented with Lettuce, Tomato, Pickle, and Rusty Bull Sauce. Give a thought to Uncle Doug as you enjoy this burger. Cheers!! Full Menu Pair a great beer with some local music All Brewery Events Events at our North Charleston Brewery Shuck & Shield Oyster Roast Sat 24 Benefiting Defenders of Children & Sponsored by Tito's Handmade Vodka Sat, Jan 24, 2026 Event Details January Special of the Month Thu 1 Benefiting Defenders For Children Thu, Jan 1, 2026 - Thu, Jan 1, 2026 Event Details Super Bowl Madden Tournament Thu 5 Could this be a bigger game than the Super Bowl? Thu, Feb 5, 2026 Event Details The Office Trivia Night Wed 11 For all you Dunder Mifflin-ites... Wed, Feb 11, 2026 Event Details We'll see you soon for a cold beer and great local music! from the Taprooms Scenes Join us to meet more of these 4-legged heroes & to support local law enforcement! Tickets are $10 off in the bio! Throwing it back next Saturday with the greatest age of Rock! Mark those calendars— free to play and prizes for the winners! We hope your New Year’s resolution was to eat more good food— our January Special of the Month is a mouthwatering blue cheese burger, inspired by the life-saving canines & efforts of @defendersforchildren ! Proceeds from the Special AND our Oyster Roast will go to benefit them! Come try this masterpiece and get your ticket for All-U-Can-Eat oysters! (Link in bio) In anticipation for Super Bowl 60, we’re breaking out the XBoxes for some Madden 26! Manifest your team’s victory and sign up for the tourney with the link in the bio! Happy New Year, Rusty Bull family! We’re open today from 4-6pm, serving to-go beer only! Come get your supplies for tonight 🍻🥳 Tickets are moving quick! Get yours for a discount while you can with the link in the bio! Merry Christmas! We’ll be giving our amazing staff Christmas Eve and Christmas off! We’ll be back on the 26th with regular hours 🎄🍻 How’s this for a Christmas gift? Our December Special of the Month, The Tachos, go to benefit Our Lady of Community Outreach! Get yours if you haven’t yet! Mark your calendars, folks. We’ve got another All-U-Can-Eat Oyster Roast coming up with even more oysters, cookers, and fun than ever before! Even better, all ticket and beer purchases help benefit Defenders For Children. So have some fun, do some good, and hit the link in the bio QUICK cause the tickets won’t last! Sponsored by Tito’s Handmade Vodka. Follow Rusty Bull Brewing Co. × Prev Next Join us to meet more of these 4-legged heroes & to support local law enforcement! Tickets are $10 off in the bio! North Charleston's Favorite Brewery! Follow Rusty Bull Brewing Co. × Prev Next Throwing it back next Saturday with the greatest age of Rock! Mark those calendars— free to play and prizes for the winners! North Charleston's Favorite Brewery! Follow Rusty Bull Brewing Co. × Prev Next We hope your New Year’s resolution was to eat more good food— our January Special of the Month is a mouthwatering blue cheese burger, inspired by the life-saving canines & efforts of @defendersforchildren ! Proceeds from the Special AND our Oyster Roast will go to benefit them! Come try this masterpiece and get your ticket for All-U-Can-Eat oysters! (Link in bio) North Charleston's Favorite Brewery! Follow Rusty Bull Brewing Co. × Prev Next In anticipation for Super Bowl 60, we’re breaking out the XBoxes for some Madden 26! Manifest your team’s victory and sign up for the tourney with the link in the bio! North Charleston's Favorite Brewery! Follow Rusty Bull Brewing Co. × Prev Next Happy New Year, Rusty Bull family! We’re open today from 4-6pm, serving to-go beer only! Come get your supplies for tonight 🍻🥳 North Charleston's Favorite Brewery! Follow Rusty Bull Brewing Co. × Prev Next Tickets are moving quick! Get yours for a discount while you can with the link in the bio! North Charleston's Favorite Brewery! Follow Rusty Bull Brewing Co. × Prev Next Merry Christmas! We’ll be giving our amazing staff Christmas Eve and Christmas off! We’ll be back on the 26th with regular hours 🎄🍻 North Charleston's Favorite Brewery! Follow Rusty Bull Brewing Co. × Prev Next How’s this for a Christmas gift? Our December Special of the Month, The Tachos, go to benefit Our Lady of Community Outreach! Get yours if you haven’t yet! North Charleston's Favorite Brewery! Follow Rusty Bull Brewing Co. × Prev Next Mark your calendars, folks. We’ve got another All-U-Can-Eat Oyster Roast coming up with even more oysters, cookers, and fun than ever before! Even better, all ticket and beer purchases help benefit Defenders For Children. So have some fun, do some good, and hit the link in the bio QUICK cause the tickets won’t last! Sponsored by Tito’s Handmade Vodka. North Charleston's Favorite Brewery! © 2026 Rusty Bull Brewing Co. All rights reserved. . Website Design + Integrations by Taps + Tables × Checking IDs! Are You Over 21 Years Old? Yes No",
      "hash": "5e008ca1d462",
      "downloadedAt": "2026-01-18T17:00:24.475Z",
      "trimmedAt": "2026-01-18T17:11:14.338Z",
      "sizeReduction": "92.9%"
    },
    {
      "url": "https://rustybullbrewing.com/north-charleston/beers",
      "text": "× Checking IDs! Are You Over 21 Years Old? Yes No The Beers of Rusty Bull This is an extensive list of all the beers we've been brewing here in Charleston. Some are available only where they were brewed. Check out our tap lists for each location to see what they have on tap today! All Beers Standards Seasonals The Beer Dance Naked ABV: 6.0% IBU: 70 SRM: 5 OG: 1.060 FG: 1.018 Dance Naked India Pale Ale Citra, El Dorado Two Row, Vienna Hops: Grains: More Info Tumbling Monk ABV: 5.5% IBU: 27 SRM: 39 OG: 1.065 FG: 1.023 Tumbling Monk Porter Northern Brewer Vienna, Chocolate, Black, Roasted Barley, Mild Malt, Caramel 120 Hops: Grains: More Info Livin' Easy ABV: 5.0% IBU: 15 SRM: 4 OG: 1.046 FG: 1.013 Livin' Easy Light Lager Hallertau Pilsner, Vienna Grilled veggies and fresh peaches Hops: Grains: Food Pairing: More Info Berry Stomp ABV: 5.8% IBU: 15 SRM: 85 OG: 2.000 FG: 2.000 Berry Stomp Wheat Hallertau Two Row, White Wheat Blueberries, Blackberries, Raspberries Summer Salads Hops: Grains: Other Ingredients: Food Pairing: More Info Free the Trippel ABV: 9.5% IBU: 35 SRM: 9 OG: 1.074 FG: 1.002 Free the Trippel Belgian trippel Saaz Avangard Pilsen, GoldSwaen Belge Coriander Tenderloin steak and donor fries Hops: Grains: Other Ingredients: Food Pairing: More Info Juice Juice ABV: 6.7% SRM: 3 OG: 1.068 FG: 1.017 Juice Juice Hazy IPA Citra, El Dorado, Summit Vienna, Maris Otter Crisp 19, 2 Row, Carapils, Flaked Oat Beet Salad and Lemon Cheesecake Hops: Grains: Food Pairing: More Info Railyard ABV: 4.8% IBU: 15 SRM: 18 OG: 1.050 FG: 1.014 Railyard brown ale Azacca 2 Row, Maris Otter Crisp 19, Crystal Rye, Crystal 60, Vienna Pineapple Waffles and chocolate moose Hops: Grains: Other Ingredients: Food Pairing: More Info TripHopAnonymous ABV: 8.2% IBU: 130 SRM: 5 OG: 1.056 FG: 0.994 TripHopAnonymous double IPA Citra, Azacca, Mosaic Simpson's Finest Golden Promise, Simpson's Malted Rye, Simpson's Finest Pale Ale Maris Otter, Simpson's Crystal Light Fried beef tenderloin and cobb salad Hops: Grains: Food Pairing: More Info Darth Marwhal ABV: 6.2% IBU: 20 SRM: 39 OG: 1.065 FG: 1.018 Darth Marwhal porter Willamette Golden Promise, Crisp Munich, Patagonia Perla Negra, Patagoinia Dark Chocolate, Weyerman Carahell, Weyerman Chocolate Rye Raspberry Savory bacon treats and any dessert Hops: Grains: Other Ingredients: Food Pairing: More Info BellyItcher ABV: 4.8% IBU: 1 SRM: 6 OG: 1.050 FG: 1.014 BellyItcher Blonde Ale Willamette 2 Row, White Wheat, Simpson's Crystal Light Hops: Grains: More Info Cidah! ABV: 4.5% IBU: 1 SRM: 4 OG: 1.045 FG: 1.000 Cidah! Hard Cider Cascade Dextrose Honey Mustard Wings and Soft Pretzels with Beer Cheese Hops: Grains: Food Pairing: More Info Saltwater Cerveza ABV: 4.5% SRM: 4 Saltwater Cerveza Mexican Lager Motueka 2-row, Maize Taco Tuesdays Hops: Grains: Food Pairing: More Info More This Way More That Way © 2026 Rusty Bull Brewing Co. All rights reserved. . Website Design + Integrations by Taps + Tables",
      "hash": "a78b55c26608",
      "downloadedAt": "2026-01-18T17:01:17.207Z",
      "trimmedAt": "2026-01-18T17:11:14.354Z",
      "sizeReduction": "93.9%"
    },
    {
      "url": "https://rustybullbrewing.com/north-charleston/private-events",
      "text": "× Checking IDs! Are You Over 21 Years Old? Yes No Host Your Next Event at Rusty Bull No matter how large or small your event, our spacious taprooms and outdoor areas can accommodate groups from 10 to over 100! Large Parties (with Ax Throwing) in North Charleston Rusty Bull Brewing in North Charleston is neighbors with (formerly Chucktown Axe), Charleston’s premier indoor gaming complex where you can unleash the fun with ax throwing, mini golf, floor is lava, and so much more. Download the flier to learn more about bringing your group or hosting a private event at the gameroom and brewery! Chucktown Activities 8 Lanes of Ax Throwing • Plate Smashing Connect 4 Basketball • Mini-Golf • Light Up ‘Floor is Lava’ PLUS Foosball, Punch Box, Darts & other arcade games! North Charleston Info Book Your Date! Fill out the form below to give us some information about your event and we'll be in touch as quickly as we can! First Name: Last Name: Email: Phone: About Your Event (include number of people): Spam Check: What is 5 + 2? Send Your Message! Join Us for a Cold One! North Charleston: 3005 W Montague Ave © 2026 Rusty Bull Brewing Co. All rights reserved. . Website Design + Integrations by Taps + Tables",
      "hash": "ab681b6a6d5a",
      "downloadedAt": "2026-01-18T17:00:24.796Z",
      "trimmedAt": "2026-01-18T17:11:14.357Z",
      "sizeReduction": "95.9%"
    },
    {
      "url": "https://rustybullbrewing.com/north-charleston/live-music-events",
      "text": "× Checking IDs! Are You Over 21 Years Old? Yes No Trivia + Great Events = Fun. Want to do more than just drink beer? Join us for one of these great events! North Charleston Events Live music, trivia nights, craft beer and axe throwing! There's always something to do at our North Charleston taproom. January February March Shuck & Shield Oyster Roast Sat 24 Benefiting Defenders of Children & Sponsored by Tito's Handmade Vodka Sat, Jan 24, 2026 Event Details January Special of the Month Thu 1 Benefiting Defenders For Children Thu, Jan 1, 2026 - Thu, Jan 1, 2026 Event Details Super Bowl Madden Tournament Thu 5 Could this be a bigger game than the Super Bowl? Thu, Feb 5, 2026 Event Details The Office Trivia Night Wed 11 For all you Dunder Mifflin-ites... Wed, Feb 11, 2026 Event Details No further events this month. Check next month! Beer. Trivia. Fun. When you find yourself out in North Charleston near the airport or the PAC, you can always find a cold glass of Charleston-born beer nearby. And if you want to find something else to do ... you've come to the right place! Check out our calendar of events featuring beer releases, trivia nights, live music, the occasional comedian and yoga class! © 2026 Rusty Bull Brewing Co. All rights reserved. . Website Design + Integrations by Taps + Tables",
      "hash": "f50480d89ed0",
      "downloadedAt": "2026-01-18T17:00:40.244Z",
      "trimmedAt": "2026-01-18T17:11:14.362Z",
      "sizeReduction": "96.1%"
    }
  ],
  "sizeReduction": "95.0%"
}