{
  "venueId": "ChIJPc3odmxj_ogRMyxZUrj4HU4",
  "venueName": "Cane Pazzo",
  "venueArea": "North Charleston",
  "website": "http://canepazzorestaurant.com/",
  "scrapedAt": "2026-01-18T17:04:25.921Z",
  "trimmedAt": "2026-01-18T17:07:17.184Z",
  "pages": [
    {
      "url": "http://canepazzorestaurant.com/#",
      "text": "Welcome to Cane Pazzo Cane Pazzo is a neighborhood osteria l ed by Chef/Owner Mark Bolchoz. The menu tells the story of his Southern upbringing combined with his love of Italian cuisine and cooking. From handmade pastas to the wood-fired small plates, seafood, and shareable dishes, Cane Pazzo will be reminiscent of the best, old-school Italian style with Lowcountry influence. Classic Italian flavors by way of Lowcountry ingredients Latest Articles The 10 Restaurants That Defined Charleston Dining in 2025 Read Article New & Notable: Cane Pazzo Delivers A Flame-Kissed Italian Menu And Downtown Energy In Hanahan Read Article The Food Section: Scenes from Italian restaurants Read Article Explore Book A Table Book Now Join our Email List \"\" indicates required fields * Comments This field is for validation purposes and should be left unchanged. Email *",
      "hash": "6a2248504173",
      "downloadedAt": "2026-01-18T16:58:17.521Z",
      "trimmedAt": "2026-01-18T17:07:17.153Z",
      "sizeReduction": "98.5%"
    },
    {
      "url": "http://canepazzorestaurant.com/",
      "text": "Welcome to Cane Pazzo Cane Pazzo is a neighborhood osteria l ed by Chef/Owner Mark Bolchoz. The menu tells the story of his Southern upbringing combined with his love of Italian cuisine and cooking. From handmade pastas to the wood-fired small plates, seafood, and shareable dishes, Cane Pazzo will be reminiscent of the best, old-school Italian style with Lowcountry influence. Classic Italian flavors by way of Lowcountry ingredients Latest Articles The 10 Restaurants That Defined Charleston Dining in 2025 Read Article New & Notable: Cane Pazzo Delivers A Flame-Kissed Italian Menu And Downtown Energy In Hanahan Read Article The Food Section: Scenes from Italian restaurants Read Article Explore Book A Table Book Now Join our Email List \"\" indicates required fields * Comments This field is for validation purposes and should be left unchanged. Email *",
      "hash": "7e59dd54ea60",
      "downloadedAt": "2026-01-18T16:58:17.432Z",
      "trimmedAt": "2026-01-18T17:07:17.159Z",
      "sizeReduction": "98.5%"
    },
    {
      "url": "https://canepazzorestaurant.com/wine-list/",
      "text": "Wine List Spumante Prosecco Rose Ca Furlan, Brut ‘Cuvée Mariana’ 2023, Veneto 44 Prosecco Superiore Col Vetoraz, 2023, Veneto 67 Lambrusco Cleto Chiarli, NV, Emilia Romagna 45 Lambrusco Alfredo Bertolani, NV, Emilia Romagna 44 Pet Nat Bianco Folicello, 2022, Emilia Romagna 48 Bianco+Rosato Pinot Grigio Livio Fellaga, 2023 Fruili-Venezia Guilia 86 Kerner Abbazia di Novacella, 2024, Alto Adige 60 Soave Suavia, 2023, Veneto 38 Arneis Angelo Negro, \"Serra Lupini,” 2023, Piedmont 52 Greco Cantina del Taburno, 2023, Campagna 48 Etna Rosato Cottanera, 2024, Sicily 48 Etna Bianco Superiore Barone di Villagrande, 2023, Sicily 64 Etna Bianco Graci, Sicily, 2023 96 Rosso Amarone di Valpolicella La Giaretta, 2021, Veneto 94 Chilled Dolcetto G.D. Vajra, 2024, Piedmont 51 Barbera d’Alba Superiore Giacomo Fenocchio, 2023, Piedmont 66 Barbera d’Alba Superiore Castello Di Nieve, 2021, Piedmont 62 Nebbiolo Vietti ‘Perbacco,’ 2022, Piedmont 83 Nebbiolo Produttori del Barbaresco, 2023, Piedmont 90 Barbaresco Luigi Giordano, Barbaresco ‘Cavanna,’ Piedmont 86 Barbaresco Grasso Fratelli, “Vallegrande,” 2016 Piedmont 160 Barolo Oddero, 2021, Piedmont 110 Barolo Bruna Grimaldi “Camilla,” 2021 Piedmont 140 Sangiovese La Spinetta, ‘Il Nero di Casanova’ 2020, Tuscany 48 Chianti Classico Pruneto 2021 Tuscany 70 Chianti Classico Riserva Rocca di Castagnoli, ‘Poggio a Frati,’ 2020, Tuscany 90 Rosso Di Montalcino Ciacci Piccolomini d'Aragona, 2023, Tuscany 68 Brunello di Montalcino Ciacci Piccolomini d'Aragona, 2020, Tuscany 110 Brunello di Montalcino Fanti 2020, Tuscany 144 Supertuscan Fabio Motta Bolgheri ‘Pievi,’ 2022, Tuscany 66 Supertuscan Uccelliera, Rapace 2022, Tuscany 112 Aglianico Cantine Antonio Caggiano, ‘Tauri’ 2022, Campania 66 Etna Rosso Torre Morra ‘Cauru’ 2022, Sicily 51 Book A Table Book Now Join our Email List \"\" indicates required fields * Instagram This field is for validation purposes and should be left unchanged. Email *",
      "hash": "8f702253a1fa",
      "downloadedAt": "2026-01-18T16:58:18.921Z",
      "trimmedAt": "2026-01-18T17:07:17.169Z",
      "sizeReduction": "96.6%"
    },
    {
      "url": "https://canepazzorestaurant.com/dinner-menu/",
      "text": "Dinner Menu tonight's features 1/17 – roasted cauliflower, sage, garlic, red wine jus Keegan Fillian Bone In Pork Chop – rutabaga, fennel, shallot, herb breadcrumb, provolone piccante Root Vegetable Sformato daily bread wood-fired sourdough, parmesan butter, black pepper, chive 8 marinated olives citrus, bay leaf, corto evoo 7 italian salad ham, field peas, pickled pepper, olives, provolone, oregano vinaigrette 13 prosciutto + cheese pimento bianco, prosciutto di parma, gnocco fritto 19 tuna conserva toast arugula, orange, capers, radish, garlic aioli 17 crispy oysters cherry pepper \"remoulade\", lemon 18 meatballs beef + pork, spicy tomato, polenta, parmesan 13 crispy mozzarella fresh mozzarella, breadcrumbs, tomato 12 gramigna nero Tarvin shrimp, garlic, calabrian + lemon butter, herb breadcrumb 26 lumache beef bolognese, tomato, basil, parmesan 27 bucatini amatriciana pancetta, red wine vinegar, tomato, basil, pecorino 25 torchiette braised rabbit, tomato, carrot, dijon, pecorino 27 cavatelli verde cauliflower ragu, celery, cream, parmigiano, crispy garlic 26 tortellini roasted chicken, parmesan brodo, parmigiano, black pepper 28 triangoli smoked fish, potato, onion stufado, tarragon, chive, espelette 27 risotto \"milanese\", saffron, parmesan, pork ragu, chive, garlic crumble 29 market fish smoked calabrian mayo, ritz cracker. crust, lemon MKT 16 oz dry-aged KC strip* garlic compound butter gorgonzola dolce + aged balsamic + $6 truffle butter + $10 65 cabbage salsa verde, pecorino, almond 8 broccoli anchovy + lemon vinaigrette, crispy garlic 9 butterbeans bacon, parmesan, roasted garlic, chive 7 mushrooms black garlic, breadcrumb, fennel pollen 8 carrots whipped goat cheese, espelette, pistachio, pickled golden raisin 9 Book A Table Book Now Join our Email List \"\" indicates required fields * X/Twitter This field is for validation purposes and should be left unchanged. Email *",
      "hash": "9f3bb1398114",
      "downloadedAt": "2026-01-18T16:58:18.112Z",
      "trimmedAt": "2026-01-18T17:07:17.177Z",
      "sizeReduction": "96.6%"
    },
    {
      "url": "https://canepazzorestaurant.com/kids-menu/",
      "text": "Kid’s Menu red pasta 10 butter pasta 10 chicken + potato 12 pasta + meatball 12 pasta + shrimp 12 Book A Table Book Now Join our Email List \"\" indicates required fields * LinkedIn This field is for validation purposes and should be left unchanged. Email *",
      "hash": "dbebb1634ef1",
      "downloadedAt": "2026-01-18T16:58:19.582Z",
      "trimmedAt": "2026-01-18T17:07:17.184Z",
      "sizeReduction": "99.5%"
    }
  ],
  "sizeReduction": "97.9%"
}