{
  "venueId": "ChIJHTkqihN8_ogRmeLA5cQAlFs",
  "venueName": "Captain D's",
  "venueArea": "West Ashley",
  "website": "https://locations.captainds.com/ll/US/SC/Charleston/1936-Savannah-Hwy",
  "scrapedAt": "2026-01-18T17:04:24.816Z",
  "trimmedAt": "2026-01-18T17:05:31.284Z",
  "pages": [
    {
      "url": "https://locations.captainds.com/site-map/us/sc/",
      "text": "Captain D's: All Locations in South Carolina All locations > US > SC Aiken Anderson Cayce Charleston Columbia Florence Goose Creek Greenwood Lake City Lexington Lugoff Moncks Corner Newberry North Augusta Orangeburg Summerville Sumter Walterboro © 2024 Captain D's, LLC Terms & Conditions Privacy Policy Accessibility",
      "hash": "06688ad62b34",
      "downloadedAt": "2026-01-18T17:02:05.708Z",
      "trimmedAt": "2026-01-18T17:05:31.137Z",
      "sizeReduction": "99.5%"
    },
    {
      "url": "https://locations.captainds.com/ll/us/sc/charleston/4008-rivers-ave/",
      "text": "Charleston View Menu Order Now Rewards Directions All locations > US > SC > Charleston > 4008 Rivers Avenue General Information 4008 Rivers Avenue Charleston, SC 29405 +1 843-554-6195 Hours Of Operation Explore our menu inCharleston, SC Exclusive Online Deals What's New Appetizers and Add-Ons Beverages Fish Favorites Captain's Classics Chicken Meals Grilled Meals Family Meals Combos Kids Meals Desserts Sides 1 Piece Fish and Fries One piece of our batter dipped fish fillet served with one side and hushpuppies. Order Now 4 Pc Fish Meal Our famous 4 piece batter dipped fish fillet meals served with two sides and Hush Puppies. Order Now Fish & Chicken Meal Two Batter dipped fish fillets and two crispy breaded chicken tenders, served with your choice of two sides, and two hush puppies. Order Now 2 Pc Fish Dinner Two-piece batter dipped fish fillet, golden on the outside tender on the inside. Served with your choice of side. Order Now Giant Fish Sandwich Two Batter Dipped Fish fillets on a toasty bun with tangy tartar sauce and shredded lettuce. Order Now Two 3 Piece Fish Meals Two of our three-piece batter dipped fish fillet meals, golden on the outside tender on the inside. Served with your choice of two sides and hush puppies each. Order Now 2 Piece Fish and Popcorn Shrimp Meal Two of our famous batter dipped fish fillets, golden on the outside tender on the inside and golden popcorn shrimp. Served with your choice of two sides and hush puppies. Order Now 10 Piece Fish Family Meal Feed the whole family with ten of our Famous Batter Dipped Fish. Complete your feast with eight hush puppies and your choice of two family-style sides. Order Now Chicken, Waffle & Fries Two Hand-Breaded Chicken tenders served with an artisan waffle and drizzled in syrup. Order Now Chicken, Shrimp, Waffle & Fries One Hand-Breaded Chicken tender, five Butterfly Shrimp, and one artisan waffle. Served with syrup and your choice of classic side. Order Now Big Chicken & Waffles Platter Four Hand-Breaded Chicken tenders and two artisan waffles, drizzled in syrup. Served with your choice of classic side. Order Now Ultimate Seafood Platter Two Batter Dipped Fish fillets, five Butterfly Shrimp, two Stuffed Crab Shells, and Popcorn Shrimp. Served with your choice of two classic sides and hush puppies. Order Now Clam Strips A quarter-pound of our fan-favorite crispy breaded Clam Strips, perfect for dipping in D’s Dippin Sauce! Order Now Clam Strips & Butterfly Shrimp A quarter-pound of our fan-favorite breaded Clam Strips and four golden Butterfly Shrimp! Order Now Chocolate Cake A single serving of rich Chocolate Cake, topped with rosettes of milk chocolate frosting. Order Now Mozzarella Sticks 8 Breaded mozzarella sticks Order Now Jalapeno Poppers 8 Golden fried jalapeños and cheese Order Now Clam Strips A quarter-pound of our fan-favorite crispy breaded Clam Strips, perfect for dipping in D’s Dippin Sauce. Order Now 5 Piece Butterfly Shrimp Customize your meal by adding 5 breaded butterfly shrimp to any meal. Order Now 10 Piece Butterfly Shrimp Customize your meal by adding 10 breaded butterfly shrimp to any meal. Order Now 15 Piece Butterfly Shrimp Customize your meal by adding 15 breaded butterfly shrimp to any meal. Order Now 1 Piece Batter Dipped Fish Add one piece of our famous batter dipped fish to any meal. Order Now 2 Piece Batter Dipped Fish Add two pieces of our famous batter dipped fish to any meal. Order Now 6 Hush Puppies 6 of our famous golden brown hush puppies are made from a batter that’s freshly prepared and hand scooped with care. They are perfectly paired with our seafood meals. Order Now Add 2 Crab Shells Add two pieces of our crab shells to any meal. Order Now Add-On 2 Pc Chicken Two crispy hand-breaded chicken tenders Order Now Popcorn Shrimp Add some bite-sized, D'Lish Popcorn Shrimp to any meal. Perfect with D's Dippin Sauce. Order Now Clam Strips A quarter-pound of our fan-favorite crispy breaded Clam Strips, perfect for dipping in D’s Dippin Sauce! Order Now Clam Strips & Butterfly Shrimp Two fan-favorites in one! Add our breaded Clam Strips and crispy Butterfly Shrimp to any meal. Order Now Captain's Ultimate Appetizer Try a little bit of everything—Clam Strips, Butterfly Shrimp, and Popcorn Shrimp all in one D'Lish appetizer. Sharing optional. Order Now Soft Drink Choice of Sweet Tea or Unsweet Tea, Pepsi, Diet Pepsi, Starry, Mountain Dew, Dr. Pepper, Diet Dr. Pepper, and Lemonade Order Now Gallon of Tea A gallon of D's famous tea. Order Now Gallon Lemonade A gallon of Tropicana Lemonade Order Now 2 Piece Batter Dipped Fish Meal Two of our famous batter dipped fish fillets, golden on the outside tender on the inside. Served with your choice of two sides and hush puppies. Order Now 3 Piece Batter Dipped Fish Meal Three of our famous batter dipped fish fillets, golden on the outside tender on the inside. Served with your choice of two sides and hush puppies. Order Now 4 Piece Batter Dipped Fish Meal Four of our famous batter dipped fish fillets, golden on the outside tender on the inside. Served with your choice of two sides and hush puppies. Order Now 2 Piece Catfish Meal Tender catfish, hand-breaded in our signature southern-style breading and served with your choice of two sides and hush puppies. Order Now 3 Piece Catfish Meal Hand-breaded catfish fillets served with your choice of two sides and hush puppies. Order Now 4 Piece Catfish Meal Hand-breaded catfish fillets served with your choice of two sides and hush puppies. Order Now Southern Style Whitefish A large fillet of white fish hand breaded with seasoned yellow cornmeal breading. Served with your choice of two sides and hush puppies. Order Now Deluxe Seafood Platter For those seeking seafood variety, we combine two fish fillets, six shrimp, two seafood stuffed crab shells with your choice of two sides and hush puppies. Order Now 2 Piece Fish & 6 Piece Butterfly Shrimp Meal Two batter dipped fish fillets and six butterfly shrimp served with your choice of two sides and hush puppies. Order Now 2 Piece Fish & 2 Piece Chicken Meal Two pieces of batter dipped fish and two chicken tenders, served with your choice of two sides and hush puppies. Order Now Supreme Sampler Meal Two pieces of our Famous Batter Dipped Fish, two Chicken Tenders, and six Butterfly Shrimp. Served with your choice of two sides and hush puppies. Order Now 15 Piece Butterfly Shrimp Meal Fifteen of our crispy Butterfly Shrimp served with your choice of two sides and two Hush Puppies Order Now 20 Piece Butterfly Shrimp Meal Twenty of our crispy Butterfly Shrimp served with your choice of two sides and two Hush Puppies. Order Now Popcorn Shrimp & Fish Meal Two Batter Dipped Fish fillets served with a hearty helping of Popcorn Shrimp, hush puppies, and your choice of two classic sides. Order Now Wild Alaska Salmon Meal Wild Alaska Salmon seared to perfection and served on a bed of rice with your choice of two sides and a breadstick. Order Now Grilled White Fish Meal A fillet of our tender and flaky white fish, seasoned, served on a bed of rice with your choice of two sides and a breadstick. Order Now Grilled Whitefish and Shrimp Meal A fillet of our delicious grilled white fish served alongside six fire-grilled shrimp. Served on a bed of rice with your choice of two sides and a breadstick Order Now 10 Piece Fish Family Meal Feed the whole family with ten of our Famous Batter Dipped Fish. Complete your feast with eight hush puppies and your choice of two family-style sides. Order Now 14 Piece Chicken Family Meal Fourteen of our breaded chicken tenders with eight hush puppies and your choice of two family-style sides. Order Now Seafood Feast Twelve pieces of our famous batter dipped fish, twelve crispy butterfly shrimp, three seafood stuffed crab shells, twelve hush puppies and your choice of two family-style sides. Order Now Family Sampler Meal There's something for everyone in the Family Sampler! Get ten Batter Dipped Fish fillets, twelve Butterfly Shrimp, six Hand-Breaded Chicken tenders, eight hush puppies, and two Family Style Sides. Order Now Giant Fish Sandwich Two batter dipped fish fillets on a toasty bun with tangy tartar sauce, and shredded lettuce Order Now Giant Fish Sandwich Combo Two Batter Dipped Fish Fillets on a toasty bun with tangy tartar sauce and shredded lettuce. Served with choice of a side and drink. Order Now Big Chicken Sandwich Three Hand-Breaded Chicken Tenders on a toasty bun with mayo and pickles. Order Now Big Chicken Sandwich Combo Three Hand-Breaded Chicken Tenders on a toasty bun with mayo and pickles served with your choice of side and a refreshing beverage. Order Now 2 Pc Fish & Fries Combo Two Batter Dipped Fish fillets served with your choice of one classic side and a refreshing beverage. Order Now Kid's Batter Dipped Fish Meal One piece of our famous batter dipped fish served with a choice of one side, hush puppies, drink. Order Now Kid's Popcorn Shrimp Meal A plentiful portion of tender, breaded bite-sized shrimp with a choice of one side, hush puppies, drink. Order Now Kid's Chicken Tenders Meal Two seasoned and breaded chicken tenders, with a choice of one side, hush puppies, drink. Order Now Classic Cheesecake Creamy California cheesecake baked on a golden graham cracker crumb. Made exclusively by The Cheesecake Factory Bakery. Order Now Funnel Cake Stix A twist on a popular state fair favorite in an easy-to-share serving, these sweet and delicious funnel cake stix are the perfect finish to any Captain D's meal. Order Now French Fries Crispy cut french fries. Order Now Coleslaw Fresh cabbage combined with Captain D’s own signature sweet slaw dressing with a delicate blend of sweet and savory flavors. Order Now Green Beans Green beans slow cooked with country ham and served hot Order Now Broccoli Tender broccoli florets steamed to order. Order Now Mac & Cheese Classic home-style macaroni and cheese prepared with delicate Cheddar cheese sauce and tender noodles. Order Now Fried Okra A simple, southern classic; slices of okra in southern-style breading fried to a golden brown. Order Now Corn on the Cob Simply sweet corn on the cob steamed and served hot. Order Now Baked Potato A generous sized potato cooked to fluffy perfection and then served with butter and sour cream. Order Now Loaded Baked Potato A perfectly baked potato, loaded with cheese and bacon. Order Now The Captain is Callin’ Gift Cards Give the gift of D’s. Be a seafood hero and give your family what they really crave… premium seafood. Get A Gift Card Earn Rewards! Download the My Captain D’s app and receive 1 point for every dollar you spend. Rack up points and Redeem points for your favorite items at D’s including fan favorites like Mozzarella sticks and Giant Fish Sandwiches. Points only valid for online/in-app orders. Get the App! About Us Captain D's, Charleston At our Charleston, SC location, we are part of a historic seafood tradition. Captain D's Seafood Restaurant first opened its doors back on August 15, 1969. A lot has changed since then, but our commitment to serving freshly prepared seafood at a great value has been our core mission from the beginning. Known originally as Mr. D's Seafood and Hamburgers, Captain D's was opened in Donelson, Tennessee. From the very start, we set out to provide quality seafood at reasonable prices, a concept that was revolutionary at the time. Start Earning with Captain D's Rewards Get Points with every App order. Redeem towards menu items. Exclusive members-only surprises and deals. More points means more rewards. Download the My Captain D’s app and receive 1 point for every dollar you spend. Rack up points and Redeem points for your favorite items at D’s including fan favorites like Mozzarella sticks and Giant Fish Sandwiches. Points only valid for online/in-app orders. GET THE APP TODAY Frequently Asked Questions Nearby Locations Charleston 5.68 mi 1936 Savannah Highway Charleston, SC 29407 +1 843-571-2308 View Location Directions Charleston 7.64 mi 5130 Ashley Phosphate Road Charleston, SC 29418 +1 843-552-1107 View Location Directions Goose Creek 9.69 mi 111 N. Goose Creek Blvd. Goose Creek, SC 29445 +1 843-553-2540 View Location Directions © 2024 Captain D's, LLC Terms & Conditions Privacy Policy Accessibility",
      "hash": "0e0ba824a7ed",
      "downloadedAt": "2026-01-18T17:02:07.254Z",
      "trimmedAt": "2026-01-18T17:05:31.171Z",
      "sizeReduction": "94.9%"
    },
    {
      "url": "https://locations.captainds.com/site-map/us/sc/charleston/",
      "text": "Captain D's: All Locations in Charleston, South Carolina All locations > US > SC > Charleston Charleston , 5130 Ashley Phosphate Road Charleston SC 29418 +1 843-552-1107 View Location Directions Charleston , 1936 Savannah Highway Charleston SC 29407 +1 843-571-2308 View Location Directions Charleston , 4008 Rivers Avenue Charleston SC 29405 +1 843-554-6195 View Location Directions © 2024 Captain D's, LLC Terms & Conditions Privacy Policy Accessibility",
      "hash": "1cec55e7c10a",
      "downloadedAt": "2026-01-18T17:02:06.370Z",
      "trimmedAt": "2026-01-18T17:05:31.179Z",
      "sizeReduction": "99.5%"
    },
    {
      "url": "https://locations.captainds.com/site-map/",
      "text": "Captain D's: All Locations All locations Canada United States © 2024 Captain D's, LLC Terms & Conditions Privacy Policy Accessibility",
      "hash": "2093403cf886",
      "downloadedAt": "2026-01-18T17:02:05.138Z",
      "trimmedAt": "2026-01-18T17:05:31.181Z",
      "sizeReduction": "99.8%"
    },
    {
      "url": "https://locations.captainds.com/ll/US/SC/Charleston/1936-Savannah-Hwy",
      "text": "Charleston View Menu Order Now Rewards Directions All locations > US > SC > Charleston > 1936 Savannah Highway General Information 1936 Savannah Highway Charleston, SC 29407 +1 843-571-2308 Hours Of Operation Explore our menu inCharleston, SC Exclusive Online Deals What's New Appetizers and Add-Ons Beverages Fish Favorites Captain's Classics Chicken Meals Grilled Meals Family Meals Combos Kids Meals Desserts Sides 1 Piece Fish and Fries One piece of our batter dipped fish fillet served with one side and hushpuppies. Order Now 4 Pc Fish Meal Our famous 4 piece batter dipped fish fillet meals served with two sides and Hush Puppies. Order Now Fish & Chicken Meal Two Batter dipped fish fillets and two crispy breaded chicken tenders, served with your choice of two sides, and two hush puppies. Order Now 2 Pc Fish Dinner Two-piece batter dipped fish fillet, golden on the outside tender on the inside. Served with your choice of side. Order Now Giant Fish Sandwich Two Batter Dipped Fish fillets on a toasty bun with tangy tartar sauce and shredded lettuce. Order Now Two 3 Piece Fish Meals Two of our three-piece batter dipped fish fillet meals, golden on the outside tender on the inside. Served with your choice of two sides and hush puppies each. Order Now 2 Piece Fish and Popcorn Shrimp Meal Two of our famous batter dipped fish fillets, golden on the outside tender on the inside and golden popcorn shrimp. Served with your choice of two sides and hush puppies. Order Now 10 Piece Fish Family Meal Feed the whole family with ten of our Famous Batter Dipped Fish. Complete your feast with eight hush puppies and your choice of two family-style sides. Order Now Chicken, Waffle & Fries Two Hand-Breaded Chicken tenders served with an artisan waffle and drizzled in syrup. Order Now Chicken, Shrimp, Waffle & Fries One Hand-Breaded Chicken tender, five Butterfly Shrimp, and one artisan waffle. Served with syrup and your choice of classic side. Order Now Big Chicken & Waffles Platter Four Hand-Breaded Chicken tenders and two artisan waffles, drizzled in syrup. Served with your choice of classic side. Order Now Ultimate Seafood Platter Two Batter Dipped Fish fillets, five Butterfly Shrimp, two Stuffed Crab Shells, and Popcorn Shrimp. Served with your choice of two classic sides and hush puppies. Order Now Clam Strips A quarter-pound of our fan-favorite crispy breaded Clam Strips, perfect for dipping in D’s Dippin Sauce! Order Now Clam Strips & Butterfly Shrimp A quarter-pound of our fan-favorite breaded Clam Strips and four golden Butterfly Shrimp! Order Now Chocolate Cake A single serving of rich Chocolate Cake, topped with rosettes of milk chocolate frosting. Order Now Mozzarella Sticks 8 Breaded mozzarella sticks Order Now Jalapeno Poppers 8 Golden fried jalapeños and cheese Order Now Clam Strips A quarter-pound of our fan-favorite crispy breaded Clam Strips, perfect for dipping in D’s Dippin Sauce. Order Now 5 Piece Butterfly Shrimp Customize your meal by adding 5 breaded butterfly shrimp to any meal. Order Now 10 Piece Butterfly Shrimp Customize your meal by adding 10 breaded butterfly shrimp to any meal. Order Now 15 Piece Butterfly Shrimp Customize your meal by adding 15 breaded butterfly shrimp to any meal. Order Now 1 Piece Batter Dipped Fish Add one piece of our famous batter dipped fish to any meal. Order Now 2 Piece Batter Dipped Fish Add two pieces of our famous batter dipped fish to any meal. Order Now 6 Hush Puppies 6 of our famous golden brown hush puppies are made from a batter that’s freshly prepared and hand scooped with care. They are perfectly paired with our seafood meals. Order Now Add 2 Crab Shells Add two pieces of our crab shells to any meal. Order Now Add-On 2 Pc Chicken Two crispy hand-breaded chicken tenders Order Now Popcorn Shrimp Add some bite-sized, D'Lish Popcorn Shrimp to any meal. Perfect with D's Dippin Sauce. Order Now Clam Strips A quarter-pound of our fan-favorite crispy breaded Clam Strips, perfect for dipping in D’s Dippin Sauce! Order Now Clam Strips & Butterfly Shrimp Two fan-favorites in one! Add our breaded Clam Strips and crispy Butterfly Shrimp to any meal. Order Now Captain's Ultimate Appetizer Try a little bit of everything—Clam Strips, Butterfly Shrimp, and Popcorn Shrimp all in one D'Lish appetizer. Sharing optional. Order Now Soft Drink Choice of Sweet Tea or Unsweet Tea, Pepsi, Diet Pepsi, Starry, Mountain Dew, Dr. Pepper, Diet Dr. Pepper, and Lemonade Order Now Gallon of Tea A gallon of D's famous tea. Order Now Gallon Lemonade A gallon of Tropicana Lemonade Order Now 2 Piece Batter Dipped Fish Meal Two of our famous batter dipped fish fillets, golden on the outside tender on the inside. Served with your choice of two sides and hush puppies. Order Now 3 Piece Batter Dipped Fish Meal Three of our famous batter dipped fish fillets, golden on the outside tender on the inside. Served with your choice of two sides and hush puppies. Order Now 4 Piece Batter Dipped Fish Meal Four of our famous batter dipped fish fillets, golden on the outside tender on the inside. Served with your choice of two sides and hush puppies. Order Now 2 Piece Catfish Meal Tender catfish, hand-breaded in our signature southern-style breading and served with your choice of two sides and hush puppies. Order Now 3 Piece Catfish Meal Hand-breaded catfish fillets served with your choice of two sides and hush puppies. Order Now 4 Piece Catfish Meal Hand-breaded catfish fillets served with your choice of two sides and hush puppies. Order Now Southern Style Whitefish A large fillet of white fish hand breaded with seasoned yellow cornmeal breading. Served with your choice of two sides and hush puppies. Order Now Deluxe Seafood Platter For those seeking seafood variety, we combine two fish fillets, six shrimp, two seafood stuffed crab shells with your choice of two sides and hush puppies. Order Now 2 Piece Fish & 6 Piece Butterfly Shrimp Meal Two batter dipped fish fillets and six butterfly shrimp served with your choice of two sides and hush puppies. Order Now 2 Piece Fish & 2 Piece Chicken Meal Two pieces of batter dipped fish and two chicken tenders, served with your choice of two sides and hush puppies. Order Now Supreme Sampler Meal Two pieces of our Famous Batter Dipped Fish, two Chicken Tenders, and six Butterfly Shrimp. Served with your choice of two sides and hush puppies. Order Now 15 Piece Butterfly Shrimp Meal Fifteen of our crispy Butterfly Shrimp served with your choice of two sides and two Hush Puppies Order Now 20 Piece Butterfly Shrimp Meal Twenty of our crispy Butterfly Shrimp served with your choice of two sides and two Hush Puppies. Order Now Popcorn Shrimp & Fish Meal Two Batter Dipped Fish fillets served with a hearty helping of Popcorn Shrimp, hush puppies, and your choice of two classic sides. Order Now 4 Piece Chicken Meal Four crispy breaded chicken tenders with your choice of two sides and hush puppies. Perfect for dipping in D’s delicious honey mustard! Order Now Wild Alaska Salmon Meal Wild Alaska Salmon seared to perfection and served on a bed of rice with your choice of two sides and a breadstick. Order Now Grilled White Fish Meal A fillet of our tender and flaky white fish, seasoned, served on a bed of rice with your choice of two sides and a breadstick. Order Now Grilled Whitefish and Shrimp Meal A fillet of our delicious grilled white fish served alongside six fire-grilled shrimp. Served on a bed of rice with your choice of two sides and a breadstick Order Now 10 Piece Fish Family Meal Feed the whole family with ten of our Famous Batter Dipped Fish. Complete your feast with eight hush puppies and your choice of two family-style sides. Order Now 14 Piece Chicken Family Meal Fourteen of our breaded chicken tenders with eight hush puppies and your choice of two family-style sides. Order Now Seafood Feast Twelve pieces of our famous batter dipped fish, twelve crispy butterfly shrimp, three seafood stuffed crab shells, twelve hush puppies and your choice of two family-style sides. Order Now Family Sampler Meal There's something for everyone in the Family Sampler! Get ten Batter Dipped Fish fillets, twelve Butterfly Shrimp, six Hand-Breaded Chicken tenders, eight hush puppies, and two Family Style Sides. Order Now Giant Fish Sandwich Two batter dipped fish fillets on a toasty bun with tangy tartar sauce, and shredded lettuce Order Now Giant Fish Sandwich Combo Two Batter Dipped Fish Fillets on a toasty bun with tangy tartar sauce and shredded lettuce. Served with choice of a side and drink. Order Now Big Chicken Sandwich Three Hand-Breaded Chicken Tenders on a toasty bun with mayo and pickles. Order Now Big Chicken Sandwich Combo Three Hand-Breaded Chicken Tenders on a toasty bun with mayo and pickles served with your choice of side and a refreshing beverage. Order Now 2 Pc Fish & Fries Combo Two Batter Dipped Fish fillets served with your choice of one classic side and a refreshing beverage. Order Now Kid's Batter Dipped Fish Meal One piece of our famous batter dipped fish served with a choice of one side, hush puppies, drink. Order Now Kid's Popcorn Shrimp Meal A plentiful portion of tender, breaded bite-sized shrimp with a choice of one side, hush puppies, drink. Order Now Kid's Chicken Tenders Meal Two seasoned and breaded chicken tenders, with a choice of one side, hush puppies, drink. Order Now Classic Cheesecake Creamy California cheesecake baked on a golden graham cracker crumb. Made exclusively by The Cheesecake Factory Bakery. Order Now Funnel Cake Stix A twist on a popular state fair favorite in an easy-to-share serving, these sweet and delicious funnel cake stix are the perfect finish to any Captain D's meal. Order Now French Fries Crispy cut french fries. Order Now Coleslaw Fresh cabbage combined with Captain D’s own signature sweet slaw dressing with a delicate blend of sweet and savory flavors. Order Now Green Beans Green beans slow cooked with country ham and served hot Order Now Broccoli Tender broccoli florets steamed to order. Order Now Mac & Cheese Classic home-style macaroni and cheese prepared with delicate Cheddar cheese sauce and tender noodles. Order Now Fried Okra A simple, southern classic; slices of okra in southern-style breading fried to a golden brown. Order Now Corn on the Cob Simply sweet corn on the cob steamed and served hot. Order Now Baked Potato A generous sized potato cooked to fluffy perfection and then served with butter and sour cream. Order Now Loaded Baked Potato A perfectly baked potato, loaded with cheese and bacon. Order Now The Captain is Callin’ Gift Cards Give the gift of D’s. Be a seafood hero and give your family what they really crave… premium seafood. Get A Gift Card Earn Rewards! Download the My Captain D’s app and receive 1 point for every dollar you spend. Rack up points and Redeem points for your favorite items at D’s including fan favorites like Mozzarella sticks and Giant Fish Sandwiches. Points only valid for online/in-app orders. Get the App! About Us Captain D's, Charleston At our Charleston, SC location, we are part of a historic seafood tradition. Captain D's Seafood Restaurant first opened its doors back on August 15, 1969. A lot has changed since then, but our commitment to serving freshly prepared seafood at a great value has been our core mission from the beginning. Known originally as Mr. D's Seafood and Hamburgers, Captain D's was opened in Donelson, Tennessee. From the very start, we set out to provide quality seafood at reasonable prices, a concept that was revolutionary at the time. Start Earning with Captain D's Rewards Get Points with every App order. Redeem towards menu items. Exclusive members-only surprises and deals. More points means more rewards. Download the My Captain D’s app and receive 1 point for every dollar you spend. Rack up points and Redeem points for your favorite items at D’s including fan favorites like Mozzarella sticks and Giant Fish Sandwiches. Points only valid for online/in-app orders. GET THE APP TODAY Frequently Asked Questions Nearby Locations Charleston 5.68 mi 4008 Rivers Avenue Charleston, SC 29405 +1 843-554-6195 View Location Directions Charleston 9.95 mi 5130 Ashley Phosphate Road Charleston, SC 29418 +1 843-552-1107 View Location Directions Goose Creek 14.55 mi 111 N. Goose Creek Blvd. Goose Creek, SC 29445 +1 843-553-2540 View Location Directions © 2024 Captain D's, LLC Terms & Conditions Privacy Policy Accessibility",
      "hash": "5c17593b1e6f",
      "downloadedAt": "2026-01-18T17:02:05.081Z",
      "trimmedAt": "2026-01-18T17:05:31.216Z",
      "sizeReduction": "94.9%"
    },
    {
      "url": "https://locations.captainds.com/ll/us/sc/charleston/5130-ashley-phosphate-rd/",
      "text": "Charleston View Menu Order Now Rewards Directions All locations > US > SC > Charleston > 5130 Ashley Phosphate Road General Information 5130 Ashley Phosphate Road Charleston, SC 29418 +1 843-552-1107 Hours Of Operation Explore our menu inCharleston, SC Exclusive Online Deals What's New Appetizers and Add-Ons Beverages Fish Favorites Captain's Classics Chicken Meals Grilled Meals Family Meals Combos Kids Meals Desserts Sides 1 Piece Fish and Fries One piece of our batter dipped fish fillet served with one side and hushpuppies. Order Now 4 Pc Fish Meal Our famous 4 piece batter dipped fish fillet meals served with two sides and Hush Puppies. Order Now Fish & Chicken Meal Two Batter dipped fish fillets and two crispy breaded chicken tenders, served with your choice of two sides, and two hush puppies. Order Now 2 Pc Fish Dinner Two-piece batter dipped fish fillet, golden on the outside tender on the inside. Served with your choice of side. Order Now Giant Fish Sandwich Two Batter Dipped Fish fillets on a toasty bun with tangy tartar sauce and shredded lettuce. Order Now Two 3 Piece Fish Meals Two of our three-piece batter dipped fish fillet meals, golden on the outside tender on the inside. Served with your choice of two sides and hush puppies each. Order Now 2 Piece Fish and Popcorn Shrimp Meal Two of our famous batter dipped fish fillets, golden on the outside tender on the inside and golden popcorn shrimp. Served with your choice of two sides and hush puppies. Order Now 10 Piece Fish Family Meal Feed the whole family with ten of our Famous Batter Dipped Fish. Complete your feast with eight hush puppies and your choice of two family-style sides. Order Now Chicken, Waffle & Fries Two Hand-Breaded Chicken tenders served with an artisan waffle and drizzled in syrup. Order Now Chicken, Shrimp, Waffle & Fries One Hand-Breaded Chicken tender, five Butterfly Shrimp, and one artisan waffle. Served with syrup and your choice of classic side. Order Now Big Chicken & Waffles Platter Four Hand-Breaded Chicken tenders and two artisan waffles, drizzled in syrup. Served with your choice of classic side. Order Now Ultimate Seafood Platter Two Batter Dipped Fish fillets, five Butterfly Shrimp, two Stuffed Crab Shells, and Popcorn Shrimp. Served with your choice of two classic sides and hush puppies. Order Now Clam Strips A quarter-pound of our fan-favorite crispy breaded Clam Strips, perfect for dipping in D’s Dippin Sauce! Order Now Clam Strips & Butterfly Shrimp A quarter-pound of our fan-favorite breaded Clam Strips and four golden Butterfly Shrimp! Order Now Chocolate Cake A single serving of rich Chocolate Cake, topped with rosettes of milk chocolate frosting. Order Now Mozzarella Sticks 8 Breaded mozzarella sticks Order Now Jalapeno Poppers 8 Golden fried jalapeños and cheese Order Now Clam Strips A quarter-pound of our fan-favorite crispy breaded Clam Strips, perfect for dipping in D’s Dippin Sauce. Order Now 5 Piece Butterfly Shrimp Customize your meal by adding 5 breaded butterfly shrimp to any meal. Order Now 10 Piece Butterfly Shrimp Customize your meal by adding 10 breaded butterfly shrimp to any meal. Order Now 15 Piece Butterfly Shrimp Customize your meal by adding 15 breaded butterfly shrimp to any meal. Order Now 1 Piece Batter Dipped Fish Add one piece of our famous batter dipped fish to any meal. Order Now 2 Piece Batter Dipped Fish Add two pieces of our famous batter dipped fish to any meal. Order Now 6 Hush Puppies 6 of our famous golden brown hush puppies are made from a batter that’s freshly prepared and hand scooped with care. They are perfectly paired with our seafood meals. Order Now Add 2 Crab Shells Add two pieces of our crab shells to any meal. Order Now Add-On 2 Pc Chicken Two crispy hand-breaded chicken tenders Order Now Popcorn Shrimp Add some bite-sized, D'Lish Popcorn Shrimp to any meal. Perfect with D's Dippin Sauce. Order Now Clam Strips A quarter-pound of our fan-favorite crispy breaded Clam Strips, perfect for dipping in D’s Dippin Sauce! Order Now Clam Strips & Butterfly Shrimp Two fan-favorites in one! Add our breaded Clam Strips and crispy Butterfly Shrimp to any meal. Order Now Captain's Ultimate Appetizer Try a little bit of everything—Clam Strips, Butterfly Shrimp, and Popcorn Shrimp all in one D'Lish appetizer. Sharing optional. Order Now Soft Drink Choice of Sweet Tea or Unsweet Tea, Pepsi, Diet Pepsi, Starry, Mountain Dew, Dr. Pepper, Diet Dr. Pepper, and Lemonade Order Now Gallon of Tea A gallon of D's famous tea. Order Now Gallon Lemonade A gallon of Tropicana Lemonade Order Now 2 Piece Batter Dipped Fish Meal Two of our famous batter dipped fish fillets, golden on the outside tender on the inside. Served with your choice of two sides and hush puppies. Order Now 3 Piece Batter Dipped Fish Meal Three of our famous batter dipped fish fillets, golden on the outside tender on the inside. Served with your choice of two sides and hush puppies. Order Now 4 Piece Batter Dipped Fish Meal Four of our famous batter dipped fish fillets, golden on the outside tender on the inside. Served with your choice of two sides and hush puppies. Order Now 2 Piece Catfish Meal Tender catfish, hand-breaded in our signature southern-style breading and served with your choice of two sides and hush puppies. Order Now 3 Piece Catfish Meal Hand-breaded catfish fillets served with your choice of two sides and hush puppies. Order Now 4 Piece Catfish Meal Hand-breaded catfish fillets served with your choice of two sides and hush puppies. Order Now Southern Style Whitefish A large fillet of white fish hand breaded with seasoned yellow cornmeal breading. Served with your choice of two sides and hush puppies. Order Now Deluxe Seafood Platter For those seeking seafood variety, we combine two fish fillets, six shrimp, two seafood stuffed crab shells with your choice of two sides and hush puppies. Order Now 2 Piece Fish & 6 Piece Butterfly Shrimp Meal Two batter dipped fish fillets and six butterfly shrimp served with your choice of two sides and hush puppies. Order Now 2 Piece Fish & 2 Piece Chicken Meal Two pieces of batter dipped fish and two chicken tenders, served with your choice of two sides and hush puppies. Order Now Supreme Sampler Meal Two pieces of our Famous Batter Dipped Fish, two Chicken Tenders, and six Butterfly Shrimp. Served with your choice of two sides and hush puppies. Order Now 15 Piece Butterfly Shrimp Meal Fifteen of our crispy Butterfly Shrimp served with your choice of two sides and two Hush Puppies Order Now 20 Piece Butterfly Shrimp Meal Twenty of our crispy Butterfly Shrimp served with your choice of two sides and two Hush Puppies. Order Now Popcorn Shrimp & Fish Meal Two Batter Dipped Fish fillets served with a hearty helping of Popcorn Shrimp, hush puppies, and your choice of two classic sides. Order Now 4 Piece Chicken Meal Four crispy breaded chicken tenders with your choice of two sides and hush puppies. Perfect for dipping in D’s delicious honey mustard! Order Now Wild Alaska Salmon Meal Wild Alaska Salmon seared to perfection and served on a bed of rice with your choice of two sides and a breadstick. Order Now Grilled White Fish Meal A fillet of our tender and flaky white fish, seasoned, served on a bed of rice with your choice of two sides and a breadstick. Order Now Grilled Whitefish and Shrimp Meal A fillet of our delicious grilled white fish served alongside six fire-grilled shrimp. Served on a bed of rice with your choice of two sides and a breadstick Order Now 10 Piece Fish Family Meal Feed the whole family with ten of our Famous Batter Dipped Fish. Complete your feast with eight hush puppies and your choice of two family-style sides. Order Now 14 Piece Chicken Family Meal Fourteen of our breaded chicken tenders with eight hush puppies and your choice of two family-style sides. Order Now Seafood Feast Twelve pieces of our famous batter dipped fish, twelve crispy butterfly shrimp, three seafood stuffed crab shells, twelve hush puppies and your choice of two family-style sides. Order Now Family Sampler Meal There's something for everyone in the Family Sampler! Get ten Batter Dipped Fish fillets, twelve Butterfly Shrimp, six Hand-Breaded Chicken tenders, eight hush puppies, and two Family Style Sides. Order Now Giant Fish Sandwich Two batter dipped fish fillets on a toasty bun with tangy tartar sauce, and shredded lettuce Order Now Giant Fish Sandwich Combo Two Batter Dipped Fish Fillets on a toasty bun with tangy tartar sauce and shredded lettuce. Served with choice of a side and drink. Order Now Big Chicken Sandwich Three Hand-Breaded Chicken Tenders on a toasty bun with mayo and pickles. Order Now Big Chicken Sandwich Combo Three Hand-Breaded Chicken Tenders on a toasty bun with mayo and pickles served with your choice of side and a refreshing beverage. Order Now 2 Pc Fish & Fries Combo Two Batter Dipped Fish fillets served with your choice of one classic side and a refreshing beverage. Order Now Kid's Batter Dipped Fish Meal One piece of our famous batter dipped fish served with a choice of one side, hush puppies, drink. Order Now Kid's Popcorn Shrimp Meal A plentiful portion of tender, breaded bite-sized shrimp with a choice of one side, hush puppies, drink. Order Now Kid's Chicken Tenders Meal Two seasoned and breaded chicken tenders, with a choice of one side, hush puppies, drink. Order Now Classic Cheesecake Creamy California cheesecake baked on a golden graham cracker crumb. Made exclusively by The Cheesecake Factory Bakery. Order Now Funnel Cake Stix A twist on a popular state fair favorite in an easy-to-share serving, these sweet and delicious funnel cake stix are the perfect finish to any Captain D's meal. Order Now French Fries Crispy cut french fries. Order Now Coleslaw Fresh cabbage combined with Captain D’s own signature sweet slaw dressing with a delicate blend of sweet and savory flavors. Order Now Green Beans Green beans slow cooked with country ham and served hot Order Now Broccoli Tender broccoli florets steamed to order. Order Now Mac & Cheese Classic home-style macaroni and cheese prepared with delicate Cheddar cheese sauce and tender noodles. Order Now Fried Okra A simple, southern classic; slices of okra in southern-style breading fried to a golden brown. Order Now Corn on the Cob Simply sweet corn on the cob steamed and served hot. Order Now Baked Potato A generous sized potato cooked to fluffy perfection and then served with butter and sour cream. Order Now Loaded Baked Potato A perfectly baked potato, loaded with cheese and bacon. Order Now The Captain is Callin’ Gift Cards Give the gift of D’s. Be a seafood hero and give your family what they really crave… premium seafood. Get A Gift Card Earn Rewards! Download the My Captain D’s app and receive 1 point for every dollar you spend. Rack up points and Redeem points for your favorite items at D’s including fan favorites like Mozzarella sticks and Giant Fish Sandwiches. Points only valid for online/in-app orders. Get the App! About Us Captain D's, Charleston At our Charleston, SC location, we are part of a historic seafood tradition. Captain D's Seafood Restaurant first opened its doors back on August 15, 1969. A lot has changed since then, but our commitment to serving freshly prepared seafood at a great value has been our core mission from the beginning. Known originally as Mr. D's Seafood and Hamburgers, Captain D's was opened in Donelson, Tennessee. From the very start, we set out to provide quality seafood at reasonable prices, a concept that was revolutionary at the time. Start Earning with Captain D's Rewards Get Points with every App order. Redeem towards menu items. Exclusive members-only surprises and deals. More points means more rewards. Download the My Captain D’s app and receive 1 point for every dollar you spend. Rack up points and Redeem points for your favorite items at D’s including fan favorites like Mozzarella sticks and Giant Fish Sandwiches. Points only valid for online/in-app orders. GET THE APP TODAY Frequently Asked Questions Nearby Locations Goose Creek 6.94 mi 111 N. Goose Creek Blvd. Goose Creek, SC 29445 +1 843-553-2540 View Location Directions Charleston 7.64 mi 4008 Rivers Avenue Charleston, SC 29405 +1 843-554-6195 View Location Directions Summerville 8.29 mi 300 East 5th North Street Summerville, SC 29483 +1 843-871-2653 View Location Directions © 2024 Captain D's, LLC Terms & Conditions Privacy Policy Accessibility",
      "hash": "66f5c0c6a61e",
      "downloadedAt": "2026-01-18T17:02:07.841Z",
      "trimmedAt": "2026-01-18T17:05:31.250Z",
      "sizeReduction": "94.9%"
    },
    {
      "url": "https://locations.captainds.com/ll/us/sc/goose-creek/111-n-goose-creek-blvd/",
      "text": "Goose Creek View Menu Order Now Rewards Directions All locations > US > SC > Goose Creek > 111 N. Goose Creek Blvd. General Information 111 N. Goose Creek Blvd. Goose Creek, SC 29445 +1 843-553-2540 Hours Of Operation Explore our menu inGoose Creek, SC Exclusive Online Deals What's New Appetizers and Add-Ons Beverages Fish Favorites Captain's Classics Chicken Meals Grilled Meals Family Meals Combos Kids Meals Desserts Sides 1 Piece Fish and Fries One piece of our batter dipped fish fillet served with one side and hushpuppies. Order Now 4 Pc Fish Meal Our famous 4 piece batter dipped fish fillet meals served with two sides and Hush Puppies. Order Now Fish & Chicken Meal Two Batter dipped fish fillets and two crispy breaded chicken tenders, served with your choice of two sides, and two hush puppies. Order Now 2 Pc Fish Dinner Two-piece batter dipped fish fillet, golden on the outside tender on the inside. Served with your choice of side. Order Now Giant Fish Sandwich Two Batter Dipped Fish fillets on a toasty bun with tangy tartar sauce and shredded lettuce. Order Now Two 3 Piece Fish Meals Two of our three-piece batter dipped fish fillet meals, golden on the outside tender on the inside. Served with your choice of two sides and hush puppies each. Order Now 2 Piece Fish and Popcorn Shrimp Meal Two of our famous batter dipped fish fillets, golden on the outside tender on the inside and golden popcorn shrimp. Served with your choice of two sides and hush puppies. Order Now 10 Piece Fish Family Meal Feed the whole family with ten of our Famous Batter Dipped Fish. Complete your feast with eight hush puppies and your choice of two family-style sides. Order Now Chicken, Waffle & Fries Two Hand-Breaded Chicken tenders served with an artisan waffle and drizzled in syrup. Order Now Chicken, Shrimp, Waffle & Fries One Hand-Breaded Chicken tender, five Butterfly Shrimp, and one artisan waffle. Served with syrup and your choice of classic side. Order Now Big Chicken & Waffles Platter Four Hand-Breaded Chicken tenders and two artisan waffles, drizzled in syrup. Served with your choice of classic side. Order Now Ultimate Seafood Platter Two Batter Dipped Fish fillets, five Butterfly Shrimp, two Stuffed Crab Shells, and Popcorn Shrimp. Served with your choice of two classic sides and hush puppies. Order Now Clam Strips A quarter-pound of our fan-favorite crispy breaded Clam Strips, perfect for dipping in D’s Dippin Sauce! Order Now Clam Strips & Butterfly Shrimp A quarter-pound of our fan-favorite breaded Clam Strips and four golden Butterfly Shrimp! Order Now Chocolate Cake A single serving of rich Chocolate Cake, topped with rosettes of milk chocolate frosting. Order Now Mozzarella Sticks 8 Breaded mozzarella sticks Order Now Jalapeno Poppers 8 Golden fried jalapeños and cheese Order Now Clam Strips A quarter-pound of our fan-favorite crispy breaded Clam Strips, perfect for dipping in D’s Dippin Sauce. Order Now 5 Piece Butterfly Shrimp Customize your meal by adding 5 breaded butterfly shrimp to any meal. Order Now 10 Piece Butterfly Shrimp Customize your meal by adding 10 breaded butterfly shrimp to any meal. Order Now 15 Piece Butterfly Shrimp Customize your meal by adding 15 breaded butterfly shrimp to any meal. Order Now 1 Piece Batter Dipped Fish Add one piece of our famous batter dipped fish to any meal. Order Now 2 Piece Batter Dipped Fish Add two pieces of our famous batter dipped fish to any meal. Order Now 6 Hush Puppies 6 of our famous golden brown hush puppies are made from a batter that’s freshly prepared and hand scooped with care. They are perfectly paired with our seafood meals. Order Now Add 2 Crab Shells Add two pieces of our crab shells to any meal. Order Now Add-On 2 Pc Chicken Two crispy hand-breaded chicken tenders Order Now Popcorn Shrimp Add some bite-sized, D'Lish Popcorn Shrimp to any meal. Perfect with D's Dippin Sauce. Order Now Clam Strips A quarter-pound of our fan-favorite crispy breaded Clam Strips, perfect for dipping in D’s Dippin Sauce! Order Now Clam Strips & Butterfly Shrimp Two fan-favorites in one! Add our breaded Clam Strips and crispy Butterfly Shrimp to any meal. Order Now Captain's Ultimate Appetizer Try a little bit of everything—Clam Strips, Butterfly Shrimp, and Popcorn Shrimp all in one D'Lish appetizer. Sharing optional. Order Now Soft Drink Choice of Sweet Tea or Unsweet Tea, Pepsi, Diet Pepsi, Starry, Mountain Dew, Dr. Pepper, Diet Dr. Pepper, and Lemonade Order Now Gallon of Tea A gallon of D's famous tea. Order Now Gallon Lemonade A gallon of Tropicana Lemonade Order Now 2 Piece Batter Dipped Fish Meal Two of our famous batter dipped fish fillets, golden on the outside tender on the inside. Served with your choice of two sides and hush puppies. Order Now 3 Piece Batter Dipped Fish Meal Three of our famous batter dipped fish fillets, golden on the outside tender on the inside. Served with your choice of two sides and hush puppies. Order Now 4 Piece Batter Dipped Fish Meal Four of our famous batter dipped fish fillets, golden on the outside tender on the inside. Served with your choice of two sides and hush puppies. Order Now 2 Piece Catfish Meal Tender catfish, hand-breaded in our signature southern-style breading and served with your choice of two sides and hush puppies. Order Now 3 Piece Catfish Meal Hand-breaded catfish fillets served with your choice of two sides and hush puppies. Order Now 4 Piece Catfish Meal Hand-breaded catfish fillets served with your choice of two sides and hush puppies. Order Now Southern Style Whitefish A large fillet of white fish hand breaded with seasoned yellow cornmeal breading. Served with your choice of two sides and hush puppies. Order Now Deluxe Seafood Platter For those seeking seafood variety, we combine two fish fillets, six shrimp, two seafood stuffed crab shells with your choice of two sides and hush puppies. Order Now 2 Piece Fish & 6 Piece Butterfly Shrimp Meal Two batter dipped fish fillets and six butterfly shrimp served with your choice of two sides and hush puppies. Order Now 2 Piece Fish & 2 Piece Chicken Meal Two pieces of batter dipped fish and two chicken tenders, served with your choice of two sides and hush puppies. Order Now Supreme Sampler Meal Two pieces of our Famous Batter Dipped Fish, two Chicken Tenders, and six Butterfly Shrimp. Served with your choice of two sides and hush puppies. Order Now 15 Piece Butterfly Shrimp Meal Fifteen of our crispy Butterfly Shrimp served with your choice of two sides and two Hush Puppies Order Now 20 Piece Butterfly Shrimp Meal Twenty of our crispy Butterfly Shrimp served with your choice of two sides and two Hush Puppies. Order Now Popcorn Shrimp & Fish Meal Two Batter Dipped Fish fillets served with a hearty helping of Popcorn Shrimp, hush puppies, and your choice of two classic sides. Order Now 4 Piece Chicken Meal Four crispy breaded chicken tenders with your choice of two sides and hush puppies. Perfect for dipping in D’s delicious honey mustard! Order Now Wild Alaska Salmon Meal Wild Alaska Salmon seared to perfection and served on a bed of rice with your choice of two sides and a breadstick. Order Now Grilled White Fish Meal A fillet of our tender and flaky white fish, seasoned, served on a bed of rice with your choice of two sides and a breadstick. Order Now Grilled Whitefish and Shrimp Meal A fillet of our delicious grilled white fish served alongside six fire-grilled shrimp. Served on a bed of rice with your choice of two sides and a breadstick Order Now 10 Piece Fish Family Meal Feed the whole family with ten of our Famous Batter Dipped Fish. Complete your feast with eight hush puppies and your choice of two family-style sides. Order Now 14 Piece Chicken Family Meal Fourteen of our breaded chicken tenders with eight hush puppies and your choice of two family-style sides. Order Now Seafood Feast Twelve pieces of our famous batter dipped fish, twelve crispy butterfly shrimp, three seafood stuffed crab shells, twelve hush puppies and your choice of two family-style sides. Order Now Family Sampler Meal There's something for everyone in the Family Sampler! Get ten Batter Dipped Fish fillets, twelve Butterfly Shrimp, six Hand-Breaded Chicken tenders, eight hush puppies, and two Family Style Sides. Order Now Giant Fish Sandwich Two batter dipped fish fillets on a toasty bun with tangy tartar sauce, and shredded lettuce Order Now Giant Fish Sandwich Combo Two Batter Dipped Fish Fillets on a toasty bun with tangy tartar sauce and shredded lettuce. Served with choice of a side and drink. Order Now Big Chicken Sandwich Three Hand-Breaded Chicken Tenders on a toasty bun with mayo and pickles. Order Now Big Chicken Sandwich Combo Three Hand-Breaded Chicken Tenders on a toasty bun with mayo and pickles served with your choice of side and a refreshing beverage. Order Now 2 Pc Fish & Fries Combo Two Batter Dipped Fish fillets served with your choice of one classic side and a refreshing beverage. Order Now Kid's Batter Dipped Fish Meal One piece of our famous batter dipped fish served with a choice of one side, hush puppies, drink. Order Now Kid's Popcorn Shrimp Meal A plentiful portion of tender, breaded bite-sized shrimp with a choice of one side, hush puppies, drink. Order Now Kid's Chicken Tenders Meal Two seasoned and breaded chicken tenders, with a choice of one side, hush puppies, drink. Order Now Classic Cheesecake Creamy California cheesecake baked on a golden graham cracker crumb. Made exclusively by The Cheesecake Factory Bakery. Order Now Funnel Cake Stix A twist on a popular state fair favorite in an easy-to-share serving, these sweet and delicious funnel cake stix are the perfect finish to any Captain D's meal. Order Now French Fries Crispy cut french fries. Order Now Coleslaw Fresh cabbage combined with Captain D’s own signature sweet slaw dressing with a delicate blend of sweet and savory flavors. Order Now Green Beans Green beans slow cooked with country ham and served hot Order Now Broccoli Tender broccoli florets steamed to order. Order Now Mac & Cheese Classic home-style macaroni and cheese prepared with delicate Cheddar cheese sauce and tender noodles. Order Now Fried Okra A simple, southern classic; slices of okra in southern-style breading fried to a golden brown. Order Now Corn on the Cob Simply sweet corn on the cob steamed and served hot. Order Now Baked Potato A generous sized potato cooked to fluffy perfection and then served with butter and sour cream. Order Now Loaded Baked Potato A perfectly baked potato, loaded with cheese and bacon. Order Now The Captain is Callin’ Gift Cards Give the gift of D’s. Be a seafood hero and give your family what they really crave… premium seafood. Get A Gift Card Earn Rewards! Download the My Captain D’s app and receive 1 point for every dollar you spend. Rack up points and Redeem points for your favorite items at D’s including fan favorites like Mozzarella sticks and Giant Fish Sandwiches. Points only valid for online/in-app orders. Get the App! About Us Captain D's, Goose Creek At our Goose Creek, SC location, we are part of a historic seafood tradition. Captain D's Seafood Restaurant first opened its doors back on August 15, 1969. A lot has changed since then, but our commitment to serving freshly prepared seafood at a great value has been our core mission from the beginning. Known originally as Mr. D's Seafood and Hamburgers, Captain D's was opened in Donelson, Tennessee. From the very start, we set out to provide quality seafood at reasonable prices, a concept that was revolutionary at the time. Start Earning with Captain D's Rewards Get Points with every App order. Redeem towards menu items. Exclusive members-only surprises and deals. More points means more rewards. Download the My Captain D’s app and receive 1 point for every dollar you spend. Rack up points and Redeem points for your favorite items at D’s including fan favorites like Mozzarella sticks and Giant Fish Sandwiches. Points only valid for online/in-app orders. GET THE APP TODAY Frequently Asked Questions Nearby Locations Charleston 6.94 mi 5130 Ashley Phosphate Road Charleston, SC 29418 +1 843-552-1107 View Location Directions Summerville 7.65 mi 300 East 5th North Street Summerville, SC 29483 +1 843-871-2653 View Location Directions Charleston 9.69 mi 4008 Rivers Avenue Charleston, SC 29405 +1 843-554-6195 View Location Directions © 2024 Captain D's, LLC Terms & Conditions Privacy Policy Accessibility",
      "hash": "d989f1c04dde",
      "downloadedAt": "2026-01-18T17:02:08.416Z",
      "trimmedAt": "2026-01-18T17:05:31.284Z",
      "sizeReduction": "94.9%"
    }
  ],
  "sizeReduction": "95.7%"
}