{
  "venueId": "ChIJc9BqKCNg_ogRDAFcR7nVrhk",
  "venueName": "MOMO riverfront park",
  "venueArea": "North Charleston",
  "website": "http://www.momocharleston.com/",
  "scrapedAt": "2026-01-19T03:25:43.838Z",
  "trimmedAt": "2026-01-19T03:32:14.345Z",
  "pages": [
    {
      "url": "http://www.momocharleston.com/north-charleston-park-circle-momo-riverfront-park-drink-menu",
      "text": "[Page Title: MOMO riverfront park - Drink Menu]\n\nOur Drinks\nCocktails Wine Beer Spirits",
      "hash": "28b82fdedc09",
      "downloadedAt": "2026-01-19T02:14:56.535Z",
      "trimmedAt": "2026-01-19T03:32:14.313Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "http://www.momocharleston.com/north-charleston-park-circle-momo-riverfront-park-catering",
      "text": "[Page Title: MOMO riverfront park - Catering]\n\nCatering\n\nMOMO GASTROTRUCK is founded on the principle of being creative and having fun in hopes that our guests will share our excitement. It is shaped by our craftsman approach to cooking, the culture of our city, and the products of our local farmers and fishermen.\n\nChef Justin Moore wants our guests to know that it is possible to have wonderful, creative, and innovative cuisine from a truck with the same standards and quality that you would experience from a fine dining restaurant to a rustic gastropub in a brick and mortar setting.\n\nOur menu options are seasonal and change based on the ingredients availability and inspirations of the kitchen. We take pride in our values and hope to continue to grow and support the local food community. Farm to Street.\nInquire Here \nYour request has been sent to the restaurant. We will contact you soon.\n\n{{reservations.serverError}}\n\nCatering menu",
      "hash": "2bae43d5533c",
      "downloadedAt": "2026-01-19T02:14:58.385Z",
      "trimmedAt": "2026-01-19T03:32:14.317Z",
      "sizeReduction": "98.8%"
    },
    {
      "url": "http://www.momocharleston.com/north-charleston-park-circle-momo-riverfront-park-events",
      "text": "[Page Title: MOMO riverfront park - events]\n\nEvents\n\nValentine's Day\n\nSaturday February 14th\n\nJoin us on Valentine's Day for the perfect romantic evening!\n\n11:00 AM - 10:00 PM\n2026-02-14 11:00:00 2026-02-14 22:00:00 America/New_York Valentine's Day Join us on Valentine's Day for the perfect romantic evening! MOMO riverfront park MOMO riverfront park iryna@momocharleston.com \nInternational Women's Day\n\nSunday March 8th\n\nCome celebrate International Women's Day with us - March 8th\n\n11:00 AM - 03:00 PM\n2026-03-08 11:00:00 2026-03-08 15:00:00 America/New_York International Women's Day Come celebrate International Women's Day with us - March 8th MOMO riverfront park MOMO riverfront park iryna@momocharleston.com \nEaster\n\nSunday April 5th\n\nCome celebrate Easter with us!\n\n11:00 AM - 03:00 PM\n2026-04-05 11:00:00 2026-04-05 15:00:00 America/New_York Easter Come celebrate Easter with us! MOMO riverfront park MOMO riverfront park iryna@momocharleston.com",
      "hash": "532b83faa4a9",
      "downloadedAt": "2026-01-19T02:14:57.771Z",
      "trimmedAt": "2026-01-19T03:32:14.322Z",
      "sizeReduction": "98.7%"
    },
    {
      "url": "http://www.momocharleston.com/north-charleston-park-circle-momo-riverfront-park-food-menu",
      "text": "[Page Title: MOMO riverfront park - Food Menu]\n\nOur Menu\nMenu Brunch Menu",
      "hash": "6c94722b35aa",
      "downloadedAt": "2026-01-19T02:14:55.902Z",
      "trimmedAt": "2026-01-19T03:32:14.326Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "http://www.momocharleston.com/north-charleston-park-circle-momo-riverfront-park-happy-hours-specials",
      "text": "[Page Title: MOMO riverfront park - all specials]\n\nSpecials\n\nWe are updating our specials\n\nPlease stay tuned",
      "hash": "c510fbe8d3cd",
      "downloadedAt": "2026-01-19T02:14:57.153Z",
      "trimmedAt": "2026-01-19T03:32:14.328Z",
      "sizeReduction": "99.8%"
    },
    {
      "url": "http://www.momocharleston.com/",
      "text": "[Page Title: MOMO riverfront park - Park Circle, North Charleston, SC]\n\n× \nTurn moments into memories!\n\nChoose us for your next special occasion or get-together.\n\nGot a birthday party, rehearsal dinner, corporate or other event coming up? We're a great option for your gathering! Inquire today and let us know how we can make your special occasion perfect!\nBook your party × \nDid you know we do catering?\n\nWhatever your occasion, however big or small, we have the perfect options to choose from.\n\nCater your birthday party, holiday party, corporate events, wedding festivities and more!\nCall to Inquire × \nWe are taking online reservations!\n\nLet’s ensure you get a great table: Book today!\n\nWe recommend making a reservation ahead of time. Book your table today!\nBook Table \nJob Listings - We're hiring! Call, email or submit an inquiry today to learn more!\nJob Listings Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! \n1049 Everglades Avenue, North Charleston, SC 29405\nmap marker pin \nABOUT MOMO\n\nPurveyor of American dining\n\nLocated in Riverfront Park, MOMO is a purveyor of American dining from esteemed Chef Justin Moore\n\nMOMO is founded on the principle of being creative and having fun in hopes that our guest will share our excitement. As husband and wife owners Justin & Iryna Moore we truly appreciate the guest that continue to make our dreams come true.\nRead More About us Check Out Our Menu Menu Private Parties \nBooking a larger group?\nBook \nOur Story\nAbout us \nUnique and memorable\nOur Menu \nHost your event with us\nPrivate Parties Dot slide navigation number 1 Dot slide navigation number 2 Dot slide navigation number 3 Dot slide navigation number 4 slideshow start stop playing \nReservations\n\nJoin us today\n\nClick the button below to make a reservation.\nReserve \nReviews\n\nreview by - Yelp\n\nDavid Q:\n\nFound this hidden spot along the water. Great view, small place and amazing staff. The menu is simple and to the point. Burger was spot on and our son inhaled the truffle fries. We will be coming back when weather is warmer to let the kids run outside.\n\nreview by - Yelp\n\nSydney T:\n\nWent to dinner here last night with my book club to celebrate a birthday and they were so accommodating of our larger party (8!). The drinks were good, and well-priced in my opinion. We all split a few different appetizers and some truffle fries...\n\nreview by - Yelp\n\nKevin E:\n\nWhat a great find on the old Navy base in North Charleston! We visited for the first time recently and plan to be regulars. Momo is situated in an old Navy building by the Riverfront Park with terrific views of the Cooper River. There is a lot of patio seating with heaters and a fire pit, too...\n\nreview by - Yelp\n\nKimberly B:\n\nIt's not often that I go to a restaurant twice while visiting a place because I usually want to visit many places, and this especially true for the Charleston area. But MOMO's kitchen blew me away! The CAROLINA GOLD RICE BOWL was extremely good. (I had it both times)...\n\nreview by - Yelp\n\nBrian B:\n\nThis place was quite a surprise in goose Creek. I went with my girlfriend and her brother. The decor is simple and sheik, and the food was not only beautiful, but very tasty. I highly recommend trying this place out, especially if you live in Goose Creek.\nStop reviews carousel Play reviews carousel \nNewsletter\n\nLocation\n\n1049 Everglades Avenue\n\nNorth Charleston, SC\n\n29405\n\nHours\n\nTue, Wed, Thur\n\n11:00 AM - 9:00 PM\n\nFri, Sat\n\n11:00 AM - 10:00 PM\n\nSun\n\n10:00 AM - 3:00 PM\n\nFind us on...\nInstagram page Yelp page \nContact us\n(843)-834-0212 iryna@momocharleston.com \nPowered by:\nWebsite design, Social Media marketing and Email marketing provided by SpotHopper. × \nNewsletter",
      "hash": "f71f256e01fd",
      "downloadedAt": "2026-01-19T02:14:55.817Z",
      "trimmedAt": "2026-01-19T03:32:14.345Z",
      "sizeReduction": "97.5%"
    }
  ],
  "sizeReduction": "98.9%"
}