{
  "venueId": "ChIJ-yyUfcN5_ogRFR0pS0mx4PI",
  "venueName": "El Pollo Guapo",
  "venueArea": "James Island",
  "website": "http://elpolloguapo.com/",
  "scrapedAt": "2026-01-18T17:04:22.890Z",
  "trimmedAt": "2026-01-18T17:04:42.017Z",
  "pages": [
    {
      "url": "http://elpolloguapo.com/charleston-el-pollo-guapo-locations",
      "text": "Locations Buy E-Gift Card View map Back to Location James Island Address: 1130 Folly Rd, Charleston, SC 29412 on Google maps Location Hours: Monday-Saturday 11 AM-8 PM, Sunday Closed Phone: 843-225-4460 order from James Island Buy E-Gift Card from James Island Catering Delivery from James Island Catering Pick Up from James Island View James Island on Google maps View on map James Island Newington Address: 1044 Main St, Newington, CT 06111 on Google maps Location Hours: Seven days a week, 11 AM-8 PM Phone: 860-436-4982 Order from Newington Buy E-Gift Card from Newington Catering Delivery from Newington Catering pick up from Newington View Newington on Google maps View on map Newington HARTFORD Address: 26 Front St, Hartford, CT 06103 on Google maps Location Hours: Monday-Saturday 11 AM-8 PM, Sunday Closed Phone: 860-246-2800 Order from HARTFORD Buy E-Gift Card from HARTFORD Catering Delivery from HARTFORD Catering Pick Up from HARTFORD View HARTFORD on Google maps View on map HARTFORD Glastonbury Address: 347 New London Turnpike, Glastonbury, CT 06033 on Google maps Location Hours: Seven days a week, 11 AM-8 PM Phone: 860-781-8356 order from Glastonbury Buy E-Gift Card from Glastonbury Catering Delivery from Glastonbury Catering Pick Up from Glastonbury View Glastonbury on Google maps View on map Glastonbury Go back to the main content Reset zoom",
      "hash": "2125ac7bdc07",
      "downloadedAt": "2026-01-18T16:55:33.119Z",
      "trimmedAt": "2026-01-18T17:04:41.990Z",
      "sizeReduction": "98.4%"
    },
    {
      "url": "http://elpolloguapo.com/charleston-el-pollo-guapo-events",
      "text": "Events National Margarita Day Sunday February 22nd Come celebrate National Margarita day with us on February 22nd. 11:00 AM - 11:59 PM",
      "hash": "284a0751b757",
      "downloadedAt": "2026-01-18T16:55:34.366Z",
      "trimmedAt": "2026-01-18T17:04:41.993Z",
      "sizeReduction": "99.8%"
    },
    {
      "url": "http://elpolloguapo.com/",
      "text": "× We're hiring! Call, email, or submit an inquiry today to learn more! Job Listings × Turn moments into memories! Choose us for your next special occasion or get-together. Got a birthday party, rehearsal dinner, corporate or other event coming up? We're a great option for your gathering! Inquire today and let us know how we can make your special occasion perfect! Call to Inquire order online The Same Great Food Hot and Ready for You -- Skip the wait and click below for quick and easy order pick up at any of our locations! order tailored catering Elevate Your Event Make Your Next Event Handsome - Leave the cooking to us and enjoy your next event with our variety of catering options (delivery available, exclusions apply) catering . A neighborhood rotisserie joint featuring whole roasted chickens, fresh sides, tacos and salads. Oh yeah, we cater too. Skip Photo Gallery Reviews Start stop reviews carousel Review by - Google Danielle K: five star review by Delicious! The Dazed and Confused and Almost Legal rice bowls were amazing, so flavorful and good that we went back the next night! The brussels sprouts were also really good! Looking forward to making this place our go to place for delicious meals! Review by - Google Ruth W: five star review by This place has a nice ambiance very eclectic. Ordered the queso with house chips, almost legal, and dazed and confused. The chicken was delicious, and everything was perfectly seasoned. Will definitely be going back. Review by - Google Jill B: five star review by What a clean and upbeat restaurant this was! The Span-ish chop bowl was amazingly full of flavors and very filling! The specialty fish taco was delicious! Can't wait to return! slideshow start stop playing Slide 1 content Slide 2 content previous slide next slide For Any Occasion Flexible Catering Options catering It's Always Fresh Indulge Your Appetite Menu Newsletter Reset zoom Locations 1130 Folly Road Charleston, SC 29412 347 New London Turnpike Glastonbury, CT 06033 26 Front St Hartford, CT 06103 1044 Main St Newington, CT 06111 Allergen Guide Hours Charleston Mon, Tue, Wed, Thur, Fri, Sat 11:00 AM - 8:00 PM Glastonbury Seven days a week 11:00AM - 8:00PM Hartford Mon, Tue, Wed, Thur, Fri, Sat 11:00AM - 8:00PM Sunday - Closed Newington Seven days a week 11:00AM - 8:00PM Find us on... Facebook page Instagram page Google page Contact us Charleston (843)-225-4460 Call us at catering@elpolloguapo.com Write us at Glastonbury (860)-781-8356 Call us at Hartford (860)-246-2800 Call us at Newington (860)-436-4982 Call us at Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "8e90359a332c",
      "downloadedAt": "2026-01-18T16:55:33.019Z",
      "trimmedAt": "2026-01-18T17:04:42.013Z",
      "sizeReduction": "98.2%"
    },
    {
      "url": "http://elpolloguapo.com/charleston-el-pollo-guapo-food-menu",
      "text": "Our Menu Main Menu Catering Menu Allergen Guide",
      "hash": "a0cfc6871bc1",
      "downloadedAt": "2026-01-18T16:55:33.749Z",
      "trimmedAt": "2026-01-18T17:04:42.017Z",
      "sizeReduction": "100.0%"
    }
  ],
  "sizeReduction": "98.9%"
}