{
  "venueId": "ChIJEVOm3EJ6_ogRAYlhvJV_7oM",
  "venueName": "Poogan's Smokehouse",
  "venueArea": "Downtown Charleston",
  "website": "https://www.pooganssmokehouse.com/",
  "scrapedAt": "2026-01-19T03:25:39.778Z",
  "trimmedAt": "2026-01-19T03:26:41.171Z",
  "pages": [
    {
      "url": "https://www.pooganssmokehouse.com/",
      "text": "[Page Title: Poogan's Smokehouse | Southern BBQ Restaurant in Charleston | South Carolina]\n\ntop of page 188 East Bay Street, Charleston, SC 29401  |  Open Sunday - Thursday from 11am - 9pm & Friday - Saturday from 11am - 10pm View Menus Charleston’s French Quarter has its share of legends, and Poogan’s Smokehouse is proud to be part of the story. We share our roots with Poogan’s Porch, a beloved Charleston landmark that first opened in 1976, where a stray dog named Poogan greeted guests at the door and stories of friendly spirits became part of the charm. At Poogan’s Smokehouse, we kept the hospitality, traded the haunted history for some hearty smoke, and built a menu around slow-smoked barbecue, satisfying Southern sides, and our house-famous ribs. ​ Since opening in 2015, we've also earned a reputation for our extensive bourbon and whiskey list, complete with curated flights perfect for sipping and savoring. Whether you're craving a plate piled high with barbecue or a drink worth lingering over, Poogan’s Smokehouse is where good food and great company come together. Lunch & Dinner Sunday - Thursday 11am - 9pm ​ Friday - Saturday 11am - 10pm 843-577-5665 188 East Bay Street, Charleston, SC 29401 Reserve a Table MAKE THEIR DAY. A Poogan’s Hospitality gift card is the perfect way to treat someone special to a warm welcome and an unforgettable dining experience. ​ Choose the amount that fits the occasion, whether it’s a casual bite or a full Southern feast. Available for purchase in person or delivered instantly via email or text, our gift cards make last-minute gifting effortless. You can even schedule a digital delivery for a future date or time. And with no expiration date, they can savor their meal whenever the moment feels just right. Purchase a Gift Card LOVE LETTERS TO OUR BBQ - STUART R. My wife and I have been big fans of Poogan’s Porch for years, so we decided to give Poogan’s Smokehouse a try for lunch today. Let me tell you, we were not disappointed. When we asked our waitress for a recommendation, she suggested the Four Porksmen sandwich, saying it was a crowd favorite. Folks, I’ve eaten a lot of sandwiches in my 60 years, but I’ve never seen anything like this one. It was absolutely incredible with a rib sitting on top of the bun. The flavors were great and our waitress was delightful —cracking jokes, sharing her favorites, and really making us feel at home. This was the kind of meal that turns you into a lifelong fan. - STACIE W. I got the Smokehouse Salad with smoked turkey, which was juicy and flavorful. My party also got a serving of smoked turkey with sides that were substantial; the smoked turkey sandwich was absolutely phenomenal with the pimento cheese and beautifully toasted bun; and the pulled pork tacos, which were displayed well and stuffed substantially. We also tried two zero-proof mocktails—highly recommend the Sweet Sereni-Tea and the \"Nojito.\" Fresh and beautiful presentation. Our server, Meghan, was attentive and pleasant throughout the entire meal. They were also accommodating and attentive toward my dietary restriction of gluten. 10/10. YOUR TURN TO DISH Tell us about your visit, and you just might see your words featured here. Leave a Review bottom of page",
      "hash": "0c6d40b9355e",
      "downloadedAt": "2026-01-19T02:09:15.036Z",
      "trimmedAt": "2026-01-19T03:26:40.973Z",
      "sizeReduction": "99.7%"
    },
    {
      "url": "https://www.pooganssmokehouse.com/private-events",
      "text": "[Page Title: Private Events | Poogan's Smokehouse]\n\ntop of page BBQ MADE FOR BIG MOMENTS. When it comes to planning an event, we know you've got a lot on your plate. Wouldn't it be better if that plate was filled with Southern BBQ instead? Consider it done! Our loft is ideal for rehearsal dinners, corporate functions, family reunions, birthdays, and more. View Our Event Guide Click to take a virtual tour of our event space SELECT THE OPTION THAT SUITS YOUR PARTY PREFERENCES. Booking your event is easy with our DirectBook system. Pick your date, time, and menu, then place a $100 deposit to lock it in. The deposit is applied to your final balance, and only charged once your event is approved. It's also refundable with at least 48 hours’ notice. Best part? No room or rental fees! SEMI-PRIVATE EVENT (FOR PARTIES OF 15-20 GUESTS) reserve half of our loft We offer several family-style menu options that include a house salad, skillet cornbread with whipped honey butter, a selection of meats, sides, and desserts, as well as fountain beverages and tea! An alcoholic beverage package can be added, or drinks can be ordered and charged individually. Hog Wild packages start at $40 per adult + tax & service charge (2 meats, 2 sides, 1 dessert) ​ Hog Heaven packages start at $50 per adult + tax & service charge (3 meats, 3 sides, 2 desserts) Book a Semi-Private Event (15-20 guests) PRIVATE EVENT (FOR PARTIES OF 21-40 GUESTS) reserve our entire loft We offer several family-style menu options that include a house salad, skillet cornbread with whipped honey butter, a selection of meats, sides, and desserts, as well as fountain beverages and tea! An alcoholic beverage package can be added, or drinks can be ordered and charged individually. Hog Wild packages start at $40 per adult + tax & service charge (2 meats, 2 sides, 1 dessert) ​ Hog Heaven packages start at $50 per adult + tax & service charge (3 meats, 3 sides, 2 desserts) Book a Private Event (21-40 guests) AT YOUR SERVICE Meet Zoe Stewart, Poogan's Hospitality's Senior Sales Manager. Zoe is here to help you navigate the planning process and ensure you have an exceptional event experience. Have questions or need assistance? Check out our booking guide button below for step-by-step instructions, view our FAQs tab, or email us at . events@pooganshospitality.com Zoe Stewart View Our Event Booking Instructions \nFAQs\nPromotions and Discounts Private Events Reservations Gift Cards Dining with Us Holidays \nDo you offer discounts to active duty military, veterans, or first responders?\nIt’s our honor to serve those who serve. We proudly offer a 15% discount on food for veterans, active-duty military, police, and firefighters. Just show your server or bartender a valid form of ID, and we’ll take care of the rest. \nDo you have a loyalty program?\nWe sure do, and it’s packed with perks: ➤ Earn 1 point for every dollar you spend, plus 25 bonus points just for signing up. ➤ Rack up 100 points and we’ll throw you a bone—enjoy a $10 reward on us. ➤ Every dog has its day! Celebrate your birthday with a $5 reward when you dine with us within 5 days of your big day. ➤ Points can be earned and redeemed at all five Poogan’s Hospitality locations. Sign up once, enjoy the rewards everywhere. It’s our way of saying thanks for being part of the pack. \nDo you donate gift cards to charitable organizations?\nOur \"Community Outreach\" committee is dedicated to reviewing gift card donation requests on an ongoing basis. To be considered, complete the form at the link below at least three weeks prior to your event donation deadline. To ensure fairness and consistency, we accept all submissions through the link below and are unable to accept requests by phone, email, or in-person visits. If you are selected, you will be notified. We appreciate your kindness and commitment to improving the lives of those in our community. \nDonation Requests\nTAKE A VIRTUAL TOUR OF OUR EVENT SPACE. Haven’t been by in a while? Or planning from afar? Our virtual tour lets you step inside and explore our private event space at your own pace. Whether you're envisioning an intimate dinner or a lively celebration, this is your chance to see how it all comes to life – no visit required (but we’d love to see you soon). bottom of page",
      "hash": "55f790c5ddfd",
      "downloadedAt": "2026-01-19T02:09:15.671Z",
      "trimmedAt": "2026-01-19T03:26:41.050Z",
      "sizeReduction": "99.5%"
    },
    {
      "url": "https://www.pooganssmokehouse.com/menus",
      "text": "[Page Title: Menus | Poogan's Smokehouse]\n\ntop of page THE TOP DOG OF SOUTHERN BBQ. Around here, the smell of smoke on East Bay Street isn't a mystery. It’s our welcome mat. We don’t believe in rushing good things, and we know the best meals start low and slow. Our menu’s built on Southern traditions you can taste and twists that keep things interesting, all paired with a whiskey list that also knows a thing or two about patience. FOOD STARTERS SMOKED CHICKEN WINGS choice of sauce, blue cheese, slaw $12 SMOKEHOUSE NACHOS chicken, cheddar cheese fondue, sour cream, pickled onions & jalapeños, pico de gallo, guacamole $16 CAST-IRON CORNBREAD honey butter $8 BAR-P-QUETERIE benton's country ham, smoked sausage, pork belly pastrami, pickled things, pimento cheese, ritz crackers $18 PULLED PORK TACOS flour tortillas, slaw, queso fresco, pickled onions & jalapeños $12 PORK BELLY BURNT ENDS cheerwine bbq, green bbq rub, pickled watermelon rind $16 PIG WINGS crispy pork ribs, smoky buffalo sauce, alabama bleu $16 SMOKED CREAM CHEESE ritz crackers, tomato bacon jam, giardiniera $10 SANDWICHES AND ENTRÉES all sandwiches and burgers are served with kettle chips and pickled onions & jalapeños. add cheddar cheese fondue for $1. PULLED PORK SANDWICH smokehouse slaw $16 SMOKEHOUSE BURGER 8-oz. patty, pimento cheese, onion rings, carolina bbq $17 PULLED CHICKEN SANDWICH alabama white bbq, smokehouse slaw $16 THE FOUR PORKSMEN pulled pork, smoked sausage, bacon, smokehouse rib, cheddar cheese fondue, poogan's bbq sauce $18 SMOKED MEATBALL SANDWICH smoky tomato gravy, collard green pesto, white cheddar $18 CHICKEN TENDERS collard greens, cheddar mac & cheese, honey mustard $18 TURKEY MELT swiss cheese, smoked turkey, smoked tomato mayo, bacon jam, pickled onions & jalapeños $16 PORK BELLY PASTRAMI GRILLED CHEESE gouda, collard greens, smoky tomato gravy $16 SMOKEHOUSE SALAD mixed greens, hard-boiled egg, chopped bacon, cheddar cheese, cucumbers, red onion, tomato. dressing options: ranch, blue cheese, honey mustard, or lemon vinaigrette $12 DIRTY MAC jalapeño cheddar mac topped with any meat $20 SIDES HOUSEMADE KETTLE CHIPS $6 POTATO SALAD $6 SWEET POTATO FRIES $6 SIDE SALAD $6 SMOKEHOUSE SLAW $6 COLLARD GREENS $6 ROASTED BRUSSELS SPROUTS $6 CHEDDAR MAC & CHEESE $6 DESSERTS KEY LIME PIE whipped cream, key lime zest $10 BANANA PUDDING bourbon vanilla pudding, whipped cream, bananas, nilla wafers $8 S'MORES ICEBOX PIE chocolate pie, marshmallow fluff, graham cracker $8 BAR-P-Q served with two sides, bbq sauce, and pickled onions & jalapeños. SMOKEHOUSE RIBS HALF RACK $26 FULL RACK $36 SMOKED PULLED PORK $18 PORK BELLY PASTRAMI $24 BONE-IN SMOKED CHICKEN $22 SMOKED CHICKEN WINGS $22 SMOKED TURKEY $20 SMOKED TEXAS HOT LINK $18 TWO-MEAT COMBO $28 THREE-MEAT COMBO $34 THE MEAT SAMPLER turkey, pulled pork, bone-in chicken, texas hot link, smokehouse ribs, two family-sized sides (serves 2 - 4 people) $72 bottom of page",
      "hash": "f045da86611d",
      "downloadedAt": "2026-01-19T02:09:15.126Z",
      "trimmedAt": "2026-01-19T03:26:41.171Z",
      "sizeReduction": "99.8%"
    }
  ],
  "sizeReduction": "99.7%"
}