{
  "venueId": "ChIJCcbkaFd__ogRHn8eNHambBU",
  "venueName": "Tolli’s Trattoria",
  "venueArea": "West Ashley",
  "website": "http://www.tollistrattoria.com/",
  "scrapedAt": "2026-01-18T17:04:24.304Z",
  "trimmedAt": "2026-01-18T17:05:19.739Z",
  "pages": [
    {
      "url": "http://www.tollistrattoria.com/menus",
      "text": "Main content starts here, tab to start navigating Slide 1 of 4 Slide 2 of 4 Slide 3 of 4 Slide 4 of 4 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Menus Appetizers Salads Entrees 12\" Pizzas For Take Out Pasta Subs Chubby Chub Sub Desserts Sides & Additions Drinks Catering Menu Tollis Trattoria Lunch Menu Appetizers N.Y. Style Fried Calamari Corn meal n flour dusted domestic calamari tube & tentacles fried with sliced hot cherry peppers. Served with lemon wedge & our marinara sauce 15.00 $ Garlic Pesto Knots Our pizza dough knots baked & then tossed in housemade garlicky pesto. 6 pieces per order **There are no nuts in this dish** 9.00 $ Cheezy Garlic Bread Our daily fresh made in house bread slathered with garlic butter then topped with American, mozzarella, oregano & pecorino cheeses baked til nice n cheezy, then parsley 10.00 $ Arancini's Crisp shell Risotto fritters with peas, chili pepper and pecorino cheese served on a bed of our marinara sauce topped with more grated pecorino cheese. Two to an order 9.00 $ Tollis Dam Good Bar Wings Our seasoned & floured jumbo wings deep fried and dressed with one of our buffalo or sweet & spicy Italian chili sauce. Served with either our blue cheese dressing or our ranch dressing 9.00 $ Clams Posillipo Local Clams, Garlic, Nduja, Anchovies, white wine, Grape tomato, splash of marinara, lemon zest & Grilled crostini 13.00 $ Burrata Amalfi A center cracked Burrata Ball with sliced Mortadella, pistachios, EVOO, parsley pesto and our sliced ciabatta bread 16.00 $ Focaccia of the Day House made thick airy Focaccia, dressed differently Daily, square cut & sliced. served warm 8.00 $ Soup of the Day 10.00 $ Salads Arugula Panzanella Salad Caramelized onion pizzette with burrata cheese, EVOO, cracked pepper & balsamic drizzle 16.00 $ Tre Colori Caprese Arugula, fresh mozzarella ovaline, sliced on top of vine ripe tomato, some sweet grape tomato with olive oil, parsley pesto, salt and pepper, balsamic glaze drizzle & fresh basil 14.00 $ Classic Caesar Salad Crisp romaine tossed with our housemade Caesar dressing and house made croutons, finished with shaved grana padana cheese 12.00 $ Tolli's Chopped Salad Crisp romaine, green olives, sliced hot cherry peppers, diced red onion, crisp bacon, & housemade blue cheese dressing. Red wine vinaigrette is available upon request 12.00 $ Red Beet Salad Roasted Beets, Arugula, Whipped Ricotta Cheese base, Crushed Pistachio sprinkled on top & House made Lemon Vinaigrette. 14.00 $ Entrees Main course items Chicken Milanese Our cooked to order cutlet from tenders, topped with grape tomato and arugula salad with lemon parm dressing and house pickled red onions 21.00 $ Chicken Parmigiana Our fried cutlet topped with marinara sauce & melted mozzarella served over rigatoni or linguini pasta 28.00 $ Baked Meatballs Four of our homemade beef meatballs served in marinara sauce topped with melted mozzarella cheese, fresh arugula & pickled red onions 18.00 $ Chicken Piccata Sauteed thin, floured cutlets finished in lemon butter sauce with Garlic Aioli dressed smashed fried potato 26.00 $ Salmon Lemon Thyme Skinless salmon filet, pan seared & finished in a lemon, thyme wine sauce served with salt & pepper Broccoli 27.00 $ Country Fried Pork Pork tenderloin cutlets, buttermilk marinade, floured, fried and dressed with cracked black pepper gravy served with salt & pepper Broccoli 26.00 $ N.Y. Strip Steak Frites strip steak pan seared finished with a chimichurri sauce, pecorino parsley fries and a horseradish cream dipping sauce 39.00 $ 12\" Pizzas For Take Out 12\" Pizzas Your Way Base Red or white. Add mozzarella A La Carte Toppings (Limit 5) Bacon | Pepperoni | Meatball | Sausage | Fresh Mozzarella | Fresh Tomato | Bell Pepper | Fresh Garlic | Onion | Mushroom | Arugula | Black Olive 12\" Red Mozzarella Build Your Own Apizza Classic red base with tomato sauce, oregano, mozzarella. Now comes with mozzarella 11.00 $ 12\" White Mozzarella Build Your Own Apizza Classic white base with EVOO, oregano, mozzarella. Now comes with mozzarella 11.00 $ Calzone Our dough is filled with a three cheese blend of ricotta, mozzarella & grated pecorino romano cheese, black pepper, and parsley mixture then topped with your choice of filling. The dough is folded over itself, sealed, and baked till golden. Served with a side of marinara sauce 15.75 $ 12\" New Calabrese Our Calabrese but made better. Red base, fresh mozzarella, pickled Fresno, soppressata, chili flakes, honey, pecorino & when done we add a little arugula and pickled red onion. Small change. Huge taste difference for the better! 23.25 $ 12\" Morty Mortadella White base with fresh mozzarella baked blind. Then we add fresh sliced mortadella fresh ricotta, parsley pesto, roasted pistachio & EVOO. An amazing pizza 23.00 $ 12\" Thea White a pizza with mozzarella, chopped broccoli rabe, fresh garlic, pinch of chili flakes, EVOO, pecorino and our loose Italian sausage 19.75 $ 12\" Americano White a pizza, mozzarella, fresh sliced tomato, fresh garlic, pecorino, fresh basil & parley pesto drizzle 16.75 $ 12\" BBQ Chicken White a pizza, mozzarella, chopped fried chicken, red onion, pecorino, BBQ sauce & bacon 19.25 $ 12\" Buffalo Chicken White pie with our blended Frank’s red hot special sauce, fried chicken, mozzarella cheese & pecorino 16.00 $ 12\" Estiva White a pizza with mozzarella, baked blind then dressed with arugula, chopped tomato, shaved Parmigiano cheese, drizzled with our lemon parm dressing and finished with sliced prosciutto di parma 16.75 $ 12\" Margharita Plain tomato sauce, our fresh mozzarella, fresh basil, pecorino & E.V.O.O. this is the a pizza made to honor queen Margherita of Italy. Hence the name... also the pizza was to symbolize the Italian flag colors 16.75 $ 12\" Marios This white a pizza is unique. White base with crumbled goat cheese, caramelized onions, ground pistacchio nuts, honey, olive oil and finished with truffle oil when it comes out of oven. You can also add fresh fruit as an option 17.50 $ 12\" Nonno Our red sauce base, mozzarella, oregano, fresh garlic, loose Italian sausage, pecorino and fresh sliced mushrooms 16.25 $ 12\" Shrimp Arugentine White pizza with mozzarella, shrimp, garlic baked then dressed with fresh arugula, chopped tomato, lemon Parmigiani dressing, pecorino and shaved grana Padana cheese 24.00 $ 12\" Shrimp Scampi A white pizza with oregano, mozzarella, fresh shrimp, fresh garlic, lemon parm dressing, sliced grape tomato, fresh parsley, pecorino, EVOO and baked until crisp and golden 22.75 $ 12\" Tonino's White base, mozzarella, ham, mushrooms, caramelized onions, hot cherry peppers, pecorino, & EVOO 21.50 $ 12\" Shrimp Pesto White base, mozzarella, garlic, shrimp, pesto, pecorino, oregano & EVOO 20.25 $ 12\" Porchetta & Rabe White base, mozzarella, porchetta, broccoli rabe, garlic, pesto & EVOO 21.25 $ 12\" Scampi Casino White, mozzarella, shrimp, garlic, lemon parm dressing, sliced grape tomato, roasted peppers, fresh parsley, pecorino & bacon 25.75 $ 12\" Nutty Cannoli White pizza shell baked blind, then topped with Nutella spread, crumbled cannoli shells, cannoli cream and chocolate chips 19.25 $ 12\" N.Y. Steakbomb white pizza, American, Mozzarella, mushrooms, onions, garlic, shaved steak & hot cherry peppers 19.75 $ 12\" chicken Supreme White pizza, mozzarella, chopped chicken cutlet, spinach, red onions, garlic, bacon & Bread Crumb 20.00 $ 12\" Eggplant Deluxe Red pizza, mozzarella, spinach, eggplant, ricotta, garlic, pecorino & EVOO 18.50 $ 12\" Broccoli & Sausage White pizza, mozzarella, broccoli, housemade sausage, garlic, ricotta & pecorino 19.50 $ Pasta Linguini Puttanesca Tomato base with Kalamata and green olives, anchovy, garlic, capers, Fresno, shallots tossed with linguini pasta and finished with fresh parsley. An old-school Italian staple 25.00 $ Linguini Shrimp Provencal Grape tomato sauteed with shallots, garlic, EVOO, white wine, pepper flakes, with shrimp & shrimp stock, tossed with linguini pasta 28.00 $ Shrimp Fra Diavolo Sauteed Shrimp In Our Marinara With Added Chili Flakes to spice it up Fra Diavolo Style. 27.00 $ Pasta Marinara & Meatball Either Penne or Linguini tossed with our Marinara Sauce, Topped with two of our all Beef Meatballs finished with Pecorino & EVOO. 22.00 $ Penne Alla Vodka Bacon, shallots, sweet peas, & Fresno chilis sautéed & tossed with Penne Rigate pasta in a vodka cream sauce & finished with grated pecorino 24.00 $ Pesto Cream Gnocchi Our housemade ricotta gnocchi tossed with traditional basil pesto & a touch of cream. Finished with pecorino Romano cheese & olive oil drizzle. **There are nuts in this dish** 27.00 $ Linguine Alle Vongole Bianco Linguine and fresh pasta neck local clams in their shells, sautéed with garlic, shallot, & fresno peppers. Finished with fresh parsley 28.00 $ Pasta Marinara Either Penne Rigate or linguini tossed with our marinara sauce finished with pecorino & EVOO 14.00 $ Gnocchi Sorrentino Housemade ricotta gnocchi, tossed with our marinara sauce and finished with fresh mozzarella, fresh basil and pecorino cheese 26.00 $ Fettucine Alfredo Egg noodle fettuccine pasta tossed with an alfredo sauce of cream, butter, nutmeg and pecorino cheese dusted with fresh cracked black pepper 20.00 $ Pasta Rose' Either penne or linguine pasta with our house marinara and a touch of cream tossed with fresh basil & pecorino 20.00 $ Pappardelle alla Bolognese Traditional beef Bolognese served with house made pappardelle tossed with pecorino Romano grated cheese and finished with Spanish EVOO 27.00 $ Cavatelli Rabe House made Ricotta Cavatelli with sauteed rabe, house made sausage, pecorino, chili flakes, butter, vegetable stock & EVOO. 28.00 $ Subs Meatball Parm Nonna's famous meatballs with our pomodoro sauce baked on our housemade bread with melted mozzarella & grated cheese 15.00 $ Chicken Parm Chicken cutlets, hand-pounded & fried to order then dressed with our pomodoro sauce and mozzarella and pecorino cheeses. Served on our toasted italian bread 15.00 $ Italian combo Chubby Chub Sub Mortadella, Genoa salami, provolone cheese, baby gem lettuce, oil & vinegar, oregano & sliced tomato 15.00 $ Pepperoni Parm Our fresh baked bread is layered with pepperoni, mozzarella cheese, and our famous pomodoro sauce. Toasty and melty and delicious! 15.00 $ Caprese Chubby Chub Sub Fresh mozzarella, tomato, fresh basil, arugula, parsley pesto, balsamic glaze, EVOO on our housemade bread 15.00 $ Chicken Cutlet Chubby Chub Sub Our crunchy & juicy chicken tender cutlets are fried, sliced, and placed on our housemade bread with mayo, romaine, tomato, salt n pepper & white American cheese. A cold sub 15.00 $ Buffalo Chicken Cutlet Chubby Chub Sub Crispy juicy fried tenders sliced and dressed with our buffalo sauce, Romaine, blue cheese dressing & pickled red onions 15.00 $ N.Y. Steak Bomb Chubby Chub Sub Shaved steak, sautéed in garlic butter, mushrooms, onions then put in our bread with sliced hot cherry peppers and toasted with white American cheese The Bomb!! (*Served until 3pm only!) 15.00 $ Muffuletta Chubby Chub Sub Bread with EVOO, parsley pesto, ham, soppressata, provolone cheese, mozzarella cheese, olive tapenade and mortadella 15.00 $ Porchetta & Rabe Chubby Chub Sub Our bread with sliced pork belly porchetta, parsley pesto, sautéed rabe and provolone. Toasted 15.00 $ Morty Chubby Chub Sub EVOO, Olive Tapenade, Mortadella, Fresh Mozzarella, Pickled Red Onions 15.00 $ Italian Trio Chubby Chub Sub Vinaigrette, Olive Tapenade, Greens, Cotto Ham, Mortadella, Soppressata, Vine Ripe Tomato, Oregano & Provolone 15.00 $ Royal Caprese Chubby Chub Sub Parsley Pesto, EVOO, Arugula, Prosciutto, Fresh Mozzarella, Vine Ripe Tomato, Fresh Basil & Balsamic Glaze. 19.00 $ Lil Taliano Olive Tapenade, Vinaigrette, Cotto Ham, Soppressata, Greens, Fresh Mozzarella. 15.00 $ The Medi Burrata, Vine Ripe Tomato, Greens, Olive Tapenade, EVOO, Balsamic Glaze. 15.00 $ Desserts Changes often, check with order taker or waitstaff Cheesecake Of The Day, Call To Find Out What Flavor 12.00 $ Peanutbutter & Reeses Chunk Cookies 3.95 $ Assorted Gelati Flavors & Sorbetto 4.00 $ TRIPLE CHIP CHOCOLATE CHIP COOKIES 3.95 $ TWO Small Cannoli 6.00 $ Nonna Pina Makes an Assortment of Different Desserts, Changes Daily From Carrot Cakes, Chocolate Cakes, Ricotta Cakes, French Apple Cakes, etc 11' Whole Cheese Cake (Three Day Advance Notice To Order) 120.00 $ 9\" Whole Three Layer Cake (3 Day Advance Notice To Order) 85.00 $ GELATI Espresso Gelato 1 scoop/ 4.00 $ Pistachio Gelato 1 scoop/ 4.00 $ Mixed Berry Sorbet 1 scoop/ 4.00 $ Sea Salt Caramel Gelato 1 scoop/ 4.00 $ Chocolate Gelato 1 scoop/ 4.00 $ Hazelnut Gelato 1 scoop/ 4.00 $ Sides & Additions Side Bread Butter & EVOO Our housemade ciabatta bread sliced & served with butter & EVOO 5.00 $ 7 Grilled Shrimp Fresh local shrimp seasoned with salt & black pepper lightly grilled and added to your salad of choice 9.00 $ Single Meatball Housemade all beef meatball with marinara sauce & grated pecorino cheese 4.00 $ Side Chicken Cutlet Our jumbo tender cutlet fried to order for pasta or salad of your choice 6.00 $ Single Burrata Ball Fresh mozzarella ball with stracciatella cheese center 6.00 $ Side EVOO Imported first cold pressed extra virgin olive oil 1.00 $ Side Blue Cheese Dressing Our housemade Danish blue cheese dressing, 2.5 oz 1.75 $ Side Grated Cheese D.O.P. Pecorino Romano genuine, sheep's milk cheese, cut fresh, dried and grated in house 1.00 $ Side of Crushed Red Pepper Flakes Dried crushed chili pepper flakes 0.25 $ Side Marinara Sauce Our fresh housemade marinara, 2.5 oz 1.00 $ Couple of Meatballs Two of our all beef housemade meatball with marinara sauce & pecorino cheese 8.00 $ Side Grilled Chicken Jumbo tender lightly seasoned with salt & pepper olive oil and grilled, to add to a salad or pasta 5.00 $ Side Of Fries Our lunch fries with salt & side of ketchup 5.00 $ Single Ovaline Fresh Mozzarella Fresh ovaline mozzarella cheese ball, added to your item 4.00 $ Side of Extra Vinaigrette Dressing 1.00 $ Side of Extra Lemon Parm Dressing 1.00 $ Side Extra Ranch Dressing 1.00 $ Italian Sautéed Greens Chef's choice of available greens sautéed with fresh garlic, chili pepper flakes, anchovies and spices & finished with extra virgin olive oil 9.00 $ Side Bread, EVOO & Butter Our housemade bread sliced and served with butter & EVOO, that's it 5.00 $ Drinks Cocktails & wines Cocktails Amber Negroni Gin, Braulio Amaro, Cocchi Americano, lemon, rosemary 13.00 $ Black Manhattan Knob Creek Rye, Averna Amaro, walnut bitters, orange zest 13.00 $ Aperol Spritz Aperol, Prosecco, seltzer & an orange slice on ice 11.00 $ Old Fashioned Bourbon, bitters, sugar, orange zest & maraschino cherry over large cube 14.00 $ Tolli Bellini Alberto Nani Prosecco & white peach puree, fresh basil in a flute 13.00 $ Sgroppino Al Limone Lemon sorbetto, prosecco float, Wheatly Vodka, slice of lemon and mint martini glass 13.00 $ Rose' Pina Homemade Orangecello, Carolina Reaper Vodka, Pasubio Amaro, Pineapple & Rose' Prosecco 14.00 $ Big Ant's Manhattan MAKERS MARK BOURON, NONINO AMARO, SWEET VERMOUTH, ANGOSTURA BITTERS & CHERRY 16.00 $ The Ringmaster Blanco Tequila, Grand Marnier, Lime, Pineapple & Coconut Cream with Nutmeg. 13.00 $ The Efficiency Expert White Rum, Homemade Limoncello, Lime, Angostura Bitters, Simple Syrup, Fresh Mint & Club Soda. 13.00 $ The Odd Man Bulleit Bourbon, Grapefruit, Campari, Lemon & Simple Syrup. 14.00 $ The Zinger Hendrick's Gin, Cocchi Americano, Lemon, Simple Syrup, Cardamon Lemongrass Bitters, Orange Bitters & Prosecco. 15.00 $ The Throwback Jameson, Sweet Vermouth & Fontbonne Herbal Liqueur with Orange Essence. 11.00 $ The Sass Bourbon, Demerara Simple Syrup & Lemon with Lambrusco Wine Float. 11.00 $ The Aficionado Casamigos Anejo Tequila, Agave Syrup, Angostura & Orange Bitters with Cherry. 17.00 $ The Stark & Dormy White Rum, Goslings Rum, Bergamot Black Tea, Allspice Bitters, Lime & Ginger Beer. 11.00 $ The Ingenue Blanco Tequila, Fontbonne Herbal Liqueur, Passionfruit Puree & Lime. 11.00 $ The Go- Getter Muddled Fresh Strawberries & Basil, Gin Mare', Lillet Blanc & Lemon Served Up, Topped with Prosecco & Fresh Basil. 14.00 $ The Nightcap Grappa, Strega, Orange & Lemon. 15.00 $ The Cherry on Top Vodka, Borghetti, Nonino Amaro, Sherry, Simple Syrup & Cherry. 12.00 $ Fiora D' Amalfi White Rum, Limoncello, Elderflower Liqueur & Lemon. 14.00 $ Espresso Martini Vodka, Borghetti, Espresso. 12.00 $ Mocha Martini Van Gogh Double Espresso Vodka, Licor 43 Chocolate Liqueur, Espresso. 13.00 $ Brown Sugar Walnut old Fashioned Templeton Rye, Demerara Simple Syrup, Black Walnut Bitters. 13.00 $ Wines Sparkling & Rose Prosecco, Nino Arvedi Veneto, Italy NV Gls/ 9.00 $ BTL/ 32.00 $ Rosé, Prosecco, \"Ca Di Rajo\" Brut Veneto, Italy NV GLS/ 13.00 $ BTL/ 48.00 $ Moscato Sicilia, Cantine Pellegrino Sicily, IT GLS/ 9.00 $ BTL/ 32.00 $ Lambrusco, \"LINI 910\" Emilia Romagna, Italy NV GLS/ 10.00 $ BTL/ 36.00 $ Champagne, Laurent Perrier Brut Rose' France 144.00 $ Whites House White, Bonizio Italian White Blend GLS/ 9.00 $ Sauvignon Blanc, Sea Pearl Marlborough, New Zealand 2021 GLS/ 10.00 $ BTL/ 36.00 $ Sauvignon Blanc, Sager & Verdier Loire Valley, FR BTL/ 49.00 $ Pinot Grigio, Antonutti Friuli, Italy GLS/ 13.00 $ BTL/ 48.00 $ Chardonnay, Mer Soleil Monterrey, CA GLS/ 13.00 $ BTL/ 48.00 $ Chardonnay, Ferrari Carano Russian River Valley, California BTL/ 66.00 $ Chardonnay, Rombauer Carneros, CA BTL/ 70.00 $ Reds House Red, Bonizio Italian Red Blend GLS/ 9.00 $ Pinot Noir, \"Calatroni\" Lombardy,IT GLS/ 10.00 $ BTL/ 36.00 $ Chianti Classico , Castello di Bossi Tuscany, Italy GLS/ 12.00 $ BTL/ 24.00 $ Super Tuscan, Trambusti Tuscany, Italy GLS/ 11.00 $ BTL/ 40.00 $ Montepulciano d'Abruzzo, Zaccagnini Abruzzo, Italy GLS/ 12.00 $ BTL/ 44.00 $ Corvina, Baby Amarone- Tinazzi Veneto, Italy GLS/ 13.00 $ BTL/ 48.00 $ Cabernet Sauvignon, Broadbent North Coast, CA GLS/ 12.00 $ BTL/ 44.00 $ Zinfandel, Saldo, The Prisoner Wine Co. Napa Valley, California BTL/ 57.00 $ Barolo, Damilano “Lecinquevigne” Piedmont, Italy BTL/ 75.00 $ Grenache Blend, Dept. 66, \"Others\" Languedoc-Roussillon, France BTL/ 60.00 $ Red Blend, 8 Years In Th e Desert California BTL/ 85.00 $ Barolo, Broccardo Piemonte, Italy BTL/ 90.00 $ Amarone Della Valpolicella, \"Tinazzi\" Veneto, Italy BTL/ 90.00 $ Chianti Classico, \"Arcena\" Italy BTL/ 54.00 $ Super Tuscan, \"Fabio Motta\" Bolgheri Rosso,Italy BTL/ 90.00 $ Super Tuscan, Pietro Nova Bolgheri Rosso, IT BTL/ 120.00 $ Red Blend, Papillon, Orin Swift Napa,CA BTL/ 140.00 $ Fortified \"Florio\", Marsala- Vecchio & Dolce Italy 12.00 $ Grahams- Reserve 6 Grape 12.00 $ Sandeman- Fine Tawny Porto 8.00 $ Catering Menu View our catering menu below, then contact us at the restaurant to make an order! Appetizers Dough Knots Our dough tied baked and dressed (30 piece / order) Antipasti Mortadella, coppa, Genoa salami, artichoke, giardiniera, roast pepper, grana padano, sharp provolone and fontina Eggplant Rollatini We grill & marinate our sliced eggplant then stuff & roll with ricotta, mozzarella, pecorino & herbs. Then top with sauced, and baked (22 piece) Italian Housemade Sausage Peppers & Onions Our housemade mild sausage links, roasted, sliced then tossed with oven roasted peppers, sautéed onions together with a touch of marinara sauce fresh parsley and finished with grated pecorino Grilled Vegetables We grill sliced, onion, eggplant, green & yellow zucchini, colored peppers and then dress with a vinaigrette, fresh mint, fresh parsley and Spanish EVOO to finish Tollis Rosemary Roasted Potato Take peeled potato, quarter lengthwise, then oil, fresh rosemary, salt, pepper, garlic and roast til crisp on outside but moist inside Golden Moist Fried Jumbo Wings Jumbo wings, flats & drums, floured with house seasonings, fried til crisp and moist, then dressed with sauce of choice. Dry, Italian sweet & spicy, BBQ, or our buffalo sauce Cream Cheese and Crab Stuffed Mushrooms We use leg and claw crab meat together with cream cheese, herbs and seasonings, mix together and fill caps then top with panko, butter and bake Sausage And Herb Stuffing, Stuffed Mushrooms We do a sausage and mushroom mix, sauté with garlic and shallots then add some moistened bread with chicken stock to make a dressing then put into caps and bake Chicken Chicken Marsala Mushroom, marsala, butter with floured tenders Chicken Picatta Traditional lemon caper piccata sauce with sauteed floured tenders finished with sliced lemon wheels and fresh parsley. Can add penne pasta as an add on option, finished in same lemon caper piccata sauce Chicken Parmigiano Our cutlets fried then layered on sauce then topped with more sauce, mozzarella and pecorino cheese, then baked til cheese just melts. You can order it over penne that is finished in a bechamel sauce under chicken for a nice twist Chicken Francese Our cutlets, floured dredged, egg-dipped, sautéed with a lemon butter and white wine sauce Chicken Al Forno Leg & thigh meat baked with onions, peas, garlic, rosemary & potato. On the bone, old school Italian Fish Selection Scrod Oreganato Filets of scrod seasoned with salt, pepper, crushed red pepper flakes, oregano, sliced green & Kalamata olives, crushed tomato, white wine, parsley & EVOO & a cracker panko crumb. Baked to perfection Baked Stuffed Filet Of Sole We take a good size filet of sole line it with herbs, crab meat, and a light cracker crumb filling, roll it up bake and dress with a meuniere sauce to finish Salads House Chop Salad Romaine, grape tomato, diced red onion, sliced cherry peppers, sliced green olives, crisp bacon crumble & house vinaigrette Caesar Salad Housemade croutons, shaved grana padano finished with our housemade dressing. You can add grilled chicken tenders seasoned with herbs, grilled, sliced, and dressed Pasta Baked Penne Meatball crumbles, ricotta, mozzarella, pecorino house tomato sauce, and parsley tossed with pasta and baked crispy Penne Vodka Our house vodka cream sauce, made with onion, bacon, peas, marinara and pecorino, tossed with penne pasta & finished with fresh pecorino cheese Manicotti Di Tolli Light egg noodle, housemade and rolled with ricotta, pecorino, pepper, mozzarella then topped with our marinara sauce then baked (12 piece minimum) Penne Rigate Marinara Our plain marinara sauce tossed with penne rigate to hold the sauce and finished with fresh basil and pecorino cheese. You can add housemade beef meatballs Italian Macaroni & 3 Cheese Traditional elbow pasta tossed with our three cheese bechamel sauce, then we add panko chip crumb and bake. You can add shrimp or lobster meat to make it special Tollis Lasagna (Vegetable or Meat) Our egg noodle pasta sheet five layers with ricotta, mozzarella, herbs and seasonings together with either crumbled meatballs or veggies consisting of broccoli, spinach, slice tomato and roasted portobello with ricotta, mozzarella, marinara sauce and baked off Desserts Biscotti Cannoli Nonna Pina 11\" Whole Cheesecakes 120.00 $ Gourmet Fresh Baked 4.5 Ounce Jumbo Cookies Triple chocolate chip cookies, Reese's chunk cookies Lunch Menu Served from 11:00 am to 3:00 pm. Dine-in or take-out Appetizer NY Fried Calamari 14.00 $ Garlic Knotz 9.00 $ Cheesey Garlic Bread 10.00 $ Arancini 9.00 $ Tollis Dam Good Bar Wings 9.00 $ Burrata Amalfi 14.00 $ Fresh Mozzarella Caprese 13.00 $ Lunch Chubby Chub Subs The Medi Burrata, tomato, greens, olive tapenade, hot pepper marmalade & balsamic glaze 15.00 $ Porchetta / Rabe Pesto, broccoli rabe, porchetta, melted provolone & EVOO 15.00 $ Lil Italiano Salami, sopressata, hot pepper spread, greens, fresh mozzarella, vinaigrette 15.00 $ Royal Caprese Prosciutto, fresh mozzarella, tomato, pesto, balsamic glaze, arugula, basil & EVOO 15.00 $ Miggy Mortadella, fresh mozzarella, hot pepper marmalade, pickled red onion 15.00 $ Combo Mortadella, salami, greens, tomato, vinaigrette & provolone 15.00 $ Trio Ham, mortadella & salami, greens, tomato, vinaigrette & provolone 15.00 $ Our Muffaletta Hot pepper marmalade, olive tapenade, ham, salami, mortadella, mayo & provolone 15.00 $ Chicken Parm Chicken cutlet, marinara, Melted mozzarella, pecorino 15.00 $ Meatball Parm Meatballs, marinara, melted mozzarella, pecorino 15.00 $ Buffalo Chicken Chicken cutlet, mayo, buffalo sauce, American cheese, pickled red onions, greens 15.00 $ Chicken Cutlet Chicken cutlet, mayo, greens, tomato, American cheese 15.00 $ NY Steak Bomb Shaved steak, sautéed mushrooms, onions, in a garlic butter & hot cherry peppers, toasted with American cheese 15.00 $ Lunch Mains Chicken Picatta 22.00 $ Chicken Milanese 21.00 $ Lunch Pastas Linguini Putanesca Marinara, Kalamata olives, anchovy, shallots, Fresno chili & garlic 19.00 $ Bucatini Nocciole Aglio & Olio Toasted hazelnuts, garlic, chili flakes, EVOO, pasta water and fresh parsley Fettucine Estate' Egg fettucine, lemon, parsley, anchovy, grape tomato, butter & toasted breadcrumb 18.00 $ Rigatoni Cacio e' Pepe Pecorino cheese, parmigiano reggiano cheese, cracked black pepper & pasta water to cream sauce 18.00 $ Linguini Sugo Al' Amatriciana Guanciale sautéed, wine, crushed tomato, pecorino Romano cheese tossed with linguini 19.00 $ Lunch Salads Chop Salad 12.00 $ Arugula Panzanella 14.00 $ Classic Caesar 12.00 $ Roast Beet Salad 14.00 $ Salad Dressing & Additions House Vinaigrette House Blue Cheese Dressing House Caesar Balsamic House Lemon Vinaigrette Grill Shrimp Add-On 9.00 $ Grill Chicken Add on 5.00 $ Chicken Cutlet Add-On 6.00 $ Burrata Add-On 6.00 $ Handwich combos come with choice of one side Lunch Handwich Combo Combo Cup of Soup Combo Side Arugula Salad Combo Side Fries Combo Bag of Chips Handwich Lil Italiano Salami, sopressata, hot pepper marmalade, greens, fresh mozzarella, vinaigrette 12.50 $ Handwich Royal Caprese Prosciutto, fresh mozzarella, tomato, pesto, balsamic glaze, arugula, basil & EVOO 12.50 $ Handwich Miggy Mortadella, fresh mozzarella, hot pepper marmalade, pickled red onion 12.50 $ Handwich Combo Mortadella, salami, greens, tomato, vinaigrette & provolon 12.50 $ Handwich Trio Ham, mortadella & salami, greens, tomato, vinaigrette & provolone 12.50 $ Handwich Muffaletta Hot pepper marmalade, olive tapenade, ham, salami, mortadella, mayo & provolone 12.50 $ Handwich Chicken Parm Chicken cutlet, marinara, melted mozzarella, pecorino 12.50 $ Handwich Meatball Parm Meatballs, marinara, melted mozzarella, pecorino 12.50 $ Handwich Buffalo Chicken Chicken cutlet, mayo, buffalo sauce, American cheese, pickled red onions, greens 12.50 $ Handwich Chicken Cutlet Chicken cutlet, mayo, greens, tomato, American cheese 12.50 $ Call (843)-212-7893 Order Online Through Us Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "2f97d5113ac6",
      "downloadedAt": "2026-01-18T17:04:13.507Z",
      "trimmedAt": "2026-01-18T17:05:19.611Z",
      "sizeReduction": "88.9%"
    },
    {
      "url": "http://www.tollistrattoria.com/location/tollis-trattoria/",
      "text": "Main content starts here, tab to start navigating Hours & Location 1803 Crowne Commons Way Suite A-3, Johns Island, SC 29455 (843)-212-7893 info@tollistrattoria.com 4:00 PM - 9:00 PM Monday: 11:00 AM - 9:00 PM Tuesday - Saturday: Get Directions Call (843)-212-7893 Order Online Through Us Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "6c1312a27dac",
      "downloadedAt": "2026-01-18T17:04:11.566Z",
      "trimmedAt": "2026-01-18T17:05:19.614Z",
      "sizeReduction": "97.8%"
    },
    {
      "url": "http://www.tollistrattoria.com/private-events/",
      "text": "Main content starts here, tab to start navigating Private Events Book an Event Our space holds 20 people max. For all inquiries, please fill out the form below and we’ll be in touch soon. Inquire Now Call (843)-212-7893 Order Online Through Us Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Contact Us About Your Private Event Please, enter a valid email Email - Required Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid phone number Phone Number - Required Please, enter a valid company Company - Required Event Date - Required Please, enter a valid start time Start Time - Required Start Time 11:30 PM 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM 6:30 AM 6:00 AM 5:30 AM 5:00 AM 4:30 AM 4:00 AM 3:30 AM 3:00 AM 2:30 AM 2:00 AM 1:30 AM 1:00 AM 12:30 AM 12:00 AM Please, enter a valid end time End Time - Required End Time 11:30 PM 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM 6:30 AM 6:00 AM 5:30 AM 5:00 AM 4:30 AM 4:00 AM 3:30 AM 3:00 AM 2:30 AM 2:00 AM 1:30 AM 1:00 AM 12:30 AM 12:00 AM Please, enter a valid type of event Type of Event - Required Type of Event Alumni Bachelor / Bachelorette Birthday Cocktail Reception Corporate Lunch Engagement Fundraiser Graduation Holiday Meeting / Presentation Photo / Film Shoot Private Dinner Rehearsal Dinner Shower Sporting Event Wedding Other Please, enter a valid number of people Number of People - Required Additional Information - Optional Submit Please check errors in the form above Thank you for your inquiry. We’ll be in touch shortly. Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "7be220a84667",
      "downloadedAt": "2026-01-18T17:04:12.707Z",
      "trimmedAt": "2026-01-18T17:05:19.623Z",
      "sizeReduction": "94.9%"
    },
    {
      "url": "http://www.tollistrattoria.com/",
      "text": "Home Main content starts here, tab to start navigating Classic & Modern Italian Tolli's Trattoria in Johns Island Learn More Slide 1 of 7 Slide 2 of 7 Slide 3 of 7 Slide 4 of 7 Slide 5 of 7 Slide 6 of 7 Slide 7 of 7 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Johns Island, SC We prepare classic and modern Italian dinners, pizza, and pasta. Tolli's brings Johns Island over 80 years and four generations of our family's dedication to serving the very best. Our Menu Reserve Book your Tollis Trattoria reservation below Book Now Private Events Celebrate your birthday, graduation, wedding, holiday, family events, or any kind of your big day with us. We’ll do our best to make it special! Catering Let us cater your next event Fine food is very important at any event - book catering with us and make sure people talk about your event for a long time! Call (843)-212-7893 Order Online Through Us Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "8374b5d76ca3",
      "downloadedAt": "2026-01-18T17:04:11.508Z",
      "trimmedAt": "2026-01-18T17:05:19.628Z",
      "sizeReduction": "96.6%"
    },
    {
      "url": "http://www.tollistrattoria.com/menus/",
      "text": "Main content starts here, tab to start navigating Slide 1 of 4 Slide 2 of 4 Slide 3 of 4 Slide 4 of 4 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Menus Appetizers Salads Entrees 12\" Pizzas For Take Out Pasta Subs Chubby Chub Sub Desserts Sides & Additions Drinks Catering Menu Tollis Trattoria Lunch Menu Appetizers N.Y. Style Fried Calamari Corn meal n flour dusted domestic calamari tube & tentacles fried with sliced hot cherry peppers. Served with lemon wedge & our marinara sauce 15.00 $ Garlic Pesto Knots Our pizza dough knots baked & then tossed in housemade garlicky pesto. 6 pieces per order **There are no nuts in this dish** 9.00 $ Cheezy Garlic Bread Our daily fresh made in house bread slathered with garlic butter then topped with American, mozzarella, oregano & pecorino cheeses baked til nice n cheezy, then parsley 10.00 $ Arancini's Crisp shell Risotto fritters with peas, chili pepper and pecorino cheese served on a bed of our marinara sauce topped with more grated pecorino cheese. Two to an order 9.00 $ Tollis Dam Good Bar Wings Our seasoned & floured jumbo wings deep fried and dressed with one of our buffalo or sweet & spicy Italian chili sauce. Served with either our blue cheese dressing or our ranch dressing 9.00 $ Clams Posillipo Local Clams, Garlic, Nduja, Anchovies, white wine, Grape tomato, splash of marinara, lemon zest & Grilled crostini 13.00 $ Burrata Amalfi A center cracked Burrata Ball with sliced Mortadella, pistachios, EVOO, parsley pesto and our sliced ciabatta bread 16.00 $ Focaccia of the Day House made thick airy Focaccia, dressed differently Daily, square cut & sliced. served warm 8.00 $ Soup of the Day 10.00 $ Salads Arugula Panzanella Salad Caramelized onion pizzette with burrata cheese, EVOO, cracked pepper & balsamic drizzle 16.00 $ Tre Colori Caprese Arugula, fresh mozzarella ovaline, sliced on top of vine ripe tomato, some sweet grape tomato with olive oil, parsley pesto, salt and pepper, balsamic glaze drizzle & fresh basil 14.00 $ Classic Caesar Salad Crisp romaine tossed with our housemade Caesar dressing and house made croutons, finished with shaved grana padana cheese 12.00 $ Tolli's Chopped Salad Crisp romaine, green olives, sliced hot cherry peppers, diced red onion, crisp bacon, & housemade blue cheese dressing. Red wine vinaigrette is available upon request 12.00 $ Red Beet Salad Roasted Beets, Arugula, Whipped Ricotta Cheese base, Crushed Pistachio sprinkled on top & House made Lemon Vinaigrette. 14.00 $ Entrees Main course items Chicken Milanese Our cooked to order cutlet from tenders, topped with grape tomato and arugula salad with lemon parm dressing and house pickled red onions 21.00 $ Chicken Parmigiana Our fried cutlet topped with marinara sauce & melted mozzarella served over rigatoni or linguini pasta 28.00 $ Baked Meatballs Four of our homemade beef meatballs served in marinara sauce topped with melted mozzarella cheese, fresh arugula & pickled red onions 18.00 $ Chicken Piccata Sauteed thin, floured cutlets finished in lemon butter sauce with Garlic Aioli dressed smashed fried potato 26.00 $ Salmon Lemon Thyme Skinless salmon filet, pan seared & finished in a lemon, thyme wine sauce served with salt & pepper Broccoli 27.00 $ Country Fried Pork Pork tenderloin cutlets, buttermilk marinade, floured, fried and dressed with cracked black pepper gravy served with salt & pepper Broccoli 26.00 $ N.Y. Strip Steak Frites strip steak pan seared finished with a chimichurri sauce, pecorino parsley fries and a horseradish cream dipping sauce 39.00 $ 12\" Pizzas For Take Out 12\" Pizzas Your Way Base Red or white. Add mozzarella A La Carte Toppings (Limit 5) Bacon | Pepperoni | Meatball | Sausage | Fresh Mozzarella | Fresh Tomato | Bell Pepper | Fresh Garlic | Onion | Mushroom | Arugula | Black Olive 12\" Red Mozzarella Build Your Own Apizza Classic red base with tomato sauce, oregano, mozzarella. Now comes with mozzarella 11.00 $ 12\" White Mozzarella Build Your Own Apizza Classic white base with EVOO, oregano, mozzarella. Now comes with mozzarella 11.00 $ Calzone Our dough is filled with a three cheese blend of ricotta, mozzarella & grated pecorino romano cheese, black pepper, and parsley mixture then topped with your choice of filling. The dough is folded over itself, sealed, and baked till golden. Served with a side of marinara sauce 15.75 $ 12\" New Calabrese Our Calabrese but made better. Red base, fresh mozzarella, pickled Fresno, soppressata, chili flakes, honey, pecorino & when done we add a little arugula and pickled red onion. Small change. Huge taste difference for the better! 23.25 $ 12\" Morty Mortadella White base with fresh mozzarella baked blind. Then we add fresh sliced mortadella fresh ricotta, parsley pesto, roasted pistachio & EVOO. An amazing pizza 23.00 $ 12\" Thea White a pizza with mozzarella, chopped broccoli rabe, fresh garlic, pinch of chili flakes, EVOO, pecorino and our loose Italian sausage 19.75 $ 12\" Americano White a pizza, mozzarella, fresh sliced tomato, fresh garlic, pecorino, fresh basil & parley pesto drizzle 16.75 $ 12\" BBQ Chicken White a pizza, mozzarella, chopped fried chicken, red onion, pecorino, BBQ sauce & bacon 19.25 $ 12\" Buffalo Chicken White pie with our blended Frank’s red hot special sauce, fried chicken, mozzarella cheese & pecorino 16.00 $ 12\" Estiva White a pizza with mozzarella, baked blind then dressed with arugula, chopped tomato, shaved Parmigiano cheese, drizzled with our lemon parm dressing and finished with sliced prosciutto di parma 16.75 $ 12\" Margharita Plain tomato sauce, our fresh mozzarella, fresh basil, pecorino & E.V.O.O. this is the a pizza made to honor queen Margherita of Italy. Hence the name... also the pizza was to symbolize the Italian flag colors 16.75 $ 12\" Marios This white a pizza is unique. White base with crumbled goat cheese, caramelized onions, ground pistacchio nuts, honey, olive oil and finished with truffle oil when it comes out of oven. You can also add fresh fruit as an option 17.50 $ 12\" Nonno Our red sauce base, mozzarella, oregano, fresh garlic, loose Italian sausage, pecorino and fresh sliced mushrooms 16.25 $ 12\" Shrimp Arugentine White pizza with mozzarella, shrimp, garlic baked then dressed with fresh arugula, chopped tomato, lemon Parmigiani dressing, pecorino and shaved grana Padana cheese 24.00 $ 12\" Shrimp Scampi A white pizza with oregano, mozzarella, fresh shrimp, fresh garlic, lemon parm dressing, sliced grape tomato, fresh parsley, pecorino, EVOO and baked until crisp and golden 22.75 $ 12\" Tonino's White base, mozzarella, ham, mushrooms, caramelized onions, hot cherry peppers, pecorino, & EVOO 21.50 $ 12\" Shrimp Pesto White base, mozzarella, garlic, shrimp, pesto, pecorino, oregano & EVOO 20.25 $ 12\" Porchetta & Rabe White base, mozzarella, porchetta, broccoli rabe, garlic, pesto & EVOO 21.25 $ 12\" Scampi Casino White, mozzarella, shrimp, garlic, lemon parm dressing, sliced grape tomato, roasted peppers, fresh parsley, pecorino & bacon 25.75 $ 12\" Nutty Cannoli White pizza shell baked blind, then topped with Nutella spread, crumbled cannoli shells, cannoli cream and chocolate chips 19.25 $ 12\" N.Y. Steakbomb white pizza, American, Mozzarella, mushrooms, onions, garlic, shaved steak & hot cherry peppers 19.75 $ 12\" chicken Supreme White pizza, mozzarella, chopped chicken cutlet, spinach, red onions, garlic, bacon & Bread Crumb 20.00 $ 12\" Eggplant Deluxe Red pizza, mozzarella, spinach, eggplant, ricotta, garlic, pecorino & EVOO 18.50 $ 12\" Broccoli & Sausage White pizza, mozzarella, broccoli, housemade sausage, garlic, ricotta & pecorino 19.50 $ Pasta Linguini Puttanesca Tomato base with Kalamata and green olives, anchovy, garlic, capers, Fresno, shallots tossed with linguini pasta and finished with fresh parsley. An old-school Italian staple 25.00 $ Linguini Shrimp Provencal Grape tomato sauteed with shallots, garlic, EVOO, white wine, pepper flakes, with shrimp & shrimp stock, tossed with linguini pasta 28.00 $ Shrimp Fra Diavolo Sauteed Shrimp In Our Marinara With Added Chili Flakes to spice it up Fra Diavolo Style. 27.00 $ Pasta Marinara & Meatball Either Penne or Linguini tossed with our Marinara Sauce, Topped with two of our all Beef Meatballs finished with Pecorino & EVOO. 22.00 $ Penne Alla Vodka Bacon, shallots, sweet peas, & Fresno chilis sautéed & tossed with Penne Rigate pasta in a vodka cream sauce & finished with grated pecorino 24.00 $ Pesto Cream Gnocchi Our housemade ricotta gnocchi tossed with traditional basil pesto & a touch of cream. Finished with pecorino Romano cheese & olive oil drizzle. **There are nuts in this dish** 27.00 $ Linguine Alle Vongole Bianco Linguine and fresh pasta neck local clams in their shells, sautéed with garlic, shallot, & fresno peppers. Finished with fresh parsley 28.00 $ Pasta Marinara Either Penne Rigate or linguini tossed with our marinara sauce finished with pecorino & EVOO 14.00 $ Gnocchi Sorrentino Housemade ricotta gnocchi, tossed with our marinara sauce and finished with fresh mozzarella, fresh basil and pecorino cheese 26.00 $ Fettucine Alfredo Egg noodle fettuccine pasta tossed with an alfredo sauce of cream, butter, nutmeg and pecorino cheese dusted with fresh cracked black pepper 20.00 $ Pasta Rose' Either penne or linguine pasta with our house marinara and a touch of cream tossed with fresh basil & pecorino 20.00 $ Pappardelle alla Bolognese Traditional beef Bolognese served with house made pappardelle tossed with pecorino Romano grated cheese and finished with Spanish EVOO 27.00 $ Cavatelli Rabe House made Ricotta Cavatelli with sauteed rabe, house made sausage, pecorino, chili flakes, butter, vegetable stock & EVOO. 28.00 $ Subs Meatball Parm Nonna's famous meatballs with our pomodoro sauce baked on our housemade bread with melted mozzarella & grated cheese 15.00 $ Chicken Parm Chicken cutlets, hand-pounded & fried to order then dressed with our pomodoro sauce and mozzarella and pecorino cheeses. Served on our toasted italian bread 15.00 $ Italian combo Chubby Chub Sub Mortadella, Genoa salami, provolone cheese, baby gem lettuce, oil & vinegar, oregano & sliced tomato 15.00 $ Pepperoni Parm Our fresh baked bread is layered with pepperoni, mozzarella cheese, and our famous pomodoro sauce. Toasty and melty and delicious! 15.00 $ Caprese Chubby Chub Sub Fresh mozzarella, tomato, fresh basil, arugula, parsley pesto, balsamic glaze, EVOO on our housemade bread 15.00 $ Chicken Cutlet Chubby Chub Sub Our crunchy & juicy chicken tender cutlets are fried, sliced, and placed on our housemade bread with mayo, romaine, tomato, salt n pepper & white American cheese. A cold sub 15.00 $ Buffalo Chicken Cutlet Chubby Chub Sub Crispy juicy fried tenders sliced and dressed with our buffalo sauce, Romaine, blue cheese dressing & pickled red onions 15.00 $ N.Y. Steak Bomb Chubby Chub Sub Shaved steak, sautéed in garlic butter, mushrooms, onions then put in our bread with sliced hot cherry peppers and toasted with white American cheese The Bomb!! (*Served until 3pm only!) 15.00 $ Muffuletta Chubby Chub Sub Bread with EVOO, parsley pesto, ham, soppressata, provolone cheese, mozzarella cheese, olive tapenade and mortadella 15.00 $ Porchetta & Rabe Chubby Chub Sub Our bread with sliced pork belly porchetta, parsley pesto, sautéed rabe and provolone. Toasted 15.00 $ Morty Chubby Chub Sub EVOO, Olive Tapenade, Mortadella, Fresh Mozzarella, Pickled Red Onions 15.00 $ Italian Trio Chubby Chub Sub Vinaigrette, Olive Tapenade, Greens, Cotto Ham, Mortadella, Soppressata, Vine Ripe Tomato, Oregano & Provolone 15.00 $ Royal Caprese Chubby Chub Sub Parsley Pesto, EVOO, Arugula, Prosciutto, Fresh Mozzarella, Vine Ripe Tomato, Fresh Basil & Balsamic Glaze. 19.00 $ Lil Taliano Olive Tapenade, Vinaigrette, Cotto Ham, Soppressata, Greens, Fresh Mozzarella. 15.00 $ The Medi Burrata, Vine Ripe Tomato, Greens, Olive Tapenade, EVOO, Balsamic Glaze. 15.00 $ Desserts Changes often, check with order taker or waitstaff Cheesecake Of The Day, Call To Find Out What Flavor 12.00 $ Peanutbutter & Reeses Chunk Cookies 3.95 $ Assorted Gelati Flavors & Sorbetto 4.00 $ TRIPLE CHIP CHOCOLATE CHIP COOKIES 3.95 $ TWO Small Cannoli 6.00 $ Nonna Pina Makes an Assortment of Different Desserts, Changes Daily From Carrot Cakes, Chocolate Cakes, Ricotta Cakes, French Apple Cakes, etc 11' Whole Cheese Cake (Three Day Advance Notice To Order) 120.00 $ 9\" Whole Three Layer Cake (3 Day Advance Notice To Order) 85.00 $ GELATI Espresso Gelato 1 scoop/ 4.00 $ Pistachio Gelato 1 scoop/ 4.00 $ Mixed Berry Sorbet 1 scoop/ 4.00 $ Sea Salt Caramel Gelato 1 scoop/ 4.00 $ Chocolate Gelato 1 scoop/ 4.00 $ Hazelnut Gelato 1 scoop/ 4.00 $ Sides & Additions Side Bread Butter & EVOO Our housemade ciabatta bread sliced & served with butter & EVOO 5.00 $ 7 Grilled Shrimp Fresh local shrimp seasoned with salt & black pepper lightly grilled and added to your salad of choice 9.00 $ Single Meatball Housemade all beef meatball with marinara sauce & grated pecorino cheese 4.00 $ Side Chicken Cutlet Our jumbo tender cutlet fried to order for pasta or salad of your choice 6.00 $ Single Burrata Ball Fresh mozzarella ball with stracciatella cheese center 6.00 $ Side EVOO Imported first cold pressed extra virgin olive oil 1.00 $ Side Blue Cheese Dressing Our housemade Danish blue cheese dressing, 2.5 oz 1.75 $ Side Grated Cheese D.O.P. Pecorino Romano genuine, sheep's milk cheese, cut fresh, dried and grated in house 1.00 $ Side of Crushed Red Pepper Flakes Dried crushed chili pepper flakes 0.25 $ Side Marinara Sauce Our fresh housemade marinara, 2.5 oz 1.00 $ Couple of Meatballs Two of our all beef housemade meatball with marinara sauce & pecorino cheese 8.00 $ Side Grilled Chicken Jumbo tender lightly seasoned with salt & pepper olive oil and grilled, to add to a salad or pasta 5.00 $ Side Of Fries Our lunch fries with salt & side of ketchup 5.00 $ Single Ovaline Fresh Mozzarella Fresh ovaline mozzarella cheese ball, added to your item 4.00 $ Side of Extra Vinaigrette Dressing 1.00 $ Side of Extra Lemon Parm Dressing 1.00 $ Side Extra Ranch Dressing 1.00 $ Italian Sautéed Greens Chef's choice of available greens sautéed with fresh garlic, chili pepper flakes, anchovies and spices & finished with extra virgin olive oil 9.00 $ Side Bread, EVOO & Butter Our housemade bread sliced and served with butter & EVOO, that's it 5.00 $ Drinks Cocktails & wines Cocktails Amber Negroni Gin, Braulio Amaro, Cocchi Americano, lemon, rosemary 13.00 $ Black Manhattan Knob Creek Rye, Averna Amaro, walnut bitters, orange zest 13.00 $ Aperol Spritz Aperol, Prosecco, seltzer & an orange slice on ice 11.00 $ Old Fashioned Bourbon, bitters, sugar, orange zest & maraschino cherry over large cube 14.00 $ Tolli Bellini Alberto Nani Prosecco & white peach puree, fresh basil in a flute 13.00 $ Sgroppino Al Limone Lemon sorbetto, prosecco float, Wheatly Vodka, slice of lemon and mint martini glass 13.00 $ Rose' Pina Homemade Orangecello, Carolina Reaper Vodka, Pasubio Amaro, Pineapple & Rose' Prosecco 14.00 $ Big Ant's Manhattan MAKERS MARK BOURON, NONINO AMARO, SWEET VERMOUTH, ANGOSTURA BITTERS & CHERRY 16.00 $ The Ringmaster Blanco Tequila, Grand Marnier, Lime, Pineapple & Coconut Cream with Nutmeg. 13.00 $ The Efficiency Expert White Rum, Homemade Limoncello, Lime, Angostura Bitters, Simple Syrup, Fresh Mint & Club Soda. 13.00 $ The Odd Man Bulleit Bourbon, Grapefruit, Campari, Lemon & Simple Syrup. 14.00 $ The Zinger Hendrick's Gin, Cocchi Americano, Lemon, Simple Syrup, Cardamon Lemongrass Bitters, Orange Bitters & Prosecco. 15.00 $ The Throwback Jameson, Sweet Vermouth & Fontbonne Herbal Liqueur with Orange Essence. 11.00 $ The Sass Bourbon, Demerara Simple Syrup & Lemon with Lambrusco Wine Float. 11.00 $ The Aficionado Casamigos Anejo Tequila, Agave Syrup, Angostura & Orange Bitters with Cherry. 17.00 $ The Stark & Dormy White Rum, Goslings Rum, Bergamot Black Tea, Allspice Bitters, Lime & Ginger Beer. 11.00 $ The Ingenue Blanco Tequila, Fontbonne Herbal Liqueur, Passionfruit Puree & Lime. 11.00 $ The Go- Getter Muddled Fresh Strawberries & Basil, Gin Mare', Lillet Blanc & Lemon Served Up, Topped with Prosecco & Fresh Basil. 14.00 $ The Nightcap Grappa, Strega, Orange & Lemon. 15.00 $ The Cherry on Top Vodka, Borghetti, Nonino Amaro, Sherry, Simple Syrup & Cherry. 12.00 $ Fiora D' Amalfi White Rum, Limoncello, Elderflower Liqueur & Lemon. 14.00 $ Espresso Martini Vodka, Borghetti, Espresso. 12.00 $ Mocha Martini Van Gogh Double Espresso Vodka, Licor 43 Chocolate Liqueur, Espresso. 13.00 $ Brown Sugar Walnut old Fashioned Templeton Rye, Demerara Simple Syrup, Black Walnut Bitters. 13.00 $ Wines Sparkling & Rose Prosecco, Nino Arvedi Veneto, Italy NV Gls/ 9.00 $ BTL/ 32.00 $ Rosé, Prosecco, \"Ca Di Rajo\" Brut Veneto, Italy NV GLS/ 13.00 $ BTL/ 48.00 $ Moscato Sicilia, Cantine Pellegrino Sicily, IT GLS/ 9.00 $ BTL/ 32.00 $ Lambrusco, \"LINI 910\" Emilia Romagna, Italy NV GLS/ 10.00 $ BTL/ 36.00 $ Champagne, Laurent Perrier Brut Rose' France 144.00 $ Whites House White, Bonizio Italian White Blend GLS/ 9.00 $ Sauvignon Blanc, Sea Pearl Marlborough, New Zealand 2021 GLS/ 10.00 $ BTL/ 36.00 $ Sauvignon Blanc, Sager & Verdier Loire Valley, FR BTL/ 49.00 $ Pinot Grigio, Antonutti Friuli, Italy GLS/ 13.00 $ BTL/ 48.00 $ Chardonnay, Mer Soleil Monterrey, CA GLS/ 13.00 $ BTL/ 48.00 $ Chardonnay, Ferrari Carano Russian River Valley, California BTL/ 66.00 $ Chardonnay, Rombauer Carneros, CA BTL/ 70.00 $ Reds House Red, Bonizio Italian Red Blend GLS/ 9.00 $ Pinot Noir, \"Calatroni\" Lombardy,IT GLS/ 10.00 $ BTL/ 36.00 $ Chianti Classico , Castello di Bossi Tuscany, Italy GLS/ 12.00 $ BTL/ 24.00 $ Super Tuscan, Trambusti Tuscany, Italy GLS/ 11.00 $ BTL/ 40.00 $ Montepulciano d'Abruzzo, Zaccagnini Abruzzo, Italy GLS/ 12.00 $ BTL/ 44.00 $ Corvina, Baby Amarone- Tinazzi Veneto, Italy GLS/ 13.00 $ BTL/ 48.00 $ Cabernet Sauvignon, Broadbent North Coast, CA GLS/ 12.00 $ BTL/ 44.00 $ Zinfandel, Saldo, The Prisoner Wine Co. Napa Valley, California BTL/ 57.00 $ Barolo, Damilano “Lecinquevigne” Piedmont, Italy BTL/ 75.00 $ Grenache Blend, Dept. 66, \"Others\" Languedoc-Roussillon, France BTL/ 60.00 $ Red Blend, 8 Years In Th e Desert California BTL/ 85.00 $ Barolo, Broccardo Piemonte, Italy BTL/ 90.00 $ Amarone Della Valpolicella, \"Tinazzi\" Veneto, Italy BTL/ 90.00 $ Chianti Classico, \"Arcena\" Italy BTL/ 54.00 $ Super Tuscan, \"Fabio Motta\" Bolgheri Rosso,Italy BTL/ 90.00 $ Super Tuscan, Pietro Nova Bolgheri Rosso, IT BTL/ 120.00 $ Red Blend, Papillon, Orin Swift Napa,CA BTL/ 140.00 $ Fortified \"Florio\", Marsala- Vecchio & Dolce Italy 12.00 $ Grahams- Reserve 6 Grape 12.00 $ Sandeman- Fine Tawny Porto 8.00 $ Catering Menu View our catering menu below, then contact us at the restaurant to make an order! Appetizers Dough Knots Our dough tied baked and dressed (30 piece / order) Antipasti Mortadella, coppa, Genoa salami, artichoke, giardiniera, roast pepper, grana padano, sharp provolone and fontina Eggplant Rollatini We grill & marinate our sliced eggplant then stuff & roll with ricotta, mozzarella, pecorino & herbs. Then top with sauced, and baked (22 piece) Italian Housemade Sausage Peppers & Onions Our housemade mild sausage links, roasted, sliced then tossed with oven roasted peppers, sautéed onions together with a touch of marinara sauce fresh parsley and finished with grated pecorino Grilled Vegetables We grill sliced, onion, eggplant, green & yellow zucchini, colored peppers and then dress with a vinaigrette, fresh mint, fresh parsley and Spanish EVOO to finish Tollis Rosemary Roasted Potato Take peeled potato, quarter lengthwise, then oil, fresh rosemary, salt, pepper, garlic and roast til crisp on outside but moist inside Golden Moist Fried Jumbo Wings Jumbo wings, flats & drums, floured with house seasonings, fried til crisp and moist, then dressed with sauce of choice. Dry, Italian sweet & spicy, BBQ, or our buffalo sauce Cream Cheese and Crab Stuffed Mushrooms We use leg and claw crab meat together with cream cheese, herbs and seasonings, mix together and fill caps then top with panko, butter and bake Sausage And Herb Stuffing, Stuffed Mushrooms We do a sausage and mushroom mix, sauté with garlic and shallots then add some moistened bread with chicken stock to make a dressing then put into caps and bake Chicken Chicken Marsala Mushroom, marsala, butter with floured tenders Chicken Picatta Traditional lemon caper piccata sauce with sauteed floured tenders finished with sliced lemon wheels and fresh parsley. Can add penne pasta as an add on option, finished in same lemon caper piccata sauce Chicken Parmigiano Our cutlets fried then layered on sauce then topped with more sauce, mozzarella and pecorino cheese, then baked til cheese just melts. You can order it over penne that is finished in a bechamel sauce under chicken for a nice twist Chicken Francese Our cutlets, floured dredged, egg-dipped, sautéed with a lemon butter and white wine sauce Chicken Al Forno Leg & thigh meat baked with onions, peas, garlic, rosemary & potato. On the bone, old school Italian Fish Selection Scrod Oreganato Filets of scrod seasoned with salt, pepper, crushed red pepper flakes, oregano, sliced green & Kalamata olives, crushed tomato, white wine, parsley & EVOO & a cracker panko crumb. Baked to perfection Baked Stuffed Filet Of Sole We take a good size filet of sole line it with herbs, crab meat, and a light cracker crumb filling, roll it up bake and dress with a meuniere sauce to finish Salads House Chop Salad Romaine, grape tomato, diced red onion, sliced cherry peppers, sliced green olives, crisp bacon crumble & house vinaigrette Caesar Salad Housemade croutons, shaved grana padano finished with our housemade dressing. You can add grilled chicken tenders seasoned with herbs, grilled, sliced, and dressed Pasta Baked Penne Meatball crumbles, ricotta, mozzarella, pecorino house tomato sauce, and parsley tossed with pasta and baked crispy Penne Vodka Our house vodka cream sauce, made with onion, bacon, peas, marinara and pecorino, tossed with penne pasta & finished with fresh pecorino cheese Manicotti Di Tolli Light egg noodle, housemade and rolled with ricotta, pecorino, pepper, mozzarella then topped with our marinara sauce then baked (12 piece minimum) Penne Rigate Marinara Our plain marinara sauce tossed with penne rigate to hold the sauce and finished with fresh basil and pecorino cheese. You can add housemade beef meatballs Italian Macaroni & 3 Cheese Traditional elbow pasta tossed with our three cheese bechamel sauce, then we add panko chip crumb and bake. You can add shrimp or lobster meat to make it special Tollis Lasagna (Vegetable or Meat) Our egg noodle pasta sheet five layers with ricotta, mozzarella, herbs and seasonings together with either crumbled meatballs or veggies consisting of broccoli, spinach, slice tomato and roasted portobello with ricotta, mozzarella, marinara sauce and baked off Desserts Biscotti Cannoli Nonna Pina 11\" Whole Cheesecakes 120.00 $ Gourmet Fresh Baked 4.5 Ounce Jumbo Cookies Triple chocolate chip cookies, Reese's chunk cookies Lunch Menu Served from 11:00 am to 3:00 pm. Dine-in or take-out Appetizer NY Fried Calamari 14.00 $ Garlic Knotz 9.00 $ Cheesey Garlic Bread 10.00 $ Arancini 9.00 $ Tollis Dam Good Bar Wings 9.00 $ Burrata Amalfi 14.00 $ Fresh Mozzarella Caprese 13.00 $ Lunch Chubby Chub Subs The Medi Burrata, tomato, greens, olive tapenade, hot pepper marmalade & balsamic glaze 15.00 $ Porchetta / Rabe Pesto, broccoli rabe, porchetta, melted provolone & EVOO 15.00 $ Lil Italiano Salami, sopressata, hot pepper spread, greens, fresh mozzarella, vinaigrette 15.00 $ Royal Caprese Prosciutto, fresh mozzarella, tomato, pesto, balsamic glaze, arugula, basil & EVOO 15.00 $ Miggy Mortadella, fresh mozzarella, hot pepper marmalade, pickled red onion 15.00 $ Combo Mortadella, salami, greens, tomato, vinaigrette & provolone 15.00 $ Trio Ham, mortadella & salami, greens, tomato, vinaigrette & provolone 15.00 $ Our Muffaletta Hot pepper marmalade, olive tapenade, ham, salami, mortadella, mayo & provolone 15.00 $ Chicken Parm Chicken cutlet, marinara, Melted mozzarella, pecorino 15.00 $ Meatball Parm Meatballs, marinara, melted mozzarella, pecorino 15.00 $ Buffalo Chicken Chicken cutlet, mayo, buffalo sauce, American cheese, pickled red onions, greens 15.00 $ Chicken Cutlet Chicken cutlet, mayo, greens, tomato, American cheese 15.00 $ NY Steak Bomb Shaved steak, sautéed mushrooms, onions, in a garlic butter & hot cherry peppers, toasted with American cheese 15.00 $ Lunch Mains Chicken Picatta 22.00 $ Chicken Milanese 21.00 $ Lunch Pastas Linguini Putanesca Marinara, Kalamata olives, anchovy, shallots, Fresno chili & garlic 19.00 $ Bucatini Nocciole Aglio & Olio Toasted hazelnuts, garlic, chili flakes, EVOO, pasta water and fresh parsley Fettucine Estate' Egg fettucine, lemon, parsley, anchovy, grape tomato, butter & toasted breadcrumb 18.00 $ Rigatoni Cacio e' Pepe Pecorino cheese, parmigiano reggiano cheese, cracked black pepper & pasta water to cream sauce 18.00 $ Linguini Sugo Al' Amatriciana Guanciale sautéed, wine, crushed tomato, pecorino Romano cheese tossed with linguini 19.00 $ Lunch Salads Chop Salad 12.00 $ Arugula Panzanella 14.00 $ Classic Caesar 12.00 $ Roast Beet Salad 14.00 $ Salad Dressing & Additions House Vinaigrette House Blue Cheese Dressing House Caesar Balsamic House Lemon Vinaigrette Grill Shrimp Add-On 9.00 $ Grill Chicken Add on 5.00 $ Chicken Cutlet Add-On 6.00 $ Burrata Add-On 6.00 $ Handwich combos come with choice of one side Lunch Handwich Combo Combo Cup of Soup Combo Side Arugula Salad Combo Side Fries Combo Bag of Chips Handwich Lil Italiano Salami, sopressata, hot pepper marmalade, greens, fresh mozzarella, vinaigrette 12.50 $ Handwich Royal Caprese Prosciutto, fresh mozzarella, tomato, pesto, balsamic glaze, arugula, basil & EVOO 12.50 $ Handwich Miggy Mortadella, fresh mozzarella, hot pepper marmalade, pickled red onion 12.50 $ Handwich Combo Mortadella, salami, greens, tomato, vinaigrette & provolon 12.50 $ Handwich Trio Ham, mortadella & salami, greens, tomato, vinaigrette & provolone 12.50 $ Handwich Muffaletta Hot pepper marmalade, olive tapenade, ham, salami, mortadella, mayo & provolone 12.50 $ Handwich Chicken Parm Chicken cutlet, marinara, melted mozzarella, pecorino 12.50 $ Handwich Meatball Parm Meatballs, marinara, melted mozzarella, pecorino 12.50 $ Handwich Buffalo Chicken Chicken cutlet, mayo, buffalo sauce, American cheese, pickled red onions, greens 12.50 $ Handwich Chicken Cutlet Chicken cutlet, mayo, greens, tomato, American cheese 12.50 $ Call (843)-212-7893 Order Online Through Us Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "a4fb56bef724",
      "downloadedAt": "2026-01-18T17:04:12.143Z",
      "trimmedAt": "2026-01-18T17:05:19.739Z",
      "sizeReduction": "88.9%"
    }
  ],
  "sizeReduction": "90.3%"
}