{
  "venueId": "ChIJjavPXG1x_ogRYUM4qK0SDRE",
  "venueName": "Mainland Container Co. Kitchen & Bar",
  "venueArea": "Mount Pleasant",
  "website": "https://mainlandcontainerco.com/",
  "scrapedAt": "2026-01-18T17:04:28.952Z",
  "trimmedAt": "2026-01-18T17:11:33.822Z",
  "pages": [
    {
      "url": "https://mainlandcontainerco.com/mount-pleasant-mainland-container-co-kitchen-and-bar-happy-hours-specials",
      "text": "Specials We are updating our specials Please stay tuned",
      "hash": "291bfa22386f",
      "downloadedAt": "2026-01-18T16:56:49.314Z",
      "trimmedAt": "2026-01-18T17:11:33.789Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "https://mainlandcontainerco.com/mount-pleasant-mainland-container-co-kitchen-and-bar-events",
      "text": "Events Mainland Container Oyster Roast! Sunday January 18th Sundays and Saturdays every week $21 Buckets of oysters - 12-4pm every Saturday & Sunday! We'll have oysters grilling, sports on the big screens & live music! 04:00 PM - 06:00 PM 2026-01-18 16:00:00 2026-01-18 18:00:00 America/New_York Mainland Container Oyster Roast! $21 Buckets of oysters - 12-4pm every Saturday & Sunday! We'll have oysters grilling, sports on the big screens & live music! Mainland Container Co Kitchen & Bar Mainland Container Co Kitchen & Bar info@mainlandcontainer.com Hans Solo Sunday! Sunday January 18th Every Sunday Sunday Funday with Hans Solo! Another Hans Solo Sunday is among us! Come join us for live music and amazing weather!! Show starts at 5pm on the patio stage! #HansSoloSunday #mainlandcontainerco 05:00 PM - 08:00 PM 2026-01-18 17:00:00 2026-01-18 20:00:00 America/New_York Hans Solo Sunday! Sunday Funday with Hans Solo! Another Hans Solo Sunday is among us! Come join us for live music and amazing weather!! Show starts at 5pm on the patio stage! #HansSoloSunday#mainlandcontainerco Mainland Container Co Kitchen & Bar Mainland Container Co Kitchen & Bar info@mainlandcontainer.com",
      "hash": "5aced2291855",
      "downloadedAt": "2026-01-18T16:56:49.922Z",
      "trimmedAt": "2026-01-18T17:11:33.792Z",
      "sizeReduction": "98.2%"
    },
    {
      "url": "https://mainlandcontainerco.com/mount-pleasant-mainland-container-co-kitchen-and-bar-drink-menu",
      "text": "Our Drinks Beer & Seltzer Wine",
      "hash": "8224bb481f0d",
      "downloadedAt": "2026-01-18T16:56:48.737Z",
      "trimmedAt": "2026-01-18T17:11:33.795Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "https://mainlandcontainerco.com/",
      "text": "Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! Job Listings Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! navigation logo 1528 Ben Sawyer Blvd, Mount Pleasant, SC 29464 map marker pin About us Our Vision Our vision is to be a local restaurant that serves better than your average bar fare and provide exceptional customer service. We strive every day to bring you quality, fresh food, at affordable prices, and some of the best guest services in the Lowcountry! Read more about us About us Restaurant & Bar Meet the Team Owner Harris Khan is a veteran of the food & beverage industry. His belief that hospitality should be the driving force behind any restaurant, combined with his passion for food, is the backbone of the business model for Mainland Container Co. Read more about our team Specials We are updating our specials Please stay tuned Reviews review by - Yelp Blake F: What a fun place! They have a big beautiful bar and cute bartenders. Plenty of seating inside and out. I can't wait for them to be completely done renovating the outside! they have so much room to make such a great space to hang out at! Food is also outstanding! I'll definitely be back here hanging out. review by - Yelp Kate R: Lovely spot for a beer and burger! The outdoor seating is awesome! Little on the buggy side being so close to the marsh, but Mainland Container has citronella candles, bug spray and fans to help ease the little pesky flies! Beer is cold, burgers and fish are on point, and the service was attentive and courteous. And... they are pet friendly... this is our new go-to spot! review by - Yelp Diego R: The shrimp and grits was amazing. Shrimp tacos were delish, as were the hush puppies. The servers were very attentive. Food was hot. Drinks were cold and served fast. Venue is quaint, but its not cheap. But it is worth the price. review by - Yelp Kalea E: A group of friends and I tried this for Sunday brunch (as everything else in town and downtown had over an hour long wait) and we were VERY impressed! Awesome tater tots and brunch specials at reasonable prices! Very friendly service and fun shipping container downstairs! Highly recommended! review by - Yelp Matthew G: Great spot and great staff. Food is above average bar food, solid burgers and great duck fat fried tator tots. Outdoor patio has a nice coastal breeze. The converted shipping container to a bar is a nice touch. Newsletter Location 1528 Ben Sawyer Blvd Mount Pleasant, SC 29464 Hours NOW OPEN for LUNCH! The Pickled Palate @ Mainland serving lunch upstairs, Wednesday-Saturday! Kitchen Hours: Wednesday | 11am-3pm, 4pm-9pm Thursday | 11am-3pm, 4pm-9pm Friday | 11am-3pm, 4pm-10pm Saturday | 11am-3pm, 3pm-10pm Sunday | 11am-9pm Bar Hours: open late daily, midnight on weekends Find us on... SpotHopper page Facebook page Instagram page Contact us (843)-936-6718 info@mainlandcontainer.com Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "8bf11dc23ef7",
      "downloadedAt": "2026-01-18T16:56:48.078Z",
      "trimmedAt": "2026-01-18T17:11:33.809Z",
      "sizeReduction": "98.2%"
    },
    {
      "url": "https://mainlandcontainerco.com/mount-pleasant-mainland-container-co-kitchen-and-bar-about",
      "text": "Meet The Team Owner Harris Khan is a veteran of the food & beverage industry. His belief that hospitality should be the driving force behind any restaurant, combined with his passion for food, is the backbone of the business model for Mainland Container Co. Dot slide navigation number 1 Dot slide navigation number 2 Dot slide navigation number 3 Meet The Team Owner Harris Khan is a veteran of the food & beverage industry. His belief that hospitality should be the driving force behind any restaurant, combined with his passion for food, is the backbone of the business model for Mainland Container Co. About us Our vision is to be a local restaurant that serves better than your average bar fare and provide exceptional customer service. We strive every day to bring you quality, fresh food, at affordable prices, and some of the best guest services in the Lowcountry! Contact us: (843)-936-6718, by phone info@mainlandcontainer.com by email",
      "hash": "8d80da4b17c3",
      "downloadedAt": "2026-01-18T16:56:50.507Z",
      "trimmedAt": "2026-01-18T17:11:33.815Z",
      "sizeReduction": "98.6%"
    },
    {
      "url": "https://mainlandcontainerco.com/mount-pleasant-mainland-container-co-kitchen-and-bar-about#",
      "text": "Meet The Team Owner Harris Khan is a veteran of the food & beverage industry. His belief that hospitality should be the driving force behind any restaurant, combined with his passion for food, is the backbone of the business model for Mainland Container Co. Dot slide navigation number 1 Dot slide navigation number 2 Dot slide navigation number 3 Meet The Team Owner Harris Khan is a veteran of the food & beverage industry. His belief that hospitality should be the driving force behind any restaurant, combined with his passion for food, is the backbone of the business model for Mainland Container Co. About us Our vision is to be a local restaurant that serves better than your average bar fare and provide exceptional customer service. We strive every day to bring you quality, fresh food, at affordable prices, and some of the best guest services in the Lowcountry! Contact us: (843)-936-6718, by phone info@mainlandcontainer.com by email",
      "hash": "9b18f1d902f8",
      "downloadedAt": "2026-01-18T16:56:51.113Z",
      "trimmedAt": "2026-01-18T17:11:33.819Z",
      "sizeReduction": "98.6%"
    },
    {
      "url": "https://mainlandcontainerco.com/mount-pleasant-mainland-container-co-kitchen-and-bar-food-menu",
      "text": "Our Menu Dinner | Mainland Container Lunch | The Pickled Palate",
      "hash": "a40efbaba1ac",
      "downloadedAt": "2026-01-18T16:56:48.154Z",
      "trimmedAt": "2026-01-18T17:11:33.822Z",
      "sizeReduction": "99.9%"
    }
  ],
  "sizeReduction": "98.9%"
}