{
  "venueId": "ChIJ3QSqBQCL_ogRGg2gDqJRYcw",
  "venueName": "Thailicious Thai Cuisine and Hotpot",
  "venueArea": "West Ashley",
  "website": "http://thailiciousthaiwestashley.com/",
  "scrapedAt": "2026-01-18T17:04:23.449Z",
  "trimmedAt": "2026-01-18T17:04:53.466Z",
  "pages": [
    {
      "url": "http://thailiciousthaiwestashley.com/charleston-west-ashley-thailicious-thai-cuisine-and-hotpot-drink-menu",
      "text": "Our Drinks Soft Drinks Beer Wine",
      "hash": "75374abeb439",
      "downloadedAt": "2026-01-18T17:04:01.341Z",
      "trimmedAt": "2026-01-18T17:04:53.447Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://thailiciousthaiwestashley.com/charleston-west-ashley-thailicious-thai-cuisine-and-hotpot-food-menu",
      "text": "Our Menu Menu",
      "hash": "a6e8ec75a61d",
      "downloadedAt": "2026-01-18T17:04:00.694Z",
      "trimmedAt": "2026-01-18T17:04:53.450Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://thailiciousthaiwestashley.com/",
      "text": "× Let us host your special event! Whether a birthday party, office function or any other special occasion - we take care of all the fine details, bringing your event to life, just as you imagined. Host your next party or get together Book your party × Did you know we do catering? Whatever your occasion, however big or small, we have the perfect options to choose from. Cater your birthday party, holiday party, corporate events, wedding festivities and more! Catering Packages Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! Job Listings Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! West Ashley location 1975 Magwood Drive Unit T, Charleston, SC 29414 Visit us at map marker pin Groups & Parties Book your next party with us Create memories to last a lifetime with our personalized private party options. Let our team help you plan an unforgettable celebration. Parties Catering Let us cater your next event Trust us to cater your special day with our delectable and exquisite offerings, from appetizers to entrees, and desserts, we have got everything to make your event a success. Catering Order online Pick up your favorite food Pick-up & Delivery are available during Open Hours Order now Various food on the table Thai Iced Matcha Green Tea Crab Rangoon Thai Boat Noodle Soup, with pork, beef, bean sprouts, scallions,... Red curry with coconut milk, bell peppers, bamboo shoots, basil, and... Shrimp Pad Thai Chicken Satay, served with peanut sauce, and salad Pad Thai, with shrimp, noodles, egg, bean sprouts, scallions, and... Mango Sticky Rice Fried rice, with chicken, and mixed vegetables Assorted Iced Teas Crab Rangoon, Spring Rolls, and Curry Poppers Mango Sticky Rice dessert Chicken and veggie fried rice Reservations Secure your spot Click the button below to make a reservation Book a table Reviews Start stop reviews carousel Google reviews Leysha J: five star review by We did an order pickup for Yellow Curry, Pad Thai, Wings and the Curry Poppers and it was all fantastic. I am blown away by how good everything was. The yellow curry was amazing and the wings were my favorite. My husband loved the pad Thai and the curry poppers. I cannot wait to visit again. Google reviews Hazel C. A: five star review by This is my second time here in a week. This time I brought my husband. We ordered the Thai boat soup and the red curry. Both dishes were exquisite and had plenty of meat. You can request the level of spice in your dish. They provide a tray of spices and seasonings on the side and their chili oil was amazing. We were extremely happy with the quality and quantity of food. Google reviews Jonathan S: five star review by The best Thai food I've ever had. From the first bite onward my taste buds were in ecstasy. I got the Cashew chicken. From the peppers to the wonderful flavor of the chicken to the bites of pineapple and rice and cashews... Every flavor flowed together well. I recommend. Google reviews Erin B: five star review by Delicious food, very attentive and kind service (from the owner) and good ambiance. So glad to have great Thai food nearby! And they understand their ingredients, and most of the menu is or can be gluten free. Tried 1 app, 3 dishes, Thai tea and a yummy sticky mango rice and am quite confident I will have Thai way too often now. Google reviews Rachel F: five star review by Love, love, love this restaurant! I mostly get take out but have eaten inside quite a few times as well and the ambiance is awesome. It's very well decorated and just such a cute little spot. The food is definitely some of the best Thai I've had in Charleston. They have multiple levels of spice which is nice and very nice portions, but mostly the flavors and variety of things to choose from are just awesome! Newsletter Location 1975 Magwood Drive Unit T Charleston, SC 29414 Hours Monday-Friday 11am-3pm and 4:30pm-9pm Sat-Sun 12-9 pm Find us on... Google page Contact us (843)-501-7167 Call us at jirasak025@gmail.com Write us at Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "da53caefdcd6",
      "downloadedAt": "2026-01-18T17:04:00.585Z",
      "trimmedAt": "2026-01-18T17:04:53.466Z",
      "sizeReduction": "97.1%"
    }
  ],
  "sizeReduction": "98.7%"
}