{
  "venueId": "ChIJi7jLCABz_ogRJUmJJuhhoMo",
  "venueName": "Coastal Dreams",
  "venueArea": "Isle of Palms",
  "website": "http://www.exclusivepropertiesus.com/",
  "scrapedAt": "2026-01-19T02:45:56.686Z",
  "trimmedAt": "2026-01-19T02:52:46.863Z",
  "pages": [
    {
      "url": "http://www.exclusivepropertiesus.com/specials",
      "text": "[Page Title: Isle of Palms Vacation Rental Specials | Isle of Palms Vacation Rentals]\n\nSkip to main content \nIsle of Palms Vacation Rental Specials\nRefine Search \nYou are here\nHome Isle of Palms Rentals Isle of Palms Vacation Rental Specials \nReceive Exclusive Offers\nEmail Address * Sign Up Leave this field blank",
      "hash": "211de2d02cf1",
      "downloadedAt": "2026-01-19T02:09:50.335Z",
      "trimmedAt": "2026-01-19T02:52:46.824Z",
      "sizeReduction": "99.5%"
    },
    {
      "url": "http://www.exclusivepropertiesus.com/",
      "text": "[Page Title: Isle of Palms Vacation Rentals]\n\nSkip to main content Browse All Properties Search Rentals Find My Rental Find Property By Name - Choose - Avonlea- 2204 Palm Blvd Barbados - 3302 Palm Blvd Beach Bliss- 3 53rd Ave. Beach Daze - 1004 Carolina Blvd Beachfront Sanctuary- 3900 Palm Blvd Belle Mer - 3908 Palm Blvd Casa Banana- 914 Ocean Blvd Casa Flamingo- 912 Ocean Blvd Casa Margarita- 904 Ocean Blvd Coastal Dreams- 4202 Palm Blvd. Coastal Manor- 3403 Palm Blvd. Coastal Sunrise- 702 Ocean Blvd. Dolphin Manor- 512 Ocean Blvd. Dolphin View - 202 Palm Blvd Isle be Back - 5 57th Ave Lime Tree Cabana - 4002 Cameron Blvd Modern Tides- 3706 Palm Blvd. Nostos- 6 51st ave Ocean View - 411 Ocean Blvd Palm Manor - 917 Ocean Blvd Pavilion A La Plage - 4 10th Ave Peaceful Easy Feeling- 2910 Palm Blvd Port of Call - 3400 Palm Blvd Saint Somewhere- 500 Carolina Blvd Sandcastle- 2704 Palm Blvd. Sea Glass Villa - 304 Carolina Blvd. Sea Spray- 400 Ocean Blvd. Seascapes- 714 Ocean Blvd Serenity- 2 50th ave Sunrise Manor- 601 Ocean Blvd Sunsational- 620 Ocean Blvd The Sea Herring- 614 Palm Blvd. Treehouse on the Ocean- 3206 Palm Blvd Villa Del Mare- 7 53rd Ave. Villa Las Palmas- 206 Ocean Blvd Whispering Palms- 8 31st Ave Go Leave this field blank Refine Search \nIsle of Palms Rentals\n\nYou Deserve To Stay at the Beach In Style\n\nPrivate Pools\n\nOceanfront\n\nOcean View\n\nPet Friendly\n\nPrivate Hot Tub\n\nHomes for Weddings\n\n4+ Bedrooms\n\nLuxury Homes\n\nView All Rentals\n\nWelcome to Exclusive Properties\n\nYour source for the best selection of Isle of Palms Vacation Rentals!\n\nIsle of Palms is a gorgeous tropical paradise, located conveniently close to Charleston, SC and everything this wonderful city has to offer. A South Carolina coast vacation on Isle of Palms means that you’ll be immersed in a world of stunning seaside scenery, fun activities, and fascinating attractions. We love our beautiful barrier island on the Atlantic Ocean and want visitors to experience the best of it by staying in one of our luxury IOP beach rentals!\n\nOur array of Isle of Palms vacation rentals are in the best parts of Isle of Palms, and only a short drive from the charm and history of downtown Charleston. At each IOP rental, you’ll find incredible views, personality, and an amazing blend of amenities. Choose from a variety of our Isle of Palms house rentals ranging from 4-12 bedrooms, and start planning your beach vacation today!\nView Our Live Surfcam \nFeatured Isle of Palms Vacation Rentals\n\nBrowse a variety of luxury vacation rentals on Isle of Palms\nTreehouse on the Ocean- 3206 Palm Blvd \nOceanfront\n\n7 Bedrooms\n\n6.5 Baths\n\n12 Guests\nModern Tides- 3706 Palm Blvd. \nOceanfront\n\n6 Bedrooms\n\n10 Baths\n\n12 Guests\nCoastal Dreams- 4202 Palm Blvd. \nOcean View\n\n7 Bedrooms\n\n7 Baths\n\n12 Guests\n\nWhat Our Guests Are Saying\nAs a person who is in the marketing business, am use to trying to find the right words. But when it comes to describing this property, truly think that words cannot describe what an awesome place this is for large families and groups. Had 21 people stay here and we all had accommodations that go over the top. Plenty of room for everybody and first class in every way. One amazing thing about this house is despite everything being luxurious, the house still has some of those touches that make it feel warm and welcoming. And the folks are Exclusive Properties are really friendly folks who balance good customer service with genuine caring about their guests. Thank you so much Exclusive Properties for making this one of the most memorable incredible get togethers ever for our family!! \nRick\nThere is not enough space to detail how much we loved our stay! Everything was perfect!! Simply everything! We want to return year after year— and Megan and team went out of their way for us'. Just an amazing weekend! Thank you so much! \nMindy\n\nOur family vacation worked out perfectly as little children and adults all had their own room/baths which made for very happy people. Shelly and Megan were very responsive to a couple of issues and very delightful. Having the pool heated was a good choice for our group, having dinners catered spoiled all of us. Poe's (on Sullivan Island) is a favorite dinner choice of our group as is buying fresh seafood at Shem Creek.\n\nSusie\n\nEach summer we try to take our children and grandsons to a beach location and after many other locations we fell in love with Isle of Palms. The most important ingredient to our new love affair is this amazing home. It is incredibly clean and convenient with comfortable elegance. We have small grandsons and it is a perfect home for families. They enjoyed the pool, screened in porches and quick access to the beach, near by restaurants..kid friendly. The listing description is very accurate! And absolutely not a bug insight the entire week, coming from the north where we are not used to your local creatures, that was important to us! We will return to Isle of Palms and to this lovely home. Thanks to the owner for sharing with us. We created wonderful memories!\n\nCheri\n\nIsle of Palms Property Management\n\nNo Hassle Management\n\nWe shoulder the burden of the management process from reservations and maintenance to deep cleans and hurricane prep, without passing a lot of extra cost to you.\nLearn More \nMarketing is our Top Priority\n\nWe employ cutting edge marketing strategies including a top of the line website and booking engine fully optimized for maximum ROI.\nLearn More \nIncreasing Value is our Objective\n\nClients who come from other management companies experience an increase in rental income from 15% to 60%.\nLearn More Things to Do \nHarris Teeter on Isle of Palms\n\nThe only grocery store on the island is conveniently located right when you come on the island. Pick up all of...\nOur Blog Oysters, Oysters Everywhere! \nAs the old saying goes, any month with an “R” in the name is a good time to eat oysters.  And is prime...\nJanuary/February Beach Cam \nReceive Exclusive Offers\nEmail Address * Sign Up Leave this field blank",
      "hash": "b98465b2666d",
      "downloadedAt": "2026-01-19T02:09:50.183Z",
      "trimmedAt": "2026-01-19T02:52:46.847Z",
      "sizeReduction": "96.5%"
    },
    {
      "url": "http://www.exclusivepropertiesus.com/isle-of-palms-events",
      "text": "[Page Title: Isle of Palms Events | Isle of Palms Vacation Rentals]\n\nSkip to main content \nIsle of Palms Events\nRefine Search \nYou are here\nHome Guest Services Isle of Palms Events \nDisplaying 1 - 5 of 161\n\nRecommended!\nOysters on the Point \nto\n12/13/2025 03/07/2026 Website \nOyster roasts on Mount Pleasant's \"beach\" overlooking the harbor.\nView Details \nRecommended!\nOysters at The Windjammer \nto\n12/20/2025 02/22/2026 \n(843) 886-8596\nWebsite \nGrab a bucket of oysters on the IOP at a great price.\nView Details \nRecommended!\nYoga in the Park \nto\n12/22/2025 12/23/2026 \n(843) 886-8294\nWebsite Outdoor morning yoga classes at the Rec Center, open to all. View Details \nRecommended!\nSpoleto Season Announced & Tickets on Sale \nto\n01/13/2026 06/07/2026 \n(843) 722-2764\nWebsite \nThe world renowned arts festival has officially launched its new season.\nView Details \nRecommended!\nCharleston Boat Show \nto\n01/23/2026 01/25/2026 \n(864) 250-9713\nWebsite \nAll things boat, all in one place.\nView Details \nPages\n1 2 3 4 5 6 7 8 9 … next › last » \nEvent categories\nConcerts (8) Festivals (53) Holidays (51) Isle of Palms Special Events (22) Outdoor Events (60) \nUpcoming events\n\n-\nSunrise or Starlight Yoga 04/04/2024 \n-\nLive at Firefly Concerts 05/01/2024 \n-\nSaltwater Fishing with an Expert 06/20/2024 \n-\nTicket Sales Open for the Gaillard 05/01/2025 \n-\nBest of Broadway 2025-26 Season 05/13/2025 \nReceive Exclusive Offers\nEmail Address * Sign Up Leave this field blank",
      "hash": "ea799f9e8142",
      "downloadedAt": "2026-01-19T02:09:51.531Z",
      "trimmedAt": "2026-01-19T02:52:46.863Z",
      "sizeReduction": "98.1%"
    }
  ],
  "sizeReduction": "97.5%"
}