{
  "venueId": "ChIJAQCENAx6_ogRh4wVFjcOus0",
  "venueName": "The Peacock",
  "venueArea": "Downtown Charleston",
  "website": "http://www.thepeacock-chs.com/",
  "scrapedAt": "2026-01-18T17:04:24.021Z",
  "trimmedAt": "2026-01-18T17:05:07.819Z",
  "pages": [
    {
      "url": "http://www.thepeacock-chs.com/menus",
      "text": "MenuS Chef Matthew Greene offers culinary creations that are uniquely American with an international twist Wine/Cocktails Brunch Lunch/Dinner Dessert Address 213 East Bay StCharleston, SC 29401 A convenient Uber, Lyft, or pedicab ride away from anywhere on the peninsula Dining Indoor Dining & Outdoor Rooftop Hours Mon – Thur: 4:00p – MIDNIGHT Fri – Sat: 11:30a – 2:00a Sun: 11:30a – MIDNIGHT V’s schedule varies so please check our event schedule Contact us P: E: 843.955.5226 info@thepeacock-chs.com Reservations Close © Copyright The Peacock 213 East Bay St, Charleston, SC 29401 843.955.5226 info@thepeacock-chs.com Close Search for: Search",
      "hash": "35c324c1148b",
      "downloadedAt": "2026-01-18T16:55:06.218Z",
      "trimmedAt": "2026-01-18T17:05:07.734Z",
      "sizeReduction": "99.3%"
    },
    {
      "url": "http://www.thepeacock-chs.com/private-events",
      "text": "Private Events Host an unforgettable private event at The Peacock Check for availability A one-of-a-kind venue in Downtown Charleston The Peacock Charleston is an Art Deco-inspired restaurant, bar, and event venue spanning two floors and a rooftop. With four beautiful event spaces under one roof and a classically trained in-house catering team, we are fully equipped for any event large or small. Inquire Now 1st FLOOR Main Dining Room Overlooking East Bay Street and featuring a stunning large full bar and 20-foot ceilings, our charming art deco restaurant is perfect for large private dining events with seating for 65 guests. 2nd Floor Peacock Alley The Alley is designed to impress with lush art deco decor, a private full-sized bar, floor-to-ceiling views, private bathrooms, elevator access, ambience lighting, and a secret library lounge. Great for private dining (seating up to 30), cocktail parties, rehearsal dinner & so much more. Peacock Alley + V's Speakeasy can be rented together for a private floor of event space 2ND Floor V's Speakeasy This flexible space is perfect for all event types, from corporate presentations and private dinners to late night after parties. This space features velvet lounge furniture, a stage, AV setup, a dance floor, three 13-foot projection screens, a top-of-the-line lighting system & endless configuration options. 3rd floor Rooftop A rooftop oasis overlooking the Customs House and Charleston Harbor with three lounge cabanas, a beautiful full sized bar and multiple outdoor T.Vs. Private Events a Premier Charleston Event venue With countless events under our belt, our team is ready to help execute your event to make it special and truly unique. Private Dining Rehearsal Dinners, Welcome or After Parties Weddings, Proposal & Elopements Corporate Events Business Dinners with Presentations Full Venue Buyouts Birthdays & Anniversaries & so much more! Check for availability Address 213 East Bay StCharleston, SC 29401 A convenient Uber, Lyft, or pedicab ride away from anywhere on the peninsula Dining Indoor Dining & Outdoor Rooftop Hours Mon & Tues: CLOSED Wed – Thur: 4:00p – MIDNIGHT Fri – Sat: 11:30a – 2:00a Sun: 11:30a – MIDNIGHT V’s schedule varies so please check our event schedule Contact us P: E: 843.955.5226 info@thepeacock-chs.com Reservations Close © Copyright The Peacock 213 East Bay St, Charleston, SC 29401 843.955.5226 info@thepeacock-chs.com Close Search for: Search",
      "hash": "73ba3c6c2ed8",
      "downloadedAt": "2026-01-18T16:55:07.562Z",
      "trimmedAt": "2026-01-18T17:05:07.757Z",
      "sizeReduction": "97.6%"
    },
    {
      "url": "http://www.thepeacock-chs.com/",
      "text": "The heart of Charleston three levels of DININg, entertainment and cocktails Dining | Lounge | Rooftop | Events Reservations Private Events Music and Events Explore Menus Dining @ THE PEACOCK The Peacock dining experience has something for everyone. Join us for dinner 7 days a week or for weekend lunch & brunch. Make A Reservation Private Events @ THE PEACOCK We offer a diverse and unique space for your private event. We can accommodate from 10 – 400 people ranging from breakfast meeting space to a rooftop wedding ceremony. View our Event Spaces music and entertainment @ THE PEACOCK There is always something happening at The Peacock. Enjoy live music every Monday-Thursday at 6:00pm. Weekends offer three levels of fun with live bands, DJ dance parties and late nights on the roof. Follow us on Instagram to keep up to date. View Upcoming Events ROOFTOP @ the PEACOCK Our rooftop terrace has it all with seating overlooking Charleston Harbor. Full menu available with kitchen hours. See Menus Follow us on IG for the latest news & updates thepeacockchs More than a restaurant or lounge - an elevated multilevel entertainment experience! Time well spent! #thepeacockchs #espressomartini It’s that time of the year again! 🍽️🥂 Come dine w Psst… 👀 if you’re making a list of Charleston favo The memories are here🦚🖤 Our New Year’s Eve photo The season ahead at The Peacock✨ A few dates wort What a way to ring in 2025 ✨ Thank you to everyone Feeling extra merry ✨🎄 We’re thrilled to be featu If you’re looking for holiday plans… you’ve found See More Follow on Instagram Address 213 East Bay StCharleston, SC 29401 A convenient Uber, Lyft, or pedicab ride away from anywhere on the peninsula Dining Indoor Dining & Outdoor Rooftop Hours Mon & Tues: CLOSED Wed – Thur: 4:00p – MIDNIGHT Fri – Sat: 11:30a – 2:00a Sun: 11:30a – MIDNIGHT V’s schedule varies so please check our event schedule Contact us P: E: 843.955.5226 info@thepeacock-chs.com Reservations Close © Copyright The Peacock 213 East Bay St, Charleston, SC 29401 843.955.5226 info@thepeacock-chs.com Close Search for: Search",
      "hash": "a9e57e6a2d35",
      "downloadedAt": "2026-01-18T16:55:04.763Z",
      "trimmedAt": "2026-01-18T17:05:07.780Z",
      "sizeReduction": "98.5%"
    },
    {
      "url": "http://www.thepeacock-chs.com/event-calendar",
      "text": "Event Calendar New and recurring events each week! January 2026 11 January 2026 Sunday Brunch Join us for Sunday brunch! ... - 11:30 am 3:00 pm 213 E Bay St, Charleston, SC View Details 15 January 2026 Live Music – Nick Horn Join us on Thursday, January 15th, in our main dining room to enjoy the live music of Nick Horn! ... - 7:00 pm 10:00 pm 213 E Bay St, Charleston, SC View Details 16 January 2026 Live Music – Evelyn Ivory Join us on Friday, January 16th, in our main dining room to enjoy the live music of Evelyn Ivory! ... - 7:00 pm 10:00 pm 213 E Bay St, Charleston, SC View Details 17 January 2026 Saturday Brunch Enjoy brunch in our main dining room or on our waterfront rooftop. We have something to tempt all palettes, from a smoked salmon plate to shakshuka, and even delicious traditional breakfast sandwiches. ... - 11:30 am 3:00 pm 213 E Bay St, Charleston, SC View Details 18 January 2026 Sunday Brunch Join us for Sunday brunch! ... - 11:30 am 3:00 pm 213 E Bay St, Charleston, SC View Details 22 January 2026 Live Music – Nick Horn Join us on Thursday, January 22nd, in our main dining room to enjoy the live music of Nick Horn! ... - 7:00 pm 10:00 pm 213 E Bay St, Charleston, SC View Details 23 January 2026 Live Music – Grace Miller Moody Join us on Friday, January 23rd, in our main dining room to enjoy the live music of former NBC The Voice contestant, Grace Miller Moody! ... - 7:00 pm 10:00 pm 213 E Bay St, Charleston, SC View Details 24 January 2026 Saturday Brunch Enjoy brunch in our main dining room or on our waterfront rooftop. We have something to tempt all palettes, from a smoked salmon plate to shakshuka, and even delicious traditional breakfast sandwiches. ... - 11:30 am 3:00 pm 213 E Bay St, Charleston, SC View Details 24 January 2026 Salsa Night! Spice up your Saturday night with Salsa at V’s Speakeasy! 💃 Join us on Saturday, January 24th, for an evening of music, movement, and rhythm! Kick things off with a 30-minute dance lesson from 6-6:30 PM, then dance the night away! $15 cover at the door. ... - 6:00 pm 10:00 pm View Details 25 January 2026 Sunday Brunch Join us for Sunday brunch! ... - 11:30 am 3:00 pm 213 E Bay St, Charleston, SC View Details 29 January 2026 Live Music – Nick Horn Join us on Thursday, January 29th, in our main dining room to enjoy the live music of Nick Horn! ... - 7:00 pm 10:00 pm 213 E Bay St, Charleston, SC View Details 30 January 2026 Live Music – Grace Miller Moody Join us on Friday, January 30th, in our main dining room to enjoy the live music of former NBC The Voice contestant, Grace Miller Moody! ... - 7:00 pm 10:00 pm 213 E Bay St, Charleston, SC View Details No event found! Load More Address 213 East Bay StCharleston, SC 29401 A convenient Uber, Lyft, or pedicab ride away from anywhere on the peninsula Dining Indoor Dining & Outdoor Rooftop Hours Mon & Tues: CLOSED Wed – Thur: 4:00p – MIDNIGHT Fri – Sat: 11:30a – 2:00a Sun: 11:30a – MIDNIGHT V’s schedule varies so please check our event schedule Contact us P: E: 843.955.5226 info@thepeacock-chs.com Reservations Close © Copyright The Peacock 213 East Bay St, Charleston, SC 29401 843.955.5226 info@thepeacock-chs.com Close Search for: Search",
      "hash": "fe6bd601a545",
      "downloadedAt": "2026-01-18T16:55:05.266Z",
      "trimmedAt": "2026-01-18T17:05:07.819Z",
      "sizeReduction": "97.6%"
    }
  ],
  "sizeReduction": "98.2%"
}