{
  "venueId": "ChIJOx7i0VZj_ogRGdjwEqDBy1k",
  "venueName": "Taste Of Tokyo",
  "venueArea": "North Charleston",
  "website": "https://www.tasteoftokyosouthcarolina.com/",
  "scrapedAt": "2026-01-18T17:04:25.815Z",
  "trimmedAt": "2026-01-18T17:07:16.041Z",
  "pages": [
    {
      "url": "https://www.tasteoftokyosouthcarolina.com/9ittr0j4/taste-of-tokyo-north-charleston-29418/order-online#menu-section",
      "text": "Skip to main content",
      "hash": "0d9cb423e097",
      "downloadedAt": "2026-01-18T17:01:38.058Z",
      "trimmedAt": "2026-01-18T17:07:16.035Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "https://www.tasteoftokyosouthcarolina.com/",
      "text": "Skip to main content Bite into Japanese Magic Craving Japanese cuisine in North Charleston? Dive into a world of delectable flavors with just a few clicks. Order online now and savor the essence of Tokyo right at your doorstep with delivery or takeout! Order Online View Menu Savor Tokyo's Flavor Discover the essence of Japan with Taste Of Tokyo, nestled in North Charleston, SC. We bring you the finest in Japanese cuisine, crafted to perfection. From sushi rolls and noodles to Hibachi Steak and Teriyaki Chicken—our menu captures the authentic flavors and artistry of Tokyo. Experience culinary excellence with the convenience of delivery or takeout. Place your online order now and bring a taste of Tokyo to your table! Location Taste Of Tokyo CLOSED NOW • Closes at 09:30 pm 3032 W Montague Ave #204, North Charleston, SC 29418 8435665200 Pickup Delivery Hours of Operation (Takeout) Monday - Thursday 11:00 am - 09:30 pm Friday - Saturday 11:00 am - 10:00 pm Sunday 12:00 pm - 09:30 pm Order Online View Menu Review us on Google Having you as part of our food lovers family means the world to us. We kindly ask you to spread the word about our restaurant by leaving a Google Review. Leave a review",
      "hash": "938eda59894a",
      "downloadedAt": "2026-01-18T17:01:37.543Z",
      "trimmedAt": "2026-01-18T17:07:16.041Z",
      "sizeReduction": "98.1%"
    }
  ],
  "sizeReduction": "99.9%"
}