{
  "venueId": "ChIJA1vVLY57_ogR8syPUAQNKJ4",
  "venueName": "Locker Room Sports Cafe",
  "venueArea": "North Charleston",
  "website": "https://shopnorthwoodsmall.com/store/locker_room_sports_cafe?location=uH-640",
  "scrapedAt": "2026-01-18T17:04:23.965Z",
  "trimmedAt": "2026-01-18T17:05:06.938Z",
  "pages": [
    {
      "url": "https://shopnorthwoodsmall.com/store/locker_room_sports_cafe?location=uH-640",
      "text": "Locker Room Sports Cafe Step into The Locker Room, the ultimate hangout spot where sports, good vibes, and great food come together. Designed with a true locker room feel, our bar combines the energy of game day with the comfort of a neighborhood pub. With wall-to-wall big screens, you’ll never miss a play — whether it’s football under the lights, courtside basketball action, or fight night excitement. Grab a cold beer on tap, indulge in our signature wings, burgers, and shareable plates, and cheer on your team surrounded by fans who feel like family. From pre-game happy hours to post-game celebrations, The Locker Room is your go-to spot for unforgettable nights, themed events, and unbeatable specials. Whether you’re here for the big game, a night out with friends, or just looking for a place where the energy is always high — you’ll find it at The Locker Room Sports Café. Connect with at Northwoods Mall Locker Room Sports Cafe Open - 11:00AM 11:00PM 854.251.2007 You Might Also Like ... Sarkura Express Close Deals Events About (opens in a new tab) (opens in a new tab) Leasing Close",
      "hash": "2958957bee4a",
      "downloadedAt": "2026-01-18T17:00:04.223Z",
      "trimmedAt": "2026-01-18T17:05:06.903Z",
      "sizeReduction": "98.2%"
    },
    {
      "url": "https://shopnorthwoodsmall.com/store/sbarro_italian_eatery",
      "text": "Sbarro Sbarro's original NY XL slice is made with hand-stretched dough, San Marzano-style sauce, freshly shredded 100% Whole Milk Mozz and your favorite toppings. Resistance is futile. Connect with at Northwoods Mall Sbarro Open - 12:00PM 6:00PM Space FC-2 843.640.3178 sbarro.com Deals and Events from Sbarro Deal Special Birthday Reward Check it out You Might Also Like ... Close Deals Events About (opens in a new tab) (opens in a new tab) Leasing Close",
      "hash": "7bcd44b41a06",
      "downloadedAt": "2026-01-18T17:00:05.940Z",
      "trimmedAt": "2026-01-18T17:05:06.910Z",
      "sizeReduction": "99.3%"
    },
    {
      "url": "https://shopnorthwoodsmall.com/deals",
      "text": "Shop Deals at Northwoods Mall All filters cleared. Showing 51 item(s). All Eat Shop Birthday Rewards Hero Discount Military Discount Other Student Discount Pretzel Perks Birthday Reward Auntie Anne's Hand-Rolled Soft Pretzels Your Perfect Style Is Calling—Shop BOGO FREE Jeans Aéropostale Dec 26 - Jan 21 C-Club Rewards Claire's Now at Lids: Unlock the World of Fanatics Lids Great Harvest Hoodie Cat Student Discount Banter by Piercing Pagoda Free Food for Your Birthday Charley's Cheesesteaks Special Birthday Reward Sbarro Military Discount Rack Room Shoes Military Discount Charley's Cheesesteaks Military Discount GameStop Military Discount Banter by Piercing Pagoda Military Discount American Deli Military Discount Auntie Anne's Hand-Rolled Soft Pretzels Military Discount Hot Topic Military Discount Yankee Candle Military Discount GNC Live Well Military Discount Champs Sports Military Discount REEDS Jewelers Military Discount Cinnabon Military Discount Spencer's Military Discount Aéropostale Military Discount Windsor Military Discount Hollister Co. Military Discount Zales First Responder Discount GNC Live Well Student Discount Aéropostale Student Discount PacSun Special Birthday Reward PINK by Victoria's Secret Special Birthday Reward Lids Special Birthday Reward Journeys Special Birthday Reward JCPenney Special Birthday Reward Windsor Special Birthday Offers BoxLunch Special Birthday Reward Hollister Co. Special Birthday Reward GNC Live Well Special Birthday Reward Claire's Special Birthday Reward PacSun Special Birthday Reward Bath & Body Works Special Birthday Reward Rack Room Shoes Special Birthday Reward Kids Foot Locker Special Birthday Reward Foot Locker Special Birthday Reward Mens Wearhouse Special Birthday Reward GameStop Special Birthday Reward Hot Topic Special Birthday Reward rue21 Surprise Birthday Gift Champs Sports Special Birthday Reward The Children's Place Special Birthday Reward American Eagle Outfitters Special Birthday Reward H&M Special Birthday Reward Yankee Candle Close Deals Events About (opens in a new tab) (opens in a new tab) Leasing Close",
      "hash": "92ca8225740a",
      "downloadedAt": "2026-01-18T17:00:06.502Z",
      "trimmedAt": "2026-01-18T17:05:06.932Z",
      "sizeReduction": "98.5%"
    },
    {
      "url": "https://shopnorthwoodsmall.com/events",
      "text": "Explore Events at Northwoods Mall All filters cleared. Showing 0 item(s). All Close Deals Events About (opens in a new tab) (opens in a new tab) Leasing Close",
      "hash": "96d1df4a1849",
      "downloadedAt": "2026-01-18T17:00:08.777Z",
      "trimmedAt": "2026-01-18T17:05:06.938Z",
      "sizeReduction": "99.8%"
    }
  ],
  "sizeReduction": "98.8%"
}