{
  "venueId": "ChIJw1lkHv1j_ogRA8TzBgonSWM",
  "venueName": "Dashi Wine Bar and Emporium",
  "venueArea": "North Charleston",
  "website": "https://www.dashiwinebarandemporium.com/",
  "scrapedAt": "2026-01-19T02:45:59.065Z",
  "trimmedAt": "2026-01-19T02:54:19.187Z",
  "pages": [
    {
      "url": "https://www.dashiwinebarandemporium.com/events-1",
      "text": "[Page Title: Store 2 — Dashi Wine Bar and Emporium]\n\nEvents \nEvents\n\nArgentinian Wine Tasting!\n\n$25.00\nAdd To Cart Added! \nSpanish Wine Tasting with Fermented Vines! 1/21/26 at 6pm!\n\n$30.00\nAdd To Cart Added! \nOyster Roast and Wine Tasting 1/25/26 1-3pm\n\n$40.00\nAdd To Cart Added! \nA Taste of Rioja! January 28th, 2026 7-9pm\n\n$25.00\nAdd To Cart Added! \nRibera Del Duero Tasting - February 25th, 2026 7-9pm!\n\n$25.00\nAdd To Cart Added! \nSherry Tasting - March 25th, 2026 7-9pm\n\n$25.00\nAdd To Cart Added! \nSpanish Vermouth Tasting - April 29th, 2026 7-9pm\n\n$25.00\nAdd To Cart Added! \nRias Baixas Tasting May 27, 2026, 7-9pm\n\n$25.00\nAdd To Cart Added! \nTxakoli Day - February 21, 2026 1-4pm!\n\n$50.00\nAdd To Cart Added!",
      "hash": "2152ffbaeb83",
      "downloadedAt": "2026-01-19T02:14:09.425Z",
      "trimmedAt": "2026-01-19T02:54:19.126Z",
      "sizeReduction": "99.7%"
    },
    {
      "url": "https://www.dashiwinebarandemporium.com/",
      "text": "[Page Title: Dashi Wine Bar and Emporium]\n\nDashi Wine Bar and Emporium \nEvents!\n\nVenue Use and Rental\n\nLooking for a venue for your next event? The Dashi Wine Bar and Emporium is a great option!\n\nWe have seating for groups of up to 60 people, ample parking, an adorable outdoor space and plenty of wine! If you are looking for a new place to hold a book club or other activity, we are happy to host small groups (up to 30 people) for free.\n\nIf you need to rent the entire space we can do that too!\n\nFor more information about Dashi Catering click below!\n\nIf you are interested in hosting an event at the Wine Bar or an event rental please fill out this form and we will follow up!\nDashi Catering Anza Rioja 'Carramonte' 2022 \n$145.00\n\nPrestige Wines!\n\nAlthough we have a wide variety of well priced wines that offer excellent value, we also have some of Spain’s most highly regarded wines. Here are a few of our most prestigious ones, but our inventory is constantly evolving. We invite you to come in and browse!\nHnos. Perez Pascuas - Perez Pascuas Gran Seleccion 2015 Flor de Pingus '22 Shop Now \nUpcoming events.\n\nDashi Wine Bar and Emporium Info\nHours: \n: 4pm-10pm\nWednesday \n: 4pm-10pm\nThursday \n: 4pm-10pm\nFriday \n: 1pm-10pm\nSaturday \n: 1pm-9pm\nSunday \nWines By The Glass\n\nOur Wine By The Glass selections are always changing, but here are some of our favorites that are likely to be available. We have a number of Vermouths and Sherries available by the glass as well. When you arrive, check out the wine wall to see what’s on offer!\n\nRed\n12 $ \nCa'N Verdura Supernova Mantonegro 2023\n\nThe wine is wildly fragrant with herbal-tinged, red berry fruit aromas that explode from the glass. The palate is medium-bodied and exhibits those aforementioned ripe red berry flavors mixed with notes of exotic spice.\n\n12\n$ 13 $ \nBodega Barda Pinot Noir 2024\n\nPerfumed, with subtle cherry, cranberry and strawberry aromas and a hint of peaches. Medium-bodied with brightness and freshness. Vivid, lively, crunchy and fresh. Always excellent and super drinkable.\n\n13\n$ 10 $ \nFrontonio Microcosmico Garnacha 2023\n\nPale ruby. Redcurrant and strawberry over mineral and white pepper notes. Village Grenache grown in pure slate soils. A sincere, austere Garnacha that reflects the traditional winemaking style of Aragon, the region where the grape variety originates.\n\n10\n$ 11 $ \nAntonio Lopes Ribieiro 2023\n\nLight and quite dry with beautiful acidity. Aromas and flavors of wildflowers and wild strawberries.\n\n11\n$ 10 $ \nClos de Lom Tempranillo 2022\n\nThis wine shows a deep red cherry colour with violet hits. On the nose we find intense aromas, a remarkable fruity and long-lasting character, with red fruit, blackberry, cassis and a slight subtle toast. Full-bodied, harmonious, elegant with palate-dusting tannins. Great acidity with a persistent aftertaste.\n\n10\n$ \nWhite\n10 $ \nAbellio Albarino 2023\n\nClean and bright wine. The nose has an intense aroma, highlighting apple and stone fruits. In the mouth, the typical freshness of Albariño stands out, with a very tight acidity.\n\n10\n$ 8 $ \nXarmant Txakolina 2024\n\nLight, lively, and clean with an array of fruit flavors, such as green apple and citrus, and sprightly effervescence.\n\n8\n$ 10 $ \nRibeiro Biotite Vinho Verde 2022\n\nThis is refreshingly crisp with a vibrant, fruit-driven palate yet laced with minerals that come from the schistous slopes of the vineyard site. Fermented with native yeasts, a practice that, in the best of hands, results in great character. Fresh and lively and ready to please any palate.\n\n10\n$ 9 $ \nCasamaro Verdejo 2024\n\nHoneyed apricot, peach + pear, with lemon verbena + mint leaves. Grapefruit essence on a stony, rich palate with a smooth yet vibrant finish.\n\n9\n$ \nRose\n9 $ \nBodegas Breca 2023\n\nNotes of pink nectarines, dried orange and peach pit follow through to a medium body with vivid, crunchy acidity and a sleek, polished mouthfeel. Textural and delicious.\n\n9\n$ 9 $ \nOstatu Rosado 2023\n\nThis light and refreshing wine is a modern variation of a classic rosé from Rioja. Floral and acidic, very light on the palate with notes of red berries.\n\n9\n$ \nOrange\n10 $ \nBojo do Luar Doralice 2022\n\nThis Portuguese orange wine is structured, aromatic, herbaceous with soft tannins and a touch of nuttiness in the predominantly tropical fruit flavors.\n\n10\n$ 9 $ \nNanit Orange 2023\n\nThe wine was fermented for 10 days on its skins resulting in a fragrant wine of fresh white florals, citrus zest and minerally flavours with citrus zest, fine herbs and balsamic notes silky and concentrated on the palate.\n\n9\n$ \nMenu\n6 $ \nJAMÓN SERRANO\n\nDry-cured Spanish ham from the mountains, aged 6–18 months for a savory, delicate flavor.\n\n6\n$ 12 $ \nJAMÓN IBÈRICO DE BELLOTA\n\nPremium Iberian ham, free-range and acorn-fed, cured up to 48 months for rich marbling.\n\n12\n$ 6 $ \nMILD CHORIZO\n\n6\n$ 6 $ \nHOT CHORIZO\n\n6\n$ 12 $ \nMILD CHORIZO IBÈRICO\n\n12\n$ 12 $ \nHOT CHORIZO IBÈRICO\n\n12\n$ 7 $ \nDRUNKEN GOAT\n\nGoat’s milk cheese from Murcia, soaked in red wine for 72 hours for a fruity, purple-rinded finish.\n\n7\n$ 7 $ \nMANCHEGO\n\nClassic La Mancha sheep’s milk cheese, firm and buttery with a creamy, slightly piquant bite.\n\n7\n$ 7 $ \nMANCHEGO WITH ROSEMARY\n\nNutty Manchego paired with aromatic rosemary for a fragrant, savory balance.\n\n7\n$ 7 $ \nRONCAL\n\nRobust sheep’s milk cheese from Valle de Roncal, with wild, herbaceous notes and a tangy finish.\n\n7\n$ 7 $ \nMITIBLEU BLUE\n\nSheep’s milk blue, aged 4 months. Bold, spicy, and mineral-rich yet smoother than French blues.\n\n7\n$ 7 $ \nALISIOS\n\nCanary Island cow and goat’s milk blend, coated in sweet paprika for toasted, tangy complexity.\n\n7\n$ 7 $ \nMARCONA ALMONDS\n\nThe queen of almonds.\n\n7\n$ 11 $ \nBONITO DEL NORTE TUNA IN OLIVE OIL\n\nLine-caught in the Cantabrian Sea, hand-packed in olive oil for a tender, mild flavor.\n\n11\n$ 12 $ \nSARDINES IN OLIVE OIL\n\nOrtiz “Old Style” sardines, preserved in olive oil and sea salt.\n\n12\n$ \nVARIETY OF BASQUE STYLE PINXTOS",
      "hash": "7c3408f6f20e",
      "downloadedAt": "2026-01-19T02:14:08.810Z",
      "trimmedAt": "2026-01-19T02:54:19.181Z",
      "sizeReduction": "97.9%"
    },
    {
      "url": "https://www.dashiwinebarandemporium.com/dashi-wine-club",
      "text": "[Page Title: Dashi Wine Club — Dashi Wine Bar and Emporium]\n\nDashi Wine Club!\n\n$40 per month\nSign up \nWhat an incredible Value! Join us as we celebrate wines from Spain, Portugal and South America. The Wine Club includes the following:\n\nChoice of 2 bottles of wine from our monthly selection of 5-8 selections;\n\nOne tasting per month for you and a guest at either Dashi or the Dashi Wine Bar and Emporium. Tastings include samples of all the month’s wines and food. Additional guests may attend for $25/person.\n\nAdditional 10% off retail alcohol at Dashi or Dashi Wine Bar and Emporium.\n\nOpportunity to purchase closeout wines and wholesale wines at deep discounts.",
      "hash": "adbe39e683b6",
      "downloadedAt": "2026-01-19T02:14:08.876Z",
      "trimmedAt": "2026-01-19T02:54:19.187Z",
      "sizeReduction": "99.4%"
    }
  ],
  "sizeReduction": "98.8%"
}