{
  "venueId": "ChIJM00GhHZx_ogRyp6oTu9Zji4",
  "venueName": "Community Table",
  "venueArea": "Mount Pleasant",
  "website": "https://communitytablechs.com/",
  "scrapedAt": "2026-01-18T17:04:25.504Z",
  "trimmedAt": "2026-01-18T17:07:12.940Z",
  "pages": [
    {
      "url": "https://communitytablechs.com/",
      "text": "top of page reservations modern comfort food in the heart of mount pleasant An elegant, yet approachable culinary experience awaits you, five minutes from downtown Charleston The sound of laughter and the scent of spices fill the room as strangers become friends—senses awaken the moment you step inside. An elite bar program featuring fresh juices, hand-squeezed to order for each and every cocktail alongside one of the most creative wine selections in the Lowcountry. Distressed wood and warm colors provide the backdrop for an unforgettable dining experience. Our menu highlights locally sourced, premium ingredients prepared by some of the the area’s leading culinary professionals. Gather around at Community Table, a favorite eatery among Charleston locals. We believe in three pillars when it comes to a memorable dining experience. Quality food, clean and comfortable atmosphere, professional but approachable staff. These values are the building blocks on which Community Table stands. We serve quality, modern comfort food in an approachable atmosphere, by people who care. view menu Community Table offers a cozy, welcoming ambiance and a stellar staff of professional servers. The food is some of the best in Mount Pleasant and downtown Charleston and they do an amazing job of curating a menu of local flavors and ingredients that exceed even Charleston’s dining standards. - A. Mock-Rossi read more reviews hours: Lunch/Dinner Mon-Sat ​ 11:00a-9:00p Happy Hour Mon-Sat 4:00-5:30p Sunday Brunch ​ 10:00a-2:00p bottom of page",
      "hash": "51ce040c2030",
      "downloadedAt": "2026-01-18T16:55:59.524Z",
      "trimmedAt": "2026-01-18T17:07:12.940Z",
      "sizeReduction": "99.8%"
    }
  ],
  "sizeReduction": "99.8%"
}