{
  "venueId": "ChIJVTMbuFtj_ogRLeLETzpr1Uw",
  "venueName": "Mellow Mushroom North Charleston",
  "venueArea": "North Charleston",
  "website": "https://mellowmushroom.com/location/sc-north-charleston-4855-tanger-outlet-blvd-29418/?utm_source=gmb&utm_medium=organic&utm_campaign=NorthCharleston-SC&utm_content=207",
  "scrapedAt": "2026-01-18T17:04:26.799Z",
  "trimmedAt": "2026-01-18T17:08:04.580Z",
  "pages": [
    {
      "url": "https://mellowmushroom.com/locations/all",
      "text": "Skip to main content Loading Locations Map View Alabama Arkansas Arizona Florida Georgia Indiana Kentucky Missouri North Carolina Nebraska Ohio South Carolina Tennessee Texas Virginia",
      "hash": "65791cadc341",
      "downloadedAt": "2026-01-18T17:00:16.881Z",
      "trimmedAt": "2026-01-18T17:08:04.531Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "https://mellowmushroom.com/location/sc-north-charleston-4855-tanger-outlet-blvd-29418/?utm_source=gmb&utm_medium=organic&utm_campaign=NorthCharleston-SC&utm_content=207",
      "text": "Skip to main content Loading North Charleston North Charleston Open at 11:00 AM | Delivery | Patio Mellow Mushroom has the best pizza in North Charleston, South Carolina. Our restaurant is located on Tanger Outlet Boulevard. Mellow is a favorite for travelers and locals in Downtown Charleston, West Ashley, and the surrounding areas. Mellow delivers the best pizza experience in town with our delicious dough, premium ingredients, and unique flavors. Delivering A Higher Order of Pizza™ is our standard. If we can make pizza this tasty and delicious, just imagine what we can do with Munchies, Greens, calzones, and burgers. Many of our pizzas can be made gluten-free or vegan. Take your pick from our selection of 40 draft beers and our tasty, handcrafted cocktails. Looking to feed a group? Mellow has carefully curated catering options to make sure everyone goes home with their cravings satisfied. Store Details Monday 11:00 AM - 10:00 PM Tuesday 11:00 AM - 10:00 PM Wednesday 11:00 AM - 10:00 PM Thursday 11:00 AM - 10:00 PM Friday 11:00 AM - 11:00 PM Saturday 11:00 AM - 11:00 PM Sunday 11:00 AM - 10:00 PM Address 4855 Tanger Outlet Blvd, North Charleston SC 29418 Phone (843) 790-9000 Careers Learn More Store Specials Monday Happy Hour 4:00 - 7:00PM Featured Munchie, Beer, Wine and Cocktail Specials Tuesday Happy Hour 4:00 - 7:00PM Featured Munchie, Beer, Wine and Cocktail Specials Wednesday Happy Hour 4:00 - 7:00PM Featured Munchie, Beer, Wine and Cocktail Specials Thursday Happy Hour 4:00 - 7:00PM Featured Munchie, Beer, Wine and Cocktail Specials Friday Happy Hour 4:00 - 7:00PM Featured Munchie, Beer, Wine and Cocktail Specials Explore Drinks Order Catering The Art of Mellow Mushroom North Charleston",
      "hash": "9fff712aba38",
      "downloadedAt": "2026-01-18T17:00:15.111Z",
      "trimmedAt": "2026-01-18T17:08:04.556Z",
      "sizeReduction": "99.5%"
    },
    {
      "url": "https://mellowmushroom.com/menu",
      "text": "Skip to main content Loading Get Free Pretzel Bites When You Create an Account Our Menu",
      "hash": "cc0a602e95b9",
      "downloadedAt": "2026-01-18T17:00:16.184Z",
      "trimmedAt": "2026-01-18T17:08:04.563Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "https://mellowmushroom.com/beverages",
      "text": "Skip to main content Loading Beverages Let's Have a Drink Take A Sip. Take A Trip. Wine Magic Mocktails Liquid Karma Cocktails™ & More Beer Wine Magic Mocktails Liquid Karma Cocktails™ & More Beer Wine Magic Mocktails",
      "hash": "d9ac2985d701",
      "downloadedAt": "2026-01-18T17:00:15.447Z",
      "trimmedAt": "2026-01-18T17:08:04.580Z",
      "sizeReduction": "99.9%"
    }
  ],
  "sizeReduction": "99.9%"
}