{
  "venueId": "ChIJAzlh7I17_ogRfARqVvn4emA",
  "venueName": "Lillian’s Petite Market & Eatery",
  "venueArea": "West Ashley",
  "website": "http://www.lillianschs.com/",
  "scrapedAt": "2026-01-18T17:04:24.070Z",
  "trimmedAt": "2026-01-18T17:05:08.593Z",
  "pages": [
    {
      "url": "http://www.lillianschs.com/",
      "text": "Homepage Main content starts here, tab to start navigating Slide 1 of 6 Slide 2 of 6 Slide 3 of 6 Slide 4 of 6 Slide 5 of 6 Slide 6 of 6 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Your Charleston Neighborhood Market, Café & Bar near Hampton Park Lillian’s is a community-centered market and eatery on Charleston’s Westside. Start your day with coffee & breakfast, swing by for seasonal lunch, brunch (Saturday & Sunday) and dinner, or meet friends on our rooftop. We also offer Charleston catering (tailgates, boat days, cocktail parties) and private events. Reserve on Resy, explore our menus, or join the Wine Club. Reservations No reservations needed for coffee or breakfast on the 1st floor.Coffee bar: 7:15 AM–3:00 PM • Breakfast: 7:30–10:45 AM For lunch, brunch, and dinner, reservations are recommended but not required—walk-ins are always welcome. Choose the cozy dining room or our upstairs terrace (weather permitting). Full bar with craft cocktails, local beer, and natural wines. Reserve Catering From tailgates and boat days to office lunches and cocktail parties, Lillian’s Catering brings Charleston flavors to you. Order platters, brunch kits, mini biscuits, tomato pies—pickup at Lillian’s (Westside, near Hampton Park). Most orders require 24 hours’ notice. Planning something bigger? We’ll build a seasonal menu tailored to your event. Order Catering Menu Explore Lillian’s menu with seasonal, Lowcountry-inspired plates, house-baked pastries, and shareable snacks. Start at our coffee bar (7:15 AM–3:00 PM) and breakfast (7:30–10:45 AM), then join us for brunch Sat–Sun (9:00 AM–3:00 PM), plus lunch and dinner with a full bar—craft cocktails, local beer, and natural wines. Happy Hour daily, 4–6 PM. Our menu rotates eight times a year—twice on either side of each season—so there’s always something new to discover. View Menus Private Events Host your next celebration at Lillian’s. Choose our first floor or upstairs dining rooms, open-air terrace, or a full buyout for rehearsal dinners, showers, birthdays, and corporate gatherings. Seasonal menus and full bar packages available. Inquire for dates, sample menus, and pricing. Book an Event (opens in a new tab) (opens in a new tab) (opens in a new tab) (opens in a new tab) (opens in a new tab) (opens in a new tab) (opens in a new tab) (opens in a new tab) (opens in a new tab) (opens in a new tab) Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Please leave blank or enter a valid phone number Phone number - Optional Submit Please check errors in the form above Thank you for signing up for email updates! Close and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service",
      "hash": "00ada2389ab2",
      "downloadedAt": "2026-01-18T17:02:43.440Z",
      "trimmedAt": "2026-01-18T17:05:08.354Z",
      "sizeReduction": "94.8%"
    },
    {
      "url": "http://www.lillianschs.com/menus/",
      "text": "Main content starts here, tab to start navigating Menus Slide 1 of 3 Slide 2 of 3 Slide 3 of 3 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Breakfast Brunch Lunch Dinner Wine List Cocktails & Beer Zero Proof Catering Menu Breakfast Monday - Friday 7:30 am - 11 am Seasonal Smoothie Flavors vary, just ask! Fruit-based 12.00 $ Veggie-based 12.00 $ Yogurt Bowl Local honey + yogurt, house-made granola 14.00 $ Bowl of Grits Plain 8.00 $ Veggie 10.00 $ Biscuit + Jam 6.00 $ add Gravy 2.00 $ add Sausage 3.00 $ add \"Diner Eggs\" + Cheddar 5.00 $ add Fried Chicken 6.00 $ Avocado Toast artisan sourdough, sliced avocado, shaved radish, arugula, lemon 15.00 $ add Egg 3.00 $ Breakfast Plate 2 Eggs, crispy potatoes or grits, bacon or sausage, biscuit + jam 16.00 $ Lil's Breakfast Crunchwrap house made sausage, egg, cheese, poblano crema, arugula, tomato, crispy corn tortilla, flour wrap, side salad 17.00 $ Grilled Breakfast Wrap scrambled egg, whipped feta grits, greens, tomato vinaigrette, crispy potatoes. add bacon +3 17.00 $ B.E.C. Sandwich bacon, “diner eggs”, cheddar, mayo, crispy potatoes 16.00 $ Daily selection of fresh, rotating pastries! Brunch Saturday - Sunday 9 am - 3 pm ESSENTIALS Biscuit + Jam 6.00 $ add Gravy 2.00 $ add Sausage 3.00 $ add \"Diner Eggs\" + Cheddar 5.00 $ add Fried Chicken 6.00 $ B.E.C. Sandwich bacon, “diner eggs”, cheddar, mayo, crispy potatoes 16.00 $ Breakfast Plate 2 Eggs, crispy potatoes or grits, bacon or sausage, biscuit + jam 16.00 $ Bowl of Grits PLAIN 8.00 $ VEGGIE 10.00 $ TOAST Steak + Eggs Toast sourdough, prime rib, sunny eggs, simple green salad 21.00 $ Avocado Toast artisan sourdough, sliced avocado, shaved radish, arugula, lemon 15.00 $ add Egg 3.00 $ Soft Scrambled Egg sourdough, burrata, pesto, arugula 15.00 $ Classic French Toast brioche, maple syrup, butter, powdered sugar SINGLE 8.00 $ DOUBLE 16.00 $ add Fried Chicken 10.00 $ REMIX West Side Burger beef + bacon smash patty, special sauce, house pickles, lettuce, cheddar, crispy potatoes SINGLE 14.00 $ DOUBLE 21.00 $ Lil's Lunch Crunchwrap beef + bacon patty, velveeta, poblano crema, arugula, tomato, seasonal side salad 17.00 $ Grilled Breakfast Wrap scrambled egg, whipped feta grits, greens, tomato vinaigrette, crispy potatoes. add bacon +3 17.00 $ Huevos Rancheros crispy corn tortilla, chuck roast, ground pork, sea island peas, tomatoes, avocado, chilchota, creme fraiche, fresno, sunny eggs 19.00 $ SWEET TREAT Monkey Bread cinnamon-sugar caramel + vanilla glaze 12.00 $ * Consuming raw or undercooked meats, poultry, seafood, shellfish, or eggs may increase your risk of foodborne illness, especially if you have certain medical conditions. Local Famrs: Kurios Farms, Gallop Farms, Lowcountry Creamery, Storey Farms, Bulls Bay Saltwork, White House Farms, Edisto Gold Honey Lunch Monday - Friday 11 am - 3 pm HANDS Turkey Wrap brie, apples, greens, napa cabbage, lemon pomegranate vinaigrette, potatoes 17.00 $ Fried Chicken Sandwich house pickles, gem lettuce, special sauce, milk bun, potatoes 17.00 $ Hot Italian salami, ham, burrata, hot peppers, arugula, pesto, potatoes 19.00 $ Lil's Lunch Crunchwrap beef + bacon patty, velveeta, poblano crema, arugula, tomato, seasonal side salad 17.00 $ West Side Burger beef + bacon smash patty, special sauce, house pickles, lettuce, cheddar, crispy potatoes SINGLE 14.00 $ DOUBLE 21.00 $ Prime Rib Cheesesteak peppers + onions, mushrooms, cheese wiz, potatoes 21.00 $ FORKS Breakfast Plate 2 Eggs, crispy potatoes or grits, bacon or sausage, biscuit + jam 16.00 $ Avocado Toast artisan sourdough, sliced avocado, shaved radish, arugula, lemon 15.00 $ add Egg 3.00 $ Roasted Winter Squash Soup grilled focaccia, cashew, cranberry, sage 16.00 $ Harvest Salad apples, roasted beets, greens, napa cabbage, pepitas, lemon pomegranate vinaigrette 15.00 $ Hand Cut Pasta roasted squash, sweet potato, fancy mushrooms, squash puree, cashew + cranberry + sage gremolata 18.00 $ Braised Beef + Grits exotic mushroom gravy, shaved parm, herbs 21.00 $ Local Farms: Kurios Farms, Gallop Farms, Lowcountry Creamery, Storey Farms, Bulls Bay Saltwork, White House Farms, Edisto Gold Honey Dinner Monday - Sunday 5 pm - 9 pm FINS Crab Rangoon harb salad, sweet chili sauce 15.00 $ Littleneck Clams New England chowder broth, sourdough 22.00 $ Appalachian Rainbow Trout potatoes, carrots, artichoke, olives, red bell pepper, saffron broth 38.00 $ FEATHERS Duck Ham city cured, cornbread, sweet potato jam 15.00 $ General Tso’s Quail gold rice, toasted broccoli, napa cabbage, hot peppers 20.00 $ Chicken + Dumplings sweet potato, mushroom, masa dumpling, achiote + toasted chile gravy 32.00 $ HOOVES Chili Colorado beef tongue stew, house made sope, crema, taco truck garnishes 15.00 $ Lamb Loin potatoes, carrots, mint, garlic parmesan yogurt 30.00 $ Braised Beef Madeira hunter cattle shank, handkerchief pasta, mushroom ragout 35.00 $ ROOTS Roasted Beets brie, pomegranate, sage 14.00 $ Kohlrabi Gratin cast iron baked + a wee winter salad 18.00 $ Winter Squash Pappardelle oyster mushrooms, sweet potato, squash puree, cashew cranberry gremolata 30.00 $ Local Farms: Kurios Farms, Gallop Farms, Lowcountry Creamery, Storey Farms, Bulls Bay Saltwork, Edisto Gold Honey, Hunter Cattle, Super Mushroom Bro, White House Farms Wine List White Inama Vin Soave Soave Classico, Veneto, Italy Glass 13.00 $ Bottle 52.00 $ Terlano, Pinot Bianco Trentino, Italy Glass 15.00 $ Bottle 60.00 $ Karthäuserhof, “Bruno”, Riesling Dry Mosel, Germany 72.00 $ Chai de la Dive, “Les Moulins”, Saumur Blanc Chenin Blanc, Loire Valley, France 68.00 $ Lucien Reymond, Sancerre, Sauvignon Blanc Loire Valley, France Bottle 78.00 $ Jean-Marc Brocard, Chardonnay Bourgogne, France Glass 14.00 $ Bottle 56.00 $ Peirano Estate Vineyards, Chardonnay Lodi, California, USA Glass 14.00 $ Bottle 56.00 $ Domaine de la Perriere, Chablis, Chardonnay Burgundy, France Bottle 76.00 $ Sparkling White M. Bonnamy, Crémant de Loire Loire Valley, France Glass 15.00 $ Bottle 60.00 $ Tenuta Santomè, Prosecco DOC Extra Dry Treviso, Italy Glass 13.00 $ Bottle 52.00 $ Gaillacoise, Rémi Larroque, Pet-Nat Mauzac, South West, France Glass 15.00 $ Bottle 60.00 $ Rosé La Cigale, Domaine Gavoty, Rosé Provence, France Glass 14.00 $ Bottle 56.00 $ Meinklang, Pet-Nat, Pinot Noir + Blaufrankisch Burgenland, Austria Glass 15.00 $ Bottle 60.00 $ Orange Wine Skin Contact Finca El Molar, Orange Macabeo, Manchuela, Spain Glass 14.00 $ Bottle 56.00 $ Rare Orange, Chateau Maris, Pet Nat Muscat Blanc à Petits Grains Bottle 58.00 $ Red Wine Vignobles Bulliat - Bibine, Gamay Beaujolais, France Glass 15.00 $ Bottle 60.00 $ Prost, Pinot Noir Pfalz, Germany Glass 13.00 $ Bottle 52.00 $ Clos Bortier Rouge, Pinot Noir Burgundy, France Bottle 105.00 $ Chave, “Mon Coeur”, Côtes-du-Rhône Rhône Valley, France Glass 17.00 $ Bottle 68.00 $ Podere Il Palazzino, Sangiovese Tuscany, Italy Bottle 48.00 $ Corriente Bodega Lanzaga, Blend Rioja, Spain Glass 15.00 $ Bottle 60.00 $ Le P’tit Paysan, Le P’tit, Pape Central Coast, California Bottle 68.00 $ Poppy, Cabernet Sauvignon Paso Robles, California Glass 13.00 $ Bottle 52.00 $ Fortune 1621, Cabernet Sauvignon Napa, California Bottle 78.00 $ Cocktails & Beer ALL BOOZE, NO BRAKES ALMOST A NEGRONI Campari & Cappelletti cacao blend, Amaro Nardini, Nordés gin, orange twist 18.00 $ Dream Potion #247 (Black Manhattan) bourbon infused with calming herbs + lavender + orange, amaro, black cherry 18.00 $ Mignonette-tini mignonette-infused gin, house mignonette tincture, olive brine, saline, olives 18.00 $ LIL's WAY Aperitif - Spritzes, WHICH ONE? apple-cider chai · blackberry-lemon-lavender · garden · Rinomato 13.00 $ Sake - Lost in Translation sparkling citrus, floral sake, absinthe 14.00 $ Gin - When You Love Somebody, FALL our gin riff with spiced tangerine-rooibos tea 16.00 $ Blanco - Little Wing green tea, citrus, spice, cacao, bitters Butterflies · Zebras · Moonbeams · Fairytales 16.00 $ Blanco - Boys go to Jupiter, sub Levity pineapple shrub, lime, prickly pear, ginger Queens Remedy’s rebel niece. 16.00 $ Mezcal - Naked & Almost Famous very good, very herbaceous 16.00 $ Rum - Try Matty’s, painkiller pear, Oktoberfest syrup, chai spices, hay 15.00 $ Bourbon - Season of the Witch Buffalo Trace, cider spices, black walnut, cherry, orange Smoke · Magic tricks · Still manly 17.00 $ TRUST THE PROCESS Roll the Dice + Something Nice dealers’ choice - no allergies, no mods 18.00 $ BEER COCKTAILS Ben’s Tune-up Hefeweizen, Aperol, orange 12.00 $ Fancy Fall Tallboy Oktoberfest, spiced shrub, amaro, cinnamon-sugar 13.00 $ DRAFT BEERS Stiegl, Radler Zesty, refreshing Austrian radler, real grapefruit juice + Stiegl’s signature lager ABV: 2.5% | Style: Grapefruit Radler 9.00 $ Coast, Kolsch German-style Kölsch with light malt sweetness, a dry finish, perfect for easy drinking ABV: 4.8% | Style: Kölsch 10.00 $ Munkle, Pilsner Traditional German-style Pilsner with crisp maltiness + a floral hop finish ABV: 4.9% | Style: Pilsner 8.00 $ Westbrook, White Thai Belgian-style wheat beer, lemongrass and ginger, refreshing and zesty flavor profile ABV: 5.0% | Style: Witbier 9.00 $ Edmund’s Oast, Bound by Time IPA Hazy IPA with notes of tropical fruit + citrus, smooth bitterness, balanced hop-forward profile ABV: 6.8% | Style: IPA 10.00 $ Canned Beers Fatty’s Beer Works, F Light (12 oz) ultra-refreshing American lager; dry finish ABV: 4.2% | Style: Lager 7.00 $ Freehouse, Green Door (16 oz) Organic, balanced malt body, citrus + pine ABV: 6.7% | Style: IPA 12.00 $ Keepsake, Marigold Hefeweizen (12 oz) bright wheat; clove/banana; fluffy finish ABV: 5.0% | Style: Hefeweizen 9.00 $ Munkle Brewing, Third Floor Tripel (12 oz) spicy Belgian tripel; pear & clove; dry finish ABV: 8.2% | Style: Tripel 8.00 $ Zero Proof COCKTAILS Peace of Mind herbal syrup, ginger juice, lime, Aplós Ease, soda 11.00 $ Good Thoughts similar build as Peace of Mind + a brighter citrus twist 11.00 $ Holy Trinity THC apple cider,reishi-chai, Levity, soda 11.00 $ BEER + HOUSE-MADE SODAS Untitled Art, NA Pils Non-alcoholic Pilsner, classic lager vibes without the buzz ABV: <0.5% | Style: Non-Alcoholic Pilsner 12 oz 8.00 $ House-made Sodas Cherry Limeade · Root Beer · Ginger Beer · Fresca · Shrub 11.00 $ Add House Spirit 4.00 $ Catering Menu Make holiday hosting effortless. Order chef-made dishes by December 19 and pick up December 24. Seasonal, delicious, and ready for your celebration. Holiday Catering Beef Tenderloin served with fancy mushroom red wine jus, 4 servings per order 4 servings 165.00 $ Pork Tenderloin served with roasted apple bourbon maple glaze, 4 servings per order 4 servings 145.00 $ Potato Gratin smoked cheddar, garlic, parmesan cream, 4 servings per order 4 servings 24.00 $ Southern Green Beans shallot, garlic, smokey bacon, 4 servings per order 4 servings 20.00 $ Creamed Spinach nutmeg, bechamel, toasted biscuit crumble, 4 servings per order 4 servings 24.00 $ Mac n Cheese american cheese, parmesan, dijon, bread crumbs, 4 servings per order 4 servings 24.00 $ Root Vegetables + Winter Squash herb butter, caramelized onion 4 servings 20.00 $ Complete Meal: Entrée, Sides & Dessert (Per Person) Choose One — Priced Per Person Each meal is packaged as a complete individual dinner in one compartment-style container for easy transport and reheating. Beef Tenderloin: potato gratin, green beans, roll + chocolate chess pie 55.00 $ Pork Tenderloin: mac n cheese, root vegetables, roll + eggnog custard pie 45.00 $ Braised Beef Lasagna: creamed spinach, roll + eggnog custard pie 35.00 $ Kids Meal: chicken nuggets, mac n cheese, green beans, fruit + cookie 20.00 $ Pies Allison’s Famous Holiday Pies Pecan, apple, chocolate chess, eggnog custard… why choose when you can get one of each? :) Apple 25.00 $ Pecan 35.00 $ Chocolate Chess 25.00 $ Eggnog Custard 25.00 $ Bread Accompaniment Pick your breads and treats: focaccia, yeast rolls, cornbread, biscuits, and cinnamon rolls. All are sold by the half-dozen, and you’re welcome to choose more than one. per 1/2 dozen 1/2 dozen Yeast Rolls 15.00 $ Focaccia 16.00 $ Cornbread 15.00 $ Biscuits 18.00 $ Cinnamon Rolls 20.00 $ Catering Packages Cocktail Party Package Seasonal crudité: seasonal vegetables + three dips Blue crab dip + Old Bay crackers Mini tomato pies Tarvin shrimp cocktail: Poached shrimp with lemon wedges and cocktail sauce Sliced beef tenderloin: mayo, grain mustard, horseradish, slider buns Mini ham and cheese biscuits Mini dessert platter 6-8 people 260.00 $ 8-10 people 325.00 $ dairy, egg, gluten, nuts, shellfish Lillian's Game Day Package Deviled eggs: traditional Caprese skewers: fresh mozzarella, local cherry tomatoes, basil leaves, balsamic glaze, and EVOO Seasonal crudité: seasonal vegetables + three dips Lill’s wings: tossed in Lillian’s hot sauce Tarvin shrimp cocktail: poached shrimp with lemon wedges and cocktail sauce Pulled pork sliders: braised pork, Carolina BBQ, slider buns, slaw 4-6 people 180.00 $ 6-8 people 245.00 $ 8-10 people 306.00 $ dairy, gluten, shellfish Picnic Package Hummus, pita chips, carrots, cucumbers Choice of sliders: 2 per person Cookie or Fruit Bottled Still or Sparkling Water 2 people 40.00 $ 4 people 76.00 $ 6 people 108.00 $ Turkey Ham Chicken Salad Pimento Cheese Shaved Prime Beef (upgrade - price per person) 5.00 $ Pork Belly (upgrade - price per person) 3.00 $ Bottled Still Sparkling Water Cookie Fruit dairy, egg, gluten Low Country Boil Shrimp, potatoes, corn, sausage, boiled in Cajun spice. Served with lemon wedges, cocktail sauce. 6-8 people 200.00 $ 8-10 people 250.00 $ shellfish Lillian’s Fried Chicken Package Deviled eggs: traditional Fried chickens: served with Fresno hot sauce Mac and Cheese: creamy cheese sauce, garlic breadcrumbs Seasonal Salad: mixed greens, summer vegetables, seasonal vinaigrette Rolls 4 people 120.00 $ 8 people 232.00 $ dairy, egg, gluten Sliced Flank Steak Dinner Sliced flank steak topped with chimichurri. Served with smashed fingerling potatoes, seasonal vegetables, and slider buns. 4-6 people 140.00 $ 6-8 people 189.00 $ 8-10 people 234.00 $ dairy, gluten Lillian’s Gluten-Free Catering Package Seasonal crudité: fresh seasonal vegetables served with three gluten-free dips Caprese Skewers: Fresh mozzarella, local cherry tomatoes, basil leaves + balsamic glaze and EVOO Tarvin Shrimp Cocktail: Poached shrimp with lemon wedges + cocktail sauce Flank steak sliced and topped with chimichurri Dessert platter: assortments with gluten-free options 6-8 people 273.00 $ 8-10 people 342.00 $ dairy, shellfish Quiche Brunch At Home Storey Farms quiche: spinach, goat cheese, heirloom tomato Yogurt parfait: local yogurt, local honey, granola, berries Seasonal salad: mixed greens, vegetables, seasonal vinaigrette Thick-Cut Bacon 4-6 people 150.00 $ 8-10 people 261.00 $ dairy, egg, gluten, nuts Shrimp and Grits Brunch Tarvin local shrimp, stone ground grits, tomatoes, onion, sausage Poached local eggs Thick-Cut bacon Collard greens House-made biscuits: with butter, and house-made jam 4-6 people 165.00 $ 8-10 people 288.00 $ dairy, egg, gluten, shellfish Game Day Snacks Whether you’re feeding a couple of superfans or hosting the whole neighborhood, just choose your favorites and we’ll have everything ready for pickup at Lillian’s. Pimento Cheese Sliders, dozen 36.00 $ Pulled Pork Sliders, dozen 48.00 $ Cheeseburger Sliders, dozen 48.00 $ Prime Rib Sliders, dozen 60.00 $ Wings, 2 dozen 50.00 $ Pasta Salad, quart 24.00 $ Chips + Queso, pint 15.00 $ Crab Dip, pint 16.00 $ Pimento Cheese Dip, pint 12.00 $ Extra Chips 4.00 $ Pickled Vegetables, pint 14.00 $ Beverages Catering Coffee Box (96 oz) Enjoy our freshly brewed Second State drip coffee, packaged hot and ready to serve. Each box contains 96 fluid ounces, yielding approximately twelve 8-ounce cups — perfect for meetings, brunches, and small gatherings. Served with cups, lids, stirrers, and sugar on request. 96 fluid ounces 36.00 $ Local Chocolate Milk Traditional Per ½ Gallon 7.00 $ Local Whole Milk Traditional Per Gallon 11.00 $ Bloody Mary Kit Seasonal Pickled Vegetables Jack Rudy’s Bloody Mary mix (10 servings) Celery House-made hot sauce 38.00 $ À la Carte Chicken Salad Hand-pulled roasted chicken, crisp celery, scallion, house pickles, and a touch of Duke’s—creamy, bright, and classic. Pint 12.00 $ Quart 22.00 $ egg Caprese Skewers Price per dozen. Fresh mozzarella, local cherry tomatoes, basil leaves and balsamic glaze, and a touch of extra virgin olive oil per Dozen Dozen 22.00 $ dairy Seasonal Crudité Cups Price per dozen. Individual seasonal vegetables + hummus cups Dozen 30.00 $ dairy, egg, sesame, vegetarian Seasonal Crudité Platter Seasonal vegetables + three dips (hummus*, ranch, green goddess) Small: 4-6 people 39.00 $ Large: 8-10 people 75.00 $ dairy, egg, sesame, vegetarian Mini Ham and Cheese Biscuits Price per dozen. House-made buttery biscuits, baked golden and filled with savory ham and cheese. Dozen 26.00 $ dairy, gluten Mini Tomato Pies Price per dozen. A Southern classic in bite-size form, with flaky pastry shells filled with ripe tomatoes, melted cheese, and fresh herbs. Dozen 36.00 $ dairy, egg, gluten, wheat Charcuterie Cups Per Dozen. Individually portioned 12 oz cups filled with a chef’s selection of artisanal cheeses, cured meats, fresh fruit, olives, crackers, and seasonal garnishes. A stylish and convenient way to enjoy charcuterie. per dozen 180.00 $ dairy, gluten, tree nut, wheat, contains sugar Charcuterie Platter An artful spread of artisanal cheeses, cured meats, fresh and dried fruits, seasonal vegetables, nuts, crackers, and fresh herbs. Perfect for sharing at parties, receptions, and corporate gatherings. Small (serves 6–8) 85.00 $ Medium (serves 10–12) 135.00 $ Large (serves 15–20) 195.00 $ dairy, gluten, tree nut, wheat, contains sugar Lill’s Wings Dry rub, lil’s hot BBQ sauce. Price per dozen. Dozen 26.00 $ dairy Shrimp Cocktail Shooters Priced per dozen Chilled poached shrimp over our bright tomato–horseradish cocktail sauce in a one-bite shooter, finished with lemon and an Old Bay sprinkle. per dozen Dozen 28.00 $ shellfish Shrimp Cocktail Platter Price per lb. Poached shelled & deveined shrimp with house cocktail sauce + pink sauce, garnished with celery, cucumber, lemon wedges, and chives. LB 42.00 $ shellfish Blue Crab Dip Warm, creamy dip loaded with lump blue crab, lemon, and chives—finished with a whisper of Old Bay. Served with Old Bay–dusted crackers. Pint 16.00 $ Quart 30.00 $ dairy, egg, gluten, shellfish, wheat Steak & Seasonal Vegetable Bites Skewered seared steak paired with roasted mushrooms and chef’s choice of fresh seasonal vegetables. A flavorful, gluten-free bite-sized appetizer. per dozen 60.00 $ Pimento Cheese Sliders Price per dozen. Classic, pimento cheese served on a soft, sweet King’s Hawaiian roll for the perfect bite-sized treat. Dozen 36.00 $ dairy, egg, gluten, wheat Pimento Cheese Southern classic made with sharp cheddar, roasted pimentos, and a touch of spice. Perfect as a spread, dip, or tea sandwich filling. Pint 12.00 $ Quart 22.00 $ dairy, egg, contains sugar Pulled Pork Sliders Braised pork, Carolina BBQ, housemade pickles, slaw, 12 slider buns Price per dozen. Dozen 48.00 $ dairy, egg, gluten Cheeseburger Sliders Per dozen. Beef + bacon smash patties, special sauce, lettuce, house pickles, cheddar. per doen 60.00 $ dairy, gluten, soy, wheat, contains sugar Sliced Beef Tenderloin Mayo, grain mustard, horseradish, housemade pickles, slider buns 12 sliders Dozen 96.00 $ dairy, egg, gluten Mac and Cheese Creamy cheese sauce, garlic breadcrumbs. Quart: Serves 4-6 32.00 $ 1/2 pan: serves 8-10 as a side 58.00 $ dairy, gluten Seasonal Salad Mixed greens, seasonal vegetables, seasonal vinaigrette Small: Serves 4-6 35.00 $ Large: Serves 8-10 61.00 $ Family Style Caesar Salad Romaine, Garlic Croutons, Parmesan Cheese, Dressing Small: serves 4-6 30.00 $ Large: Serves 8-10 54.00 $ dairy, egg, gluten Mini Dessert Platter Cookies, brownies, whoopie pies, key lime bites, pecan pie bars (assortment changes weekly) Price per 12 ct 2 Dozen 48.00 $ dairy, gluten, nuts Sugar Cookie Kit Price per 2 dozen baked sugar cookies in seasonal shapes, 3 colored icings, and a piping bag 48.00 $ dairy, egg, gluten Churro Spice Donut Holes Chocolate, caramel, and crème anglaise dipping sauces Price per dozen. 20.00 $ dairy, egg, gluten Pastry Box Mix of Seasonal Pastry Selections: biscuit, scones, banana or lemon bread, muffins, cinnamon rolls Full size per 1/2 dozen 1/2 dozen 26.00 $ per dozen dozen 50.00 $ dairy, egg, gluten, wheat Yogurt Parfait Local yogurt, local honey, granola, berries 4-6 people - make your own 46.00 $ Individual servings: dozen 48.00 $ dairy, nuts Seasonal Fresh Fruit Seasonal Fresh Fruit Pint 12.00 $ Quart 22.00 $ Deviled Eggs Dozen, traditional dozen 28.00 $ dairy, egg Deviled Egg Bar Priced by the dozen. A customizable spread of classic deviled eggs with rotating flavors and toppings. Guests can add their own garnishes, creating a fun, interactive, and personalized appetizer experience. per dozen 32.00 $ dairy, egg, gluten free Storey Farms Quiche Spinach, goat cheese, heirloom tomato 42.00 $ dairy, egg, gluten Biscuits and Gravy Half dozen large biscuits + sausage gravy 42.00 $ Biscuits, dozen 36.00 $ Sausage Gravy, pint 24.00 $ House-made Jam, seasonal, 8oz 15.00 $ Whipped Butter, 8oz 15.00 $ dairy, gluten Chicken + Waffles Sliders Per dozen. Mini buttermilk waffles as the buns, filled with crispy fried chicken and finished with a drizzle of local hot honey. per dozen 60.00 $ dairy, egg, gluten, wheat, contains sugar Brioche French Toast: Plain + Toppings Bar + Cups Priced by the dozen. Our whole, thick-cut brioche French toast slices come ready to warm. Standard (powdered sugar), dozen 96.00 $ Premium (+ one premium topping), dozen 108.00 $ Luxe (+ one premium toppings & one specialty sauce), dozen 126.00 $ Additional Toppings, per dozen 12.00 $ Additional Sauces, per dozen 18.00 $ French Toast in Dip Cups, per dozen 36.00 $ Thick Cut Bacon Serves 4-6 4-6 people 28.00 $ Dozen Local Eggs 8.50 $ Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Please leave blank or enter a valid phone number Phone number - Optional Submit Please check errors in the form above Thank you for signing up for email updates! Close and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service",
      "hash": "1771be5f0a0c",
      "downloadedAt": "2026-01-18T17:02:44.097Z",
      "trimmedAt": "2026-01-18T17:05:08.453Z",
      "sizeReduction": "90.3%"
    },
    {
      "url": "http://www.lillianschs.com/location/lillians-petite-market-and-eatery/",
      "text": "Main content starts here, tab to start navigating Hours & Location 247 Congress St, Charleston, SC 29403 (opens in a new tab) (843) 203-6698 eatlocal@lillianschs.com Open Daily: 7:15 AM – 10:00 PM Coffee Bar: 7:15 AM – 3:00 PM (no reservations needed) Breakfast: 7:30 AM – 10:45 AM (no reservations needed)Lunch: 11:00 AM – 3:00 PM Brunch: Saturday & Sunday, 9:00 AM – 3:00 PMDinner: 5:00 PM – 9:00 PM Happy Hour (Bar): Daily, 4:00 PM – 6:00 PM Full Bar: 11:00 AM – 10:00 PM Pastries & Grab-and-Go: Available all day No reservations needed for coffee or breakfast served in our first-floor dining room in our quaint downtown Charleston neighborhood cafe. For lunch, brunch, and dinner, reservations are recommended but not required—walk-ins welcome. Terrace seating weather permitting. Get Directions (opens in a new tab) Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Please leave blank or enter a valid phone number Phone number - Optional Submit Please check errors in the form above Thank you for signing up for email updates! Close and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service",
      "hash": "219cfc6c70f9",
      "downloadedAt": "2026-01-18T17:02:43.512Z",
      "trimmedAt": "2026-01-18T17:05:08.456Z",
      "sizeReduction": "96.1%"
    },
    {
      "url": "http://www.lillianschs.com/private-events/",
      "text": "Main content starts here, tab to start navigating Private Events BOOK AN EVENT Looking for the perfect venue to host your next private event? Look no further! We offer an exquisite setting for all your special occasions. Whether you're planning a corporate gathering, a milestone celebration, or an intimate social event, our versatile spaces and exceptional service will make your event unforgettable. For all inquiries, please fill out the form below and we’ll be in touch soon. Contact Us About Your Private Event Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Please, enter a valid phone number Phone Number - Required Event Date - Required Please, enter a valid start time Start Time - Required Start Time 11:30 PM 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM 6:30 AM 6:00 AM 5:30 AM 5:00 AM 4:30 AM 4:00 AM 3:30 AM 3:00 AM 2:30 AM 2:00 AM 1:30 AM 1:00 AM 12:30 AM 12:00 AM Please, enter a valid end time End Time - Required End Time 11:30 PM 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM 6:30 AM 6:00 AM 5:30 AM 5:00 AM 4:30 AM 4:00 AM 3:30 AM 3:00 AM 2:30 AM 2:00 AM 1:30 AM 1:00 AM 12:30 AM 12:00 AM Please, enter a valid number of people Number of People - Required Location at Lillian's: - Optional Location at Lillian's: Commons Dining Room (1st floor) Jackalope Dining Room (2nd floor) Jackalope Dining Room + Bar (2nd floor) Terrace (2nd floor) Full Buyout Meal Type: - Optional Meal Type: Breakfast Lunch Brunch Dinner Cocktail-Style Service Style: - Optional Service Style: Passed Hors d’Oeuvres Buffet Family Style Plated Dunner Combination/Custom Bar Preference: - Optional Bar Preference: None Full Bar Beer + Wine Only Cash Bar Budget Range - Optional Budget Range Under $1,000 $1,000–$2,500 $2,500–$5,000 $5,000–$10,000 $10,000+ Not Sure Yet Additional Information - Optional Please, enter a valid how did you hear about us? How did you hear about us? - Required How did you hear about us? Word of Mouth Social Media Google/Web Search Referred by a Friend or Event Planner Other Submit Please check errors in the form above Thank you for your inquiry. We’ll be in touch shortly. and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Please leave blank or enter a valid phone number Phone number - Optional Submit Please check errors in the form above Thank you for signing up for email updates! Close and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service",
      "hash": "6993bec1a2b3",
      "downloadedAt": "2026-01-18T17:02:46.047Z",
      "trimmedAt": "2026-01-18T17:05:08.467Z",
      "sizeReduction": "93.9%"
    },
    {
      "url": "http://www.lillianschs.com/private-events",
      "text": "Main content starts here, tab to start navigating Private Events BOOK AN EVENT Looking for the perfect venue to host your next private event? Look no further! We offer an exquisite setting for all your special occasions. Whether you're planning a corporate gathering, a milestone celebration, or an intimate social event, our versatile spaces and exceptional service will make your event unforgettable. For all inquiries, please fill out the form below and we’ll be in touch soon. Contact Us About Your Private Event Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Please, enter a valid phone number Phone Number - Required Event Date - Required Please, enter a valid start time Start Time - Required Start Time 11:30 PM 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM 6:30 AM 6:00 AM 5:30 AM 5:00 AM 4:30 AM 4:00 AM 3:30 AM 3:00 AM 2:30 AM 2:00 AM 1:30 AM 1:00 AM 12:30 AM 12:00 AM Please, enter a valid end time End Time - Required End Time 11:30 PM 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM 6:30 AM 6:00 AM 5:30 AM 5:00 AM 4:30 AM 4:00 AM 3:30 AM 3:00 AM 2:30 AM 2:00 AM 1:30 AM 1:00 AM 12:30 AM 12:00 AM Please, enter a valid number of people Number of People - Required Location at Lillian's: - Optional Location at Lillian's: Commons Dining Room (1st floor) Jackalope Dining Room (2nd floor) Jackalope Dining Room + Bar (2nd floor) Terrace (2nd floor) Full Buyout Meal Type: - Optional Meal Type: Breakfast Lunch Brunch Dinner Cocktail-Style Service Style: - Optional Service Style: Passed Hors d’Oeuvres Buffet Family Style Plated Dunner Combination/Custom Bar Preference: - Optional Bar Preference: None Full Bar Beer + Wine Only Cash Bar Budget Range - Optional Budget Range Under $1,000 $1,000–$2,500 $2,500–$5,000 $5,000–$10,000 $10,000+ Not Sure Yet Additional Information - Optional Please, enter a valid how did you hear about us? How did you hear about us? - Required How did you hear about us? Word of Mouth Social Media Google/Web Search Referred by a Friend or Event Planner Other Submit Please check errors in the form above Thank you for your inquiry. We’ll be in touch shortly. and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Please leave blank or enter a valid phone number Phone number - Optional Submit Please check errors in the form above Thank you for signing up for email updates! Close and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service",
      "hash": "7e4cb36ce13d",
      "downloadedAt": "2026-01-18T17:02:48.162Z",
      "trimmedAt": "2026-01-18T17:05:08.478Z",
      "sizeReduction": "93.9%"
    },
    {
      "url": "http://www.lillianschs.com/wine-club-charleston/",
      "text": "Main content starts here, tab to start navigating Wine Club Join Wine Club (opens in a new tab) Lillian’s Wine Club — Charleston’s Monthly Natural Wine Drop (Join Now) Lillian’s Wine Club is live—join anytime. Each month, pick up a hand-selected trio of natural/low-intervention wineswith tasting notes, food pairings, and fun add-ons. Local pickup in Charleston during our Monday Market near Hampton Park. It’s a great way to meet people and connect with the neighborhood—sip with fellow wine lovers, discover new producers, and explore the endless world of wine without the fuss. Members get first dibs on special allocations, pop-up tastings, and seasonal extras curated by our team. Join Wine Club How it works — enroll online in minutes. Join now We curate — three seasonal bottles, plus optional add-ons. Pick up locally — collect at Lillian’s Monday Market (Charleston, SC). Sip & learn — enjoy tasting notes, producer stories, and pairing ideas. Why join Lillian’s Wine Club? Curated in Charleston: Sommelier-selected bottles that reflect the season and our Westside neighborhood vibe. Natural & low-intervention focus: Small producers, sustainable farming, and wines with a story. Member perks: Tasting notes, pairing tips with Lillian’s menu, first dibs on special drops & events. Easy local pickup: Grab your wines during our Monthly Monday Market—meet neighbors, support local vendors. Who it’s perfect for Fans of natural wine and small producers Charleston locals who love neighborhood gatherings Curious drinkers who want an easy, guided way to explore new regions and st FAQs Is there a waitlist?No—the club is live and open. Join anytime. Do you ship?Not yet. This is a local pickup wine club in Charleston, SC. When is pickup?During our Monthly Monday Market at Lillian’s (near Hampton Park/Westside). First Monday of the month unless that is a holiday between 4-6pm. Can I skip a month?Yes—sign into your account and pause that month. Are the wines “natural”?We focus on natural/low-intervention producers: thoughtful farming, minimal cellar manipulation, and tons of character. Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Please leave blank or enter a valid phone number Phone number - Optional Submit Please check errors in the form above Thank you for signing up for email updates! Close and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service",
      "hash": "85bad3bacc9d",
      "downloadedAt": "2026-01-18T17:02:46.612Z",
      "trimmedAt": "2026-01-18T17:05:08.481Z",
      "sizeReduction": "92.6%"
    },
    {
      "url": "http://www.lillianschs.com/store/events/",
      "text": "Main content starts here, tab to start navigating Ticketed Events The Curious Cocktail Class 03:30 PM Shake, stir, and sip through Lillian’s Bar Classes—explore spirits, craft cocktails, and mixology. Lillian’s Coffee Experience Taste, learn, and make drinks in this fun coffee class—includes coffee and syrup to take home! Load More Ticketed Events Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Please leave blank or enter a valid phone number Phone number - Optional Submit Please check errors in the form above Thank you for signing up for email updates! Close and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service",
      "hash": "97a93287b114",
      "downloadedAt": "2026-01-18T17:02:45.436Z",
      "trimmedAt": "2026-01-18T17:05:08.484Z",
      "sizeReduction": "97.7%"
    },
    {
      "url": "http://www.lillianschs.com/menus",
      "text": "Main content starts here, tab to start navigating Menus Slide 1 of 3 Slide 2 of 3 Slide 3 of 3 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Breakfast Brunch Lunch Dinner Wine List Cocktails & Beer Zero Proof Catering Menu Breakfast Monday - Friday 7:30 am - 11 am Seasonal Smoothie Flavors vary, just ask! Fruit-based 12.00 $ Veggie-based 12.00 $ Yogurt Bowl Local honey + yogurt, house-made granola 14.00 $ Bowl of Grits Plain 8.00 $ Veggie 10.00 $ Biscuit + Jam 6.00 $ add Gravy 2.00 $ add Sausage 3.00 $ add \"Diner Eggs\" + Cheddar 5.00 $ add Fried Chicken 6.00 $ Avocado Toast artisan sourdough, sliced avocado, shaved radish, arugula, lemon 15.00 $ add Egg 3.00 $ Breakfast Plate 2 Eggs, crispy potatoes or grits, bacon or sausage, biscuit + jam 16.00 $ Lil's Breakfast Crunchwrap house made sausage, egg, cheese, poblano crema, arugula, tomato, crispy corn tortilla, flour wrap, side salad 17.00 $ Grilled Breakfast Wrap scrambled egg, whipped feta grits, greens, tomato vinaigrette, crispy potatoes. add bacon +3 17.00 $ B.E.C. Sandwich bacon, “diner eggs”, cheddar, mayo, crispy potatoes 16.00 $ Daily selection of fresh, rotating pastries! Brunch Saturday - Sunday 9 am - 3 pm ESSENTIALS Biscuit + Jam 6.00 $ add Gravy 2.00 $ add Sausage 3.00 $ add \"Diner Eggs\" + Cheddar 5.00 $ add Fried Chicken 6.00 $ B.E.C. Sandwich bacon, “diner eggs”, cheddar, mayo, crispy potatoes 16.00 $ Breakfast Plate 2 Eggs, crispy potatoes or grits, bacon or sausage, biscuit + jam 16.00 $ Bowl of Grits PLAIN 8.00 $ VEGGIE 10.00 $ TOAST Steak + Eggs Toast sourdough, prime rib, sunny eggs, simple green salad 21.00 $ Avocado Toast artisan sourdough, sliced avocado, shaved radish, arugula, lemon 15.00 $ add Egg 3.00 $ Soft Scrambled Egg sourdough, burrata, pesto, arugula 15.00 $ Classic French Toast brioche, maple syrup, butter, powdered sugar SINGLE 8.00 $ DOUBLE 16.00 $ add Fried Chicken 10.00 $ REMIX West Side Burger beef + bacon smash patty, special sauce, house pickles, lettuce, cheddar, crispy potatoes SINGLE 14.00 $ DOUBLE 21.00 $ Lil's Lunch Crunchwrap beef + bacon patty, velveeta, poblano crema, arugula, tomato, seasonal side salad 17.00 $ Grilled Breakfast Wrap scrambled egg, whipped feta grits, greens, tomato vinaigrette, crispy potatoes. add bacon +3 17.00 $ Huevos Rancheros crispy corn tortilla, chuck roast, ground pork, sea island peas, tomatoes, avocado, chilchota, creme fraiche, fresno, sunny eggs 19.00 $ SWEET TREAT Monkey Bread cinnamon-sugar caramel + vanilla glaze 12.00 $ * Consuming raw or undercooked meats, poultry, seafood, shellfish, or eggs may increase your risk of foodborne illness, especially if you have certain medical conditions. Local Famrs: Kurios Farms, Gallop Farms, Lowcountry Creamery, Storey Farms, Bulls Bay Saltwork, White House Farms, Edisto Gold Honey Lunch Monday - Friday 11 am - 3 pm HANDS Turkey Wrap brie, apples, greens, napa cabbage, lemon pomegranate vinaigrette, potatoes 17.00 $ Fried Chicken Sandwich house pickles, gem lettuce, special sauce, milk bun, potatoes 17.00 $ Hot Italian salami, ham, burrata, hot peppers, arugula, pesto, potatoes 19.00 $ Lil's Lunch Crunchwrap beef + bacon patty, velveeta, poblano crema, arugula, tomato, seasonal side salad 17.00 $ West Side Burger beef + bacon smash patty, special sauce, house pickles, lettuce, cheddar, crispy potatoes SINGLE 14.00 $ DOUBLE 21.00 $ Prime Rib Cheesesteak peppers + onions, mushrooms, cheese wiz, potatoes 21.00 $ FORKS Breakfast Plate 2 Eggs, crispy potatoes or grits, bacon or sausage, biscuit + jam 16.00 $ Avocado Toast artisan sourdough, sliced avocado, shaved radish, arugula, lemon 15.00 $ add Egg 3.00 $ Roasted Winter Squash Soup grilled focaccia, cashew, cranberry, sage 16.00 $ Harvest Salad apples, roasted beets, greens, napa cabbage, pepitas, lemon pomegranate vinaigrette 15.00 $ Hand Cut Pasta roasted squash, sweet potato, fancy mushrooms, squash puree, cashew + cranberry + sage gremolata 18.00 $ Braised Beef + Grits exotic mushroom gravy, shaved parm, herbs 21.00 $ Local Farms: Kurios Farms, Gallop Farms, Lowcountry Creamery, Storey Farms, Bulls Bay Saltwork, White House Farms, Edisto Gold Honey Dinner Monday - Sunday 5 pm - 9 pm FINS Crab Rangoon harb salad, sweet chili sauce 15.00 $ Littleneck Clams New England chowder broth, sourdough 22.00 $ Appalachian Rainbow Trout potatoes, carrots, artichoke, olives, red bell pepper, saffron broth 38.00 $ FEATHERS Duck Ham city cured, cornbread, sweet potato jam 15.00 $ General Tso’s Quail gold rice, toasted broccoli, napa cabbage, hot peppers 20.00 $ Chicken + Dumplings sweet potato, mushroom, masa dumpling, achiote + toasted chile gravy 32.00 $ HOOVES Chili Colorado beef tongue stew, house made sope, crema, taco truck garnishes 15.00 $ Lamb Loin potatoes, carrots, mint, garlic parmesan yogurt 30.00 $ Braised Beef Madeira hunter cattle shank, handkerchief pasta, mushroom ragout 35.00 $ ROOTS Roasted Beets brie, pomegranate, sage 14.00 $ Kohlrabi Gratin cast iron baked + a wee winter salad 18.00 $ Winter Squash Pappardelle oyster mushrooms, sweet potato, squash puree, cashew cranberry gremolata 30.00 $ Local Farms: Kurios Farms, Gallop Farms, Lowcountry Creamery, Storey Farms, Bulls Bay Saltwork, Edisto Gold Honey, Hunter Cattle, Super Mushroom Bro, White House Farms Wine List White Inama Vin Soave Soave Classico, Veneto, Italy Glass 13.00 $ Bottle 52.00 $ Terlano, Pinot Bianco Trentino, Italy Glass 15.00 $ Bottle 60.00 $ Karthäuserhof, “Bruno”, Riesling Dry Mosel, Germany 72.00 $ Chai de la Dive, “Les Moulins”, Saumur Blanc Chenin Blanc, Loire Valley, France 68.00 $ Lucien Reymond, Sancerre, Sauvignon Blanc Loire Valley, France Bottle 78.00 $ Jean-Marc Brocard, Chardonnay Bourgogne, France Glass 14.00 $ Bottle 56.00 $ Peirano Estate Vineyards, Chardonnay Lodi, California, USA Glass 14.00 $ Bottle 56.00 $ Domaine de la Perriere, Chablis, Chardonnay Burgundy, France Bottle 76.00 $ Sparkling White M. Bonnamy, Crémant de Loire Loire Valley, France Glass 15.00 $ Bottle 60.00 $ Tenuta Santomè, Prosecco DOC Extra Dry Treviso, Italy Glass 13.00 $ Bottle 52.00 $ Gaillacoise, Rémi Larroque, Pet-Nat Mauzac, South West, France Glass 15.00 $ Bottle 60.00 $ Rosé La Cigale, Domaine Gavoty, Rosé Provence, France Glass 14.00 $ Bottle 56.00 $ Meinklang, Pet-Nat, Pinot Noir + Blaufrankisch Burgenland, Austria Glass 15.00 $ Bottle 60.00 $ Orange Wine Skin Contact Finca El Molar, Orange Macabeo, Manchuela, Spain Glass 14.00 $ Bottle 56.00 $ Rare Orange, Chateau Maris, Pet Nat Muscat Blanc à Petits Grains Bottle 58.00 $ Red Wine Vignobles Bulliat - Bibine, Gamay Beaujolais, France Glass 15.00 $ Bottle 60.00 $ Prost, Pinot Noir Pfalz, Germany Glass 13.00 $ Bottle 52.00 $ Clos Bortier Rouge, Pinot Noir Burgundy, France Bottle 105.00 $ Chave, “Mon Coeur”, Côtes-du-Rhône Rhône Valley, France Glass 17.00 $ Bottle 68.00 $ Podere Il Palazzino, Sangiovese Tuscany, Italy Bottle 48.00 $ Corriente Bodega Lanzaga, Blend Rioja, Spain Glass 15.00 $ Bottle 60.00 $ Le P’tit Paysan, Le P’tit, Pape Central Coast, California Bottle 68.00 $ Poppy, Cabernet Sauvignon Paso Robles, California Glass 13.00 $ Bottle 52.00 $ Fortune 1621, Cabernet Sauvignon Napa, California Bottle 78.00 $ Cocktails & Beer ALL BOOZE, NO BRAKES ALMOST A NEGRONI Campari & Cappelletti cacao blend, Amaro Nardini, Nordés gin, orange twist 18.00 $ Dream Potion #247 (Black Manhattan) bourbon infused with calming herbs + lavender + orange, amaro, black cherry 18.00 $ Mignonette-tini mignonette-infused gin, house mignonette tincture, olive brine, saline, olives 18.00 $ LIL's WAY Aperitif - Spritzes, WHICH ONE? apple-cider chai · blackberry-lemon-lavender · garden · Rinomato 13.00 $ Sake - Lost in Translation sparkling citrus, floral sake, absinthe 14.00 $ Gin - When You Love Somebody, FALL our gin riff with spiced tangerine-rooibos tea 16.00 $ Blanco - Little Wing green tea, citrus, spice, cacao, bitters Butterflies · Zebras · Moonbeams · Fairytales 16.00 $ Blanco - Boys go to Jupiter, sub Levity pineapple shrub, lime, prickly pear, ginger Queens Remedy’s rebel niece. 16.00 $ Mezcal - Naked & Almost Famous very good, very herbaceous 16.00 $ Rum - Try Matty’s, painkiller pear, Oktoberfest syrup, chai spices, hay 15.00 $ Bourbon - Season of the Witch Buffalo Trace, cider spices, black walnut, cherry, orange Smoke · Magic tricks · Still manly 17.00 $ TRUST THE PROCESS Roll the Dice + Something Nice dealers’ choice - no allergies, no mods 18.00 $ BEER COCKTAILS Ben’s Tune-up Hefeweizen, Aperol, orange 12.00 $ Fancy Fall Tallboy Oktoberfest, spiced shrub, amaro, cinnamon-sugar 13.00 $ DRAFT BEERS Stiegl, Radler Zesty, refreshing Austrian radler, real grapefruit juice + Stiegl’s signature lager ABV: 2.5% | Style: Grapefruit Radler 9.00 $ Coast, Kolsch German-style Kölsch with light malt sweetness, a dry finish, perfect for easy drinking ABV: 4.8% | Style: Kölsch 10.00 $ Munkle, Pilsner Traditional German-style Pilsner with crisp maltiness + a floral hop finish ABV: 4.9% | Style: Pilsner 8.00 $ Westbrook, White Thai Belgian-style wheat beer, lemongrass and ginger, refreshing and zesty flavor profile ABV: 5.0% | Style: Witbier 9.00 $ Edmund’s Oast, Bound by Time IPA Hazy IPA with notes of tropical fruit + citrus, smooth bitterness, balanced hop-forward profile ABV: 6.8% | Style: IPA 10.00 $ Canned Beers Fatty’s Beer Works, F Light (12 oz) ultra-refreshing American lager; dry finish ABV: 4.2% | Style: Lager 7.00 $ Freehouse, Green Door (16 oz) Organic, balanced malt body, citrus + pine ABV: 6.7% | Style: IPA 12.00 $ Keepsake, Marigold Hefeweizen (12 oz) bright wheat; clove/banana; fluffy finish ABV: 5.0% | Style: Hefeweizen 9.00 $ Munkle Brewing, Third Floor Tripel (12 oz) spicy Belgian tripel; pear & clove; dry finish ABV: 8.2% | Style: Tripel 8.00 $ Zero Proof COCKTAILS Peace of Mind herbal syrup, ginger juice, lime, Aplós Ease, soda 11.00 $ Good Thoughts similar build as Peace of Mind + a brighter citrus twist 11.00 $ Holy Trinity THC apple cider,reishi-chai, Levity, soda 11.00 $ BEER + HOUSE-MADE SODAS Untitled Art, NA Pils Non-alcoholic Pilsner, classic lager vibes without the buzz ABV: <0.5% | Style: Non-Alcoholic Pilsner 12 oz 8.00 $ House-made Sodas Cherry Limeade · Root Beer · Ginger Beer · Fresca · Shrub 11.00 $ Add House Spirit 4.00 $ Catering Menu Make holiday hosting effortless. Order chef-made dishes by December 19 and pick up December 24. Seasonal, delicious, and ready for your celebration. Holiday Catering Beef Tenderloin served with fancy mushroom red wine jus, 4 servings per order 4 servings 165.00 $ Pork Tenderloin served with roasted apple bourbon maple glaze, 4 servings per order 4 servings 145.00 $ Potato Gratin smoked cheddar, garlic, parmesan cream, 4 servings per order 4 servings 24.00 $ Southern Green Beans shallot, garlic, smokey bacon, 4 servings per order 4 servings 20.00 $ Creamed Spinach nutmeg, bechamel, toasted biscuit crumble, 4 servings per order 4 servings 24.00 $ Mac n Cheese american cheese, parmesan, dijon, bread crumbs, 4 servings per order 4 servings 24.00 $ Root Vegetables + Winter Squash herb butter, caramelized onion 4 servings 20.00 $ Complete Meal: Entrée, Sides & Dessert (Per Person) Choose One — Priced Per Person Each meal is packaged as a complete individual dinner in one compartment-style container for easy transport and reheating. Beef Tenderloin: potato gratin, green beans, roll + chocolate chess pie 55.00 $ Pork Tenderloin: mac n cheese, root vegetables, roll + eggnog custard pie 45.00 $ Braised Beef Lasagna: creamed spinach, roll + eggnog custard pie 35.00 $ Kids Meal: chicken nuggets, mac n cheese, green beans, fruit + cookie 20.00 $ Pies Allison’s Famous Holiday Pies Pecan, apple, chocolate chess, eggnog custard… why choose when you can get one of each? :) Apple 25.00 $ Pecan 35.00 $ Chocolate Chess 25.00 $ Eggnog Custard 25.00 $ Bread Accompaniment Pick your breads and treats: focaccia, yeast rolls, cornbread, biscuits, and cinnamon rolls. All are sold by the half-dozen, and you’re welcome to choose more than one. per 1/2 dozen 1/2 dozen Yeast Rolls 15.00 $ Focaccia 16.00 $ Cornbread 15.00 $ Biscuits 18.00 $ Cinnamon Rolls 20.00 $ Catering Packages Cocktail Party Package Seasonal crudité: seasonal vegetables + three dips Blue crab dip + Old Bay crackers Mini tomato pies Tarvin shrimp cocktail: Poached shrimp with lemon wedges and cocktail sauce Sliced beef tenderloin: mayo, grain mustard, horseradish, slider buns Mini ham and cheese biscuits Mini dessert platter 6-8 people 260.00 $ 8-10 people 325.00 $ dairy, egg, gluten, nuts, shellfish Lillian's Game Day Package Deviled eggs: traditional Caprese skewers: fresh mozzarella, local cherry tomatoes, basil leaves, balsamic glaze, and EVOO Seasonal crudité: seasonal vegetables + three dips Lill’s wings: tossed in Lillian’s hot sauce Tarvin shrimp cocktail: poached shrimp with lemon wedges and cocktail sauce Pulled pork sliders: braised pork, Carolina BBQ, slider buns, slaw 4-6 people 180.00 $ 6-8 people 245.00 $ 8-10 people 306.00 $ dairy, gluten, shellfish Picnic Package Hummus, pita chips, carrots, cucumbers Choice of sliders: 2 per person Cookie or Fruit Bottled Still or Sparkling Water 2 people 40.00 $ 4 people 76.00 $ 6 people 108.00 $ Turkey Ham Chicken Salad Pimento Cheese Shaved Prime Beef (upgrade - price per person) 5.00 $ Pork Belly (upgrade - price per person) 3.00 $ Bottled Still Sparkling Water Cookie Fruit dairy, egg, gluten Low Country Boil Shrimp, potatoes, corn, sausage, boiled in Cajun spice. Served with lemon wedges, cocktail sauce. 6-8 people 200.00 $ 8-10 people 250.00 $ shellfish Lillian’s Fried Chicken Package Deviled eggs: traditional Fried chickens: served with Fresno hot sauce Mac and Cheese: creamy cheese sauce, garlic breadcrumbs Seasonal Salad: mixed greens, summer vegetables, seasonal vinaigrette Rolls 4 people 120.00 $ 8 people 232.00 $ dairy, egg, gluten Sliced Flank Steak Dinner Sliced flank steak topped with chimichurri. Served with smashed fingerling potatoes, seasonal vegetables, and slider buns. 4-6 people 140.00 $ 6-8 people 189.00 $ 8-10 people 234.00 $ dairy, gluten Lillian’s Gluten-Free Catering Package Seasonal crudité: fresh seasonal vegetables served with three gluten-free dips Caprese Skewers: Fresh mozzarella, local cherry tomatoes, basil leaves + balsamic glaze and EVOO Tarvin Shrimp Cocktail: Poached shrimp with lemon wedges + cocktail sauce Flank steak sliced and topped with chimichurri Dessert platter: assortments with gluten-free options 6-8 people 273.00 $ 8-10 people 342.00 $ dairy, shellfish Quiche Brunch At Home Storey Farms quiche: spinach, goat cheese, heirloom tomato Yogurt parfait: local yogurt, local honey, granola, berries Seasonal salad: mixed greens, vegetables, seasonal vinaigrette Thick-Cut Bacon 4-6 people 150.00 $ 8-10 people 261.00 $ dairy, egg, gluten, nuts Shrimp and Grits Brunch Tarvin local shrimp, stone ground grits, tomatoes, onion, sausage Poached local eggs Thick-Cut bacon Collard greens House-made biscuits: with butter, and house-made jam 4-6 people 165.00 $ 8-10 people 288.00 $ dairy, egg, gluten, shellfish Game Day Snacks Whether you’re feeding a couple of superfans or hosting the whole neighborhood, just choose your favorites and we’ll have everything ready for pickup at Lillian’s. Pimento Cheese Sliders, dozen 36.00 $ Pulled Pork Sliders, dozen 48.00 $ Cheeseburger Sliders, dozen 48.00 $ Prime Rib Sliders, dozen 60.00 $ Wings, 2 dozen 50.00 $ Pasta Salad, quart 24.00 $ Chips + Queso, pint 15.00 $ Crab Dip, pint 16.00 $ Pimento Cheese Dip, pint 12.00 $ Extra Chips 4.00 $ Pickled Vegetables, pint 14.00 $ Beverages Catering Coffee Box (96 oz) Enjoy our freshly brewed Second State drip coffee, packaged hot and ready to serve. Each box contains 96 fluid ounces, yielding approximately twelve 8-ounce cups — perfect for meetings, brunches, and small gatherings. Served with cups, lids, stirrers, and sugar on request. 96 fluid ounces 36.00 $ Local Chocolate Milk Traditional Per ½ Gallon 7.00 $ Local Whole Milk Traditional Per Gallon 11.00 $ Bloody Mary Kit Seasonal Pickled Vegetables Jack Rudy’s Bloody Mary mix (10 servings) Celery House-made hot sauce 38.00 $ À la Carte Chicken Salad Hand-pulled roasted chicken, crisp celery, scallion, house pickles, and a touch of Duke’s—creamy, bright, and classic. Pint 12.00 $ Quart 22.00 $ egg Caprese Skewers Price per dozen. Fresh mozzarella, local cherry tomatoes, basil leaves and balsamic glaze, and a touch of extra virgin olive oil per Dozen Dozen 22.00 $ dairy Seasonal Crudité Cups Price per dozen. Individual seasonal vegetables + hummus cups Dozen 30.00 $ dairy, egg, sesame, vegetarian Seasonal Crudité Platter Seasonal vegetables + three dips (hummus*, ranch, green goddess) Small: 4-6 people 39.00 $ Large: 8-10 people 75.00 $ dairy, egg, sesame, vegetarian Mini Ham and Cheese Biscuits Price per dozen. House-made buttery biscuits, baked golden and filled with savory ham and cheese. Dozen 26.00 $ dairy, gluten Mini Tomato Pies Price per dozen. A Southern classic in bite-size form, with flaky pastry shells filled with ripe tomatoes, melted cheese, and fresh herbs. Dozen 36.00 $ dairy, egg, gluten, wheat Charcuterie Cups Per Dozen. Individually portioned 12 oz cups filled with a chef’s selection of artisanal cheeses, cured meats, fresh fruit, olives, crackers, and seasonal garnishes. A stylish and convenient way to enjoy charcuterie. per dozen 180.00 $ dairy, gluten, tree nut, wheat, contains sugar Charcuterie Platter An artful spread of artisanal cheeses, cured meats, fresh and dried fruits, seasonal vegetables, nuts, crackers, and fresh herbs. Perfect for sharing at parties, receptions, and corporate gatherings. Small (serves 6–8) 85.00 $ Medium (serves 10–12) 135.00 $ Large (serves 15–20) 195.00 $ dairy, gluten, tree nut, wheat, contains sugar Lill’s Wings Dry rub, lil’s hot BBQ sauce. Price per dozen. Dozen 26.00 $ dairy Shrimp Cocktail Shooters Priced per dozen Chilled poached shrimp over our bright tomato–horseradish cocktail sauce in a one-bite shooter, finished with lemon and an Old Bay sprinkle. per dozen Dozen 28.00 $ shellfish Shrimp Cocktail Platter Price per lb. Poached shelled & deveined shrimp with house cocktail sauce + pink sauce, garnished with celery, cucumber, lemon wedges, and chives. LB 42.00 $ shellfish Blue Crab Dip Warm, creamy dip loaded with lump blue crab, lemon, and chives—finished with a whisper of Old Bay. Served with Old Bay–dusted crackers. Pint 16.00 $ Quart 30.00 $ dairy, egg, gluten, shellfish, wheat Steak & Seasonal Vegetable Bites Skewered seared steak paired with roasted mushrooms and chef’s choice of fresh seasonal vegetables. A flavorful, gluten-free bite-sized appetizer. per dozen 60.00 $ Pimento Cheese Sliders Price per dozen. Classic, pimento cheese served on a soft, sweet King’s Hawaiian roll for the perfect bite-sized treat. Dozen 36.00 $ dairy, egg, gluten, wheat Pimento Cheese Southern classic made with sharp cheddar, roasted pimentos, and a touch of spice. Perfect as a spread, dip, or tea sandwich filling. Pint 12.00 $ Quart 22.00 $ dairy, egg, contains sugar Pulled Pork Sliders Braised pork, Carolina BBQ, housemade pickles, slaw, 12 slider buns Price per dozen. Dozen 48.00 $ dairy, egg, gluten Cheeseburger Sliders Per dozen. Beef + bacon smash patties, special sauce, lettuce, house pickles, cheddar. per doen 60.00 $ dairy, gluten, soy, wheat, contains sugar Sliced Beef Tenderloin Mayo, grain mustard, horseradish, housemade pickles, slider buns 12 sliders Dozen 96.00 $ dairy, egg, gluten Mac and Cheese Creamy cheese sauce, garlic breadcrumbs. Quart: Serves 4-6 32.00 $ 1/2 pan: serves 8-10 as a side 58.00 $ dairy, gluten Seasonal Salad Mixed greens, seasonal vegetables, seasonal vinaigrette Small: Serves 4-6 35.00 $ Large: Serves 8-10 61.00 $ Family Style Caesar Salad Romaine, Garlic Croutons, Parmesan Cheese, Dressing Small: serves 4-6 30.00 $ Large: Serves 8-10 54.00 $ dairy, egg, gluten Mini Dessert Platter Cookies, brownies, whoopie pies, key lime bites, pecan pie bars (assortment changes weekly) Price per 12 ct 2 Dozen 48.00 $ dairy, gluten, nuts Sugar Cookie Kit Price per 2 dozen baked sugar cookies in seasonal shapes, 3 colored icings, and a piping bag 48.00 $ dairy, egg, gluten Churro Spice Donut Holes Chocolate, caramel, and crème anglaise dipping sauces Price per dozen. 20.00 $ dairy, egg, gluten Pastry Box Mix of Seasonal Pastry Selections: biscuit, scones, banana or lemon bread, muffins, cinnamon rolls Full size per 1/2 dozen 1/2 dozen 26.00 $ per dozen dozen 50.00 $ dairy, egg, gluten, wheat Yogurt Parfait Local yogurt, local honey, granola, berries 4-6 people - make your own 46.00 $ Individual servings: dozen 48.00 $ dairy, nuts Seasonal Fresh Fruit Seasonal Fresh Fruit Pint 12.00 $ Quart 22.00 $ Deviled Eggs Dozen, traditional dozen 28.00 $ dairy, egg Deviled Egg Bar Priced by the dozen. A customizable spread of classic deviled eggs with rotating flavors and toppings. Guests can add their own garnishes, creating a fun, interactive, and personalized appetizer experience. per dozen 32.00 $ dairy, egg, gluten free Storey Farms Quiche Spinach, goat cheese, heirloom tomato 42.00 $ dairy, egg, gluten Biscuits and Gravy Half dozen large biscuits + sausage gravy 42.00 $ Biscuits, dozen 36.00 $ Sausage Gravy, pint 24.00 $ House-made Jam, seasonal, 8oz 15.00 $ Whipped Butter, 8oz 15.00 $ dairy, gluten Chicken + Waffles Sliders Per dozen. Mini buttermilk waffles as the buns, filled with crispy fried chicken and finished with a drizzle of local hot honey. per dozen 60.00 $ dairy, egg, gluten, wheat, contains sugar Brioche French Toast: Plain + Toppings Bar + Cups Priced by the dozen. Our whole, thick-cut brioche French toast slices come ready to warm. Standard (powdered sugar), dozen 96.00 $ Premium (+ one premium topping), dozen 108.00 $ Luxe (+ one premium toppings & one specialty sauce), dozen 126.00 $ Additional Toppings, per dozen 12.00 $ Additional Sauces, per dozen 18.00 $ French Toast in Dip Cups, per dozen 36.00 $ Thick Cut Bacon Serves 4-6 4-6 people 28.00 $ Dozen Local Eggs 8.50 $ Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Please leave blank or enter a valid phone number Phone number - Optional Submit Please check errors in the form above Thank you for signing up for email updates! Close and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service",
      "hash": "abc84bd6d465",
      "downloadedAt": "2026-01-18T17:02:47.431Z",
      "trimmedAt": "2026-01-18T17:05:08.589Z",
      "sizeReduction": "90.3%"
    },
    {
      "url": "http://www.lillianschs.com/events-at-lillians/",
      "text": "Main content starts here, tab to start navigating Events At Lillian's Wine Club Monday Markets Happy Hour Load More Events Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Please leave blank or enter a valid phone number Phone number - Optional Submit Please check errors in the form above Thank you for signing up for email updates! Close and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service",
      "hash": "c6b7a854e4c1",
      "downloadedAt": "2026-01-18T17:02:44.649Z",
      "trimmedAt": "2026-01-18T17:05:08.593Z",
      "sizeReduction": "98.3%"
    }
  ],
  "sizeReduction": "92.1%"
}