{
  "venueId": "ChIJday_Kjxx_ogRcNHxH23hFMg",
  "venueName": "Holiday Inn Express & Suites",
  "venueArea": "Mount Pleasant",
  "website": "https://www.ihg.com/holidayinnexpress/hotels/us/en/mount-pleasant/chsgr/hoteldetail",
  "scrapedAt": "2026-01-18T17:04:28.427Z",
  "trimmedAt": "2026-01-18T17:11:20.443Z",
  "pages": [
    {
      "url": "https://www.ihg.com/holidayinnexpress/hotels/us/en/mount-pleasant/chsgr/hoteldetail/hotel-offers",
      "text": "Skip To main content View prices Holiday Inn Express & Suites Charleston - Mount Pleasant Offers Save on your hotel stay with these exclusive Holiday Inn Express & Suites Charleston - Mount Pleasant deals. Hotel packages available Prices shown reflect an average per night stay from VIEW ALL PACKAGES View in other languages English English (GB) 日本語 Deutsch 繁體中文 Español 中文 Français Español (España) Italiano Nederlands Русский Português 한국어 ไทย العربية Português (BR) Bahasa Indonesia Türkçe",
      "hash": "477b63bd1f85",
      "downloadedAt": "2026-01-18T16:56:21.637Z",
      "trimmedAt": "2026-01-18T17:11:20.223Z",
      "sizeReduction": "99.6%"
    },
    {
      "url": "https://www.ihg.com/holidayinnexpress/hotels/us/en/mount-pleasant/chsgr/hoteldetail",
      "text": "Skip To main content View prices View all Holiday Inn Express & Suites Charleston - Mount Pleasant Important Announcements Located minutes from Historic Downton Charleston as well as area beaches. Recently Renovated & Minutes from Downtown Charleston and Patriot's Point Come see Charleston, South Carolina at its best when you stay at the Holiday Inn Express & Suites Mount Pleasant - Charleston hotel. Located at the foot of the Arthur Ravenel Jr. Bridge, just off Hwy 17, it's easy to get around both Mount Pleasant and Charleston, SC. You are sure to be pleased with our newly renovated rooms and public spaces. Plus enjoy our outdoor pool, on-site laundry room, fitness center, daily housekeeping, and of course, free breakfast daily! You will find Charleston’s top attractions within a few minutes of our Mount Pleasant hotel. We are only a few miles from , Fort Moultrie, and the South Carolina Aquarium. Enjoy a day at the beach and visit nearby Isle of Palms or . Make sure you do not miss a trip to Patriot’s Point, home of the USS Yorktown, where you can also grab a ferry to the historic Fort Sumter. historic Downtown Charleston Sullivan’s Island; ranked the #1 beach in South Carolina by US News Travel Our meeting room can accommodate up to 55 people and is perfect for events. Nearby businesses include Raytheon, AT&T and Nucor, and we are also close to MUSC and College of Charleston. Kids eat free Free breakfast Fitness center On-site parking Pet-Friendly Pool Smoke-free hotel Wi-fi Cashless hotel Kids eat free Free breakfast Fitness center On-site parking Pet-Friendly Pool Smoke-free hotel Wi-fi Cashless hotel Explore all amenities Accommodations One Bedroom Suite Book Now Standard Rooms Book Now Suite Book Now Two Bedroom Suite Book Now One Bedroom Suite Book Now Standard Rooms Book Now Suite Book Now Two Bedroom Suite Book Now Reservations: Front desk: 1-843-3752600 Email: info@hiemountpleasant.com 350 Johnnie Dodds Blvd. Mount Pleasant, South Carolina 29464 United States Parking and transportation details : 3:00 PM Check-in : 11:00 AM Check-out : 18 Minimum check-in age The highlights Enjoy Quality Coffee Anytime! Pet Friendly Accomodations Close Proximity to Healthcare Facilities Daily Housekeeping Enjoy Quality Coffee Anytime! Savor the taste of freshly brewed coffee around the clock with our new bean-to-cup coffee machines, available 24/7 in the lobby. Elevate your stay with us and relish every sip of our exceptional coffee! Pet Friendly Accomodations Pet-friendly accommodations are now available! Learn more Close Proximity to Healthcare Facilities Our hotel is 3 miles to East Cooper Medical Center, 5 miles to MUSC, and close to many other medical facilities. Special medical rates are available, please call to inquire. Call +1-843-375-2600 Call +1-843-375-2600 Daily Housekeeping Enjoy daily housekeeping services on property! Call +1-843-375-2600 Call +1-843-375-2600 Explore Holiday Inn Express & Suites Charleston - Mount Pleasant Sleep well, rest easy View rooms Elevate your experience View amenities See it to believe it View photos Sleep well, rest easy View rooms Elevate your experience View amenities See it to believe it View photos Hotel packages available Prices shown reflect an average per night stay from View all packages Offers View All Offers FAQs for Holiday Inn Express & Suites Charleston - Mount Pleasant Does Holiday Inn Express & Suites Charleston - Mount Pleasant have a pool? Yes, Holiday Inn Express & Suites Charleston - Mount Pleasant has an outdoor pool. How much is parking at Holiday Inn Express & Suites Charleston - Mount Pleasant? Complimentary parking is available at Holiday Inn Express & Suites Charleston - Mount Pleasant for hotel guests. Can I bring my pet to Holiday Inn Express & Suites Charleston - Mount Pleasant? Pets are welcome at Holiday Inn Express & Suites Charleston - Mount Pleasant. Our Pet Policy: We are happy to host you and your pets. The nightly pet fee is 65 dollars per night up to 2 pets. All pets must be leashed and may not be left unattended in guest rooms. Can I cancel my booking at Holiday Inn Express & Suites Charleston - Mount Pleasant for a full refund? Always check the hotel's cancellation policy before booking a rate. Room cancellation is subject to rate booked at time of reservation and cancellation policy varies by rate. Does Holiday Inn Express & Suites Charleston - Mount Pleasant have a restaurant on site? No, there is no on site restaurant at Holiday Inn Express & Suites Charleston - Mount Pleasant. Is there free breakfast available at Holiday Inn Express & Suites Charleston - Mount Pleasant? Breakfast is free with your stay at the Holiday Inn Express & Suites Charleston - Mount Pleasant. When is breakfast at Holiday Inn Express & Suites Charleston - Mount Pleasant? Breakfast at Holiday Inn Express & Suites Charleston - Mount Pleasant is available from 6:00 AM to 9:30 AM.On weekends, breakfast is available from 6:00 AM to 10:00 AM. Is there a complimentary shuttle available at Holiday Inn Express & Suites Charleston - Mount Pleasant? No, there is not a complimentary local area shuttle available at Holiday Inn Express & Suites Charleston - Mount Pleasant. What are the check-in and check-out times for Holiday Inn Express & Suites Charleston - Mount Pleasant? Check-in at Holiday Inn Express & Suites Charleston - Mount Pleasant is from 3:00 PM, and check-out time is 11:00 AM. Contact the hotel directly for options available for early check-in or late check-out. Does Holiday Inn Express & Suites Charleston - Mount Pleasant offer free Wi-Fi? Yes, the Holiday Inn Express & Suites Charleston - Mount Pleasant offers free WiFi! Read more FAQs View in other languages English English (GB) 日本語 Deutsch 繁體中文 Español 中文 Français Español (España) Italiano Nederlands Русский Português 한국어 ไทย العربية Português (BR) Bahasa Indonesia Türkçe",
      "hash": "52ab059e9986",
      "downloadedAt": "2026-01-18T16:56:20.041Z",
      "trimmedAt": "2026-01-18T17:11:20.324Z",
      "sizeReduction": "97.5%"
    },
    {
      "url": "https://www.ihg.com/holidayinnexpress/hotels/us/en/mount-pleasant/chsgr/hoteldetail/events-facilities",
      "text": "Skip To main content View prices View all Holiday Inn Express & Suites Charleston - Mount Pleasant Meetings & events Our hotel's meeting room is ready to serve you with nearly 736 square feet and seating for 40. We also have a Business Center providing printing services and free Wi-Fi access. We can help plan your event or meeting. Request a proposal Sweetgrass Meeting Room Our Sweetgrass Meeting Room is ready to serve you with nearly 700 square feet and seating for 55. We also have a Business Center providing printing services and free Wi-Fi access. We can help plan your event or meeting. 1st Floor 55 Guests We've got you covered Comprehensive multimedia + audio visual support Office supplies available for meeting rooms Shipping available Printing services Creative meeting and event concept consultation Scanner Fax services Printer Wi-Fi throughout hotel Event planning available Event Offers Have more questions? Contact us View in other languages English English (GB) 日本語 Deutsch 繁體中文 Español 中文 Français Español (España) Italiano Nederlands Русский Português 한국어 ไทย العربية Português (BR) Bahasa Indonesia Türkçe",
      "hash": "7e8e8d00414c",
      "downloadedAt": "2026-01-18T16:56:22.229Z",
      "trimmedAt": "2026-01-18T17:11:20.354Z",
      "sizeReduction": "99.1%"
    },
    {
      "url": "https://www.ihg.com/holidayinnexpress/content/us/en/deals/hotel-offers",
      "text": "Skip To main content Book now Offers Holiday Inn Resort Samui Bophut Beach Pay for your stay with Points + Cash Stretch your points further when you book with Points + Cash. Use your existing points and purchase the remaining points required with cash to redeem your Reward Night. Learn more Buy points and get there faster With two ways to buy points, you can reach what you want faster. Buy points to stock up for future travel or add Elite Qualifying points to a booking. Learn More Find A Perfect Gift From gift cards to unique travel destinations, our new rewards catalog is full of ideas and experiences for you to enjoy. Shop Our Catalog Great rates are just a click away With IHG One Rewards, you can get access to our exclusive Member Rate. Book now Buy, gift, or transfer points Enjoy endless possibilities with Points Purchase. Buy points InterContinental ANA Manza Beach Resort Treat yourself to a Reward Night Redeem your IHG One Rewards points for a Reward Night at our 6,600+ hotels and resorts around the world, starting at just 10,000 points. Book now Rewards are just a tap away Download the IHG One Rewards app today. Enjoy fast booking and Rewards on the go – however and wherever you travel. Learn More Travel like you mean it Explore our collections to find the perfect spot for your next vacation, meeting or bucket-list escape. Discover more with our 20 brands and 6,600+ destinations. Explore Now Stay at IHG and earn towards flights IHG One Rewards Members can earn miles for their stays Learn More Earn and redeem points with our partners Maximize your membership with great travel deals on car rentals, restaurants, activities and more. View all partner offers It's better to be a member EARN POINTS TO USE FOR REWARD NIGHTS NO BLACKOUT DATES ACCESS TO MEMBER RATES & OFFERS FREE WIFI LATE CHECKOUT PLUS EVEN MORE PERKS WHEN YOU BECOME AN ELITE MEMBER JOIN FOR FREE Already a member? . Sign in",
      "hash": "99c3a0450348",
      "downloadedAt": "2026-01-18T16:56:20.979Z",
      "trimmedAt": "2026-01-18T17:11:20.443Z",
      "sizeReduction": "99.0%"
    }
  ],
  "sizeReduction": "98.6%"
}