{
  "venueId": "ChIJme9CjA56_ogRvZLv87-ntPQ",
  "venueName": "Pearlz Oyster Bar",
  "venueArea": "Downtown Charleston",
  "website": "http://www.pearlzoysterbar.com/",
  "scrapedAt": "2026-01-18T17:04:29.447Z",
  "trimmedAt": "2026-01-18T17:11:46.921Z",
  "pages": [
    {
      "url": "http://www.pearlzoysterbar.com/locations/",
      "text": "× Reservations Location - Required Location COLUMBIA, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service Main content starts here, tab to start navigating Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service",
      "hash": "076bef53dd48",
      "downloadedAt": "2026-01-18T16:54:40.102Z",
      "trimmedAt": "2026-01-18T17:11:46.821Z",
      "sizeReduction": "97.9%"
    },
    {
      "url": "http://www.pearlzoysterbar.com/charleston-menus/",
      "text": "× Reservations Location - Required Location COLUMBIA, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service Main content starts here, tab to start navigating Charleston Menus Got FOMO? Join our Hospitalit-E-Club & never miss out on things like specials, events, or really exciting news! Join the Hospitalit-E-Club MENU 🦪 HAPPY HOUR Restaurant Week Menu 2026: 1/8-1/18 COCKTAILS, BEER & WINE Kid's Menu Download PDF (opens in a new tab) Download PDF (opens in a new tab) Download PDF (opens in a new tab) $8.95 Per Kids Plate | Includes kids drink Pearlz Kids Menu Fish Fingers served with Tartar Sauce Fried Shrimp served with Cocktail Sauce Noodles Served with BUTTER or MARINIA SAUCE Hamburger Grilled Cheese Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service",
      "hash": "1027e3e3d258",
      "downloadedAt": "2026-01-18T16:54:42.960Z",
      "trimmedAt": "2026-01-18T17:11:46.831Z",
      "sizeReduction": "96.5%"
    },
    {
      "url": "http://www.pearlzoysterbar.com/columbia-happenings/",
      "text": "× Reservations Location - Required Location COLUMBIA, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service Main content starts here, tab to start navigating Columbia Happenings Restaurant Week Menu 2026: 1/8-1/18 Tues $1 HOUSE OYSTERS🦪 ALL DAY! Sun 1/2 Priced🍷 \"As Seen On TV\": Pearlz! Upstairz Lounge Music Calendar Happy Hour Load More Events Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service",
      "hash": "132d402d9db0",
      "downloadedAt": "2026-01-18T16:54:45.165Z",
      "trimmedAt": "2026-01-18T17:11:46.837Z",
      "sizeReduction": "97.0%"
    },
    {
      "url": "http://www.pearlzoysterbar.com/charleston-happenings/",
      "text": "× Reservations Location - Required Location COLUMBIA, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service Main content starts here, tab to start navigating Charleston Happenings Restaurant Week Menu 2026: 1/8-1/18 Happy Hour Steamed Oyster Buckets! 🦪 \"As Seen On TV\": Pearlz! Frosé All Day! Load More Events Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service",
      "hash": "23a48b8adb03",
      "downloadedAt": "2026-01-18T16:54:44.064Z",
      "trimmedAt": "2026-01-18T17:11:46.843Z",
      "sizeReduction": "97.1%"
    },
    {
      "url": "http://www.pearlzoysterbar.com/",
      "text": "× Reservations Location - Required Location COLUMBIA, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service Home Main content starts here, tab to start navigating About us Pearlz Oyster Bar is a fun, eclectic restaurant serving the very best in fresh seafood, including an assorted mix of raw shellfish, local seafood, Lowcountry recipes and regional favorites. The raw bar offers a variety of Lowcountry and Gulf oysters as well as specialty oysters, in addition to fresh seasonal shellfish. A full-service bar providing cold beers and unique, refreshing cocktails serves as the epicenter of the restaurant’s lively environment. Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service",
      "hash": "38867e83484c",
      "downloadedAt": "2026-01-18T16:54:40.034Z",
      "trimmedAt": "2026-01-18T17:11:46.849Z",
      "sizeReduction": "96.1%"
    },
    {
      "url": "http://www.pearlzoysterbar.com/location/pearlz-west-ashley-sc/",
      "text": "× Reservations Location - Required Location COLUMBIA, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service Main content starts here, tab to start navigating West Ashley, SC Facebook Instagram Slide 1 of 2 Slide 2 of 2 Hours & Location 9 Magnolia Road, West Ashley, SC 29407 (opens in a new tab) 843-573-2277 MONDAY - THURSDAY4PM - 10PM FRIDAY4PM - 11PM SATURDAY2PM - 11PM SUNDAY2PM - 10PM Get Directions (opens in a new tab) Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service",
      "hash": "3ee9259bca97",
      "downloadedAt": "2026-01-18T16:54:41.187Z",
      "trimmedAt": "2026-01-18T17:11:46.855Z",
      "sizeReduction": "96.7%"
    },
    {
      "url": "http://www.pearlzoysterbar.com/columbia-menus/",
      "text": "× Reservations Location - Required Location COLUMBIA, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service Main content starts here, tab to start navigating Columbia Menus Got FOMO? Join our Hospitalit-E-Club & never miss out on things like specials, events, or really exciting news! Join the Hospitalit-E-Club MENU Restaurant Week Menu 2026: 1/8-1/18 HAPPY HOUR COCKTAILS, BEER & WINE WHISKEY LIST Desserts Reserve Wine List Kids 18% Gratuity added for parties of 8 or more Enjoy rotating varietal oyster selections & chef's specials from our menu printed in-house daily! Download PDF (opens in a new tab) RAW BAR HOUSE OYSTERS* Dozen on the 1⁄2 shell or steamed 21.95 $ OYSTER SHOOTER* pepper vodka, oyster, spicy cocktail sauce 5.95 $ Hard Shell Clams* Dozen 13.95 $ Trio Sampler* 4 each: house oysters on the half shell, hard shell clams, peel & eat shrimp, cocktail sauce and mignonette sauce 23.95 $ Chilled Seafood Plateau* A variety of raw & cooked seafood and garnishes; 3 house oysters, 9 varietal oysters, 6 hard shell clams, 4 peel & eat shrimp, chilled mussels, lobster claws, tuna tartare, chilled crab salad MKT SHAREABLES & STARTERS Tuna Tartare toasted white sesame seeds, cucumber, soy, tobiko wasabi caviar, wonton chips, crushed avocado 17.95 $ Peel & Eat Jumbo Shrimp 1/2 lb. beer boiled with old bay, cocktail sauce 15.95 $ Char-Broiled Oysters NOLA butter, parmesan, 1/2 dozen 16.95 $ Southern Fried Oysters bleu cheese, buffalo sauce, celery 13.95 $ Corn Fritters maple butter 6.95 $ Lump Crab Cakes mustard sauce 16.95 $ Baked Oysters Rockefeller 1⁄2 dozen, crawfish, lump crab, bacon. our twist on the classic 16.95 $ Fried Shrimp cocktail sauce 15.95 $ Calamari lemon basil aioli 16.95 $ Steamed Mussels OR Hard Shell Clams white wine garlic butter broth 15.95 $ Crab Dip served warm, cream cheese, horseradish, warm baguette 15.95 $ SOUPS & SALADS N.E. Clam Chowder Cup 8 $ Bowl 11 $ Seafood Gumbo Cup 8 $ Bowl 11 $ Pearlz House Salad mixed greens, tomato, scallions, croutons, cucumber, & egg with choice of dressing 9.95 $ Classic Caesar Salad 8.95 $ add fried oysters or grilled shrimp 7 $ Iceburg Wedge bleu cheese dressing, tomato, bleu cheese crumbles, applewood smoked bacon 10.95 $ BLT Seafood Tower shrimp, crab, shredded lettuce, carrots, tomato, applewood smoked bacon, egg, green goddess dressing 16.95 $ Entrees Lowcountry Fish & Chips cod, beer battered, with malt vinegar, cajun tartar, house chips 18.95 $ Shrimp and Grits chef’s daily creation 24.95 $ Seafood Linguine Pasta shrimp, clams, mussels, herbs, white wine, garlic, tomato 24.95 $ Pearlz Fried Shrimp Dinner house chips, corn fritters, cocktail sauce 23.95 $ Pearlz Fried Oyster Dinner house chips, corn fritters, cocktail sauce 24.95 $ Certified Angus Beef® Ny Strip roasted fingerling potatoes, grilled asparagus, grilled balsamic onions, chimichurri 29.95 $ add on grilled shrimp, fried shrimp or fried oysters 7 $ Pearlz Select Fresh Catch A Selection of Fresh Fish Changing Daily Blackened, Fried, Pan-Seared or Grilled served with andouille cajun red rice and grilled asparagus MKT Sandwiches Pearlz Signature Burger certified angus beef,® roasted garlic herbed goat cheese, applewood smoked bacon, spinach, pickled red onion, house chips 15.95 $ Crab Cake Sandwich pan seared crab cake, baby arugula, tomato, mustard sauce, house chips 18.95 $ New England Lobster Roll classic lobster salad, top split bun, house chips 27.95 $ Served on flour tortillas Tacos ONE: $7.95 TWO: $14.95 THREE: $19.95 Tuna Taco crushed avocado, pineapple chutney, sriracha mayo, red cabbage Grilled Mahi Taco cabbage, pico de gallo, crema Crispy Shrimp Taco red cabbage, black bean corn salsa, chipotle-lime aioli 5.95 Sides GRILLED ASPARAGUS BROCCOLI SLAW ROASTED FINGERLING POTATOES ANDOUILLE CAJUN RED RICE FLASH FRIED BRUSSEL SPROUTS WITH PARMESAN CHEESE Download PDF (opens in a new tab) Download PDF (opens in a new tab) Download PDF (opens in a new tab) Snafu Cran-Razz Columbia Craft Carolinian Blonde Cigar City Maduro Brown Blue Moon Sycamore Mountain Candy Highland Cold Mountain Savage Craft Galaxy Banger IPA Sweetwater Lager Dogfish Head Grateful Dead Pale Ale Wicked Weed Pernicious Yuengling Guinness Draft Martinis El Presidente Classic dirty martini made with Tito's Handmade Vodka, and finished with blue cheese stuffed olives Pama-tini Deep Eddy Orange, PAMA pomegranate liqueur, pomegranate juice, triple sec Greyhound Martini Deep Eddy Ruby Red vodka, St. Elder natural elderflower liqueur, grapefruit juice, lemon twist MULE Strawberry Lime Mule Deep Eddy Lime Vodka, strawberry syrup, fresh lime juice, ginger beer Don't miss out on HALF PRICED BOTTLES every Sunday. 12pm-9pm *dine in only, select bottles only Half Priced Wine Sundays Angels Envy Bourbon Basil Hayden Bourbon Blantons Bourbon Bulleit Bourbon Buffalo Trace Bourbon Elijah Craig Eagle Rare Evan Williams Black E.H. Taylor Small Batch Four Roses Four Roses Small Batch Henry McKenna 10yr Jim Beam Knob Creek Larceny Bourbon Makers Mark Willett Pot Still Reserve Woodford Reserve BOURBON EH Taylor Private Barrel Blantons Gold Pappy 12 year $54 Pappy 10 year $46 Eagle Rare Private Barrel TOP SHELF BOURBON Angels Envy Rye Bulleit Rye Knob Creek Rye High West Double Rye RYE Canadian Club Crown Royal Crown Royal Peach Crown Royal Regal Apple Gentleman Jack Jack Daniels 10yr Jack Daniels Jameson Irish Whiskey Jameson Irish Whiskey OrangeJameson Cold Brew Jameson Caskmates IPA Jameson Caskmates Stout Seagrams 7 Seagrams Vo Canadian SQRRL Peanut Butter Whiskey Shackleton Blended Malt Whiskey Balvenie 12 Yr Dewars White Label Glenfiddich 12 Year Glenlivet 12 Johnnie Walker Black Johnnie Walker Red Lagavulin 8 Yr Laphroaig 10Yr Macallan 12 Sherry Oak Oban SCOTCH Johnnie Walker Blue Macallan 18 Octmore 12 yr TOP SHELF SCOTCH Download PDF (opens in a new tab) SPARKLING JCB Cremant De Bourgogne Brut Rose 70 $ Veuve Clicquot 150 $ Dom Perignon 450 $ TAITTINGER BRUT RESERVE 125 $ WHITE Vincent Girardin Macon-Fuisse, France 85 $ Hess Collection Panthera Chardonnay, Russian River Valley 95 $ Cakebread Chardonnay, Napa 110 $ RED Penner-Ash Pinot Noir, Willamette Valley 110 $ Orin Swift, 8 Years in the Desert, Red Blend, California 110 $ Adaptation by Plumpjack Cabernet Sauvignon, Napa 125 $ Stags Leap Cabernet Sauvignon, Napa 150 $ $6.95 Per Kids Plate | Includes kids drink. | All Kids meals served with homemade chips Pearlz Kids Menu Fish Fingers served with Tartar Sauce Fried Shrimp served with Cocktail Sauce Hamburger sliders Grilled Quesadilla Pasta Alfredo Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service",
      "hash": "511ca33f6c87",
      "downloadedAt": "2026-01-18T16:54:43.517Z",
      "trimmedAt": "2026-01-18T17:11:46.893Z",
      "sizeReduction": "92.3%"
    },
    {
      "url": "http://www.pearlzoysterbar.com/west-ashley-happenings/",
      "text": "× Reservations Location - Required Location COLUMBIA, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service Main content starts here, tab to start navigating West Ashley Happenings Restaurant Week Menu 2026: 1/8-1/18 Happy Hour WEDS $2 PREMIUM OYSTERS WEDS 1/2 Priced🍷 \"As Seen On TV\": Pearlz! Frosé All Day! Load More Events Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service",
      "hash": "58d69c33d1ec",
      "downloadedAt": "2026-01-18T16:54:44.616Z",
      "trimmedAt": "2026-01-18T17:11:46.901Z",
      "sizeReduction": "97.1%"
    },
    {
      "url": "http://www.pearlzoysterbar.com/west-ashley-menus/",
      "text": "× Reservations Location - Required Location COLUMBIA, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service Main content starts here, tab to start navigating West Ashley Menus Got FOMO? Join our Hospitalit-E-Club & never miss out on things like specials, events, or really exciting news! Join the Hospitalit-E-Club Menu 🦪 HAPPY HOUR Restaurant Week Menu 2026: 1/8-1/18 COCKTAILS, BEER & WINE Liquor SEASONAL COCKTAILS & DRAFTS Kid's Menu Download PDF (opens in a new tab) Download PDF (opens in a new tab) Alcohol Consumption Notice - HHG is concerned for the safety of its patrons and the community. As a result, we provide the availability of Transportation after the consumption of Alcohol. Please notify your server should you need assistance or transportation home; we will be glad to make the appropriate arrangements. Alcohol consumption is a personal choice, and it is your responsibility to drink responsibly and take appropriate precautions to protect the community, other patrons and yourself from harm. Download PDF (opens in a new tab) Download PDF (opens in a new tab) DRAFT BEERS Edmunds Oast Guava and Tangerine Sour Two Blokes Hefeweizen Estuary Slowpoke IPA Narragansett Lager Southern Hops Red Ale Allagash White $8.95 Per Kids Plate | Includes kids drink Pearlz Kids Menu Fish Fingers served with Tartar Sauce Fried Shrimp served with Cocktail Sauce Noodles Served with BUTTER or MARINIA SAUCE Hamburger Grilled Cheese Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service",
      "hash": "654047342440",
      "downloadedAt": "2026-01-18T16:54:42.400Z",
      "trimmedAt": "2026-01-18T17:11:46.909Z",
      "sizeReduction": "95.2%"
    },
    {
      "url": "http://www.pearlzoysterbar.com/location/pearlz-columbia-sc/",
      "text": "× Reservations Location - Required Location COLUMBIA, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service Main content starts here, tab to start navigating Columbia, SC Facebook Instagram Hours & Location 936 Gervais Street, Columbia, SC 29201 (opens in a new tab) 803-661-7741 MONDAY- THURSDAY 4PM-9PM FRIDAY 4PM-2AM (KITCHEN CLOSES AT 10PM) SATURDAY 12PM-2AM (KITCHEN CLOSES AT 10PM) SUNDAY 12PM - 9PM Book your Pearlz Oyster Bar - Columbia reservation on Resy Get Directions (opens in a new tab) Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service",
      "hash": "6bb41319c104",
      "downloadedAt": "2026-01-18T16:54:41.731Z",
      "trimmedAt": "2026-01-18T17:11:46.915Z",
      "sizeReduction": "96.5%"
    },
    {
      "url": "http://www.pearlzoysterbar.com/location/pearlz-charleston-sc/",
      "text": "× Reservations Location - Required Location COLUMBIA, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service Main content starts here, tab to start navigating Charleston, SC Hours & Location 153 East Bay Street, Charleston, SC 29401 (opens in a new tab) 843-577-5755 MONDAY - THURSDAY2PM - 9PM FRIDAY & SATURDAY12PM - 10PM SUNDAY12PM - 9PM Facebook Instagram Get Directions (opens in a new tab) Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service",
      "hash": "bbd5f12d8f41",
      "downloadedAt": "2026-01-18T16:54:40.643Z",
      "trimmedAt": "2026-01-18T17:11:46.921Z",
      "sizeReduction": "96.8%"
    }
  ],
  "sizeReduction": "95.9%"
}