{
  "venueId": "ChIJzb49LO5-_ogRVAImHqfEk2M",
  "venueName": "Wild Olive Restaurant - Johns Island, SC",
  "venueArea": "West Ashley",
  "website": "http://www.wildolive.com/",
  "scrapedAt": "2026-01-19T02:19:38.872Z",
  "trimmedAt": "2026-01-19T02:27:50.688Z",
  "pages": [
    {
      "url": "https://www.wildolive.com/menu",
      "text": "[Page Title: MENU | Wild Olive]\n\ntop of page MENU ANTIPASTI Warm Bread house made rosemary focaccia, Tiller Bakery sourdough, seasonal condimento $11 Marinated Warm Olives $7 Caesar Salad romaine, radicchio, pangrattato, white anchovy, grilled grana padano $14 Local Green Salad with radish, cucumber, tomato, onion, red wine vinaigrette $13 Charred Octopus creamer potatoes, spring onion, capers, pancetta $19 Crispy Calamari marinara, garlic aioli, lemon $15 Bruschetta with apples, celery root, goat cheese, arugula, almonds, rosemary, mustard vinaigrette $14 Suppli al Telefono risotto fritters stuffed with sausage, spinach, parmesan, mozzarella, tomato vodka aioli $12 Ribeye Crespelle with fontina, caramelized onions, local mustard green pesto $15 PRIMI Lobster Risotto with oven-roasted tomatoes, English peas, basil oil $69 Bavette with shrimp, spicy hot Fresno chile, tomato, basil, lemon $29 Ricotta and Goat Cheese Gnocchi marinara, mozzarella, basil $27 Eliche \"Zozzona\" with guanciale, sweet sausage, tomato, onion, chile, egg, parmesan $29 Tagliatelle alla Bolognese with lamb, Split Creek Farm feta, tomato, red wine, coriander, mint $29 Baked Penne with sweet sausage, red and green bell peppers, onions, tomato, mozzarella, parmesan $24 \"Sunday Gravy\" Lasagna with venison, elk, ribeye, mushrooms, tomato, fontina $32 Pappardelle with local wild mushrooms, garlic, onion, parmesan, thyme $28 Agnolotti with rabbit \"cacciatore\", ricotta, parmesan, Dijon, tomato, thyme, rosemary brown butter $30 SECONDI *Grilled Grass-fed Rib Eye Steak smashed, fried, and truffled Yukon gold potatoes, demi $55 *\"Scallops & Grits\" with pancetta, tomato, onions, peppers, local greens, pan sugo $49 Braised Bison Short rib with parmesan polenta, braising sugo, gremolata $49 *Grilled Mountain River Elk Loin potato horseradish gratinato, broccolini, blueberry agrodolce $43 Grilled Yellowfin Tuna with farro piccolo, creamer potatoes, local vegetables, sugo puttanesca $38 Pan Seared Grouper with roasted local vegetables, sweet potatoes, celery leaf & herb vinaigrette $49 Chicken Parmesan with short pasta alfredo, marinara, mozzarella, arugula $33 Disclaimer *Contains ingredients that are raw CONTORNI Broccolini and Artichokes with lemon vinaigrette, fonduta $9 Smashed and Fried Potatoes truffled aioli, scallion, parmesan $9 Potato Gnocchi parmesan, butter $7 Anson Mills Parmesan Polenta $7 Tomato Braised Meatball $7 Side of Bread with extra virgin olive oil $5 DOLCI Tiramisu espresso and rum soaked lady fingers, mascarpone, cocoa $12 Thin Mint Cheesecake Oreo crust, peppermint cheesecake, milk chocolate sauce, Oreo & peppermint candy crumble $12 Espresso Biscoff Cake chocolate cake, espresso Biscoff buttercream, chocolate covered espresso bean & Biscoff cookie crumble $12 Peanut Butter Butterscotch Pie Oreo/peanut crust, butterscotch chip ganache, peanut butter mousse, butterscotch sauce, chocolate sprinkles $12 bottom of page",
      "hash": "1f4a6f245e83",
      "downloadedAt": "2026-01-19T02:18:49.545Z",
      "trimmedAt": "2026-01-19T02:27:50.641Z",
      "sizeReduction": "99.7%"
    },
    {
      "url": "http://www.wildolive.com/",
      "text": "[Page Title: Wild Olive Restaurant | Johns Island]\n\ntop of page CUCINA ITALIANA JOHNS ISLAND, SOUTH CAROLINA RESERVATIONS Please be aware the largest parties we accommodate are parties of seven and\nwe are unable to accommodate reservations via email. Reservations About Wild Olive opened its doors in the heart of Charleston’s farming community in 2009. Managed by longtime industry veterans, Executive Chef Brad Grozis and General Manager Jason Parrish, Wild Olive's consistency and dedication to excellence has now spanned fifteen years for each restaurateur. Striving to capture the cultural magic of true Italian dining, Wild Olive places the utmost value on simple, seasonal cuisine, paired with food friendly wines. Delivered by a service staff with a genuine warmth and enthusiasm, the restaurant’s energy is relaxed yet lively. ​ While sourcing as much product locally as possible, the kitchen staff transforms the resources of the Lowcountry into artisanal variations of regional Italian classics. House made pasta is the heart and soul of the menu, while the bounty of the Lowcountry's waterways and farms is the anchor. ​ In its continual commitment to operate an environmentally conscious business, Wild Olive not only purchases the bulk of their product locally, but also recycles and composts 85% of their waste. In essence, the restaurant is not only farm to table, but table to farm. Wild Olive composts 1,000 pounds of raw material each week. A strict adherence to environmental sustainability has been a continual focus of the restaurant and its culture. ABOUT MENU ORDER ONLINE Online orders available Monday-Thursday 5-9 PM & Friday-Sunday 4-9 PM. Phone in To-Go Orders: 843.737.4177 CONTACT bottom of page",
      "hash": "254ab6931b0f",
      "downloadedAt": "2026-01-19T02:18:49.381Z",
      "trimmedAt": "2026-01-19T02:27:50.688Z",
      "sizeReduction": "99.7%"
    }
  ],
  "sizeReduction": "99.7%"
}