{
  "venueId": "ChIJ96pSNAx6_ogRgsEtLGyCTXM",
  "venueName": "Mac's Place",
  "venueArea": "Downtown Charleston",
  "website": "http://www.macsplacecharleston.com/",
  "scrapedAt": "2026-01-18T17:04:23.853Z",
  "trimmedAt": "2026-01-18T17:05:05.264Z",
  "pages": [
    {
      "url": "http://www.macsplacecharleston.com/",
      "text": "× Order Online Now! Order your favorite dishes in seconds! Order Online × We are taking online reservations! Let’s ensure you get a great table: Book today! We recommend making a reservation ahead of time. Book your table today! Book Table Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! Job Listings Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! Parties & Groups - Host your next party or get together with us! Book your party Parties & Groups - Host your next party or get together with us! NFL Playoffs - Come watch the NFL Playoffs with us! Upcoming Events NFL Playoffs - Come watch the NFL Playoffs with us! 215 East Bay Street, Charleston, SC 29401 map marker pin MAC's place Stop by anytime to cheer on Chicago sports Mac's Place Pub and Grub is the official South Carolina bar for the Chicago Blackhawks. No one else in the state can say that. learn more about us Order online order you favorite dishes in seconds Order pick up or delivery anytime! Order arcade games experience with great food and drinks at reach Our Menu home away from home Offering over 50 beers on tap,in a bottle, and in a can! beer menu Irish Pub born from the love of food,great drinks, and better beer! our menu Dot slide navigation number 1 Dot slide navigation number 2 Dot slide navigation number 3 slideshow start stop playing Reviews review by - Yelp Kaylan L: Loved this place!! Got a couple of drinks and appetizers and everything was AMAZING! We got fried macaroni, cheese sticks and fries. All so good along with the drinks! Service was great as well! It's more of a dive bar compared to the more high end places in the area which I actually prefer! Also super clean! Definitely recommend! review by - Yelp Ann C: Mac's Place is exactly the kind of place that makes you feel right at home! Especially if you are visiting from the Midwest:) Had a few drinks, watched some football and had the absolute best pretzels and cheese, hands down! They also have wireless phone chargers built into the bar!!! review by - Yelp Melissa S: We liked this place so much we went two nights in a row. Great hip hop music playing and awesome bartenders. It's not expensive to drink here either. Just a great vibe, easily one of my favorite stops in Charleston. review by - Yelp Guy T: This place is the definition of Bar. In Charleston for our honeymoon and came here to watch the NBA finals. Great place really love the decor and the vibe. Highly recommend if you're a dive bar kind of person which we are. Wish more places were like it. If I'm ever back in Charleston I'll make my way back to mac. review by - Yelp Abby A: Awesome Chicago themed bar in Charleston!! The decor is fantastic and is the same as Chicago bars from back home! The Irish nachos are a must! The chicken tender wrap is also very tasty, lots of good wing sauces to choose from. There is also a lot of good table sizes for various party sizes which is nice! A must see if you're from Chicago!!! Stop reviews carousel Play reviews carousel enjoy! In the meantime, have fun exploring a 'not so traditional' Irish Pub filled with various activities, games, with 14 flat screen televisions, you can find any sporting event you are looking for!Drinks and food specials are always available during the game of Chicago Football. specials view our specials we look forward to seeing you! Newsletter Location 215 East Bay Street Charleston, SC 29401 Hours Sunday - Thursday 12:00 pm - 2:00 am Friday - Saturday 11:00 am - 2:00 am Find us on... Facebook page Instagram page Yelp page Contact us (855)-681-7076 info@macsplacecharleston.com Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "240fcc8bba3b",
      "downloadedAt": "2026-01-18T16:54:31.390Z",
      "trimmedAt": "2026-01-18T17:05:05.247Z",
      "sizeReduction": "97.3%"
    },
    {
      "url": "http://www.macsplacecharleston.com/charleston-east-bay-mac-s-place-drink-menu",
      "text": "Our Drinks Beverages Wine Beer Cocktails Spirits",
      "hash": "3729e983c203",
      "downloadedAt": "2026-01-18T16:54:32.096Z",
      "trimmedAt": "2026-01-18T17:05:05.252Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://www.macsplacecharleston.com/charleston-east-bay-mac-s-place-happy-hours-specials",
      "text": "Specials Monday January 19th Happy Hour $1 off all liquor $1 off all beer $1 off all wine 04:00 PM - 07:00 PM Tuesday January 20th Happy Hour $1 off all liquor $1 off all beer $1 off all wine 04:00 PM - 07:00 PM Wednesday January 21st Happy Hour $1 off all liquor $1 off all beer $1 off all wine 04:00 PM - 07:00 PM Thursday January 22nd Happy Hour $1 off all liquor $1 off all beer $1 off all wine 04:00 PM - 07:00 PM Friday January 23rd Happy Hour $1 off all liquor $1 off all beer $1 off all wine 04:00 PM - 07:00 PM",
      "hash": "4cb06a27b0fd",
      "downloadedAt": "2026-01-18T16:54:32.712Z",
      "trimmedAt": "2026-01-18T17:05:05.256Z",
      "sizeReduction": "99.2%"
    },
    {
      "url": "http://www.macsplacecharleston.com/charleston-east-bay-mac-s-place-events",
      "text": "Events St. Patrick's Day Tuesday March 17th Grab your best green garb and join us for St. Patrick's Day! 11:00 AM - 02:00 AM 2026-03-17 11:00:00 2026-03-17 02:00:00 America/New_York St. Patrick's Day Grab your best green garb and join us for St. Patrick's Day! Mac's Place Mac's Place info@macsplacecharleston.com",
      "hash": "63a428903cc0",
      "downloadedAt": "2026-01-18T16:54:33.337Z",
      "trimmedAt": "2026-01-18T17:05:05.259Z",
      "sizeReduction": "99.5%"
    },
    {
      "url": "http://www.macsplacecharleston.com/charleston-east-bay-mac-s-place-food-menu",
      "text": "Our Menu Menu Retail",
      "hash": "90fd99969758",
      "downloadedAt": "2026-01-18T16:54:31.476Z",
      "trimmedAt": "2026-01-18T17:05:05.264Z",
      "sizeReduction": "100.0%"
    }
  ],
  "sizeReduction": "99.0%"
}