{
  "venueId": "ChIJw5sFmRV8_ogRm4IqY2OoKb0",
  "venueName": "Taco Bell",
  "venueArea": "West Ashley",
  "website": "https://locations.tacobell.com/sc/charleston/2040-savannah-hwy.html?utm_source=yext&utm_campaign=googlelistings&utm_medium=referral&utm_term=005096&utm_content=website&y_source=1_NjE0NTMzMi03MTUtbG9jYXRpb24ud2Vic2l0ZQ%3D%3D",
  "scrapedAt": "2026-01-18T17:04:31.841Z",
  "trimmedAt": "2026-01-18T17:12:56.972Z",
  "pages": [
    {
      "url": "https://locations.tacobell.com/sc/charleston/2040-savannah-hwy.html?utm_source=yext&utm_campaign=googlelistings&utm_medium=referral&utm_term=005096&utm_content=website&y_source=1_NjE0NTMzMi03MTUtbG9jYXRpb24ud2Vic2l0ZQ%3D%3D",
      "text": "Open Open til 2:00AM Taco Bell 2040 Savannah Hwy Charleston , SC 29407 (843) 571-6121 Drive-Thru Open Late Delivery Start Your Order Get Directions Download The App HOURS OF OPERATION Drive-Thru Hours Day of the Week Hours tuesday 9:00 AM - 2:00 AM wednesday 9:00 AM - 2:00 AM thursday 9:00 AM - 2:00 AM friday 9:00 AM - 2:00 AM saturday 9:00 AM - 2:00 AM sunday 9:00 AM - 2:00 AM monday 9:00 AM - 2:00 AM Dine-In Hours Day of the Week Hours tuesday 9:00 AM - 10:00 PM ABOUT TACO BELL AT 2040 Savannah Hwy Find your nearby Taco Bell at 2040 Savannah Hwy in Charleston, SC. We're serving all your favorite menu items, from classic , , and to newer favorites like the , and . Our features great value items like the and the . Our has your daytime cravings covered with the and the . If you're looking for close to the Charleston area, stop by Taco Bell today. tacos burritos quesadillas nachos Mexican Pizza Crunchwrap Supreme® Cheesy Gordita Crunch Cravings Value Menu Cheesy Bean and Rice Burrito Spicy Potato Soft Taco Cantina Chicken Menu Cantina Chicken Crispy Taco Cantina Chicken Bowl fast food CRAVING TACO BELL? Check out our menu and explore categories like tacos, burritos, nachos and quesadillas. VIEW MENU TACOS Go soft or keep it crunchy. Or both. ORDER NOW BURRITOS Get wrapped up in one of our classic burritos. ORDER NOW QUESADILLAS Perfect your cheese-pull with one of our quesadillas. ORDER NOW NACHOS Tortilla chips, Nacho Cheese Sauce and all your favorite toppings. Dip in. ORDER NOW COMBOS & BOXES Get your favorite menu items plus a drink with one of our combos or Luxe Boxes. ORDER NOW SPECIALTIES The Taco Bell menu items you won’t find anywhere else. ORDER NOW CRAVINGS VALUE MENU 10 menu items for $3 or less every day. ORDER NOW CANTINA CHICKEN MENU Enjoy our marinated, slow-roasted chicken. ORDER NOW VIEW MENU WE'RE HIRING Working for Taco Bell just hits different. Join our family today. View Terms SEE OPEN POSITIONS WANT MORE? Learn more about what Taco Bell has to offer. Breakfast Learn more about breakfast at Taco Bell Lunch Learn more about lunch at Taco Bell Happier Hour Learn more about Happier Hour Dinner Learn more about dinner at Taco Bell Takeout Get take out from Taco Bell near you Rewards Learn more about Taco Bell Rewards Offers Get Taco Bell offers and deals Restaurant Find a Taco Bell restaurant near you Fast Food Get fast food from Taco Bell near you",
      "hash": "14b1c682d3ee",
      "downloadedAt": "2026-01-18T17:03:20.806Z",
      "trimmedAt": "2026-01-18T17:12:56.937Z",
      "sizeReduction": "97.9%"
    },
    {
      "url": "https://locations.tacobell.com/index.html",
      "text": "Taco Bell® Restaurants in the United States 8,236 locations in the United States When autocomplete results are available, use up and down arrows to review and enter to select. Search Locate Me Alaska (7) Alabama (106) Arkansas (81) Arizona (67) California (416) Colorado (64) Connecticut (43) Washington DC (1) Delaware (15) Florida (206) Georgia (159) Hawaii (18) Iowa (42) Idaho (24) Illinois (209) Indiana (142) Kansas (53) Kentucky (105) Louisiana (74) Massachusetts (65) Maryland (77) Maine (19) Michigan (227) Minnesota (73) Missouri (142) Mississippi (69) Montana (12) North Carolina (162) North Dakota (9) Nebraska (19) New Hampshire (17) New Jersey (111) New Mexico (27) Nevada (20) New York (175) Ohio (251) Oklahoma (77) Oregon (70) Pennsylvania (166) Rhode Island (12) South Carolina (81) South Dakota (8) Tennessee (139) Texas (315) Utah (44) Virginia (119) Vermont (5) Washington (89) Wisconsin (105) West Virginia (58) Wyoming (12)",
      "hash": "acf68ed85ff3",
      "downloadedAt": "2026-01-18T17:03:21.615Z",
      "trimmedAt": "2026-01-18T17:12:56.955Z",
      "sizeReduction": "99.4%"
    },
    {
      "url": "https://locations.tacobell.com/sc/charleston/2040-savannah-hwy/fast-food.html",
      "text": "Open Open til 2:00AM FAST FOOD NEAR ME 2040 Savannah Hwy Charleston , SC 29407 (843) 571-6121 Drive-Thru Open Late Delivery Start Your Order Get Directions Download The App HOURS OF OPERATION Drive-Thru Hours Day of the Week Hours tuesday 9:00 AM - 2:00 AM wednesday 9:00 AM - 2:00 AM thursday 9:00 AM - 2:00 AM friday 9:00 AM - 2:00 AM saturday 9:00 AM - 2:00 AM sunday 9:00 AM - 2:00 AM monday 9:00 AM - 2:00 AM Dine-In Hours Day of the Week Hours tuesday 9:00 AM - 10:00 PM ORDER FAST FOOD NEAR YOU IN Charleston, SC Looking for great fast food near you in Charleston, SC? Look no further than Taco Bell at 2040 Savannah Hwy. With a completely customizable menu, the options are endless. Choose from classic , and to newer options like the and the . If you're looking for fast food near you in Charleston, SC, Taco Bell will not disappoint! tacos burritos nachos Cravings Value Menu Cantina Chicken Menu CRAVING FAST FOOD? Check out our menu and explore our tacos, burritos, quesadillas, nachos and so much more. VIEW MENU TACOS Go soft or keep it crunchy. Or both. ORDER NOW BURRITOS Get wrapped up in one of our classic burritos. ORDER NOW QUESADILLAS Perfect your cheese-pull with one of our quesadillas. ORDER NOW NACHOS Tortilla chips, Nacho Cheese Sauce and all your favorite toppings. Dip in. ORDER NOW COMBOS & BOXES Get your favorite menu items plus a drink with one of our combos or Luxe Boxes. ORDER NOW SPECIALTIES The Taco Bell menu items you won’t find anywhere else. ORDER NOW CRAVINGS VALUE MENU 10 menu items for $3 or less every day. ORDER NOW CANTINA CHICKEN MENU Enjoy our marinated, slow-roasted chicken. ORDER NOW VIEW MENU WANT MORE? Learn more about what Taco Bell has to offer. Breakfast Learn more about breakfast at Taco Bell Lunch Learn more about lunch at Taco Bell Happier Hour Learn more about Happier Hour Dinner Learn more about dinner at Taco Bell Takeout Get take out from Taco Bell near you Rewards Learn more about Taco Bell Rewards Offers Get Taco Bell offers and deals Restaurant Find a Taco Bell restaurant near you Fast Food Get fast food from Taco Bell near you",
      "hash": "d2c13fe57970",
      "downloadedAt": "2026-01-18T17:03:21.019Z",
      "trimmedAt": "2026-01-18T17:12:56.972Z",
      "sizeReduction": "98.0%"
    }
  ],
  "sizeReduction": "98.5%"
}