{
  "venueId": "ChIJRcsIOQxj_ogR4mn4VRkMgNA",
  "venueName": "Lasso Gaucho Brazilian Steakhouse Charleston",
  "venueArea": "North Charleston",
  "website": "https://lassogauchochs.com/",
  "scrapedAt": "2026-01-18T17:04:26.251Z",
  "trimmedAt": "2026-01-18T17:07:23.942Z",
  "pages": [
    {
      "url": "https://lassogauchochs.com/north-charleston-lasso-gaucho-brazilian-steakhouse-charleston-locations",
      "text": "Locations View map Back to Location North Charleston Address: 2411 Mall Drive, North Charleston, SC 29406 on Google maps Location Hours: Monday - Thursday: 4:00pm - 9:00pm Friday: 4:00pm - 10:00pm Saturday: 1:00pm - 10:00pm Sunday: 12:00pm - 9:00pm Phone: 843-744-9000 Order from North Charleston Reserve at North Charleston Parties at North Charleston Catering from North Charleston Jobs at North Charleston View North Charleston on Google maps View on map North Charleston Winston-Salem Address: 115 S Main St, Winston-Salem, NC 27101 on Google maps Location Hours: Monday - Thursday: 4:00pm - 9:00pm Friday, Saturday: 12:00pm - 10:00pm Sunday: 12:00pm - 9:00pm Phone: 336-293-6702 View Winston-Salem on Google maps View on map Winston-Salem Fort Lauderdale Address: 2457 E Sunrise Blvd, Fort Lauderdale, FL 33304 on Google maps Location Hours: Monday - Thursday: 4:00pm - 10:00pm Friday: 12:00pm - 10:30pm Saturday: 1:00pm - 10:30pm Sunday: 12:00pm - 9:00pm Phone: 754-223-4663 View Fort Lauderdale on Google maps View on map Fort Lauderdale Go back to the main content Reset zoom",
      "hash": "27a287cbb947",
      "downloadedAt": "2026-01-18T16:59:59.350Z",
      "trimmedAt": "2026-01-18T17:07:23.917Z",
      "sizeReduction": "98.8%"
    },
    {
      "url": "https://lassogauchochs.com/",
      "text": "× Let us host your special event! Whether a birthday party, office function or any other special occasion - we take care of all the fine details, bringing your event to life, just as you imagined. Host your next party or get together Book your party × Order your favorite dishes in seconds! Order Online × Did you know we do catering? Whatever your occasion, however big or small, we have the perfect options to choose from. Cater your birthday party, holiday party, corporate events, wedding festivities and more! Catering Packages × We are taking online reservations! Let’s ensure you get a great table: Book today! We recommend making a reservation ahead of time. Book your table today! Book Table × Join us for Valentine's Day February 14th Join us on Valentine's Day for the perfect romantic evening! $74,95 per person with a glass of Champagne (non-alcoholic available) Book Table Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! Job Listings Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! RESTAURANT WEEK SOUTH CAROLINA RESTAURANT WEEK 08-18 OF JANUARY Come and have the best experience! SEE MENU unique experience ''Churrascaria\" style dining Enjoy the \"parade\" of 17 USDA Prime cuts of Beef, Lamb, Chicken and Pork carved tableside by our Gauchos. our menu VALENTINE'S Join us on 02/14 to celebrate! Open from 01pm - 10:00pm on Valentine's Day. Reserve your table now. Reserve slideshow start stop playing Slide 1 content Slide 2 content Slide 3 content Slide 4 content previous slide next slide authentic Brazilian cuisine unique \"Churrascaria\" style dining experience Our Menu typical Brazilian mixed drinks a worldwide selection of fine wines and cocktails Our Drinks amazing specials treat yourself All specials our events something for everyone Events check our locations Learn more about our locations Impress Your Guests group reservations and parties Whether you're celebrating a milestone, hosting a corporate event, or just gathering with friends, our restaurant is the perfect setting. Book Now a private party ABOUT Lasso Gaucho BRAZILIAN STEAKHOUSE Lasso Gaucho Brazilian Steakhouse is a unique, Award Winning “Churrascaria” featuring a Fresh Salad Bar with over 30 items, 6 Hot Brazilian Flavored Dishes and a “parade” of 16 USDA Prime cuts of Beef, Lamb, Chicken and Pork carved tableside by our Gauchos. To complement your meal, we have a full bar offering a worldwide selection of fine wines, cocktails, typical Brazilian mixed drinks and a tasteful selection of desserts. Our Drinks Newsletter Location 2411 Mall Drive North Charleston, SC 29406 Hours Monday 4-9 PM Tuesday 4-9 PM Wednesday 4-9 PM Thursday 4pm - 10:00pm Friday 4pm-10 PM Saturday: 1pm - 10:30 pm Sunday: 12pm - 9 pm Week Hours: Thanksgiving eve, November 26th and Black Friday, November 28th, we will be open at 3 pm and Thanksgiving Day, November 27. we will be open from 1 pm-9:30 PM Find us on... Facebook page Instagram page Google page Contact us (843)-744-9000 Call us at chs@lassogaucho.com Write us at Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "355dee3e29ed",
      "downloadedAt": "2026-01-18T16:59:56.371Z",
      "trimmedAt": "2026-01-18T17:07:23.931Z",
      "sizeReduction": "97.9%"
    },
    {
      "url": "https://lassogauchochs.com/north-charleston-lasso-gaucho-brazilian-steakhouse-charleston-food-menu",
      "text": "Our Menu Full Experience Salad Bar Bar Menu",
      "hash": "b0fed5915091",
      "downloadedAt": "2026-01-18T16:59:56.575Z",
      "trimmedAt": "2026-01-18T17:07:23.934Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "https://lassogauchochs.com/north-charleston-lasso-gaucho-brazilian-steakhouse-charleston-happy-hours-specials",
      "text": "Specials We are updating our specials Please stay tuned",
      "hash": "b7df7f7efb5a",
      "downloadedAt": "2026-01-18T16:59:57.896Z",
      "trimmedAt": "2026-01-18T17:07:23.937Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "https://lassogauchochs.com/north-charleston-lasso-gaucho-brazilian-steakhouse-charleston-drink-menu",
      "text": "Our Drinks Cocktail",
      "hash": "dbc3f73ce89b",
      "downloadedAt": "2026-01-18T16:59:57.251Z",
      "trimmedAt": "2026-01-18T17:07:23.940Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "https://lassogauchochs.com/north-charleston-lasso-gaucho-brazilian-steakhouse-charleston-events",
      "text": "Events Valentine's Day Saturday February 14th Join us on Valentine's Day for the perfect romantic evening! $ 74,95 per person with a glass of champagne (non-alcoholic available). 11:00 AM - 10:00 PM",
      "hash": "f7b231b836f1",
      "downloadedAt": "2026-01-18T16:59:58.512Z",
      "trimmedAt": "2026-01-18T17:07:23.942Z",
      "sizeReduction": "99.7%"
    }
  ],
  "sizeReduction": "99.2%"
}