{
  "venueId": "ChIJY7OygBF6_ogRk88l0KDgR-A",
  "venueName": "Fulton Lane Inn",
  "venueArea": "Downtown Charleston",
  "website": "https://www.fultonlaneinn.com/?utm_source=google&utm_medium=organic&utm_campaign=business-listing",
  "scrapedAt": "2026-01-19T03:25:43.416Z",
  "trimmedAt": "2026-01-19T03:32:04.215Z",
  "pages": [
    {
      "url": "https://www.fultonlaneinn.com/?utm_source=google&utm_medium=organic&utm_campaign=business-listing",
      "text": "[Page Title: Fulton Lane Inn Official Site | Charleston, SC Hotels]\n\nSkip to Main Content \nDiscover Charleston's Best Kept Secret\n\nFulton Lane Inn\n\nFulton Lane Inn is a peaceful and tranquil retreat situated in the heart of the city. The inn features the natural beauty, warm hospitality, and cozy comforts of the Lowcountry, all just steps from the energy and excitement of King Street. Whether you’re exploring Charleston’s historic landmarks, indulging in world-class dining, or simply strolling through the charming streets, Fulton Lane Inn offers a perfect blend of serenity and convenience. Our charming rooms, Southern Hospitality, and thoughtful amenities ensure that your stay is as relaxing as it is memorable, making it the ideal home base for your Charleston getaway!\nBook Now \nIncluded With Every Stay\n\nLife’s Little Luxuries\n\nFree Wi-Fi\n\n24-hour concierge\n\nMorning newspaper\n\nContinental breakfast delivered to your room\n\nEvening wine & cheese reception\n\nEvening sherry\nBook Now View More \nYour Charleston Home Awaits\n\nTop Reasons to Stay\n\nUnmatched Location\n\nTucked in quietly on charming King Street, Fulton Lane Inn is just steps from the antique and shopping districts, renowned restaurants, and historic waterfront homes.\n\nWine & Cheese Reception\n\nKings Courtyard Inn, our sister property next door, hosts a fantastic happy hour, offering the perfect chance to mingle with other guests and an ideal start to a memorable night.\n\nBreakfast In Bed\n\nWhether you prefer a healthy meal of granola or you feel like indulging in freshly baked pastries, you’ll love having a continental breakfast delivered directly to your room each morning, free of charge.\n\nSouthern Hospitality\n\nWith 24-hour concierge service, our courteous staff is always happy to help. You’re sure to find that Southern hospitality you’ve heard so much about here at our Charleston hotel.\n\nPerfect Meeting Space\n\nWe welcome events of all kinds, from corporate meetings to celebrations. Choose Fulton Lane Inn’s convenient location and personalized services for a gathering you won’t soon forget.\n\nRomance Galore\n\nTrue romantics adore Fulton Lane Inn’s charming suites and deluxe rooms, beautifully appointed with two-person whirlpool tubs and luxurious king-size beds.\n\nRooms & Suites\n\nEnchanting\n\nEach of our uniquely appointed guest rooms and suites features picturesque furnishings and thoughtful amenities. Whether you join us in a romantic Deluxe King or a family-friendly Two Room Suite, you’re sure to find complete comfort at the Fulton Lane Inn.\nView Rooms \nOffers & Packages\n\nAdventures in the Holy City\n\nEnjoy the historical beauty of our beloved city with this experiential package, featuring an idyllic carriage ride and even more exciting Charleston activities.\nExplore \nThe only place to be\n\nDowntown Charleston\n\nThe Wentworth Mansion is located in the heart of Charleston’s downtown historic district, within minutes of the city’s most important attractions.\nExplore \nGUIDES TO EVENTS IN AND AROUND CHARLESTON\n\nTop Events in Charleston\n\nHappening in\n\nSpring\n\nHappening in\n\nSummer\n\nHappening in\n\nFall\n\nHappening in\n\nWinter\nMore Guides to Charleston \n\"We absolutely loved our stay\"\n\nThe staff was so kind and informative. Loved the ability to walk everywhere. And the breakfast delivered to the room was amazing! Would highly recommend!\n\nMaren | 4/10/25\n\n\"This hotel is full of charm and character\"\n\nThe friendly staff, daily breakfast delivered to your room, enjoyable happy hours, and nightly sherry made our stay truly unforgettable. Not to mention the location truly can't be beat. Wylie, in particular, stood out for always offering great recommendations for local activities and engaging in interesting conversations.\n\nJessica T. | 4/9/25\n\n\"Great location\"\n\nI cannot say enough good things about this hotel. Every person we met was friendly and helpful. Fantastic central location - no car needed to walk everywhere. Wine and cheese a delightful touch. Super clean. Breakfast delivered on a tray every morning. They stored our luggage a few hours on arrival and departure to accommodate our flight schedule. I hope to come back. Thanks for a great trip!!\n\nTripAdvisor | 7/21/24\n\n\"Great Place to Stay in Historic Charleston\"\n\n\"Fantastic place to stay. We opted to spend a little more to stay in the French Quarter area of historic Charleston and we are so glad we did. Its like stepping back in time. This hotel is charming and in a great location for walking to many points of interest. The hotel is clean, updated but with all the historic charm, quiet, safe, and the staff is friendly and polite. Parking is in a lot behind the hotel. It cost $17 per day but it seems to be common in this area to have to pay for parking. The entrance to the lobby is on the side of the building in an alley. Different but safe and charming with the gas lights. Breakfast is brought to your room each morning (you fill out a menu card the night before and hang it on your door). Its a simple but adequate breakfast and we really enjoyed this convenience. Overall I cant recommend this hotel enough. It exceeded our expectations and we would definitely stay here again.\"\n\nTripAdvisor | Michigan | 8/16/22\n\n\"Great Place to Stay\"\n\n\"Great location, fabulous rooms and a safe parking lot. My wife and I checked the reviews prior to booking and saw a few comments on issues with parking. We were concerned but it work out perfectly. Plenty of parking and the charge is $17 per day. We had lots of fun visiting Charleston and our stay at the Fulton Lane Inn was outstanding.\"\n\nDMG D. | 4/6/25\nOpen post by fultonlaneinn with ID 18306580417257904 Please join us in welcoming Jackie, the newest member of our concierge team at Fulton Lane Inn. With a passion for thoughtful service and a love for Charleston, she’s here to help make every stay seamless and memorable. Be sure to say hello during your next visit.#Charleston #Hospitality #SouthernHospitality #CharlestonHotel #FultonLaneInn #HistoricHotel #BoutiqueHotel #KingStreet #HistoricHotelsOfAmerica #MeetTheTeam ... 8 0 Open post by fultonlaneinn with ID 18108647941729888 Experience Charleston’s quieter winter charm at Fulton Lane Inn. ❄️✨ Just steps from King Street, the Inn offers a warm, intimate retreat where timeless character and thoughtful comfort set the tone for the season. Discover why winter is the perfect time to visit in our Winter Escape blog—link in bio.#FultonLaneInn #HistoricHotel #BoutiqueHotel #HistoricHotelsOfAmerica #KingStCHS #ExploreCharleston #VisitCharleston #CharlestonWinter ... 2 0 Open post by fultonlaneinn with ID 18100446067894715 Not sure what to do this weekend? We rounded up some of Charleston’s best events—from creative workshops to can’t-miss experiences like the Camellia Workshop at Middleton Place. 🌺 Tap the link in bio to explore.#FultonLaneInn #HistoricHotel #BoutiqueHotel #HistoricHotelsOfAmerica #CharlestonSC #ExploreCharleston #DowntownCharleston #CharlestonStay #DiscoverCharleston ... 2 0 Open post by fultonlaneinn with ID 18419143747136794 From cozy nooks to spacious suites, every room at Fulton Lane Inn is one-of-a-kind. Which would you reserve?#FultonLaneInn #HistoricHotel #BoutiqueHotel #HistoricHotelsOfAmerica #CharlestonSC ... 8 0 Open post by fultonlaneinn with ID 17877409893460163 Recent guest Shawn S. says it best: “The location is amazing—we walked everywhere the entire weekend.” From historic streets to local eats, Fulton Lane Inn puts Charleston right at your feet. Head to our guide through the link in bio to explore just a few of the many amazing things waiting within 15 minutes of our doors.#FultonLaneInn #HistoricHotel #BoutiqueHotel #HistoricHotelsOfAmerica #CharlestonSC #ExploreCharleston #DowntownCharleston #CharlestonStay #DiscoverCharleston ... 8 0 Open post by fultonlaneinn with ID 18075829982037503 It’s Museum Mile Month in Charleston! Explore the city’s top museums all month long with a single low-price ticket, perfect for locals and visitors alike. Dive into our blog for tips and highlights to make the most of your Museum Mile experience—link in bio!#FultonLaneInn #KingStreet #HistoricHotelsOfAmerica #WinterEvents #ExploreCharleston ... 5 0 Open post by fultonlaneinn with ID 17928892722177336 Ring in the New Year at Fulton Lane Inn. ✨ Begin 2026 surrounded by historic elegance, cozy comfort, and Charleston charm. From all of us, we wish you a happy and memorable New Year—book your stay today through the link in bio.#FultonLaneInn #HistoricHotel #BoutiqueHotel #KingStreet #HistoricHotelsOfAmerica #VisitCharleston #ExploreCharleston ... 6 0 Open post by fultonlaneinn with ID 17869628019427161 Tucked just off King Street, Fulton Lane Inn offers an intimate way to experience Charleston. Our Discover Charleston package invites you to slow down and explore—through historic tours, scenic carriage rides, and time spent inside one of the city’s storied homes. 🏛️ Visit the link in bio to book a stay designed for discovery.#FultonLaneInn #HistoricHotel #BoutiqueHotel #KingStreet #HistoricHotelsOfAmerica #VisitCharleston #ExploreCharleston ... 10 0 Open post by fultonlaneinn with ID 18076551242201286 Say hello to Bree, the newest member of our Fulton Lane Inn family! 🌿✨ As a Concierge, she’s here to make your Charleston stay effortless and unforgettable. Drop a warm welcome for her in the comments!#Charleston #Hospitality #SouthernHospitality #CharlestonHotel #FultonLaneInn #HistoricHotel #BoutiqueHotel #KingStreet #HistoricHotelsOfAmerica #MeetTheTeam ... 8 1 Open post by fultonlaneinn with ID 18127387234507222 On this Christmas Eve, we’re reflecting on the joy of the season and sending warm wishes from all of us at Fulton Lane Inn. May your Christmas be merry, bright, and full of cherished moments. 🎄#FultonLaneInn #HistoricHotel #BoutiqueHotel #KingStreet #HistoricHotelsOfAmerica #WinterEvents #VisitCharleston #ExploreCharleston #CharlestonEvents #HolidayEvents #Christmas ... 5 0 Open post by fultonlaneinn with ID 17974432910970181 Winter is just a day away, and we’re still dreaming of last year’s snowfall—when Fulton Lane Inn felt extra cozy, quietly tucked away while King Street shimmered just beyond the lane. ❄️ Start planning your winter stay through the link in bio.#FultonLaneInn #HistoricHotel #BoutiqueHotel #HistoricHotelsOfAmerica #KingStCHS #ExploreCharleston #VisitCharleston #CharlestonWinter ... 30 0 Open post by fultonlaneinn with ID 18084083645014539 Breakfast in bed is just the beginning at Fulton Lane Inn. 🥐 Our curated Romance Package brings together cozy accommodations, Champagne, sweet indulgences, and an evening at @circa1886. Don’t wait—start planning your Charleston escape via the link in our bio.#FultonLaneInn #HistoricHotel #BoutiqueHotel #HistoricHotelsOfAmerica #BoutiqueLuxury #RomanticRetreat #BoutiqueEscape #CouplesGetaway #CouplesTrip #HotelPackage #RomanticGetaway ... 6 0 Open post by fultonlaneinn with ID 18101322145754365 Cozy nights await at Fulton Lane Inn. Enjoy the warmth of an in-room fireplace in select rooms and make your Charleston stay truly unforgettable. 🔥 Explore availability through the link in our bio.#FultonLaneInn #HistoricHotel #BoutiqueHotel #HistoricHotelsOfAmerica #Fireplace #ExploreCharleston #VisitCharleston ... 21 1 Open post by fultonlaneinn with ID 18028620836774193 Whether your weekend includes Holiday Market Under the Stars at @parkandgrovechs or Holiday Strings at the @charlestonlibrarysociety, Charleston is full of festive ways to explore the city. ✨ With Fulton Lane Inn as your starting point, every stop is just moments away. Plan your weekend through the link in our bio.#FultonLaneInn #HistoricHotel #BoutiqueHotel #HistoricHotelsOfAmerica #KingStreet #CharlestonSC #WeekendEvents #SecondSundayOnKing #KingStCHS ... 8 0 Open post by fultonlaneinn with ID 18549093412008898 Enhance your Charleston stay with a simple indulgence: Champagne and chocolate-covered strawberries. At Fulton Lane Inn, thoughtful touches help make your visit truly special. 🥂🍓 View all thoughtful touches and amenities to elevate your stay—link in bio.#FultonLaneInn #HistoricHotel #BoutiqueHotel #HistoricHotelsOfAmerica #Champagne #Strawberries #Amenities ... 6 0 Open post by fultonlaneinn with ID 18115961023602784 Charleston’s art districts are just steps from Fulton Lane Inn, inviting you to wander through vibrant galleries, meet local artists, and discover pieces inspired by the beauty of the ‘Holy City’. Start planning your stroll—our curated gallery guide is linked in bio.#FultonLaneInn #HistoricHotel #BoutiqueHotel #KingStreet #HistoricHotelsOfAmerica #WinterEvents #VisitCharleston #ExploreCharleston #CharlestonEvents #CharlestonGallery #Gallery #ArtGallery ... 5 0 Open post by fultonlaneinn with ID 18079487210126092 The red-brick building that forms part of Fulton Lane Inn once served as the YWCA—home to an indoor pool and welcoming rooms for members. 🏊‍♂️ Today, its storied past enriches the character and quiet beauty of your stay with us! To learn more or plan your visit, tap the link in our bio.#FultonLaneInn #HistoricHotel #BoutiqueHotel #HistoricHotelsOfAmerica #CharlestonSC #ExploreCharleston #DowntownCharleston #CharlestonStay #DiscoverCharleston #History ... 1 0 Open post by fultonlaneinn with ID 18109036453623540 Celebrate the holidays in Charleston with ease when you stay at Fulton Lane Inn. From charming local traditions to seasonal events and hidden gems, our December Guide showcases the best ways to enjoy the city this festive season. 🎄 Tap the link in our bio to explore!#FultonLaneInn #HistoricHotel #BoutiqueHotel #KingStreet #HistoricHotelsOfAmerica #WinterEvents #VisitCharleston #ExploreCharleston #CharlestonEvents #HolidayEvents #Christmas ... 11 1 Open post by fultonlaneinn with ID 18107991907628260 Dreaming of a Charleston getaway? Enjoy 20% off your stay at Fulton Lane Inn for visits between December 1, 2025 and January 31, 2026. Use code BLACKFRIDAY2025 when booking. 🛏️Reserve your stay via the link in our bio.#FultonLaneInn #HistoricHotel #BoutiqueHotel #HistoricHotelsOfAmerica #SouthernHospitality #VisitCharleston #ExploreCharleston #KingStCHS #BlackFriday #Sale ... 6 0 Open post by fultonlaneinn with ID 18064139303529909 Staying at Fulton Lane Inn means Charleston’s holiday magic is right at your doorstep. 🎄From Aquarium Aglow to Folly Beach Christmas Tree Lighting to hands-on candle making at Candlefish, the season’s best is all within easy reach. Discover more holiday weekend events through the link in bio.#FultonLaneInn #HistoricHotel #BoutiqueHotel #HistoricHotelsOfAmerica #FallEvents #VisitCharleston #CharlestonFall #ExploreCharleston #CharlestonEvents #Thanksgiving #HolidayEvents ... 5 0 Load More Follow on Instagram \nManage Consent\n\nTo provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions.\nFunctional Always active Functional The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} \nManage Consent\n\nTo provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions.\nFunctional Always active Functional The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent Manage consent \nKeep in Touch!\n\nStay connected for promotions, announcements, & more!\nYes, I would like to receive updates. Get Updates",
      "hash": "9441c5e6fe53",
      "downloadedAt": "2026-01-19T02:08:46.146Z",
      "trimmedAt": "2026-01-19T03:32:04.215Z",
      "sizeReduction": "94.8%"
    }
  ],
  "sizeReduction": "94.8%"
}