{
  "venueId": "ChIJtzvzdNcF9YgR4wKm-yI3cws",
  "venueName": "CentraArchy Restaurants",
  "venueArea": "West Ashley",
  "website": "http://centraarchy.com/",
  "scrapedAt": "2026-01-19T02:45:58.799Z",
  "trimmedAt": "2026-01-19T02:54:13.318Z",
  "pages": [
    {
      "url": "https://centraarchy.com/happenings/",
      "text": "[Page Title: Happenings - CentraArchy Restaurants]\n\nRestaurants Restaurants Gift Cards Reservations Homepage News & Happenings Careers Contact \n☰\n\nx\nRestaurants Restaurants Gift Cards Reservations Homepage News & Happenings Careers Contact Thank you, Veterans | Nov. 11 CentraArchy Restaurants Express Gratitude to Armed Forces \n– Local restaurants are honoring the hard work and sacrifices of U.S. military with a special discount on Veterans Day.\nAtlanta (Oct. 2, 2025) \nAt all 15 CentraArchy Restaurants, on Nov. 11, any U.S. veteran or active-duty member of the armed forces with I.D. is invited to enjoy any entrée from the full menu at half price.\n\n“We greatly appreciate U.S. veterans and active armed forces personnel for their service to our nation and in the local communities for our restaurants,” said CentraArchy Restaurants CEO Vince Van Brunt. “We invite veterans and active-duty military to enjoy regular menu entrées including fresh seafood, aged steaks and other popular items at half price on Veterans Day, Nov. 11.”\n\nHonored guests are encouraged to book reservations online in advance and bring a valid military I.D. or proof of military service to enjoy half-off any entrée from the restaurant’s regular dinner menu. The special half price offer is valid for dine-in only.\n\nAll CentraArchy Restaurants are participating. For more information and to make a reservation, or call your preferred location.\nplease click here > \n# # #\n15th ANNUAL PINK KISS FOR THE CURE Diners Across Five States Join in Supporting Living Beyond Breast Cancer with the Pink Kiss Martini \n– For the 15th consecutive year, in recognition of , continues its annual campaign throughout October.\nAtlanta (Sept. 30, 2025) National Breast Cancer Awareness Month CentraArchy Restaurants “Pink Kiss for the Cure” \nAll CentraArchy Restaurants in five states are offering the limited-edition Pink Kiss martini with 50 percent of the sales going directly to breast cancer research and care.\n\nAs in 2022 through 2024, this year’s Pink Kiss campaign contributions will go to the national nonprofit , an organization on mission for over 30 years to provide trusted information and a community of support to those impacted by the disease, offering on-demand emotional, practical and evidence-based content that is meaningful to those newly diagnosed, in-treatment, post-treatment and living with metastatic disease.\nLiving Beyond Breast Cancer \n“In the first 14 years, thousands of our guests generously raised over $275,000 for the Pink Kiss for the Cure campaign,” said . “This is an important tradition for all eight of our restaurant brands at 15 Southeast locations—we hope our 15th year is another tremendous success in support of the great work by the team at Living Beyond Breast Cancer.”\nCentraArchy CEO Vince Van Brunt \nTo participate, guests simply order the at any CentraArchy Restaurant, including (Augusta, Ga., Charleston, S.C., Columbia, S.C., Greenville, S.C., Spanish Fort, Ala., and Surfside Beach, S.C.), (Myrtle Beach, S.C.), (Greenville, S.C.), and in La., (Garden City, S.C.), (Atlanta) or (Atlanta, Boca Raton, Fla. and Myrtle Beach, S.C.).\n“Pink Kiss” California Dreaming Carolina Roadhouse Chophouse ’47 Chophouse New Orleans Bon Ton Prime Rib Gulfstream Café Joey D’s Oak Room New York Prime \nCentraArchy dining guests are encouraged to share their photo-worthy Pink Kiss images on Facebook or Instagram using the hashtag #PinkKiss. For more information about CentraArchy Restaurants, visit .\nCentraArchy.com \n# # #\nNew York Prime, Boca “Top Steakhouse” \nThank you The Palm Beaches Florida for featuring us in and calling us ‘where classic steakhouse swagger meets Boca Raton.’ We’re proud to be your favorite #Boca steakhouse.\n’10 Top Steak Houses in The Palm Beaches’ \nRead the full story\nSizzling Bites: The Best Steakhouses in Palm Beach County You Need to try Now > New York Prime, Boca “Still the One” \nA huge thank you to  for the amazing “Still the One” feature! We’re proud to keep raising the bar as your favorite #Boca steakhouse and grateful to our team and guests who make it all happen.\nThe Boca Raton Observer \nRead the full story on page 236 of the >\n100th Anniversary issue of The Boca Raton Observer « Older Entries \nMedia Contact\n\nAmber Stewart\namber@centraarchy.com \nArchives\nArchives Select Month October 2025 July 2025 October 2024 September 2024 June 2024 April 2024 October 2023 March 2023 October 2022 August 2022 March 2022 January 2022 August 2021 March 2021 January 2021 November 2020 October 2020 August 2020 March 2020 February 2020 January 2020 September 2019 August 2018 July 2018 August 2017 August 2016 April 2016 August 2015 March 2015 August 2014 October 2013 October 2012 Restaurants California Dreaming Carolina Roadhouse Chophouse ’47 Chophouse New Orleans Gulfstream Cafe Joey D’s Oak Room New York Prime Cities Atlanta, GA Augusta, GA Boca Raton, FL Charleston, SC Columbia, SC Greenville, SC Myrtle Beach, SC New Orleans, LA Spanish Fort, AL Contact CentraArchy Restaurants Careers \n© 2026 CentraArchy Restaurants. All Rights Reserved.",
      "hash": "2166f2751e02",
      "downloadedAt": "2026-01-19T02:16:35.389Z",
      "trimmedAt": "2026-01-19T02:54:13.307Z",
      "sizeReduction": "92.4%"
    },
    {
      "url": "http://centraarchy.com/",
      "text": "[Page Title: CentraArchy Restaurants]\n\nRestaurants Restaurants Gift Cards Reservations Homepage News & Happenings Careers Contact \n☰\n\nx\nRestaurants Restaurants Gift Cards Reservations Homepage News & Happenings Careers Contact Watch Video Full Watch Video Full \nOur Restaurants\nIn 1984, California Dreaming ‘The Restaurant and Bar at Union Station’ opened in Columbia, South Carolina. Since then, our company has grown to 15 unique restaurants under eight brands throughout the Southeast. Our menus focus on high-quality, fresh ingredients and house-made items that appeal to both casual and fine-dining guests. The teams at each location go to great lengths to ensure a dining experience that exceeds our guests’ expectations in every respect. The award-winning restaurants include: California Dreaming, New York Prime, Joey D’s Oak Room, Chophouse ’47, Carolina Roadhouse, Gulfstream Café, Bon Ton Prime Rib and Chophouse New Orleans. Bon Ton Prime Rib \nBon Ton Prime Rib\nCalifornia Dreaming \nCalifornia Dreaming\nCarolina Roadhouse \nCarolina Roadhouse\nChophouse '47 \nChophouse '47\nChophouse New Orleans \nChophouse New Orleans\nGulfstream Cafe \nGulfstream Cafe\nJoey D's Oak Room \nJoey D's Oak Room\nNew York Prime \nNew York Prime\nRestaurants California Dreaming Carolina Roadhouse Chophouse ’47 Chophouse New Orleans Gulfstream Cafe Joey D’s Oak Room New York Prime Cities Atlanta, GA Augusta, GA Boca Raton, FL Charleston, SC Columbia, SC Greenville, SC Myrtle Beach, SC New Orleans, LA Spanish Fort, AL Contact CentraArchy Restaurants Careers \n© 2026 CentraArchy Restaurants. All Rights Reserved.",
      "hash": "b2a85767fe9a",
      "downloadedAt": "2026-01-19T02:16:34.977Z",
      "trimmedAt": "2026-01-19T02:54:13.318Z",
      "sizeReduction": "97.9%"
    }
  ],
  "sizeReduction": "95.4%"
}