{
  "venueId": "ChIJ_0SDbmt6_ogRyxGo5SuT2Lg",
  "venueName": "Virginia's On King",
  "venueArea": "Downtown Charleston",
  "website": "http://www.virginiasonking.com/",
  "scrapedAt": "2026-01-19T02:19:35.905Z",
  "trimmedAt": "2026-01-19T02:25:53.548Z",
  "pages": [
    {
      "url": "http://www.virginiasonking.com/",
      "text": "[Page Title: Virginia's On King - Holy City Hospitality]\n\nMake a Reservation View Menus Join Our Loyalty Program \nCharleston Southern Hospitality\n\nVirginia’s on King is a sophisticated Southern restaurant blending traditional kitchen comforts with familiar regional dishes. Prepared with the utmost care for quality and flavor, the menu incorporates local ingredients and family recipes to bring you Southern cooking Lowcountry style. Classic Charleston style and homecooked aromas inspire the ambiance of this local favorite. At the heart of Virginia’s, you will find gracious Southern hospitality and comfort foods that make you feel right at home.\n\nContact us at 843-725-5959 ext 1 or through the link below\n\nFollow Us\n\nPrivate Events\n\nThe Upstairs at Virginia’s dining room is completely separated from the downstairs dining room. Purposely designed to host small receptions, corporate events, rehearsal dinners and bridal luncheons, Upstairs at Virginia’s is your ideal local for your special occasion!\n\nClassic Charleston influenced interior and the aromas of home cooking inspire all of the comforts of a traditional Southern kitchen, the perfect setting for hosting any of your events. At the heart of Virginia’s you will find gracious southern hospitality along with all of the flavors of the Lowcountry.\nDownload Info Packet Inquire Now \nGive the gift of delicious cuisine.\nPurchase Gift Cards \nContact Us\n\nHours of Operation:\nBrunch Served Daily! 8am-3pm Supper Served Thursday through Sunday 3pm-8pm Join us Thursdays for Fried Chicken Night! \n412 King Street Charleston, SC 29403\n\nPhone: (843) 735-5800\nEmail Us \nSee our news, reviews, and happenings.\nPress & Reviews View the Blog",
      "hash": "fed438c0b587",
      "downloadedAt": "2026-01-19T02:09:42.957Z",
      "trimmedAt": "2026-01-19T02:25:53.548Z",
      "sizeReduction": "96.7%"
    }
  ],
  "sizeReduction": "96.7%"
}