{
  "venueId": "ChIJA1VLHAVx_ogRAW1cAlWT3W0",
  "venueName": "The Red Drum",
  "venueArea": "Mount Pleasant",
  "website": "https://reddrumrestaurant.com/",
  "scrapedAt": "2026-01-18T17:04:23.961Z",
  "trimmedAt": "2026-01-18T17:05:06.895Z",
  "pages": [
    {
      "url": "https://reddrumrestaurant.com/",
      "text": "× Let us host your special event! Whether a birthday party, office function or any other special occasion - we take care of all the fine details, bringing your event to life, just as you imagined. Host your next party or get together Book your party Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! Job Listings Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! 803 Coleman Blvd, Charleston, SC 29464 map marker pin About us The Red Drum Gastro Welcome to the intersection of South by Southwest. It’s the islanders’ hangout where the food honors Southern heritage and Chef/Owner Ben Berryhill’s Texan cuisine. our menu Private Events Your private party spot Need the perfect space for your special event? Your search is over. We host. You party! Private Events Careers We are hiring! We want to hear from you! Send us your resume! Learn More & Apply for a job Gallery Ribeye steak topped with shrimp Bottles in a bucket with a glass of red wine and flowers by a window A bar nook with bar chairs, a table, bucket of drinks, glasses, and... Brunch steak and eggs with grits and biscuit Guacamole tortilla chips appetizer bites with a cocktail Interior, a close up view of a table with cooling drink buckets and... Patio table detail, flowers in a vase An assortment of various dishes and drinks spread on a table,... Eggs Benedict with Texas toast, and a small cup of fruit THE RED DRUM GASTRO THE RED DRUM GASTRO THE RED DRUM GASTRO THE RED DRUM GASTRO THE RED DRUM GASTRO THE RED DRUM GASTRO THE RED DRUM GASTRO THE RED DRUM GASTRO THE RED DRUM GASTRO THE RED DRUM GASTRO THE RED DRUM GASTRO Order online Pick Up Your Favorite Food Don't feel like cooking today? We got you covered - order now! Order Reviews Review by - Yelp Greg Z: Awesome food, service and atmosphere. Can't go wrong ordering at Red Drum. Will definitely return next time in Mt Pleasant area. Review by - Yelp Miles W: This place is phenomenal. Got the potato flautas with bacon and cheese for an app. Had the pan seared sea scallops for dinner. Everything went so well together. Got a couple old fashioned drinks too. Everything was amazing and service was great. Review by - Yelp Frank C: Great place for food and drinks. Bartenders attentive and personable. Either inside or the outside dining and bar area. Owners are hard working and very cool. And a must to check out their lunch truck. Review by - Yelp Ellie K: Every time we visit Charleston this is a must go dinner. It's always great and tastes fantastic! I got the chicken for the first time and it was 10/10. Highly recommend! Review by - Yelp Jennifer W: We absolutely love this place! The food and service is amazing. The chips and salsa...to die for. Stop reviews carousel Play reviews carousel Experience the difference Our Menu Treat yourself Our Drinks Make some memories Reserve we offer gift cards gift cards Dot slide navigation number 1 Dot slide navigation number 2 Dot slide navigation number 3 Dot slide navigation number 4 slideshow start stop playing Newsletter Location 803 Coleman Blvd Charleston, SC 29464 Hours Tue, Wed, Thur, Fri, Sat Bar: 4:00 PM - 11:30 PM Limited menu until 5:00pm Dining Room: 5:00 PM - 9:30 PM Sunday Brunch: Bar 10:00 AM - 11:00 PM Limited menu from 2pm to 5:00pm Dining Room 10:30 AM - 2:00 PM Sunday Dinner 5:00 PM - 9 PM Find us on... Facebook page Instagram page Yelp page Contact us (843)-849-0313 thereddrumgastro@gmail.com Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "04277507b352",
      "downloadedAt": "2026-01-18T16:57:38.596Z",
      "trimmedAt": "2026-01-18T17:05:06.876Z",
      "sizeReduction": "97.5%"
    },
    {
      "url": "https://reddrumrestaurant.com/charleston-the-red-drum-gastro-food-menu",
      "text": "Our Menu Dinner Happy Hour Bar Sunday Brunch Desserts",
      "hash": "0b965880d157",
      "downloadedAt": "2026-01-18T16:57:38.815Z",
      "trimmedAt": "2026-01-18T17:05:06.882Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "https://reddrumrestaurant.com/charleston-the-red-drum-gastro-happy-hours-specials",
      "text": "Specials We are updating our specials Please stay tuned",
      "hash": "6c5a2a830239",
      "downloadedAt": "2026-01-18T16:57:39.997Z",
      "trimmedAt": "2026-01-18T17:05:06.884Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "https://reddrumrestaurant.com/charleston-the-red-drum-gastro-cocktails",
      "text": "Cocktails Wine by the Glass Cellar List – Red Drum Cocktails",
      "hash": "f0dfc403b98d",
      "downloadedAt": "2026-01-18T16:57:39.408Z",
      "trimmedAt": "2026-01-18T17:05:06.889Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "https://reddrumrestaurant.com/charleston-the-red-drum-gastro-private-events",
      "text": "Private Events Red Drum offers a variety of private dining spaces that are perfect for your corporate events, rehearsal dinners, and other special celebrations. Our private spaces can accommodate groups of all sizes (up to 125 people). We offer select, customized seated dinner menus and group hors d’oeuvres/cocktail party menus at varying price points. Food and Beverage minimums apply to each private space, contracts are required to secure a private room reservation. For special events or private dining, please contact Mary Catherine Chance at or call thereddrumgastro@gmail.com 843-568-9571 Book Now a private event The Wine Room The Wine Room is inviting and warm. This is our most intimate private room. It is perfect for small celebrations and meetings. You will have a dedicated server and our team will explore menu options with you if you choose. The Max Capacity for this room is 20 people. See inside The Wine Room The Pub Room The Pub Room features a fireplace, wooden tables and a sliding barn door for privacy. This space can accommodate a set seated dinner or cocktail/hors d’oeuvres party. You can combine The Pub with our covered patio space for even larger events. Perfect for a rehearsal dinner or company holiday party. The Max Capacity for this room is 50 people (125 if combined with our Patio). See inside The Pub Room Outdoor Patio Our beautiful open air and covered patio features its own bar and heaters if needed. The Patio is ideal for larger parties looking to enjoy passed hors d’oeuvres and stations. Our event coordinator will work with you to create the perfect menu and evening. The Max Capacity for this space is 70 people (125 if combined with our Pub Room). See The Outdoor Patio Book Now private events",
      "hash": "fd83530a8aea",
      "downloadedAt": "2026-01-18T16:57:40.594Z",
      "trimmedAt": "2026-01-18T17:05:06.895Z",
      "sizeReduction": "97.6%"
    }
  ],
  "sizeReduction": "98.9%"
}