{
  "venueId": "ChIJ06i6Dmt6_ogRGLIqrt_VSgg",
  "venueName": "Halls Chophouse",
  "venueArea": "Downtown Charleston",
  "website": "http://hallschophousecharleston.com/",
  "scrapedAt": "2026-01-18T17:04:22.950Z",
  "trimmedAt": "2026-01-18T17:04:44.611Z",
  "pages": [
    {
      "url": "http://hallschophousecharleston.com/charleston-downtown-halls-chophouse-charleston-food-menu",
      "text": "Our Menus Download Dinner menu Download Lunch menu Download Brunch menu Download Bar menu Dinner Sunday Brunch Saturday Lunch Dessert Bar Menu Signature Cocktails Restaurant Week",
      "hash": "08962d3901d9",
      "downloadedAt": "2026-01-18T16:54:06.378Z",
      "trimmedAt": "2026-01-18T17:04:44.577Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "http://hallschophousecharleston.com/",
      "text": "434 King Street, Charleston, SC 29403 map marker pin Reservations Reimagining fine dining Make some memories. Reserve your table, we look forward to seeing you! Book your Halls Chophouse - Charleston reservation on Resy The art of fine dining Our Menus Make some memories Reserve a table Private Dining & Groups Inquire now a party Dot slide navigation number 1 Dot slide navigation number 2 Dot slide navigation number 3 slideshow start stop playing _ The Hall family opened the doors of Halls Chophouse Charleston in 2009, but their pursuit of exceptional hospitality started long before. About Us Live Music & Events at Halls Charleston Events Our Steaks Steaks Premium Cuts. Classic Steakhouse Selections. Watercress salad, with grape tomatoes Dining table with leather seats Interior, dining area Sliced Tomahawk steak Grilled T bone steak Dining area, painting on the wall Crowded bar area Reviews Review by - Tripadvisor John F: This was really an amazing culinary experience. Everything I ordered was truly exquisite. If in Charleston, book a table do not think about it. Service was very attentive and made some great suggestions for ordering. Live music was great and not so loud as to take away from an intimate dinner. Fantastic place. Review by - Tripadvisor Ashley F: We had the most amazing meal at Hall's. The service is truly 5-star and the steak was probably the best steak I have ever eaten. We were here to celebrate a special event, and we were treated as such. Our servers took time to give us personalized recommendations and the sommelier helped us select a delicious wine. We would highly recommend and can't wait to dine again. We will be back soon! Review by - Tripadvisor Daniel B: Excellent food, attentive staff, outside seating. We were visiting Charleston on our journey across the country. We wanted a special dinner to celebrate. We choose an early seating on their outside patio, it was perfect. Safe and separate. Review by - Tripadvisor John S: Outstanding Dinner and exceptional service highly recommend the dry aged strip steak and the she crab soup. A dining experience you won’t forget definitely will go back on our next trip to Charleston. Oh and the whiskey bread pudding mouth watering!!! Review by - Tripadvisor Bob T: Halls is always superb and well deserves its recurrent place on the 10 best restaurants list. The service is always fantastic with the best and friendliest staff around town. The variety of steaks available - wet aged, dry aged, etc. - makes it impossible to not find one's favorite here. If your local this should be on your repeat list, if your visiting it should be a not to be missed. Stop reviews carousel Play reviews carousel Location 434 King Street Charleston, SC 29403 Hours DINNER Monday - Thursday 4:00pm - 11:00pm Friday 4:00pm - 12:00am Saturday 4:30pm - 12:00am Sunday 4:30pm - 11:00pm SATURDAY LUNCH Saturday 11:00am - 2:30pm SUNDAY BRUNCH Sunday 10:00am - 2:00pm + SPECIAL HOURS + Thanksgiving Day 12:00pm - 8:00pm Friday, Nov. 28 Lunch 11:00am - 2:00pm, Dinner beginning at 4:00pm Friday, Dec. 5 Lunch 11:00am - 2:00pm, Dinner beginning at 4:00pm Friday, Dec. 12 Lunch 11:00am - 2:00pm, Dinner beginning at 4:00pm Friday, Dec. 19 Lunch 11:00am - 2:00pm, Dinner beginning at 4:00pm Christmas Eve 3:00pm - 9:00pm Christmas Day closed New Year's Eve 4:00pm - midnight Find us on... Facebook page Instagram page Google page Contact us (843)-727-0090 ContactUs02@hallmanagementgroup.com Careers Donation Requests Locations Private Dining Shop Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper.",
      "hash": "28e7a6988de7",
      "downloadedAt": "2026-01-18T16:54:06.276Z",
      "trimmedAt": "2026-01-18T17:04:44.592Z",
      "sizeReduction": "96.9%"
    },
    {
      "url": "http://hallschophousecharleston.com/charleston-downtown-halls-chophouse-charleston-locations",
      "text": "Locations Charleston Columbia Greenville Nexton Nashville Charleston Address: 434 King St, Charleston, SC 29403 Location Hours: 4:00 pm - 11:00 pm Monday - Thursday 4:00 pm - 12:00 am Friday 11:00 am - 12:00 am Saturday 10:00 am - 11:00 pm Sunday TO-GO AVAILABLE 4:30 pm - 6:00 pm Friday - Saturday Phone: 843-727-0090 Columbia Address: 1221 Main St 150, Columbia, SC 29201 Location Hours: 11:00 am - 11:00 pm Monday - Thursday 11:00 am - 12:00 am Friday & Saturday 10:00 am - 9:00 pm Sunday Phone: 803-563-5066 Greenville Address: 550 S Main St, Greenville, SC 29601 Location Hours: 11:00 am - 10:00 pm Monday - Thursday 11:00 am - 11:00 pm Friday - Saturday 10:00 am - 10:00 pm Sunday Phone: 864-335-4200 Nexton Address: 300 Nexton Square Dr, Summerville, SC 29486 Location Hours: 11:00 am - 10:00 pm Monday - Thursday 11:00 am - 11:00 pm Friday & Saturday 10:00 am - 10:00 pm Sunday Phone: 843-900-6000 Nashville Address: 1600 West End Ave, Nashville, TN 37203 Location Hours: 11:00 am - 11:00 pm Monday - Thursday 11:00 am - 12:00 am Friday - Saturday 10:00 am - 12:00 am Sunday Phone: 615-246-6000",
      "hash": "32025ce94651",
      "downloadedAt": "2026-01-18T16:54:08.245Z",
      "trimmedAt": "2026-01-18T17:04:44.605Z",
      "sizeReduction": "98.6%"
    },
    {
      "url": "http://hallschophousecharleston.com/charleston-downtown-halls-chophouse-charleston-wine",
      "text": "Wine Corkage Policy $45 per 750mL standard bottle, limit 2 $90 per 1.5mL magnum bottle, limit 1 We kindly ask you do not bring a wine currently on our wine list. Any additional bottles after 2, and wines currently listed are subject to a $90 corkage fee per bottle. Please click the button below to download the PDF of our wine list. Download Wine List",
      "hash": "c7a0b273a332",
      "downloadedAt": "2026-01-18T16:54:06.999Z",
      "trimmedAt": "2026-01-18T17:04:44.607Z",
      "sizeReduction": "99.5%"
    },
    {
      "url": "http://hallschophousecharleston.com/charleston-downtown-halls-chophouse-charleston-events",
      "text": "Events 5-course Wine Lunch featuring Domaine Pierre Usseglio & Fils Saturday February 7th Join us at Halls Chophouse for an exceptional five-course wine lunch featuring Domaine Pierre Usseglio & Fils. Enjoy a guided tour of Châteauneuf-du-Pape, with each course thoughtfully paired to showcase the elegance and depth of these renowned Rhône Valley wines, alongside a curated menu by the Halls Chophouse culinary team. The Menu 1st Course Mussels & Shrimp in Saffron Broth Wine Pairing: Châteauneuf-du-Pape 1er Cru Pierre Blanc 2021 2nd Course Gnocchi with Boar Ragù Wine Pairing: Châteauneuf-du-Pape 1er Cru Pierre Rouge 2022 3rd Course Ganache-Seared Duck Breast with Ratatouille and Pomegranate Reduction Wine Pairing: Châteauneuf-du-Pape “Réserve des 2 Frères” 2020 4th Course Elk Loin with Lyonnaise Potatoes and Fig Mostarda Wine Pairing: Châteauneuf-du-Pape “Clos No. 18” 2021 Dessert Course Cherry Clafoutis Wine Pairing: Regional Dessert Wine Price: $175++ per person for lunch and wine pairing Tickets: Tickets are now available. Please call 843-727-0090 to reserve your seat. 12:00 PM - 03:00 PM",
      "hash": "e0a5f04984ac",
      "downloadedAt": "2026-01-18T16:54:07.623Z",
      "trimmedAt": "2026-01-18T17:04:44.611Z",
      "sizeReduction": "98.4%"
    }
  ],
  "sizeReduction": "98.7%"
}