{
  "venueId": "ChIJCWc4JAx6_ogRd-tOwrQKAho",
  "venueName": "Slightly North of Broad Restaurant",
  "venueArea": "Downtown Charleston",
  "website": "https://www.snobcharleston.com/",
  "scrapedAt": "2026-01-18T17:04:24.299Z",
  "trimmedAt": "2026-01-18T17:05:19.490Z",
  "pages": [
    {
      "url": "https://www.snobcharleston.com/",
      "text": "S.N.O.B. IT'S A VIBE * An eclectic Lowcountry bistro that brings together an abundance of fresh, local ingredients and expert presentation with friendly, contagious energy. Reservations Your table, your moment Secure your spot and enjoy fresh, seasonal dishes crafted with care. Reserve today for an unforgettable Lowcountry dining experience. Reserve now Farm-to-Table for Over 30 Years Locally Sourced, Sustainably Harvested Boutique proteins, specialty produce, seasonal seafood. Our daily menus evolve from the most recent harvests of our growers & artisans, arriving at our kitchen door every day. Our growers & ARTISANS Our Menus Our menus are packed with so much creativity, you can taste it!We cultivate our menus daily, just like the fields, farms, & waters that provide our ingredients. Our menus Reservations Book your Slightly North of Broad reservation on Resy slideshow start stop playing Slide 1 content Slide 2 content previous slide next slide An Eclectic Local Bistro Our Menus Farm-to-Table. Elevated. Meet Our Growers & Artisans Take a Look Inside Virtual Tour Reviews Start stop reviews carousel Review by - Google David W: five star review by 1st time. Excellent service, great open kitchen atmosphere, fantastic food. We had Sangria to begin and dined on Carolina BBQ Shrimp and a Salad for starters. Then Scallops and Duck Breast for entrees. All was delicious. Review by - Google Jacqueline L: five star review by Fantastic staff, very welcoming & knowledgeable. The food was top notch, just the right amount of luxury in a practical, tasty dish. Review by - Google Barno: five star review by What a great place to eat if you're in Charleston. Thank you so much for a wonderful dining experience. FOOD WAS FANTASTIC! Review by - Google Kristina L: five star review by Food was delicious and service was great! Recommend the shrimp and grits or flounder but you really can't go wrong! Review by - Google Jon S: five star review by We ate lunch here on a long weekend trip to Charleston. The food was fabulous and the atmosphere was top notch. Must stop in again! Skip Photo Gallery Newsletter Location 192 East Bay Street Charleston, SC 29401 Hours Mon, Tue, Wed, Thur, Fri, Sat 11:00 AM - 10:00 PM Sun 10:30 AM - 10:00 PM +Special Hours + Thanksgiving Day 11:00am - 7:00pm Christmas Eve 11:00am - 8:00pm Christmas Day closed New Year's Eve 11:00am - 11:00pm New Year's Day 11:00am - 8:00pm Find us on... Facebook page Instagram page Google page Contact us (843)-723-3424 Call us at contactus5@hallmanagementgroup.com Write us at Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "061b6a015780",
      "downloadedAt": "2026-01-18T16:54:48.052Z",
      "trimmedAt": "2026-01-18T17:05:19.477Z",
      "sizeReduction": "98.1%"
    },
    {
      "url": "https://www.snobcharleston.com/charleston-slightly-north-of-broad-menus",
      "text": "Our Menus Dinner Weekday Lunch Weekend Brunch PICCOLO MENU Restaurant Week Valentine's Day Menu",
      "hash": "bfa46b5ef40a",
      "downloadedAt": "2026-01-18T16:54:48.175Z",
      "trimmedAt": "2026-01-18T17:05:19.482Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "https://www.snobcharleston.com/charleston-slightly-north-of-broad-events",
      "text": "Events Valentine' Day Menu Saturday February 14th Celebrate the love in your life with our prix fixe Valentine's Day menu on Saturday, February 14th., starting at 4:30pm. Appetizer & Main Course for $90 | Include Dessert $100 SEE MENU Seating is limited so reserve your spot today! RESERVE NOW *Our regular menus will be offered for Lunch & Dinner on Friday, February 13th, Saturday Brunch, and Brunch & Dinner on Sunday, February 15th. 10:00 AM - 10:00 PM",
      "hash": "ccd09062d632",
      "downloadedAt": "2026-01-18T16:54:49.447Z",
      "trimmedAt": "2026-01-18T17:05:19.486Z",
      "sizeReduction": "99.3%"
    },
    {
      "url": "https://www.snobcharleston.com/charleston-slightly-north-of-broad-signature-cocktails",
      "text": "Our Drinks Cocktails Beer Wine",
      "hash": "e140ac99b604",
      "downloadedAt": "2026-01-18T16:54:48.829Z",
      "trimmedAt": "2026-01-18T17:05:19.490Z",
      "sizeReduction": "100.0%"
    }
  ],
  "sizeReduction": "99.2%"
}