{
  "venueId": "ChIJw1lkHv1j_ogRA8TzBgonSWM",
  "venueName": "Dashi Wine Bar and Emporium",
  "venueArea": "North Charleston",
  "website": "https://www.dashiwinebarandemporium.com/",
  "scrapedAt": "2026-01-18T17:04:31.829Z",
  "trimmedAt": "2026-01-18T17:12:56.859Z",
  "pages": [
    {
      "url": "https://www.dashiwinebarandemporium.com/events-1",
      "text": "Events Events Argentinian Wine Tasting! $25.00 Add To Cart Added! Spanish Wine Tasting with Fermented Vines! 1/21/26 at 6pm! $30.00 Add To Cart Added! Oyster Roast and Wine Tasting 1/25/26 1-3pm $40.00 Add To Cart Added! A Taste of Rioja! January 28th, 2026 7-9pm $25.00 Add To Cart Added! Ribera Del Duero Tasting - February 25th, 2026 7-9pm! $25.00 Add To Cart Added! Sherry Tasting - March 25th, 2026 7-9pm $25.00 Add To Cart Added! Spanish Vermouth Tasting - April 29th, 2026 7-9pm $25.00 Add To Cart Added! Rias Baixas Tasting May 27, 2026, 7-9pm $25.00 Add To Cart Added! Txakoli Day - February 21, 2026 1-4pm! $50.00 Add To Cart Added!",
      "hash": "2152ffbaeb83",
      "downloadedAt": "2026-01-18T16:58:59.439Z",
      "trimmedAt": "2026-01-18T17:12:56.800Z",
      "sizeReduction": "99.7%"
    },
    {
      "url": "https://www.dashiwinebarandemporium.com/",
      "text": "Dashi Wine Bar and Emporium Events! Venue Use and Rental Looking for a venue for your next event? The Dashi Wine Bar and Emporium is a great option! We have seating for groups of up to 60 people, ample parking, an adorable outdoor space and plenty of wine! If you are looking for a new place to hold a book club or other activity, we are happy to host small groups (up to 30 people) for free. If you need to rent the entire space we can do that too! For more information about Dashi Catering click below! If you are interested in hosting an event at the Wine Bar or an event rental please fill out this form and we will follow up! Dashi Catering Anza Rioja 'Carramonte' 2022 $145.00 Prestige Wines! Although we have a wide variety of well priced wines that offer excellent value, we also have some of Spain’s most highly regarded wines. Here are a few of our most prestigious ones, but our inventory is constantly evolving. We invite you to come in and browse! Hnos. Perez Pascuas - Perez Pascuas Gran Seleccion 2015 Flor de Pingus '22 Shop Now Upcoming events. Dashi Wine Bar and Emporium Info Hours: : 4pm-10pm Wednesday : 4pm-10pm Thursday : 4pm-10pm Friday : 1pm-10pm Saturday : 1pm-9pm Sunday Wines By The Glass Our Wine By The Glass selections are always changing, but here are some of our favorites that are likely to be available. We have a number of Vermouths and Sherries available by the glass as well. When you arrive, check out the wine wall to see what’s on offer! Red 12 $ Ca'N Verdura Supernova Mantonegro 2023 The wine is wildly fragrant with herbal-tinged, red berry fruit aromas that explode from the glass. The palate is medium-bodied and exhibits those aforementioned ripe red berry flavors mixed with notes of exotic spice. 12 $ 13 $ Bodega Barda Pinot Noir 2024 Perfumed, with subtle cherry, cranberry and strawberry aromas and a hint of peaches. Medium-bodied with brightness and freshness. Vivid, lively, crunchy and fresh. Always excellent and super drinkable. 13 $ 10 $ Frontonio Microcosmico Garnacha 2023 Pale ruby. Redcurrant and strawberry over mineral and white pepper notes. Village Grenache grown in pure slate soils. A sincere, austere Garnacha that reflects the traditional winemaking style of Aragon, the region where the grape variety originates. 10 $ 11 $ Antonio Lopes Ribieiro 2023 Light and quite dry with beautiful acidity. Aromas and flavors of wildflowers and wild strawberries. 11 $ 10 $ Clos de Lom Tempranillo 2022 This wine shows a deep red cherry colour with violet hits. On the nose we find intense aromas, a remarkable fruity and long-lasting character, with red fruit, blackberry, cassis and a slight subtle toast. Full-bodied, harmonious, elegant with palate-dusting tannins. Great acidity with a persistent aftertaste. 10 $ White 10 $ Abellio Albarino 2023 Clean and bright wine. The nose has an intense aroma, highlighting apple and stone fruits. In the mouth, the typical freshness of Albariño stands out, with a very tight acidity. 10 $ 8 $ Xarmant Txakolina 2024 Light, lively, and clean with an array of fruit flavors, such as green apple and citrus, and sprightly effervescence. 8 $ 10 $ Ribeiro Biotite Vinho Verde 2022 This is refreshingly crisp with a vibrant, fruit-driven palate yet laced with minerals that come from the schistous slopes of the vineyard site. Fermented with native yeasts, a practice that, in the best of hands, results in great character. Fresh and lively and ready to please any palate. 10 $ 9 $ Casamaro Verdejo 2024 Honeyed apricot, peach + pear, with lemon verbena + mint leaves. Grapefruit essence on a stony, rich palate with a smooth yet vibrant finish. 9 $ Rose 9 $ Bodegas Breca 2023 Notes of pink nectarines, dried orange and peach pit follow through to a medium body with vivid, crunchy acidity and a sleek, polished mouthfeel. Textural and delicious. 9 $ 9 $ Ostatu Rosado 2023 This light and refreshing wine is a modern variation of a classic rosé from Rioja. Floral and acidic, very light on the palate with notes of red berries. 9 $ Orange 10 $ Bojo do Luar Doralice 2022 This Portuguese orange wine is structured, aromatic, herbaceous with soft tannins and a touch of nuttiness in the predominantly tropical fruit flavors. 10 $ 9 $ Nanit Orange 2023 The wine was fermented for 10 days on its skins resulting in a fragrant wine of fresh white florals, citrus zest and minerally flavours with citrus zest, fine herbs and balsamic notes silky and concentrated on the palate. 9 $ Menu 6 $ JAMÓN SERRANO Dry-cured Spanish ham from the mountains, aged 6–18 months for a savory, delicate flavor. 6 $ 12 $ JAMÓN IBÈRICO DE BELLOTA Premium Iberian ham, free-range and acorn-fed, cured up to 48 months for rich marbling. 12 $ 6 $ MILD CHORIZO 6 $ 6 $ HOT CHORIZO 6 $ 12 $ MILD CHORIZO IBÈRICO 12 $ 12 $ HOT CHORIZO IBÈRICO 12 $ 7 $ DRUNKEN GOAT Goat’s milk cheese from Murcia, soaked in red wine for 72 hours for a fruity, purple-rinded finish. 7 $ 7 $ MANCHEGO Classic La Mancha sheep’s milk cheese, firm and buttery with a creamy, slightly piquant bite. 7 $ 7 $ MANCHEGO WITH ROSEMARY Nutty Manchego paired with aromatic rosemary for a fragrant, savory balance. 7 $ 7 $ RONCAL Robust sheep’s milk cheese from Valle de Roncal, with wild, herbaceous notes and a tangy finish. 7 $ 7 $ MITIBLEU BLUE Sheep’s milk blue, aged 4 months. Bold, spicy, and mineral-rich yet smoother than French blues. 7 $ 7 $ ALISIOS Canary Island cow and goat’s milk blend, coated in sweet paprika for toasted, tangy complexity. 7 $ 7 $ MARCONA ALMONDS The queen of almonds. 7 $ 11 $ BONITO DEL NORTE TUNA IN OLIVE OIL Line-caught in the Cantabrian Sea, hand-packed in olive oil for a tender, mild flavor. 11 $ 12 $ SARDINES IN OLIVE OIL Ortiz “Old Style” sardines, preserved in olive oil and sea salt. 12 $ VARIETY OF BASQUE STYLE PINXTOS",
      "hash": "7c3408f6f20e",
      "downloadedAt": "2026-01-18T16:58:57.838Z",
      "trimmedAt": "2026-01-18T17:12:56.853Z",
      "sizeReduction": "97.9%"
    },
    {
      "url": "https://www.dashiwinebarandemporium.com/dashi-wine-club",
      "text": "Dashi Wine Club! $40 per month Sign up What an incredible Value! Join us as we celebrate wines from Spain, Portugal and South America. The Wine Club includes the following: Choice of 2 bottles of wine from our monthly selection of 5-8 selections; One tasting per month for you and a guest at either Dashi or the Dashi Wine Bar and Emporium. Tastings include samples of all the month’s wines and food. Additional guests may attend for $25/person. Additional 10% off retail alcohol at Dashi or Dashi Wine Bar and Emporium. Opportunity to purchase closeout wines and wholesale wines at deep discounts.",
      "hash": "adbe39e683b6",
      "downloadedAt": "2026-01-18T16:58:58.204Z",
      "trimmedAt": "2026-01-18T17:12:56.859Z",
      "sizeReduction": "99.4%"
    }
  ],
  "sizeReduction": "98.8%"
}