{
  "venueId": "ChIJex_shH97_ogRVVQ80es9svY",
  "venueName": "La Cave",
  "venueArea": "Mount Pleasant",
  "website": "https://lacavechs.com/",
  "scrapedAt": "2026-01-19T02:45:56.416Z",
  "trimmedAt": "2026-01-19T02:52:41.938Z",
  "pages": [
    {
      "url": "https://lacavechs.com/",
      "text": "[Page Title: French Cuisine, Wine & Cocktails in Charleston SC | La Cave Restaurant]\n\nQuintessential French Elegance\n\nLa Cave is an intimate French dining room where a seasonal, ingredient-driven menu sets the tone, complemented by an exceptional selection of French wines, craft cocktails, and whiskies.\n\nA Taste of Provence in Charleston\n\nSeasonal French cooking and understated elegance inspired by the South of France.\nThe Menu \nPrivate Events\n\nAn elevated backdrop for rehearsal dinners, private brunches, cocktail parties, and beyond.\n\nLocated right on King Street, La Cave’s European charm and curated interiors provide a retreat in the heart of downtown Charleston.\nInquire Now \nSavor every moment in classic Provençal style\nLearn More",
      "hash": "6024fd145b99",
      "downloadedAt": "2026-01-19T02:11:27.115Z",
      "trimmedAt": "2026-01-19T02:52:41.916Z",
      "sizeReduction": "97.4%"
    },
    {
      "url": "https://lacavechs.com/menu/",
      "text": "[Page Title: Our Menu - La Cave Restaurant | Charleston SC]\n\nMenu\n\nIn the esprit de Provence, La Cave celebrates the rhythm of the seasons through the lens of Chef Alex Eaton. Each dish showcases the Lowcountry’s freshest ingredients, thoughtfully sourced from local farms and purveyors, and paired with organic French wines and garden-driven cocktails—all meant to be shared and savored at a leisurely pace.\nDinner Cocktails Wines & Digestifs \nPetits Plats\n\nCAVIAR PROFITEROLE\n\nlemon craquelin, crème fraîche, kaluga caviar\n\n18\n\nOYSTERS\n\nelderberry mignonette\n\n17\n\nCRUDO\n\nlocal fish, grape/ginger consommé, apple, sumac\n\n15\n\nLA SALADE\n\nlocal lettuce, roquefort vinaigrette, poivron, capers, marcona almonds\n\n15\n\nCIDER GLAZED CARROTS\n\npistachios, warm spice, espelette\n\n9\n\nPOMMES FRITES\n\nrosemary-lemon aïoli\n\n8\n\nRACLETTE BURGER SLIDER\n\ndouble short rib-brisket patties, caramelized onion, dijonnaise, raclette, petit local bakery sesame roll\n\n10\n\nBOUILLABAISSE\n\nmussels, shrimp, and local fish, saffron broth, fennel, potato, grilled baguette\n\n26\n\nCHARRED OCTOPUS\n\npotato purée, salade mentonnaise, burnt orange, pine nuts\n\n31\n\nPROVENÇAL TARVIN SHRIMP\n\nsaffron beurre blanc, castelvetrano olive, tarragon, micro chervil\n\n23\n\nFILET MIGNON TARTINE\n\nwild mushroom, fresh ricotta, hot honey, sea salt, grilled baguette\n\n27\n\nPlats\n\nCONFIT DUCK GNOCCHI\n\ncognac-soaked golden raisins, shaved brussels sprouts, parmesan\n\n24\n\nPOULET ROUGE\n\njoyce farms half chicken, herbes de provence beurre blanc, roasted seasonal vegetables\n\n35\n\nWAGYU NY STRIP\n\nentrecôte sauce, charred broccolini, black garlic & lemon\n\n62\n\nPOISSON\n\nwhole fish, braised cabbage, herb butter, roasted vegetables, endive & carrot\n\nMKT\n\nBOEUF EN CROÛTE\n\nfilet mignon, mushroom duxelles, puff pastry, prosciutto, sauce bordelaise\n\n37\n\nDesserts\n\nLEMON LAVENDER CRÈME BRÛLÉE\n\n15\n\nWARM SAINT ANGEL TARTE\n\nhoney & orange soaked figs\n\n15\n\nGÂTEAU AU CHOCOLAT\n\nsalted caramel sorbet\n\n16",
      "hash": "6964fd67a6f3",
      "downloadedAt": "2026-01-19T02:11:27.209Z",
      "trimmedAt": "2026-01-19T02:52:41.922Z",
      "sizeReduction": "94.1%"
    },
    {
      "url": "https://lacavechs.com/private-events/",
      "text": "[Page Title: Private Events - La Cave Restaurant | Charleston SC]\n\nPrivate Events\n\nPrivate Events\n\nInspired by the light-soaked villas of the South of France, La Cave provides an elevated backdrop for rehearsal dinners, private brunches, cocktail parties, and beyond. With cozy banquettes and antique mirrors, the lounge evokes classic Provençal style with natural wood finishes, curved light stone walls, organic lavender accents, and olive trees for added charm.\nInquire \nThe Space\n\nFeaturing a semi-private room surrounded by flowing drapery and full bar, the space is available for partial or full buyouts.\n\nCapacity\n\nSemi-private: Up to 14 guests\nFull Buyout: Up to 35 guests seated or 80 standing\n\nFood & Beverage\n\nMenus are fully customizable, pulling options from La Cave’s French-inspired offerings, such as caviar profiteroles, filet tartine, and oysters on the half shell, or create your own with the help of our chef and events team.\nInquire \nInquire below for your private event at La Cave\n\n\"\" indicates required fields\n* Email \nThis field is for validation purposes and should be left unchanged.\nFirst Name * Last Name * Email * Phone * \nEvent Details\nNature of Event (e.g. Birthday Party or Business Dinner) * Event Date * MM slash DD slash YYYY Start Time * 11:00 AM 12:00 PM 1:00 PM 2:00 PM 3:00 PM 4:00 PM 5:00 PM 6:00 PM 7:00 PM 8:00 PM 9:00 PM 10:00 PM End Time * 1:00 PM 2:00 PM 3:00 PM 4:00 PM 5:00 PM 6:00 PM 7:00 PM 8:00 PM 9:00 PM 10:00 PM 11:00 PM 12:00 AM Guest Count * Is there any additional info you would like to add? How did you hear about us? This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "b1f26706a64a",
      "downloadedAt": "2026-01-19T02:11:27.852Z",
      "trimmedAt": "2026-01-19T02:52:41.938Z",
      "sizeReduction": "97.4%"
    }
  ],
  "sizeReduction": "96.5%"
}