{
  "venueId": "ChIJZ2C56mV6_ogRZya7BsOOCxI",
  "venueName": "Rappahannock Oyster Bar",
  "venueArea": "Downtown Charleston",
  "website": "https://www.rroysters.com/rappahannock-oyster-bar-charleston-sc.html",
  "scrapedAt": "2026-01-19T03:25:43.493Z",
  "trimmedAt": "2026-01-19T03:32:05.362Z",
  "pages": [
    {
      "url": "https://www.rroysters.com/rappahannock-oyster-bar-fish-market-washington-dc.html",
      "text": "[Page Title: Rappahannock Oyster Co.: Rappahannock Oyster Bar @ The Wharf : Washington, DC]\n\nSkip to main content SKU: rappbaroysterwharf Rappahannock Oyster Bar @ The Wharf : Washington, DC \"DC's\nBest Oyster Bar Now Has a Waterfront Location at the DC Wharf.\" Washingtonian Rappahannock Oyster Bar (Wharf) occupies the restored historic\noyster shed (circa 1912) building at the Municipal Fish Market (the oldest fish\nmarket in the United States). The restaurant serves a line up of small plate\nofferings, wines, craft beers, unique cocktails, and of course, our very own\ncelebrated shellfish. General Manager: Adrianna Guzman Parking Notice: Parking at the Wharf can be limited, but there are plenty of convenient options, including public transit, garages and valet. We recommend checking out  before your visit to make things as smooth as possible. We look forward to seeing you! The Wharf's parking page Purchase Rappahannock Oyster Bar @ The Wharf : Washington, DC Book A Table Order Online View Menu Purchase a Gift Card \n1150 Maine Avenue SWWashington DC 20024\nHOURS Sun - Thurs : 11:30am - 10pm Fri - Sat : 11:30am - 11pm CLOSED Thanksgiving\nand Christmas Day Map \n(202) 484-0572\nEmail Us",
      "hash": "e673d9907246",
      "downloadedAt": "2026-01-19T02:09:15.941Z",
      "trimmedAt": "2026-01-19T03:32:05.348Z",
      "sizeReduction": "98.6%"
    },
    {
      "url": "https://www.rroysters.com/rappahannock-oyster-bar-charleston-sc.html",
      "text": "[Page Title: Rappahannock Oyster Co.: Rappahannock Oyster Bar : Charleston, SC]\n\nSkip to main content SKU: rappoysterbarchs Rappahannock Oyster Bar : Charleston, SC Review by Hanna Raskin – The\nPost and Courier Rappahannock Oyster Bar (Charleston) is nestled in a\njaw-dropping 19th-century cigar factory along Charleston’s Cooper River on East\nBay Street. Charleston is our biggest restaurant to-date (over 4,000 square feet), with outside dining\noptions and a 40-seat copper bar (one of Charleston’s largest). Though the\nambience is spectacular, the food is the star attraction. Light,\nbright, and brazen – you’ll see classics like our lambs ‘n clams, crab cakes,\noyster po’ boy, ceviches, and even chef’s take on a Southern classic: shrimp\n& grits (which we’ll put up against anyone’s). And seafood isn’t all we do well. You’ll also see vegan and pork/beef/chicken options that are\nsure to please. We’re also excited to introduce our  concept. Situated\nwithin the restaurant is a  that showcases all\nof the seafood we work with, from the local fish and shellfish we source to our\nvery own oysters. You’ll find our sauces and dry-mix blends, plus a rich\nselection of wines. The idea is to give consumers access to the very\ningredients we use every night – basically, our pantry is your pantry. The\nselection changes daily and will be growing over time. pantry seafood market General Manager: Sam LaCour Executive Chef: Jared Skidmore For gift cards, please visit us . here Purchase Rappahannock Oyster Bar : Charleston, SC Book A Table Order Online View Menu Purchase a Gift Card \n701 East Bay Street, No. 110Charleston SC 29403\nHOURS Mon - Sun: 11am - 10pm Thanksgiving and Christmas Day CLOSED Map \n843-576-4693\nEmail Us",
      "hash": "f42a7c66f401",
      "downloadedAt": "2026-01-19T02:09:15.601Z",
      "trimmedAt": "2026-01-19T03:32:05.356Z",
      "sizeReduction": "98.0%"
    },
    {
      "url": "https://www.rroysters.com/rappahannock-oyster-bar-los-angeles-ca.html",
      "text": "[Page Title: Rappahannock Oyster Co.: Rappahannock Oyster Bar @ ROW DTLA : Los Angeles, CA]\n\nSkip to main content SKU: rappoysterbardtla Rappahannock Oyster Bar @ ROW DTLA : Los Angeles, CA \"Rappahannock Is LA’s Sunny New Surefire Seafood Star in\nDowntown\" by Farley Elliott – Eater\nLA Exposed wood and concrete interiors of ROW DTLA’s historic\nproduce terminal is the ideal setting for Rappahannock Oyster Bar’s first West\nCoast location. Nestled in LA’s Warehouse District, just blocks from the Arts\nDistrict and Little Tokyo, ROW DTLA offers a West Coast spin on our East Coast\nheritage. With an emphasis on sustainability, locally sourced, ethically\nfished, and responsibly farmed ingredients, the menu draws inspiration from the\npeople of L.A. and the bounty of fresh produce, fish, and meat sourced in\nSouthern California. The space takes cues from the organic nature of the\noyster-farming process, blending live plants, blackened steel, zinc table tops,\ncopper accents and colorful tile, while also exhibiting the artistic energy and\nraw industrial design of Downtown LA. Grab a stool at the Carrara marble oyster\ncounter and bar, and take a glimpse into the open kitchen, where you'll find\nyour food being prepared fast and fresh right before your eyes. The oyster bar\nis filled with fresh Chesapeake Bay-farmed oysters from Rappahannock Oysters\nCo. that get shipped overnight across the U.S. You will also find a rotating\nlist of West Coast guest oysters along with fresh crab, clams, scallops, and\nshrimp, to name a few. The menu offers small and large plates consisting of\nmuch more than just oysters and seafood. The food is inspired by SoCal's\neclectic cuisines while aiming to stay true to the simplicity of oysters,\nseafood, and fresh produce. Executive Chef: Alex Rocha Purchase Rappahannock Oyster Bar @ ROW DTLA : Los Angeles, CA Book A Table Order Online View Menu Purchase a Gift Card \n777 S Alameda Street, #154Los Angeles CA 90021\nHOURS Mon - Thurs : 11:30am - 9pm Fri : 11:30pm - 10pmSat : 11am - 10pmSun : 11am - 9pm Thanksgiving and Christmas Day CLOSED Map \n(323) 435-4004\nEmail Us",
      "hash": "fbed41471f76",
      "downloadedAt": "2026-01-19T02:09:16.772Z",
      "trimmedAt": "2026-01-19T03:32:05.362Z",
      "sizeReduction": "97.5%"
    }
  ],
  "sizeReduction": "98.0%"
}