{
  "venueId": "ChIJ9epcmlNv_ogRluDeH2eKj88",
  "venueName": "Heavy's Barburger",
  "venueArea": "Daniel Island",
  "website": "https://www.heavysbarburger.com/",
  "scrapedAt": "2026-01-19T02:19:31.631Z",
  "trimmedAt": "2026-01-19T02:20:11.244Z",
  "pages": [
    {
      "url": "https://www.heavysbarburger.com/",
      "text": "[Page Title: Heavy's Barburger | Enjoy Great Food & Vibes Today]\n\nShakin’ Margaritas &smashin’ burgers\n\nWelcome to our neighborhood burger joint, where our music sets the vibe before you even hit the door. Step inside and keep the good times rollin’ — we’re talkin’ fresh off the flat top smashburgers, Shorty Margaritas, and a crew that’s genuinely glad you’re here.\n\nCome one, come all -\nwe can’t wait to serve ya! Downtown Charleston Learn more Daniel Island Learn more \nOUR MENU\n\nPairs Best With Good PEOPLE\n\nThis is the kind of food that just Smashburgers hot off the flat top, BLTs & Mahi sandwiches, Fried Chicken Salads, and House-Made Onion Rings built to pass around the table.\n. hits \nOur drink game’s strong too — Shorty Margaritas, neighborhood beers, easy wines, and zero-proof options that still bring the vibe.\n\nNo fluff. No fuss. Just , cold drinks, and the kind of menu you’ll wanna run back to weekly.\ndamn delicious food View Our Menu \nThe Heavy’s vibe, anywhere you want it.\nLearn more \nJOIN OUR TEAM\n\nYou can never have too much of a good thing — especially when it comes to people.\n\nIf you're into team service, positive energy, and putting hospitality first, you're our kind of person. Heavy’s is a burger joint built with exceptional people, great food, and a killer playlist.\nGood vibes and good taste required. Apply Now \nHEAVY LISTENING\n\nAround here, we take two things seriously: great food and good music.\nreally \nIf you’re craving the Heavy’s vibe beyond the barstool, hit play on our Spotify playlist and tune into our playlist of the season. It’s sure to bring the energy wherever you are.\n\nSolid tunes, on tap.\nalways Listen now",
      "hash": "84409506951a",
      "downloadedAt": "2026-01-19T02:06:17.253Z",
      "trimmedAt": "2026-01-19T02:20:11.208Z",
      "sizeReduction": "99.4%"
    },
    {
      "url": "https://www.heavysbarburger.com/menu",
      "text": "[Page Title: Menu — Heavy's Barburger]\n\nOUR MENU\n\nView our full food menu and drink selection - it’s full of all things you love, from our famous Barburger and Jumbo Wings to our Fresh Salads and Shorty Margarita.\nMenu offerings vary by location! Check your local Heavy’s for location-specific menu & pricing. For catering party trays, click here . Charleston Menu Daniel Island Menu \nShareable Snacks\n\nComes with One Dipping Sauce..\nAdditional Sauces +$1 each \nOur Crispy Wings Tossed in Choice of Red Ranger Sauce, The Wright Sauce, or Lemon Pepper Dry Rub. Buttermilk Ranch for Dipping. Served with Carrots & Celery.\nHEAVY’S JUMBO WINGS SIX / TEN RGF \nFour Jumbo Tenders, Buttermilk-Dipped, Hand-Breaded & Fried. Honey Mustard for Dipping.\nCHICKEN TENDERS & FRIES Dunked in Red Ranger Sauce for +$1 \nViv’s Deviled Eggs & Heavy’s Sweet & Spicy Thick-Cut Bacon\nBACON & EGGS GF \nHouse-Made Hand-Cut Sweet Onion Rings. Served with Heavy’s Sauce and Sweet & Sassy BBQ for Dipping.\nONION RINGS BASKET / HEAVY BASKET \nHeavy’s Sandwiches\n\nCrispy Fried Chicken Breast Dipped in Spiked-Up Cayenne Sauce, Topped with Pepper Slaw and Pickles\nTHE RED RANGER \nGrilled Chicken Breast with Pepper Jack Cheese, Avocado, Lettuce, Tomato, Red Onion and Duke's Mayo on a Martin's Potato Bun\nTHUNDERBIRD \nFish Filet Dusted with our Rub and Seared on a Cast Iron Skillet, Topped with Lettuce, Tomato, Red Onion and Heavy’s Sauce\nST. JOE BLACKENED FISH \nFresh Local Tomatoes, Applewood Smoked Bacon, and Fresh Lettuce with Duke’s Mayo on Normandy Farm Sourdough\nHEAVY’S BLT (SEASONAL) \nSlow-Roasted Prime Rib, Sliced Thin and Piled High on a Toasted French Loaf. Served with House-Made Jus for Dipping and The Wright Sauce.\nBIG TIM’S PRIME RIB \nSalads & Soups\n\nHand-Breaded Chicken on Fresh Greens with Cheddar, Cucumbers, Tomatoes, Bacon, Toasted Almonds, and Crunchy Sweet Potato Straws with a Side of Heavy’s Honey Mustard||\nFRIED CHICKEN SALAD RGF Sub: Chicken Salad +$1 Grilled Chicken +$2 Barburger Patty +$1 | Blackened Fish +$5 \nRoasted Chicken, Chilled, Sliced, and Tossed with Fresh Greens, Avocado, Diced Tomatoes, Toasted Almonds, Roasted Corn, Sweet Dates, Crumbled Goat Cheese, Cornbread Croutons, and Our Lemon Vinaigrette\nTHE COMPANY SALAD GF \nFresh Romaine Hearts Tossed in Our House-Made Caesar with Fresh Baked Sourdough Croutons, Topped with a Grilled Chicken Breast and Grated Parmesan\nGRILLED CHICKEN CAESAR RGF \nBrisket, Short-Rib, Kicked-Up with Sautéed Onions, Peppers, Stewed Tomatoes, and Beans. Topped with Cheddar & Jalapeños.\nSTEW’S CHILI CUP / BOWL RGF \nWe griddle-cook each of our quarter-pound smashburgers to order with our blend of ground Angus beef and serve ‘em on a Toasted Sesame Bun.Double Patty, American Cheese, Sliced Tomato, Red Onion, Lettuce, Pickles, Heavy’s Sauce\nBARBURGER \nAmerican Cheese, Red Onion, Pickles, Duke’s Mayo, French’s Mustard\nLUTEN’S CHEESEBURGER \nThick-Cut Bacon, Pepper Jack Cheese, Grilled Onions, Pickled Jalapeños, Sweet & Sassy BBQ, Fried Onion Straws\nUNCLE GENE’S RANCHERO \nAmerican & Swiss, Grilled Onions, Pickles, Heavy’s Sauce on Griddled Texas Toast\nPATTY MELT \nMarinated Mushrooms, Caramelized Onions, Swiss Cheese, Duke’s Mayo\nFUN GUY \nStew’s Chili, Grilled Onions, Cheddar Cheese, French’s Mustard on a Toasted Martin’s Potato Bun\nSTEW’S CHILI & CHEESE BURGER \nHouse-Made Veggie Patty, Swiss Cheese, Sliced Tomato, Red Onion, Lettuce, Pickles, Duke’s Mayo on a Toasted Martin’s Potato Bun\nHIPPIE BURGER \nHeavy’s Sides\n\nAdd to any sandwich or burger.\nCRINKLE CUT FRY RGF SWEET POTATO FRY GF HEAVY’S COLESLAW GF CUP OF STEW’S CHILI RGF LIL RANCH SALAD GF \nWe Have Pie!\n\nMade In-House with Fresh Lemons and Limes in a Graham Cracker and Almond Crust with House-Made Whipped Topping\nLEMON LIME ICEBOX PIE \nHeavy-Handed Pours\n\nEl Jimador Reposado, Agave Nectar, Orange, Fresh Squeezed Lime.\nSHORTY MARGARITA GF Add: Grand Marnier float +$3 \nTop Shelf Margarita with Patron Silver, Cointreau, Fresh Lime & Grand Marnier Side Piece\nELECTRA 225 GF \nA tad on the sweet side. Bulleit Bourbon, Angostura, Maple, Orange, and a good Cherry\nOUR BEST OLD FASHIONED GF \nFrozen Tequila Sunrise-ish\nTHE BANDWAGON GF \nServed Very Cold! Wild Turkey 101, Cherry & Rosemary Syrup, Fresh Squeezed Lemon\nCHERRY BOMB MANHATTAN GF \nDeep Eddy Lime Vodka, Ginger Beer, Lime\nMULE NAMED EDGAR GF \nJasper Gin, Ancho Reyes, Honey, Fresh Squeezed Lemon\nBEE STING \nAppleton Estates Rum, Plantation Pineapple Rum, Grand Marnier, Orgeat, Bitters, Fresh Squeezed Orange and Pineapple Juice\nHEY KOOL-AID MAN! GF \nZero-Proof “Cocktails”\n\nAmethyst Lemon Cucumber Serrano, Agave, Lime, Lemon, Orange\nGOOD GIRL DAISY GF \nAmethyst Blueberry Ginger Mint & Lois’s Lemonade\nBLUEBERRY LEMON CRUSH GF \nSoft Drinks\nLOIS’S FRESH LEMONADE GF BOTTLED DRINKS: CHEERWINE, NEHI, TOPO CHICO, IBC ROOT BEER, MEXICAN COKE GF DR. PEPPER & COKE PRODUCTS GF ICED TEA GF \nGluten-Friendly*\n\nRequest Gluten FriendlyGluten Friendlyon any Burger/Sandwich +$3on any Burger/Sandwich +$1\nRGF = GF = Sub Gluten Free Bun Sub Lettuce Wrap *Prepared in a shared kitchen. Not recommended for celiac or severe gluten allergy.",
      "hash": "a4ec0fdc2ca3",
      "downloadedAt": "2026-01-19T02:06:17.315Z",
      "trimmedAt": "2026-01-19T02:20:11.230Z",
      "sizeReduction": "97.3%"
    },
    {
      "url": "https://www.heavysbarburger.com/locations",
      "text": "```html\n\n```\n\n[Page Title: Charleston — Heavy's Barburger]\n\nhey, charleston neighbors!\nhey, charleston neighbors! hey, charleston neighbors! \ndowntown charleston\n\n1137 Morrison Dr, Charleston, SC 29403\n(843) 212-3302 Hours: \nOpen 11 am - 10 pm DailyHeavy's Hour: Weekdays 4 - 6 pm\nNo Reservations - Just Come on In! Order Online Get Directions Our Menu Apply Now About Our Charleston Location Morrison Drive — The Original Heavy’s Barburger Tucked between Morrison Drive and Meeting Street, our first Heavy’s Barburger is where the neighborhood comes to hang. It’s all good vibes, cold drinks, and our delicious smashburgers that bring people together. Kick back in the dining room, catch the breeze on the front deck, or unwind on the patio with your four-legged partner while our playlist sets the vibe. Whether you’re rolling solo or rolling deep, this place just hits right. And take it from the locals — the Onion Ring Basket is a must for your table. join us forHeavy’s Hour Weekdays 4 - 6 pm $5 Shorty MargaritasNeighborhood Draft BeerGlass of House WineJack & CokeTito’s Vodka & Soda \nORDER OUR FOR YOUR NEXT EVENT\nPARTY Trays \nBring the flavor to your next event with Party Trays from Heavy’s. We’ve got trays of our hand-breaded Chicken Tenders, crispy Jumbo Wings, freshly tossed Company Salad, and Bacon & Eggs tray (aka Viv’s Deviled Eggs). Plus, a whole Lemon Lime Icebox Pie! Perfect for Holidays, Beach Days, Boat Days, and .\nall the days Available for pick-up only. Learn More",
      "hash": "c5cc11993685",
      "downloadedAt": "2026-01-19T02:06:18.153Z",
      "trimmedAt": "2026-01-19T02:20:11.244Z",
      "sizeReduction": "99.2%"
    }
  ],
  "sizeReduction": "98.7%"
}