{
  "venueId": "ChIJwXiSIp97_ogR81S_Th4qiVs",
  "venueName": "The Bar at The Spectator",
  "venueArea": "Downtown Charleston",
  "website": "https://thespectatorhotel.com/the-bar?utm_source=google&utm_medium=business_listing&utm_campaign=gmb",
  "scrapedAt": "2026-01-18T17:04:31.920Z",
  "trimmedAt": "2026-01-18T17:13:02.092Z",
  "pages": [
    {
      "url": "https://thespectatorhotel.com/the-bar?utm_source=google&utm_medium=business_listing&utm_campaign=gmb#menu1049",
      "text": "Skip to content Our 1920's Inspired Speakeasy Bar The exuberance of the Jazz Age meets warm Southern charm in our Prohibition-style bar. Make yourself comfortable on a green leatherback stool, allow our cocktail artisan to conjure up a refreshment reminiscent of the 1920s, and indulge in a selection of sophisticated bar plates. The Bar also serves fine wine and a variety of local and regional craft brews. The Bar Hours of Operation Sunday - Thursday | 3:00 PM - 10:00 PM Friday + Saturday | 3:00 PM - 11:00 PM Bar Plates Served Daily | 3:00 PM - 9:00 PM A LEGACY WORTH CELEBRATING CHEERS TO 10 YEARS At The Bar, every sip offers more than just a drink — it’s a glimpse into our past. Join us in celebrating a decade of renowned service and unforgettable moments. Our new Legacy Menu offers a selection of the most beloved cocktails we’ve poured over the past 10 years, timeless favorites carefully curated to celebrate where we’ve been and where we’re going. Cocktails Bar Bites Beer Wine Cocktails Bar Bites Beer Wine Cocktails Craft Cocktails DRUGSTORE COWBOY 18.00 *New Southern Revival Abruzzi Rye | Cynar | *Southern Amaro | Bacon Salt BE ALL YOU CRAN BE 18.00 *Hat Trick Gin | Koval Liqueur | Cranberry | Thyme | Fresh Lemon | Sparkling Rose MELE KA-TIKI-MAKA 19.00 Ron Zacapa 23 | Velvet Falernum | Pierre Ferrand Dry Curacao | St Elizabeth Allspice Dram | Lime | Pineapple | Cranberry | Bittermens Elemakule Tiki Bitters PLUM LOCO 18.00 Mezcal Union | Ume Liqueur | Plum Puree | Fresh Lime | Sage THE DUDE IMBIBES 18.00 Chai- Vanilla Cathead Vodka | *Carolina Cream Liqueur | Almond Milk | King Bean Cold Brew - St George Coffee Liqueur Ice Cube HEARTH'S EMBRACE 18.00 Spectator Hotel Private Label Woodford Reserve | Disaronno | Fresh Lemon | Winter Spices | Egg White REPENT & REDEEM 20.00 Lalo Silver | Ancho Reyes Verde | Blood Orange | Lime | Chili Oil Foam (*** a $5 donation will be made to Lowcountry Food Bank for each sold) ENVY OF MANY 17.00 Tito’s | Green Apple Liqueur | Fresh Lime | Rosemary | Mint | Selter TULLY ME BANANA 19.00 Tullamore Dew 12yr | Tempus Fugit Banane | William Wolf Pecan Bourbon | Fee Brothers Black Walnut Bitters Classic Cocktails BOULEVARDIER 17.00 *Spectator Hotel Private Label Woodford Reserve Bourbon | Campari | Carpano Antica HANKY PANKY 17.00 Blue Coat Gin | Dolin Rouge Sweet Vermouth | Fernet Branca TRINIDAD SOUR 16.00 Angostura Bitters | Angostura Amaro | Bulleit Rye | Orgeat | Fresh Lemon Juice SIDECAR 17.00 Hennessy VS | Cointreau | Fresh Lemon Juice MANCINI 17.00 Elijah Craig Bourbon | Barolo Chinato | Tempus Fugit Crème de Cacao | Fee Brothers Orange Bitters BRANDY ALEXANDER 16.00 Torres 10yr Sherry Brandy | Trader Vic's Chocolate Liqueur | Cream REVOLVER 17.00 Larceny Bourbon | St George NOLA Coffee Liqueur | Orange Bitters EL DIABLO 18.00 Casa Noble Reposado | Giffard Crème de Cassis | Fresh Lime Juice | Ginger Beer BLOOD AND SAND 16.00 Glenmorangie X | Dolin Rouge Sweet Vermouth | Cherry Heering | Blood Orange YELLOW BIRD 16.00 Toppers White Rum | Galliano | Cointreau | Fresh Lime Juice Spirit Free Offerings CRIMSON & GOLD 12.00 Cranberry | Apple | Sage-Ginger Honey | Lemon | Seltzer FIGGY SMALLS 12.00 Fig | Balsamic | Rosemary | Lime | Ginger Beer FAUX G&T 12.00 Ritual Zero Proof Gin Alternative | Seagram’s Tonic SHE’S GLAMOROUS 9.00 N/A Grapefruit Paloma (canned mocktail) HEINEKEN 0.0 7.00 CEEBO HOPPED PILSNER 7.00 FRE CHARDONNAY 11.00 FRE CABERNET SAUVIGNON 11.00 Bar Bites CHARCUTERIE AND FROMAGE 21.00 Trio Fromage | Cured Meats | Honeycomb | House Pickled Accoutrements | Dijon | Jam (add Truffle Roasted Cashews $5) SLIDER TRIO 18.00 Turkey & Havarti | Ham & Swiss | Pimento Cheese & Pickled Green Tomato served with side of potato salad SEASONAL FLATBREAD 14.00 Warm Naan | Fig-Onion Spread | Goat Cheese Crumbles | Crispy Bacon | Fresh Basil | Balsamic Glaze Drizzle SPECK TATERS 14.00 Russet Potato | Speck Ham | Roasted Garlic Crème Fraiche MUSHROOM CROSTINI 15.00 Portobello Mushrooms with White Wine, Garlic, & Herbs | Smoked Gruyere | House-Made Baguette PRETZEL BITES 13.00 Salted Pretzel Bites | Smoked Gouda Beer Cheese Dip DEVILED EGG DUO (4pc) 7.00 Curry-Turmeric | Dill Pickle CHEDDAR-JALAPENO CORNBREAD BITES 7.00 Cinnamon-Honey Butter ROASTED & COZY each 5.00 Cashews | White Truffle Oil | Herbs de Provence Pecans | Smoked Olive Oil | Brown Sugar | Cayenne PARMESAN TRUFFLE POPCORN 6.00 WINTERTIME CANEPES 9.00 Whipped Gorgonzola | Baked Apple Slice | Crispy Sage | Walnut Dust | Hot Maple HOMEMADE CUPCAKE 8.00 Red Velvet Cupcake | French Vanilla Cream Cheese Filling | Traditional Cream Cheese Frosting | Raspberry Sauce Beer Draught Local | Regional COAST KOLSCH 8.00 FATTY’S LAZY HAZY IPA 8.00 FREEHOUSE GREENDOOR IPA (16oz) 10.00 ISLAND COASTAL LAGER 8.00 LINCOLN & SOUTH BEACH CITY PILSNER (16oz) 10.00 RIVER DOG “RIVERWALK EMPIRE” PILSNER 8.00 WESTBROOK WHITE THAI 8.00 WESTBROOK IPA 8.00 WESTBROOK 8.00 Domestic MICHELOB ULTRA 7.00 BUD LIGHT 7.00 Import SAPPORO - JAPAN - PALE LAGER 7.00 ESTRELLA JALISCO - MEXICO - PILSNER 7.00 HEINEKEN - HOLLAND - PALE LAGER 7.00 Non-Alcholic HEINEKEN 0.0 6.00 BLENHEIM'S SPICY GINGER ALE 5.00 GOSLING'S GINGER BEER 5.00 Wine Sparkling Franco Amoroso- Moscato D’asti Glass 11.00 Bottle 44.00 Piemonte, Italy Domaine Chandon- Brut Bottle 51.00 California Benvolio Prosecco Glass 13.00 Bottle 52.00 Veneto, Italy Biutiful- Garnacha Rose Glass 14.00 Bottle 60.00 Cava, Spain JCB #69 Brut Rose Bottle 65.00 Burgundy, France Moet & Chandon Rose Imperial - Extra Brut Rose Bottle 141.00 Epernay, France Perrier Jouet - Belle Epoch Bottle 285.00 Epernay, France Dom Perignon Bottle 395.00 Champagne, France Krug- Brut Rose Bottle 425.00 Reims, Champagne, France Armand De Brignac- Brut Bottle 470.00 Reims, Champagne, France Moet & Chandon Imperial- Brut Reserve Glass 18.00 375ml Bottle 45.00 Epernay, France Veuve Clicquot - Yellow Label Glass 24.00 375ml Bottle 60.00 Riems, France White - Sauvignon Blanc Domaine Jean Aubron Glass 12.00 Bottle 46.00 Loire Valley, France Lobster Reef Glass 13.00 Bottle 50.00 Marlborough, New Zealand Duckhorn Bottle 58.00 North Coast, CA Patient Cottat Bottle 65.00 Sancerre, Loire Valley, France Capture Bottle 71.00 Pine Mt. - Cloverdale Peak, California White - Chardonnay Elouan Bottle 48.00 Oregon Simi Bottle 52.00 Sonoma Coast, California Jackson Estate Bottle 54.00 Santa Maria Valley, Santa Barbara County, CA Kumeu Village Glass 14.00 Bottle 56.00 New Zealand Sonoma Cutrer Glass 15.00 Bottle 60.00 Russian River Valley, CA La Crema – “Saralee’s Vineyard” Bottle 63.00 Russian River Valley, California Ramey Bottle 76.00 a Russian River Valley, Sonom Far Niente Bottle 118.00 Napa Valley, CA Other Whites White Cuvee- Spindrift Bottle 39.00 Willamette Valley, Oregon Muscadet- Oysterman-2020 Bottle 44.00 Loire Valley, France Pinot Grigio - Maso Canali Glass 13.00 Bottle 52.00 Controllata, Trentino, Italy Pinot Gris -Benton Lane -2017 Bottle 51.00 Willamette Valley, Oregon Albarino- Pazo Das Bruxas -2020 Bottle 53.00 Rias Baixas, Spain Chenin Blanc - Dirty & Rowdy - 2017 Bottle 63.00 Mendocino, California Ice Wine Rosé Justin - 2020 42.00 Central Coast, CA Famille Perrin - 2020 Glass 12.00 Bottle 46.00 Cotes Du Rhone, France Tablas Creek 54.00 Paso Robles, California Miraval- 2016 Bottle 58.00 Cotes de Provence, France Red - Pinot Noir Sokol Blosser- Evolution Bottle 46.00 Willamette, Oregon Castle Rock Glass 14.00 Bottle 54.00 Willamette Valley, Oregon Jackson Estate Bottle 56.00 Anderson Valley, Mendocino County Macmurray Bottle 60.00 Russian River Valley Belle Glos- Las Alturas Glass 18.00 Bottle 70.00 Monterey County, California Hartford Court Bottle 73.00 Russian River Valley Flowers Bottle 91.00 Sonoma Coast Penner-Ash Bottle 109.00 Willamette Valley, Oregon Patz & Hall - Hyde Vineyard Bottle 117.00 Carneros, Napa Valley Red - Merlot Alexander Valley Vineyards Bottle 44.00 Sonoma County Freemark Abbey Bottle 68.00 Napa Valley, California Red - Malbec A.F. - Achaval Ferrer- 2017 Glass 12.00 Bottle 46.00 Mendoza, Argentina Achaval Ferrer- 2017 Bottle 59.00 Mendoza, Argentina Caymus - “Red Schooner Voyage 9” Bottle 64.00 Mendoza, Argentina Luna De Esperanza-2013 Bottle 79.00 Uco Valley, Mendoza, Argentina Luna De Esperanza-2013- Barrel Fermented Bottle 109.00 Uco Valley, Mendoza, Argentina Red - Zinfandel Turley - 2020 - Old Vines Bottle 89.00 California Wonderment- 2012- Burton Ranch Bottle 91.00 Lake County Ridge- 2019- Pagani Ranch Bottle 93.00 Sonoma Valley Red - Syrah | Shiraz | Petite Sirah Wonderment-2012- Petite Sirah Bottle 83.00 Russian River Valley Molly Dooker \"2 Left Feet\" - 2019 - Shiraz Bottle 88.00 McLaren Vale, Australia Famille Perrin- 2013- Les Sinards Bottle 89.00 Chateauneuf Du Pape Orin Swift - Machete-2016 Bottle 94.00 St Helena, Napa Enfield- 2012- Syrah Bottle 98.00 Haynes Vineyard, Napa Red - Cabernet Sauvignon Newton- 2016 Skyside Bottle 50.00 North Coast, California Tabali - 2019 Glass 13.00 Bottle 50.00 Maipo Valley, Chile Truth Be Told - 2019 Bottle 54.00 Columbia Valley Quilt - 2019 Glass 17.00 Bottle 68.00 Napa Valley, California Simi- 2017 - Landslide Bottle 72.00 Alexander Valley Stonestreet- 2017 Bottle 81.00 Alexander Valley Capture -2017- Pine Mountain-Cloverdale Peak Bottle 98.00 Napa-Sonoma Justin - 2018 - Isosceles Bottle 105.00 Paso Robles, CA Groth - 2018 Bottle 116.00 Oakville, Napa Chimney Rock- 2018- Stags Leap Bottle 128.00 Napa Valley Flanagan - 2015 Bottle 130.00 Sonoma County Cakebread - 2018 Bottle 135.00 Napa Valley Red - Blends and Other Reds Castel Di Salve- Negroamaro Bottle 40.00 Salento, Apulia Locations - Red Blend- “Ca” Glass 13.00 Bottle 58.00 California Chateau Yvonne- 2016- Cabernet Franc Bottle 64.00 Saumur Champigny, Loire Valley Diora “Three Crowns”- 2012- San Bernabe Bottle 67.00 Monterey Enfield- 2013-Tempranillo Bottle 77.00 Snake Ridge Ranch, Amador County Strada Al Sasso-2017-Chianti Classico -Tenuta Di Arceno Bottle 87.00 Tuscany, Italy The Prisoner - 2019 Bottle 95.00 California The Federalist “Dueling Pistols”- 2011 Bottle 89.00 Dry Creek Valley Numanthia- 2011- Tinto De Toro Bottle 104.00 Valdefinjas, Spain Allegrini Amarone Della Valpolicella - 2016 Bottle 115.00 Verona, Italy Harvey & Harriet - 2019 Bottle 110.00 San Luis Obispo County Orin Swift – Papillon -2016 Bottle 117.00 Napa Valley Trilogy – Flora Springs - 2016 Bottle 119.00 Napa Valley Marco Abella “Clos Abella”- 2009 Bottle 139.00 Priorat, Spain Ramey Annum- 2013 Bottle 142.00 Napa Valley Meet the Bar's Cocktail Mastermind Passionate and inventive, Cocktail Artisan Allen Lancaster serves up artful cocktails packed with seasonal southern flair. “With my culinary background, food is a key component that has directly influenced the creative side of the style of cocktails I've crafted at The Spectator Bar.” Live Music Every Third Thursday | 6:00 PM - 9:00 PM Handcrafted cocktails never tasted better than with a front row seat to Charleston's best live music! Bring your friends and nosh on a selection of shared plates while enjoying live musical performances by a rotating cast of talented local musicians. Indulge in half-price bottles from The Spectator's wine program. A Decade of Spirited Hospitality FOOD & WINE Global Tastemakers 15 Best Bars in the U.S. USA TODAY 10BEST Awards Top 10 Best Hotel Bar Frequently asked questions What makes The Bar at The Spectator Hotel unique in Charleston? The Bar is celebrated for its award-winning cocktails, crafted by expert mixologists in a stylish, intimate setting. It’s frequently recognized among Charleston’s best hotel bars. Do guests need a reservation to visit The Bar? No reservations are required—it’s first-come, first-served. Guests can also enjoy cocktail service from their butler in the comfort of their own room. Has The Bar at The Spectator Hotel been featured in travel magazines? Yes, our bar has been highlighted by major travel publications for its style and craftsmanship, further cementing its reputation as one of Charleston’s finest cocktail experiences. Does The Spectator Hotel have an on-site restaurant? The Spectator Hotel does not have an on-site restaurant. However, The Spectator Hotel does have a craft cocktail bar and lounge, The Bar at The Spectator, which serves light bar food bites, and a variety of beer, wine, and cocktails. It is open daily — Sunday through Thursday from 3 - PM and 3 - 11 PM on Fridays and Saturdays. Additionally, there are dozens of restaurants within walking distance for your enjoyment. What time does the bar open? The Bar is open daily at 3 PM to the public. Any time after 10 AM, we pour beer, wine, champagne or a basic mixed drink (excluding our signature cocktails) for in-house guests. Our signature cocktails are available during The Bar's regular operating hours. Does The Spectator Hotel offer in-room dining? The Spectator Hotel offers a limited in-room dining menu, served from and inspired by The Bar. Our butler staff will deliver to your guest room from 3 - 9 PM daily. Additionally, the butler team is able to pick up food from local restaurants within a two block radius of The Spectator Hotel and deliver it to your room should you wish to dine in. This will incur a 20% convenience fee. Can The Spectator Hotel's Butlers help with dining requests? Yes, The Spectator Hotel's private butlers are here to help coordinate any dining needs you may have — making reservations, ordering from local restaurants, picking up your meal, and other special requests. Just ask!",
      "hash": "02ad2b74fed9",
      "downloadedAt": "2026-01-18T16:54:55.582Z",
      "trimmedAt": "2026-01-18T17:13:01.721Z",
      "sizeReduction": "89.1%"
    },
    {
      "url": "https://thespectatorhotel.com/the-bar?utm_source=google&utm_medium=business_listing&utm_campaign=gmb#menu1051",
      "text": "Skip to content Our 1920's Inspired Speakeasy Bar The exuberance of the Jazz Age meets warm Southern charm in our Prohibition-style bar. Make yourself comfortable on a green leatherback stool, allow our cocktail artisan to conjure up a refreshment reminiscent of the 1920s, and indulge in a selection of sophisticated bar plates. The Bar also serves fine wine and a variety of local and regional craft brews. The Bar Hours of Operation Sunday - Thursday | 3:00 PM - 10:00 PM Friday + Saturday | 3:00 PM - 11:00 PM Bar Plates Served Daily | 3:00 PM - 9:00 PM A LEGACY WORTH CELEBRATING CHEERS TO 10 YEARS At The Bar, every sip offers more than just a drink — it’s a glimpse into our past. Join us in celebrating a decade of renowned service and unforgettable moments. Our new Legacy Menu offers a selection of the most beloved cocktails we’ve poured over the past 10 years, timeless favorites carefully curated to celebrate where we’ve been and where we’re going. Cocktails Bar Bites Beer Wine Cocktails Bar Bites Beer Wine Cocktails Craft Cocktails DRUGSTORE COWBOY 18.00 *New Southern Revival Abruzzi Rye | Cynar | *Southern Amaro | Bacon Salt BE ALL YOU CRAN BE 18.00 *Hat Trick Gin | Koval Liqueur | Cranberry | Thyme | Fresh Lemon | Sparkling Rose MELE KA-TIKI-MAKA 19.00 Ron Zacapa 23 | Velvet Falernum | Pierre Ferrand Dry Curacao | St Elizabeth Allspice Dram | Lime | Pineapple | Cranberry | Bittermens Elemakule Tiki Bitters PLUM LOCO 18.00 Mezcal Union | Ume Liqueur | Plum Puree | Fresh Lime | Sage THE DUDE IMBIBES 18.00 Chai- Vanilla Cathead Vodka | *Carolina Cream Liqueur | Almond Milk | King Bean Cold Brew - St George Coffee Liqueur Ice Cube HEARTH'S EMBRACE 18.00 Spectator Hotel Private Label Woodford Reserve | Disaronno | Fresh Lemon | Winter Spices | Egg White REPENT & REDEEM 20.00 Lalo Silver | Ancho Reyes Verde | Blood Orange | Lime | Chili Oil Foam (*** a $5 donation will be made to Lowcountry Food Bank for each sold) ENVY OF MANY 17.00 Tito’s | Green Apple Liqueur | Fresh Lime | Rosemary | Mint | Selter TULLY ME BANANA 19.00 Tullamore Dew 12yr | Tempus Fugit Banane | William Wolf Pecan Bourbon | Fee Brothers Black Walnut Bitters Classic Cocktails BOULEVARDIER 17.00 *Spectator Hotel Private Label Woodford Reserve Bourbon | Campari | Carpano Antica HANKY PANKY 17.00 Blue Coat Gin | Dolin Rouge Sweet Vermouth | Fernet Branca TRINIDAD SOUR 16.00 Angostura Bitters | Angostura Amaro | Bulleit Rye | Orgeat | Fresh Lemon Juice SIDECAR 17.00 Hennessy VS | Cointreau | Fresh Lemon Juice MANCINI 17.00 Elijah Craig Bourbon | Barolo Chinato | Tempus Fugit Crème de Cacao | Fee Brothers Orange Bitters BRANDY ALEXANDER 16.00 Torres 10yr Sherry Brandy | Trader Vic's Chocolate Liqueur | Cream REVOLVER 17.00 Larceny Bourbon | St George NOLA Coffee Liqueur | Orange Bitters EL DIABLO 18.00 Casa Noble Reposado | Giffard Crème de Cassis | Fresh Lime Juice | Ginger Beer BLOOD AND SAND 16.00 Glenmorangie X | Dolin Rouge Sweet Vermouth | Cherry Heering | Blood Orange YELLOW BIRD 16.00 Toppers White Rum | Galliano | Cointreau | Fresh Lime Juice Spirit Free Offerings CRIMSON & GOLD 12.00 Cranberry | Apple | Sage-Ginger Honey | Lemon | Seltzer FIGGY SMALLS 12.00 Fig | Balsamic | Rosemary | Lime | Ginger Beer FAUX G&T 12.00 Ritual Zero Proof Gin Alternative | Seagram’s Tonic SHE’S GLAMOROUS 9.00 N/A Grapefruit Paloma (canned mocktail) HEINEKEN 0.0 7.00 CEEBO HOPPED PILSNER 7.00 FRE CHARDONNAY 11.00 FRE CABERNET SAUVIGNON 11.00 Bar Bites CHARCUTERIE AND FROMAGE 21.00 Trio Fromage | Cured Meats | Honeycomb | House Pickled Accoutrements | Dijon | Jam (add Truffle Roasted Cashews $5) SLIDER TRIO 18.00 Turkey & Havarti | Ham & Swiss | Pimento Cheese & Pickled Green Tomato served with side of potato salad SEASONAL FLATBREAD 14.00 Warm Naan | Fig-Onion Spread | Goat Cheese Crumbles | Crispy Bacon | Fresh Basil | Balsamic Glaze Drizzle SPECK TATERS 14.00 Russet Potato | Speck Ham | Roasted Garlic Crème Fraiche MUSHROOM CROSTINI 15.00 Portobello Mushrooms with White Wine, Garlic, & Herbs | Smoked Gruyere | House-Made Baguette PRETZEL BITES 13.00 Salted Pretzel Bites | Smoked Gouda Beer Cheese Dip DEVILED EGG DUO (4pc) 7.00 Curry-Turmeric | Dill Pickle CHEDDAR-JALAPENO CORNBREAD BITES 7.00 Cinnamon-Honey Butter ROASTED & COZY each 5.00 Cashews | White Truffle Oil | Herbs de Provence Pecans | Smoked Olive Oil | Brown Sugar | Cayenne PARMESAN TRUFFLE POPCORN 6.00 WINTERTIME CANEPES 9.00 Whipped Gorgonzola | Baked Apple Slice | Crispy Sage | Walnut Dust | Hot Maple HOMEMADE CUPCAKE 8.00 Red Velvet Cupcake | French Vanilla Cream Cheese Filling | Traditional Cream Cheese Frosting | Raspberry Sauce Beer Draught Local | Regional COAST KOLSCH 8.00 FATTY’S LAZY HAZY IPA 8.00 FREEHOUSE GREENDOOR IPA (16oz) 10.00 ISLAND COASTAL LAGER 8.00 LINCOLN & SOUTH BEACH CITY PILSNER (16oz) 10.00 RIVER DOG “RIVERWALK EMPIRE” PILSNER 8.00 WESTBROOK WHITE THAI 8.00 WESTBROOK IPA 8.00 WESTBROOK 8.00 Domestic MICHELOB ULTRA 7.00 BUD LIGHT 7.00 Import SAPPORO - JAPAN - PALE LAGER 7.00 ESTRELLA JALISCO - MEXICO - PILSNER 7.00 HEINEKEN - HOLLAND - PALE LAGER 7.00 Non-Alcholic HEINEKEN 0.0 6.00 BLENHEIM'S SPICY GINGER ALE 5.00 GOSLING'S GINGER BEER 5.00 Wine Sparkling Franco Amoroso- Moscato D’asti Glass 11.00 Bottle 44.00 Piemonte, Italy Domaine Chandon- Brut Bottle 51.00 California Benvolio Prosecco Glass 13.00 Bottle 52.00 Veneto, Italy Biutiful- Garnacha Rose Glass 14.00 Bottle 60.00 Cava, Spain JCB #69 Brut Rose Bottle 65.00 Burgundy, France Moet & Chandon Rose Imperial - Extra Brut Rose Bottle 141.00 Epernay, France Perrier Jouet - Belle Epoch Bottle 285.00 Epernay, France Dom Perignon Bottle 395.00 Champagne, France Krug- Brut Rose Bottle 425.00 Reims, Champagne, France Armand De Brignac- Brut Bottle 470.00 Reims, Champagne, France Moet & Chandon Imperial- Brut Reserve Glass 18.00 375ml Bottle 45.00 Epernay, France Veuve Clicquot - Yellow Label Glass 24.00 375ml Bottle 60.00 Riems, France White - Sauvignon Blanc Domaine Jean Aubron Glass 12.00 Bottle 46.00 Loire Valley, France Lobster Reef Glass 13.00 Bottle 50.00 Marlborough, New Zealand Duckhorn Bottle 58.00 North Coast, CA Patient Cottat Bottle 65.00 Sancerre, Loire Valley, France Capture Bottle 71.00 Pine Mt. - Cloverdale Peak, California White - Chardonnay Elouan Bottle 48.00 Oregon Simi Bottle 52.00 Sonoma Coast, California Jackson Estate Bottle 54.00 Santa Maria Valley, Santa Barbara County, CA Kumeu Village Glass 14.00 Bottle 56.00 New Zealand Sonoma Cutrer Glass 15.00 Bottle 60.00 Russian River Valley, CA La Crema – “Saralee’s Vineyard” Bottle 63.00 Russian River Valley, California Ramey Bottle 76.00 a Russian River Valley, Sonom Far Niente Bottle 118.00 Napa Valley, CA Other Whites White Cuvee- Spindrift Bottle 39.00 Willamette Valley, Oregon Muscadet- Oysterman-2020 Bottle 44.00 Loire Valley, France Pinot Grigio - Maso Canali Glass 13.00 Bottle 52.00 Controllata, Trentino, Italy Pinot Gris -Benton Lane -2017 Bottle 51.00 Willamette Valley, Oregon Albarino- Pazo Das Bruxas -2020 Bottle 53.00 Rias Baixas, Spain Chenin Blanc - Dirty & Rowdy - 2017 Bottle 63.00 Mendocino, California Ice Wine Rosé Justin - 2020 42.00 Central Coast, CA Famille Perrin - 2020 Glass 12.00 Bottle 46.00 Cotes Du Rhone, France Tablas Creek 54.00 Paso Robles, California Miraval- 2016 Bottle 58.00 Cotes de Provence, France Red - Pinot Noir Sokol Blosser- Evolution Bottle 46.00 Willamette, Oregon Castle Rock Glass 14.00 Bottle 54.00 Willamette Valley, Oregon Jackson Estate Bottle 56.00 Anderson Valley, Mendocino County Macmurray Bottle 60.00 Russian River Valley Belle Glos- Las Alturas Glass 18.00 Bottle 70.00 Monterey County, California Hartford Court Bottle 73.00 Russian River Valley Flowers Bottle 91.00 Sonoma Coast Penner-Ash Bottle 109.00 Willamette Valley, Oregon Patz & Hall - Hyde Vineyard Bottle 117.00 Carneros, Napa Valley Red - Merlot Alexander Valley Vineyards Bottle 44.00 Sonoma County Freemark Abbey Bottle 68.00 Napa Valley, California Red - Malbec A.F. - Achaval Ferrer- 2017 Glass 12.00 Bottle 46.00 Mendoza, Argentina Achaval Ferrer- 2017 Bottle 59.00 Mendoza, Argentina Caymus - “Red Schooner Voyage 9” Bottle 64.00 Mendoza, Argentina Luna De Esperanza-2013 Bottle 79.00 Uco Valley, Mendoza, Argentina Luna De Esperanza-2013- Barrel Fermented Bottle 109.00 Uco Valley, Mendoza, Argentina Red - Zinfandel Turley - 2020 - Old Vines Bottle 89.00 California Wonderment- 2012- Burton Ranch Bottle 91.00 Lake County Ridge- 2019- Pagani Ranch Bottle 93.00 Sonoma Valley Red - Syrah | Shiraz | Petite Sirah Wonderment-2012- Petite Sirah Bottle 83.00 Russian River Valley Molly Dooker \"2 Left Feet\" - 2019 - Shiraz Bottle 88.00 McLaren Vale, Australia Famille Perrin- 2013- Les Sinards Bottle 89.00 Chateauneuf Du Pape Orin Swift - Machete-2016 Bottle 94.00 St Helena, Napa Enfield- 2012- Syrah Bottle 98.00 Haynes Vineyard, Napa Red - Cabernet Sauvignon Newton- 2016 Skyside Bottle 50.00 North Coast, California Tabali - 2019 Glass 13.00 Bottle 50.00 Maipo Valley, Chile Truth Be Told - 2019 Bottle 54.00 Columbia Valley Quilt - 2019 Glass 17.00 Bottle 68.00 Napa Valley, California Simi- 2017 - Landslide Bottle 72.00 Alexander Valley Stonestreet- 2017 Bottle 81.00 Alexander Valley Capture -2017- Pine Mountain-Cloverdale Peak Bottle 98.00 Napa-Sonoma Justin - 2018 - Isosceles Bottle 105.00 Paso Robles, CA Groth - 2018 Bottle 116.00 Oakville, Napa Chimney Rock- 2018- Stags Leap Bottle 128.00 Napa Valley Flanagan - 2015 Bottle 130.00 Sonoma County Cakebread - 2018 Bottle 135.00 Napa Valley Red - Blends and Other Reds Castel Di Salve- Negroamaro Bottle 40.00 Salento, Apulia Locations - Red Blend- “Ca” Glass 13.00 Bottle 58.00 California Chateau Yvonne- 2016- Cabernet Franc Bottle 64.00 Saumur Champigny, Loire Valley Diora “Three Crowns”- 2012- San Bernabe Bottle 67.00 Monterey Enfield- 2013-Tempranillo Bottle 77.00 Snake Ridge Ranch, Amador County Strada Al Sasso-2017-Chianti Classico -Tenuta Di Arceno Bottle 87.00 Tuscany, Italy The Prisoner - 2019 Bottle 95.00 California The Federalist “Dueling Pistols”- 2011 Bottle 89.00 Dry Creek Valley Numanthia- 2011- Tinto De Toro Bottle 104.00 Valdefinjas, Spain Allegrini Amarone Della Valpolicella - 2016 Bottle 115.00 Verona, Italy Harvey & Harriet - 2019 Bottle 110.00 San Luis Obispo County Orin Swift – Papillon -2016 Bottle 117.00 Napa Valley Trilogy – Flora Springs - 2016 Bottle 119.00 Napa Valley Marco Abella “Clos Abella”- 2009 Bottle 139.00 Priorat, Spain Ramey Annum- 2013 Bottle 142.00 Napa Valley Meet the Bar's Cocktail Mastermind Passionate and inventive, Cocktail Artisan Allen Lancaster serves up artful cocktails packed with seasonal southern flair. “With my culinary background, food is a key component that has directly influenced the creative side of the style of cocktails I've crafted at The Spectator Bar.” Live Music Every Third Thursday | 6:00 PM - 9:00 PM Handcrafted cocktails never tasted better than with a front row seat to Charleston's best live music! Bring your friends and nosh on a selection of shared plates while enjoying live musical performances by a rotating cast of talented local musicians. Indulge in half-price bottles from The Spectator's wine program. A Decade of Spirited Hospitality FOOD & WINE Global Tastemakers 15 Best Bars in the U.S. USA TODAY 10BEST Awards Top 10 Best Hotel Bar Frequently asked questions What makes The Bar at The Spectator Hotel unique in Charleston? The Bar is celebrated for its award-winning cocktails, crafted by expert mixologists in a stylish, intimate setting. It’s frequently recognized among Charleston’s best hotel bars. Do guests need a reservation to visit The Bar? No reservations are required—it’s first-come, first-served. Guests can also enjoy cocktail service from their butler in the comfort of their own room. Has The Bar at The Spectator Hotel been featured in travel magazines? Yes, our bar has been highlighted by major travel publications for its style and craftsmanship, further cementing its reputation as one of Charleston’s finest cocktail experiences. Does The Spectator Hotel have an on-site restaurant? The Spectator Hotel does not have an on-site restaurant. However, The Spectator Hotel does have a craft cocktail bar and lounge, The Bar at The Spectator, which serves light bar food bites, and a variety of beer, wine, and cocktails. It is open daily — Sunday through Thursday from 3 - PM and 3 - 11 PM on Fridays and Saturdays. Additionally, there are dozens of restaurants within walking distance for your enjoyment. What time does the bar open? The Bar is open daily at 3 PM to the public. Any time after 10 AM, we pour beer, wine, champagne or a basic mixed drink (excluding our signature cocktails) for in-house guests. Our signature cocktails are available during The Bar's regular operating hours. Does The Spectator Hotel offer in-room dining? The Spectator Hotel offers a limited in-room dining menu, served from and inspired by The Bar. Our butler staff will deliver to your guest room from 3 - 9 PM daily. Additionally, the butler team is able to pick up food from local restaurants within a two block radius of The Spectator Hotel and deliver it to your room should you wish to dine in. This will incur a 20% convenience fee. Can The Spectator Hotel's Butlers help with dining requests? Yes, The Spectator Hotel's private butlers are here to help coordinate any dining needs you may have — making reservations, ordering from local restaurants, picking up your meal, and other special requests. Just ask!",
      "hash": "68ddee64c83b",
      "downloadedAt": "2026-01-18T16:54:57.874Z",
      "trimmedAt": "2026-01-18T17:13:01.836Z",
      "sizeReduction": "89.1%"
    },
    {
      "url": "https://thespectatorhotel.com/the-bar?utm_source=google&utm_medium=business_listing&utm_campaign=gmb#menu1100",
      "text": "Skip to content Our 1920's Inspired Speakeasy Bar The exuberance of the Jazz Age meets warm Southern charm in our Prohibition-style bar. Make yourself comfortable on a green leatherback stool, allow our cocktail artisan to conjure up a refreshment reminiscent of the 1920s, and indulge in a selection of sophisticated bar plates. The Bar also serves fine wine and a variety of local and regional craft brews. The Bar Hours of Operation Sunday - Thursday | 3:00 PM - 10:00 PM Friday + Saturday | 3:00 PM - 11:00 PM Bar Plates Served Daily | 3:00 PM - 9:00 PM A LEGACY WORTH CELEBRATING CHEERS TO 10 YEARS At The Bar, every sip offers more than just a drink — it’s a glimpse into our past. Join us in celebrating a decade of renowned service and unforgettable moments. Our new Legacy Menu offers a selection of the most beloved cocktails we’ve poured over the past 10 years, timeless favorites carefully curated to celebrate where we’ve been and where we’re going. Cocktails Bar Bites Beer Wine Cocktails Bar Bites Beer Wine Cocktails Craft Cocktails DRUGSTORE COWBOY 18.00 *New Southern Revival Abruzzi Rye | Cynar | *Southern Amaro | Bacon Salt BE ALL YOU CRAN BE 18.00 *Hat Trick Gin | Koval Liqueur | Cranberry | Thyme | Fresh Lemon | Sparkling Rose MELE KA-TIKI-MAKA 19.00 Ron Zacapa 23 | Velvet Falernum | Pierre Ferrand Dry Curacao | St Elizabeth Allspice Dram | Lime | Pineapple | Cranberry | Bittermens Elemakule Tiki Bitters PLUM LOCO 18.00 Mezcal Union | Ume Liqueur | Plum Puree | Fresh Lime | Sage THE DUDE IMBIBES 18.00 Chai- Vanilla Cathead Vodka | *Carolina Cream Liqueur | Almond Milk | King Bean Cold Brew - St George Coffee Liqueur Ice Cube HEARTH'S EMBRACE 18.00 Spectator Hotel Private Label Woodford Reserve | Disaronno | Fresh Lemon | Winter Spices | Egg White REPENT & REDEEM 20.00 Lalo Silver | Ancho Reyes Verde | Blood Orange | Lime | Chili Oil Foam (*** a $5 donation will be made to Lowcountry Food Bank for each sold) ENVY OF MANY 17.00 Tito’s | Green Apple Liqueur | Fresh Lime | Rosemary | Mint | Selter TULLY ME BANANA 19.00 Tullamore Dew 12yr | Tempus Fugit Banane | William Wolf Pecan Bourbon | Fee Brothers Black Walnut Bitters Classic Cocktails BOULEVARDIER 17.00 *Spectator Hotel Private Label Woodford Reserve Bourbon | Campari | Carpano Antica HANKY PANKY 17.00 Blue Coat Gin | Dolin Rouge Sweet Vermouth | Fernet Branca TRINIDAD SOUR 16.00 Angostura Bitters | Angostura Amaro | Bulleit Rye | Orgeat | Fresh Lemon Juice SIDECAR 17.00 Hennessy VS | Cointreau | Fresh Lemon Juice MANCINI 17.00 Elijah Craig Bourbon | Barolo Chinato | Tempus Fugit Crème de Cacao | Fee Brothers Orange Bitters BRANDY ALEXANDER 16.00 Torres 10yr Sherry Brandy | Trader Vic's Chocolate Liqueur | Cream REVOLVER 17.00 Larceny Bourbon | St George NOLA Coffee Liqueur | Orange Bitters EL DIABLO 18.00 Casa Noble Reposado | Giffard Crème de Cassis | Fresh Lime Juice | Ginger Beer BLOOD AND SAND 16.00 Glenmorangie X | Dolin Rouge Sweet Vermouth | Cherry Heering | Blood Orange YELLOW BIRD 16.00 Toppers White Rum | Galliano | Cointreau | Fresh Lime Juice Spirit Free Offerings CRIMSON & GOLD 12.00 Cranberry | Apple | Sage-Ginger Honey | Lemon | Seltzer FIGGY SMALLS 12.00 Fig | Balsamic | Rosemary | Lime | Ginger Beer FAUX G&T 12.00 Ritual Zero Proof Gin Alternative | Seagram’s Tonic SHE’S GLAMOROUS 9.00 N/A Grapefruit Paloma (canned mocktail) HEINEKEN 0.0 7.00 CEEBO HOPPED PILSNER 7.00 FRE CHARDONNAY 11.00 FRE CABERNET SAUVIGNON 11.00 Bar Bites CHARCUTERIE AND FROMAGE 21.00 Trio Fromage | Cured Meats | Honeycomb | House Pickled Accoutrements | Dijon | Jam (add Truffle Roasted Cashews $5) SLIDER TRIO 18.00 Turkey & Havarti | Ham & Swiss | Pimento Cheese & Pickled Green Tomato served with side of potato salad SEASONAL FLATBREAD 14.00 Warm Naan | Fig-Onion Spread | Goat Cheese Crumbles | Crispy Bacon | Fresh Basil | Balsamic Glaze Drizzle SPECK TATERS 14.00 Russet Potato | Speck Ham | Roasted Garlic Crème Fraiche MUSHROOM CROSTINI 15.00 Portobello Mushrooms with White Wine, Garlic, & Herbs | Smoked Gruyere | House-Made Baguette PRETZEL BITES 13.00 Salted Pretzel Bites | Smoked Gouda Beer Cheese Dip DEVILED EGG DUO (4pc) 7.00 Curry-Turmeric | Dill Pickle CHEDDAR-JALAPENO CORNBREAD BITES 7.00 Cinnamon-Honey Butter ROASTED & COZY each 5.00 Cashews | White Truffle Oil | Herbs de Provence Pecans | Smoked Olive Oil | Brown Sugar | Cayenne PARMESAN TRUFFLE POPCORN 6.00 WINTERTIME CANEPES 9.00 Whipped Gorgonzola | Baked Apple Slice | Crispy Sage | Walnut Dust | Hot Maple HOMEMADE CUPCAKE 8.00 Red Velvet Cupcake | French Vanilla Cream Cheese Filling | Traditional Cream Cheese Frosting | Raspberry Sauce Beer Draught Local | Regional COAST KOLSCH 8.00 FATTY’S LAZY HAZY IPA 8.00 FREEHOUSE GREENDOOR IPA (16oz) 10.00 ISLAND COASTAL LAGER 8.00 LINCOLN & SOUTH BEACH CITY PILSNER (16oz) 10.00 RIVER DOG “RIVERWALK EMPIRE” PILSNER 8.00 WESTBROOK WHITE THAI 8.00 WESTBROOK IPA 8.00 WESTBROOK 8.00 Domestic MICHELOB ULTRA 7.00 BUD LIGHT 7.00 Import SAPPORO - JAPAN - PALE LAGER 7.00 ESTRELLA JALISCO - MEXICO - PILSNER 7.00 HEINEKEN - HOLLAND - PALE LAGER 7.00 Non-Alcholic HEINEKEN 0.0 6.00 BLENHEIM'S SPICY GINGER ALE 5.00 GOSLING'S GINGER BEER 5.00 Wine Sparkling Franco Amoroso- Moscato D’asti Glass 11.00 Bottle 44.00 Piemonte, Italy Domaine Chandon- Brut Bottle 51.00 California Benvolio Prosecco Glass 13.00 Bottle 52.00 Veneto, Italy Biutiful- Garnacha Rose Glass 14.00 Bottle 60.00 Cava, Spain JCB #69 Brut Rose Bottle 65.00 Burgundy, France Moet & Chandon Rose Imperial - Extra Brut Rose Bottle 141.00 Epernay, France Perrier Jouet - Belle Epoch Bottle 285.00 Epernay, France Dom Perignon Bottle 395.00 Champagne, France Krug- Brut Rose Bottle 425.00 Reims, Champagne, France Armand De Brignac- Brut Bottle 470.00 Reims, Champagne, France Moet & Chandon Imperial- Brut Reserve Glass 18.00 375ml Bottle 45.00 Epernay, France Veuve Clicquot - Yellow Label Glass 24.00 375ml Bottle 60.00 Riems, France White - Sauvignon Blanc Domaine Jean Aubron Glass 12.00 Bottle 46.00 Loire Valley, France Lobster Reef Glass 13.00 Bottle 50.00 Marlborough, New Zealand Duckhorn Bottle 58.00 North Coast, CA Patient Cottat Bottle 65.00 Sancerre, Loire Valley, France Capture Bottle 71.00 Pine Mt. - Cloverdale Peak, California White - Chardonnay Elouan Bottle 48.00 Oregon Simi Bottle 52.00 Sonoma Coast, California Jackson Estate Bottle 54.00 Santa Maria Valley, Santa Barbara County, CA Kumeu Village Glass 14.00 Bottle 56.00 New Zealand Sonoma Cutrer Glass 15.00 Bottle 60.00 Russian River Valley, CA La Crema – “Saralee’s Vineyard” Bottle 63.00 Russian River Valley, California Ramey Bottle 76.00 a Russian River Valley, Sonom Far Niente Bottle 118.00 Napa Valley, CA Other Whites White Cuvee- Spindrift Bottle 39.00 Willamette Valley, Oregon Muscadet- Oysterman-2020 Bottle 44.00 Loire Valley, France Pinot Grigio - Maso Canali Glass 13.00 Bottle 52.00 Controllata, Trentino, Italy Pinot Gris -Benton Lane -2017 Bottle 51.00 Willamette Valley, Oregon Albarino- Pazo Das Bruxas -2020 Bottle 53.00 Rias Baixas, Spain Chenin Blanc - Dirty & Rowdy - 2017 Bottle 63.00 Mendocino, California Ice Wine Rosé Justin - 2020 42.00 Central Coast, CA Famille Perrin - 2020 Glass 12.00 Bottle 46.00 Cotes Du Rhone, France Tablas Creek 54.00 Paso Robles, California Miraval- 2016 Bottle 58.00 Cotes de Provence, France Red - Pinot Noir Sokol Blosser- Evolution Bottle 46.00 Willamette, Oregon Castle Rock Glass 14.00 Bottle 54.00 Willamette Valley, Oregon Jackson Estate Bottle 56.00 Anderson Valley, Mendocino County Macmurray Bottle 60.00 Russian River Valley Belle Glos- Las Alturas Glass 18.00 Bottle 70.00 Monterey County, California Hartford Court Bottle 73.00 Russian River Valley Flowers Bottle 91.00 Sonoma Coast Penner-Ash Bottle 109.00 Willamette Valley, Oregon Patz & Hall - Hyde Vineyard Bottle 117.00 Carneros, Napa Valley Red - Merlot Alexander Valley Vineyards Bottle 44.00 Sonoma County Freemark Abbey Bottle 68.00 Napa Valley, California Red - Malbec A.F. - Achaval Ferrer- 2017 Glass 12.00 Bottle 46.00 Mendoza, Argentina Achaval Ferrer- 2017 Bottle 59.00 Mendoza, Argentina Caymus - “Red Schooner Voyage 9” Bottle 64.00 Mendoza, Argentina Luna De Esperanza-2013 Bottle 79.00 Uco Valley, Mendoza, Argentina Luna De Esperanza-2013- Barrel Fermented Bottle 109.00 Uco Valley, Mendoza, Argentina Red - Zinfandel Turley - 2020 - Old Vines Bottle 89.00 California Wonderment- 2012- Burton Ranch Bottle 91.00 Lake County Ridge- 2019- Pagani Ranch Bottle 93.00 Sonoma Valley Red - Syrah | Shiraz | Petite Sirah Wonderment-2012- Petite Sirah Bottle 83.00 Russian River Valley Molly Dooker \"2 Left Feet\" - 2019 - Shiraz Bottle 88.00 McLaren Vale, Australia Famille Perrin- 2013- Les Sinards Bottle 89.00 Chateauneuf Du Pape Orin Swift - Machete-2016 Bottle 94.00 St Helena, Napa Enfield- 2012- Syrah Bottle 98.00 Haynes Vineyard, Napa Red - Cabernet Sauvignon Newton- 2016 Skyside Bottle 50.00 North Coast, California Tabali - 2019 Glass 13.00 Bottle 50.00 Maipo Valley, Chile Truth Be Told - 2019 Bottle 54.00 Columbia Valley Quilt - 2019 Glass 17.00 Bottle 68.00 Napa Valley, California Simi- 2017 - Landslide Bottle 72.00 Alexander Valley Stonestreet- 2017 Bottle 81.00 Alexander Valley Capture -2017- Pine Mountain-Cloverdale Peak Bottle 98.00 Napa-Sonoma Justin - 2018 - Isosceles Bottle 105.00 Paso Robles, CA Groth - 2018 Bottle 116.00 Oakville, Napa Chimney Rock- 2018- Stags Leap Bottle 128.00 Napa Valley Flanagan - 2015 Bottle 130.00 Sonoma County Cakebread - 2018 Bottle 135.00 Napa Valley Red - Blends and Other Reds Castel Di Salve- Negroamaro Bottle 40.00 Salento, Apulia Locations - Red Blend- “Ca” Glass 13.00 Bottle 58.00 California Chateau Yvonne- 2016- Cabernet Franc Bottle 64.00 Saumur Champigny, Loire Valley Diora “Three Crowns”- 2012- San Bernabe Bottle 67.00 Monterey Enfield- 2013-Tempranillo Bottle 77.00 Snake Ridge Ranch, Amador County Strada Al Sasso-2017-Chianti Classico -Tenuta Di Arceno Bottle 87.00 Tuscany, Italy The Prisoner - 2019 Bottle 95.00 California The Federalist “Dueling Pistols”- 2011 Bottle 89.00 Dry Creek Valley Numanthia- 2011- Tinto De Toro Bottle 104.00 Valdefinjas, Spain Allegrini Amarone Della Valpolicella - 2016 Bottle 115.00 Verona, Italy Harvey & Harriet - 2019 Bottle 110.00 San Luis Obispo County Orin Swift – Papillon -2016 Bottle 117.00 Napa Valley Trilogy – Flora Springs - 2016 Bottle 119.00 Napa Valley Marco Abella “Clos Abella”- 2009 Bottle 139.00 Priorat, Spain Ramey Annum- 2013 Bottle 142.00 Napa Valley Meet the Bar's Cocktail Mastermind Passionate and inventive, Cocktail Artisan Allen Lancaster serves up artful cocktails packed with seasonal southern flair. “With my culinary background, food is a key component that has directly influenced the creative side of the style of cocktails I've crafted at The Spectator Bar.” Live Music Every Third Thursday | 6:00 PM - 9:00 PM Handcrafted cocktails never tasted better than with a front row seat to Charleston's best live music! Bring your friends and nosh on a selection of shared plates while enjoying live musical performances by a rotating cast of talented local musicians. Indulge in half-price bottles from The Spectator's wine program. A Decade of Spirited Hospitality FOOD & WINE Global Tastemakers 15 Best Bars in the U.S. USA TODAY 10BEST Awards Top 10 Best Hotel Bar Frequently asked questions What makes The Bar at The Spectator Hotel unique in Charleston? The Bar is celebrated for its award-winning cocktails, crafted by expert mixologists in a stylish, intimate setting. It’s frequently recognized among Charleston’s best hotel bars. Do guests need a reservation to visit The Bar? No reservations are required—it’s first-come, first-served. Guests can also enjoy cocktail service from their butler in the comfort of their own room. Has The Bar at The Spectator Hotel been featured in travel magazines? Yes, our bar has been highlighted by major travel publications for its style and craftsmanship, further cementing its reputation as one of Charleston’s finest cocktail experiences. Does The Spectator Hotel have an on-site restaurant? The Spectator Hotel does not have an on-site restaurant. However, The Spectator Hotel does have a craft cocktail bar and lounge, The Bar at The Spectator, which serves light bar food bites, and a variety of beer, wine, and cocktails. It is open daily — Sunday through Thursday from 3 - PM and 3 - 11 PM on Fridays and Saturdays. Additionally, there are dozens of restaurants within walking distance for your enjoyment. What time does the bar open? The Bar is open daily at 3 PM to the public. Any time after 10 AM, we pour beer, wine, champagne or a basic mixed drink (excluding our signature cocktails) for in-house guests. Our signature cocktails are available during The Bar's regular operating hours. Does The Spectator Hotel offer in-room dining? The Spectator Hotel offers a limited in-room dining menu, served from and inspired by The Bar. Our butler staff will deliver to your guest room from 3 - 9 PM daily. Additionally, the butler team is able to pick up food from local restaurants within a two block radius of The Spectator Hotel and deliver it to your room should you wish to dine in. This will incur a 20% convenience fee. Can The Spectator Hotel's Butlers help with dining requests? Yes, The Spectator Hotel's private butlers are here to help coordinate any dining needs you may have — making reservations, ordering from local restaurants, picking up your meal, and other special requests. Just ask!",
      "hash": "80f8a90eeb2e",
      "downloadedAt": "2026-01-18T16:54:56.356Z",
      "trimmedAt": "2026-01-18T17:13:01.927Z",
      "sizeReduction": "89.1%"
    },
    {
      "url": "https://thespectatorhotel.com/the-bar?utm_source=google&utm_medium=business_listing&utm_campaign=gmb#menu1050",
      "text": "Skip to content Our 1920's Inspired Speakeasy Bar The exuberance of the Jazz Age meets warm Southern charm in our Prohibition-style bar. Make yourself comfortable on a green leatherback stool, allow our cocktail artisan to conjure up a refreshment reminiscent of the 1920s, and indulge in a selection of sophisticated bar plates. The Bar also serves fine wine and a variety of local and regional craft brews. The Bar Hours of Operation Sunday - Thursday | 3:00 PM - 10:00 PM Friday + Saturday | 3:00 PM - 11:00 PM Bar Plates Served Daily | 3:00 PM - 9:00 PM A LEGACY WORTH CELEBRATING CHEERS TO 10 YEARS At The Bar, every sip offers more than just a drink — it’s a glimpse into our past. Join us in celebrating a decade of renowned service and unforgettable moments. Our new Legacy Menu offers a selection of the most beloved cocktails we’ve poured over the past 10 years, timeless favorites carefully curated to celebrate where we’ve been and where we’re going. Cocktails Bar Bites Beer Wine Cocktails Bar Bites Beer Wine Cocktails Craft Cocktails DRUGSTORE COWBOY 18.00 *New Southern Revival Abruzzi Rye | Cynar | *Southern Amaro | Bacon Salt BE ALL YOU CRAN BE 18.00 *Hat Trick Gin | Koval Liqueur | Cranberry | Thyme | Fresh Lemon | Sparkling Rose MELE KA-TIKI-MAKA 19.00 Ron Zacapa 23 | Velvet Falernum | Pierre Ferrand Dry Curacao | St Elizabeth Allspice Dram | Lime | Pineapple | Cranberry | Bittermens Elemakule Tiki Bitters PLUM LOCO 18.00 Mezcal Union | Ume Liqueur | Plum Puree | Fresh Lime | Sage THE DUDE IMBIBES 18.00 Chai- Vanilla Cathead Vodka | *Carolina Cream Liqueur | Almond Milk | King Bean Cold Brew - St George Coffee Liqueur Ice Cube HEARTH'S EMBRACE 18.00 Spectator Hotel Private Label Woodford Reserve | Disaronno | Fresh Lemon | Winter Spices | Egg White REPENT & REDEEM 20.00 Lalo Silver | Ancho Reyes Verde | Blood Orange | Lime | Chili Oil Foam (*** a $5 donation will be made to Lowcountry Food Bank for each sold) ENVY OF MANY 17.00 Tito’s | Green Apple Liqueur | Fresh Lime | Rosemary | Mint | Selter TULLY ME BANANA 19.00 Tullamore Dew 12yr | Tempus Fugit Banane | William Wolf Pecan Bourbon | Fee Brothers Black Walnut Bitters Classic Cocktails BOULEVARDIER 17.00 *Spectator Hotel Private Label Woodford Reserve Bourbon | Campari | Carpano Antica HANKY PANKY 17.00 Blue Coat Gin | Dolin Rouge Sweet Vermouth | Fernet Branca TRINIDAD SOUR 16.00 Angostura Bitters | Angostura Amaro | Bulleit Rye | Orgeat | Fresh Lemon Juice SIDECAR 17.00 Hennessy VS | Cointreau | Fresh Lemon Juice MANCINI 17.00 Elijah Craig Bourbon | Barolo Chinato | Tempus Fugit Crème de Cacao | Fee Brothers Orange Bitters BRANDY ALEXANDER 16.00 Torres 10yr Sherry Brandy | Trader Vic's Chocolate Liqueur | Cream REVOLVER 17.00 Larceny Bourbon | St George NOLA Coffee Liqueur | Orange Bitters EL DIABLO 18.00 Casa Noble Reposado | Giffard Crème de Cassis | Fresh Lime Juice | Ginger Beer BLOOD AND SAND 16.00 Glenmorangie X | Dolin Rouge Sweet Vermouth | Cherry Heering | Blood Orange YELLOW BIRD 16.00 Toppers White Rum | Galliano | Cointreau | Fresh Lime Juice Spirit Free Offerings CRIMSON & GOLD 12.00 Cranberry | Apple | Sage-Ginger Honey | Lemon | Seltzer FIGGY SMALLS 12.00 Fig | Balsamic | Rosemary | Lime | Ginger Beer FAUX G&T 12.00 Ritual Zero Proof Gin Alternative | Seagram’s Tonic SHE’S GLAMOROUS 9.00 N/A Grapefruit Paloma (canned mocktail) HEINEKEN 0.0 7.00 CEEBO HOPPED PILSNER 7.00 FRE CHARDONNAY 11.00 FRE CABERNET SAUVIGNON 11.00 Bar Bites CHARCUTERIE AND FROMAGE 21.00 Trio Fromage | Cured Meats | Honeycomb | House Pickled Accoutrements | Dijon | Jam (add Truffle Roasted Cashews $5) SLIDER TRIO 18.00 Turkey & Havarti | Ham & Swiss | Pimento Cheese & Pickled Green Tomato served with side of potato salad SEASONAL FLATBREAD 14.00 Warm Naan | Fig-Onion Spread | Goat Cheese Crumbles | Crispy Bacon | Fresh Basil | Balsamic Glaze Drizzle SPECK TATERS 14.00 Russet Potato | Speck Ham | Roasted Garlic Crème Fraiche MUSHROOM CROSTINI 15.00 Portobello Mushrooms with White Wine, Garlic, & Herbs | Smoked Gruyere | House-Made Baguette PRETZEL BITES 13.00 Salted Pretzel Bites | Smoked Gouda Beer Cheese Dip DEVILED EGG DUO (4pc) 7.00 Curry-Turmeric | Dill Pickle CHEDDAR-JALAPENO CORNBREAD BITES 7.00 Cinnamon-Honey Butter ROASTED & COZY each 5.00 Cashews | White Truffle Oil | Herbs de Provence Pecans | Smoked Olive Oil | Brown Sugar | Cayenne PARMESAN TRUFFLE POPCORN 6.00 WINTERTIME CANEPES 9.00 Whipped Gorgonzola | Baked Apple Slice | Crispy Sage | Walnut Dust | Hot Maple HOMEMADE CUPCAKE 8.00 Red Velvet Cupcake | French Vanilla Cream Cheese Filling | Traditional Cream Cheese Frosting | Raspberry Sauce Beer Draught Local | Regional COAST KOLSCH 8.00 FATTY’S LAZY HAZY IPA 8.00 FREEHOUSE GREENDOOR IPA (16oz) 10.00 ISLAND COASTAL LAGER 8.00 LINCOLN & SOUTH BEACH CITY PILSNER (16oz) 10.00 RIVER DOG “RIVERWALK EMPIRE” PILSNER 8.00 WESTBROOK WHITE THAI 8.00 WESTBROOK IPA 8.00 WESTBROOK 8.00 Domestic MICHELOB ULTRA 7.00 BUD LIGHT 7.00 Import SAPPORO - JAPAN - PALE LAGER 7.00 ESTRELLA JALISCO - MEXICO - PILSNER 7.00 HEINEKEN - HOLLAND - PALE LAGER 7.00 Non-Alcholic HEINEKEN 0.0 6.00 BLENHEIM'S SPICY GINGER ALE 5.00 GOSLING'S GINGER BEER 5.00 Wine Sparkling Franco Amoroso- Moscato D’asti Glass 11.00 Bottle 44.00 Piemonte, Italy Domaine Chandon- Brut Bottle 51.00 California Benvolio Prosecco Glass 13.00 Bottle 52.00 Veneto, Italy Biutiful- Garnacha Rose Glass 14.00 Bottle 60.00 Cava, Spain JCB #69 Brut Rose Bottle 65.00 Burgundy, France Moet & Chandon Rose Imperial - Extra Brut Rose Bottle 141.00 Epernay, France Perrier Jouet - Belle Epoch Bottle 285.00 Epernay, France Dom Perignon Bottle 395.00 Champagne, France Krug- Brut Rose Bottle 425.00 Reims, Champagne, France Armand De Brignac- Brut Bottle 470.00 Reims, Champagne, France Moet & Chandon Imperial- Brut Reserve Glass 18.00 375ml Bottle 45.00 Epernay, France Veuve Clicquot - Yellow Label Glass 24.00 375ml Bottle 60.00 Riems, France White - Sauvignon Blanc Domaine Jean Aubron Glass 12.00 Bottle 46.00 Loire Valley, France Lobster Reef Glass 13.00 Bottle 50.00 Marlborough, New Zealand Duckhorn Bottle 58.00 North Coast, CA Patient Cottat Bottle 65.00 Sancerre, Loire Valley, France Capture Bottle 71.00 Pine Mt. - Cloverdale Peak, California White - Chardonnay Elouan Bottle 48.00 Oregon Simi Bottle 52.00 Sonoma Coast, California Jackson Estate Bottle 54.00 Santa Maria Valley, Santa Barbara County, CA Kumeu Village Glass 14.00 Bottle 56.00 New Zealand Sonoma Cutrer Glass 15.00 Bottle 60.00 Russian River Valley, CA La Crema – “Saralee’s Vineyard” Bottle 63.00 Russian River Valley, California Ramey Bottle 76.00 a Russian River Valley, Sonom Far Niente Bottle 118.00 Napa Valley, CA Other Whites White Cuvee- Spindrift Bottle 39.00 Willamette Valley, Oregon Muscadet- Oysterman-2020 Bottle 44.00 Loire Valley, France Pinot Grigio - Maso Canali Glass 13.00 Bottle 52.00 Controllata, Trentino, Italy Pinot Gris -Benton Lane -2017 Bottle 51.00 Willamette Valley, Oregon Albarino- Pazo Das Bruxas -2020 Bottle 53.00 Rias Baixas, Spain Chenin Blanc - Dirty & Rowdy - 2017 Bottle 63.00 Mendocino, California Ice Wine Rosé Justin - 2020 42.00 Central Coast, CA Famille Perrin - 2020 Glass 12.00 Bottle 46.00 Cotes Du Rhone, France Tablas Creek 54.00 Paso Robles, California Miraval- 2016 Bottle 58.00 Cotes de Provence, France Red - Pinot Noir Sokol Blosser- Evolution Bottle 46.00 Willamette, Oregon Castle Rock Glass 14.00 Bottle 54.00 Willamette Valley, Oregon Jackson Estate Bottle 56.00 Anderson Valley, Mendocino County Macmurray Bottle 60.00 Russian River Valley Belle Glos- Las Alturas Glass 18.00 Bottle 70.00 Monterey County, California Hartford Court Bottle 73.00 Russian River Valley Flowers Bottle 91.00 Sonoma Coast Penner-Ash Bottle 109.00 Willamette Valley, Oregon Patz & Hall - Hyde Vineyard Bottle 117.00 Carneros, Napa Valley Red - Merlot Alexander Valley Vineyards Bottle 44.00 Sonoma County Freemark Abbey Bottle 68.00 Napa Valley, California Red - Malbec A.F. - Achaval Ferrer- 2017 Glass 12.00 Bottle 46.00 Mendoza, Argentina Achaval Ferrer- 2017 Bottle 59.00 Mendoza, Argentina Caymus - “Red Schooner Voyage 9” Bottle 64.00 Mendoza, Argentina Luna De Esperanza-2013 Bottle 79.00 Uco Valley, Mendoza, Argentina Luna De Esperanza-2013- Barrel Fermented Bottle 109.00 Uco Valley, Mendoza, Argentina Red - Zinfandel Turley - 2020 - Old Vines Bottle 89.00 California Wonderment- 2012- Burton Ranch Bottle 91.00 Lake County Ridge- 2019- Pagani Ranch Bottle 93.00 Sonoma Valley Red - Syrah | Shiraz | Petite Sirah Wonderment-2012- Petite Sirah Bottle 83.00 Russian River Valley Molly Dooker \"2 Left Feet\" - 2019 - Shiraz Bottle 88.00 McLaren Vale, Australia Famille Perrin- 2013- Les Sinards Bottle 89.00 Chateauneuf Du Pape Orin Swift - Machete-2016 Bottle 94.00 St Helena, Napa Enfield- 2012- Syrah Bottle 98.00 Haynes Vineyard, Napa Red - Cabernet Sauvignon Newton- 2016 Skyside Bottle 50.00 North Coast, California Tabali - 2019 Glass 13.00 Bottle 50.00 Maipo Valley, Chile Truth Be Told - 2019 Bottle 54.00 Columbia Valley Quilt - 2019 Glass 17.00 Bottle 68.00 Napa Valley, California Simi- 2017 - Landslide Bottle 72.00 Alexander Valley Stonestreet- 2017 Bottle 81.00 Alexander Valley Capture -2017- Pine Mountain-Cloverdale Peak Bottle 98.00 Napa-Sonoma Justin - 2018 - Isosceles Bottle 105.00 Paso Robles, CA Groth - 2018 Bottle 116.00 Oakville, Napa Chimney Rock- 2018- Stags Leap Bottle 128.00 Napa Valley Flanagan - 2015 Bottle 130.00 Sonoma County Cakebread - 2018 Bottle 135.00 Napa Valley Red - Blends and Other Reds Castel Di Salve- Negroamaro Bottle 40.00 Salento, Apulia Locations - Red Blend- “Ca” Glass 13.00 Bottle 58.00 California Chateau Yvonne- 2016- Cabernet Franc Bottle 64.00 Saumur Champigny, Loire Valley Diora “Three Crowns”- 2012- San Bernabe Bottle 67.00 Monterey Enfield- 2013-Tempranillo Bottle 77.00 Snake Ridge Ranch, Amador County Strada Al Sasso-2017-Chianti Classico -Tenuta Di Arceno Bottle 87.00 Tuscany, Italy The Prisoner - 2019 Bottle 95.00 California The Federalist “Dueling Pistols”- 2011 Bottle 89.00 Dry Creek Valley Numanthia- 2011- Tinto De Toro Bottle 104.00 Valdefinjas, Spain Allegrini Amarone Della Valpolicella - 2016 Bottle 115.00 Verona, Italy Harvey & Harriet - 2019 Bottle 110.00 San Luis Obispo County Orin Swift – Papillon -2016 Bottle 117.00 Napa Valley Trilogy – Flora Springs - 2016 Bottle 119.00 Napa Valley Marco Abella “Clos Abella”- 2009 Bottle 139.00 Priorat, Spain Ramey Annum- 2013 Bottle 142.00 Napa Valley Meet the Bar's Cocktail Mastermind Passionate and inventive, Cocktail Artisan Allen Lancaster serves up artful cocktails packed with seasonal southern flair. “With my culinary background, food is a key component that has directly influenced the creative side of the style of cocktails I've crafted at The Spectator Bar.” Live Music Every Third Thursday | 6:00 PM - 9:00 PM Handcrafted cocktails never tasted better than with a front row seat to Charleston's best live music! Bring your friends and nosh on a selection of shared plates while enjoying live musical performances by a rotating cast of talented local musicians. Indulge in half-price bottles from The Spectator's wine program. A Decade of Spirited Hospitality FOOD & WINE Global Tastemakers 15 Best Bars in the U.S. USA TODAY 10BEST Awards Top 10 Best Hotel Bar Frequently asked questions What makes The Bar at The Spectator Hotel unique in Charleston? The Bar is celebrated for its award-winning cocktails, crafted by expert mixologists in a stylish, intimate setting. It’s frequently recognized among Charleston’s best hotel bars. Do guests need a reservation to visit The Bar? No reservations are required—it’s first-come, first-served. Guests can also enjoy cocktail service from their butler in the comfort of their own room. Has The Bar at The Spectator Hotel been featured in travel magazines? Yes, our bar has been highlighted by major travel publications for its style and craftsmanship, further cementing its reputation as one of Charleston’s finest cocktail experiences. Does The Spectator Hotel have an on-site restaurant? The Spectator Hotel does not have an on-site restaurant. However, The Spectator Hotel does have a craft cocktail bar and lounge, The Bar at The Spectator, which serves light bar food bites, and a variety of beer, wine, and cocktails. It is open daily — Sunday through Thursday from 3 - PM and 3 - 11 PM on Fridays and Saturdays. Additionally, there are dozens of restaurants within walking distance for your enjoyment. What time does the bar open? The Bar is open daily at 3 PM to the public. Any time after 10 AM, we pour beer, wine, champagne or a basic mixed drink (excluding our signature cocktails) for in-house guests. Our signature cocktails are available during The Bar's regular operating hours. Does The Spectator Hotel offer in-room dining? The Spectator Hotel offers a limited in-room dining menu, served from and inspired by The Bar. Our butler staff will deliver to your guest room from 3 - 9 PM daily. Additionally, the butler team is able to pick up food from local restaurants within a two block radius of The Spectator Hotel and deliver it to your room should you wish to dine in. This will incur a 20% convenience fee. Can The Spectator Hotel's Butlers help with dining requests? Yes, The Spectator Hotel's private butlers are here to help coordinate any dining needs you may have — making reservations, ordering from local restaurants, picking up your meal, and other special requests. Just ask!",
      "hash": "86c74110ef01",
      "downloadedAt": "2026-01-18T16:54:57.106Z",
      "trimmedAt": "2026-01-18T17:13:02.010Z",
      "sizeReduction": "89.1%"
    },
    {
      "url": "https://thespectatorhotel.com/the-bar?utm_source=google&utm_medium=business_listing&utm_campaign=gmb",
      "text": "Skip to content Our 1920's Inspired Speakeasy Bar The exuberance of the Jazz Age meets warm Southern charm in our Prohibition-style bar. Make yourself comfortable on a green leatherback stool, allow our cocktail artisan to conjure up a refreshment reminiscent of the 1920s, and indulge in a selection of sophisticated bar plates. The Bar also serves fine wine and a variety of local and regional craft brews. The Bar Hours of Operation Sunday - Thursday | 3:00 PM - 10:00 PM Friday + Saturday | 3:00 PM - 11:00 PM Bar Plates Served Daily | 3:00 PM - 9:00 PM A LEGACY WORTH CELEBRATING CHEERS TO 10 YEARS At The Bar, every sip offers more than just a drink — it’s a glimpse into our past. Join us in celebrating a decade of renowned service and unforgettable moments. Our new Legacy Menu offers a selection of the most beloved cocktails we’ve poured over the past 10 years, timeless favorites carefully curated to celebrate where we’ve been and where we’re going. Cocktails Bar Bites Beer Wine Cocktails Bar Bites Beer Wine Cocktails Craft Cocktails DRUGSTORE COWBOY 18.00 *New Southern Revival Abruzzi Rye | Cynar | *Southern Amaro | Bacon Salt BE ALL YOU CRAN BE 18.00 *Hat Trick Gin | Koval Liqueur | Cranberry | Thyme | Fresh Lemon | Sparkling Rose MELE KA-TIKI-MAKA 19.00 Ron Zacapa 23 | Velvet Falernum | Pierre Ferrand Dry Curacao | St Elizabeth Allspice Dram | Lime | Pineapple | Cranberry | Bittermens Elemakule Tiki Bitters PLUM LOCO 18.00 Mezcal Union | Ume Liqueur | Plum Puree | Fresh Lime | Sage THE DUDE IMBIBES 18.00 Chai- Vanilla Cathead Vodka | *Carolina Cream Liqueur | Almond Milk | King Bean Cold Brew - St George Coffee Liqueur Ice Cube HEARTH'S EMBRACE 18.00 Spectator Hotel Private Label Woodford Reserve | Disaronno | Fresh Lemon | Winter Spices | Egg White REPENT & REDEEM 20.00 Lalo Silver | Ancho Reyes Verde | Blood Orange | Lime | Chili Oil Foam (*** a $5 donation will be made to Lowcountry Food Bank for each sold) ENVY OF MANY 17.00 Tito’s | Green Apple Liqueur | Fresh Lime | Rosemary | Mint | Selter TULLY ME BANANA 19.00 Tullamore Dew 12yr | Tempus Fugit Banane | William Wolf Pecan Bourbon | Fee Brothers Black Walnut Bitters Classic Cocktails BOULEVARDIER 17.00 *Spectator Hotel Private Label Woodford Reserve Bourbon | Campari | Carpano Antica HANKY PANKY 17.00 Blue Coat Gin | Dolin Rouge Sweet Vermouth | Fernet Branca TRINIDAD SOUR 16.00 Angostura Bitters | Angostura Amaro | Bulleit Rye | Orgeat | Fresh Lemon Juice SIDECAR 17.00 Hennessy VS | Cointreau | Fresh Lemon Juice MANCINI 17.00 Elijah Craig Bourbon | Barolo Chinato | Tempus Fugit Crème de Cacao | Fee Brothers Orange Bitters BRANDY ALEXANDER 16.00 Torres 10yr Sherry Brandy | Trader Vic's Chocolate Liqueur | Cream REVOLVER 17.00 Larceny Bourbon | St George NOLA Coffee Liqueur | Orange Bitters EL DIABLO 18.00 Casa Noble Reposado | Giffard Crème de Cassis | Fresh Lime Juice | Ginger Beer BLOOD AND SAND 16.00 Glenmorangie X | Dolin Rouge Sweet Vermouth | Cherry Heering | Blood Orange YELLOW BIRD 16.00 Toppers White Rum | Galliano | Cointreau | Fresh Lime Juice Spirit Free Offerings CRIMSON & GOLD 12.00 Cranberry | Apple | Sage-Ginger Honey | Lemon | Seltzer FIGGY SMALLS 12.00 Fig | Balsamic | Rosemary | Lime | Ginger Beer FAUX G&T 12.00 Ritual Zero Proof Gin Alternative | Seagram’s Tonic SHE’S GLAMOROUS 9.00 N/A Grapefruit Paloma (canned mocktail) HEINEKEN 0.0 7.00 CEEBO HOPPED PILSNER 7.00 FRE CHARDONNAY 11.00 FRE CABERNET SAUVIGNON 11.00 Bar Bites CHARCUTERIE AND FROMAGE 21.00 Trio Fromage | Cured Meats | Honeycomb | House Pickled Accoutrements | Dijon | Jam (add Truffle Roasted Cashews $5) SLIDER TRIO 18.00 Turkey & Havarti | Ham & Swiss | Pimento Cheese & Pickled Green Tomato served with side of potato salad SEASONAL FLATBREAD 14.00 Warm Naan | Fig-Onion Spread | Goat Cheese Crumbles | Crispy Bacon | Fresh Basil | Balsamic Glaze Drizzle SPECK TATERS 14.00 Russet Potato | Speck Ham | Roasted Garlic Crème Fraiche MUSHROOM CROSTINI 15.00 Portobello Mushrooms with White Wine, Garlic, & Herbs | Smoked Gruyere | House-Made Baguette PRETZEL BITES 13.00 Salted Pretzel Bites | Smoked Gouda Beer Cheese Dip DEVILED EGG DUO (4pc) 7.00 Curry-Turmeric | Dill Pickle CHEDDAR-JALAPENO CORNBREAD BITES 7.00 Cinnamon-Honey Butter ROASTED & COZY each 5.00 Cashews | White Truffle Oil | Herbs de Provence Pecans | Smoked Olive Oil | Brown Sugar | Cayenne PARMESAN TRUFFLE POPCORN 6.00 WINTERTIME CANEPES 9.00 Whipped Gorgonzola | Baked Apple Slice | Crispy Sage | Walnut Dust | Hot Maple HOMEMADE CUPCAKE 8.00 Red Velvet Cupcake | French Vanilla Cream Cheese Filling | Traditional Cream Cheese Frosting | Raspberry Sauce Beer Draught Local | Regional COAST KOLSCH 8.00 FATTY’S LAZY HAZY IPA 8.00 FREEHOUSE GREENDOOR IPA (16oz) 10.00 ISLAND COASTAL LAGER 8.00 LINCOLN & SOUTH BEACH CITY PILSNER (16oz) 10.00 RIVER DOG “RIVERWALK EMPIRE” PILSNER 8.00 WESTBROOK WHITE THAI 8.00 WESTBROOK IPA 8.00 WESTBROOK 8.00 Domestic MICHELOB ULTRA 7.00 BUD LIGHT 7.00 Import SAPPORO - JAPAN - PALE LAGER 7.00 ESTRELLA JALISCO - MEXICO - PILSNER 7.00 HEINEKEN - HOLLAND - PALE LAGER 7.00 Non-Alcholic HEINEKEN 0.0 6.00 BLENHEIM'S SPICY GINGER ALE 5.00 GOSLING'S GINGER BEER 5.00 Wine Sparkling Franco Amoroso- Moscato D’asti Glass 11.00 Bottle 44.00 Piemonte, Italy Domaine Chandon- Brut Bottle 51.00 California Benvolio Prosecco Glass 13.00 Bottle 52.00 Veneto, Italy Biutiful- Garnacha Rose Glass 14.00 Bottle 60.00 Cava, Spain JCB #69 Brut Rose Bottle 65.00 Burgundy, France Moet & Chandon Rose Imperial - Extra Brut Rose Bottle 141.00 Epernay, France Perrier Jouet - Belle Epoch Bottle 285.00 Epernay, France Dom Perignon Bottle 395.00 Champagne, France Krug- Brut Rose Bottle 425.00 Reims, Champagne, France Armand De Brignac- Brut Bottle 470.00 Reims, Champagne, France Moet & Chandon Imperial- Brut Reserve Glass 18.00 375ml Bottle 45.00 Epernay, France Veuve Clicquot - Yellow Label Glass 24.00 375ml Bottle 60.00 Riems, France White - Sauvignon Blanc Domaine Jean Aubron Glass 12.00 Bottle 46.00 Loire Valley, France Lobster Reef Glass 13.00 Bottle 50.00 Marlborough, New Zealand Duckhorn Bottle 58.00 North Coast, CA Patient Cottat Bottle 65.00 Sancerre, Loire Valley, France Capture Bottle 71.00 Pine Mt. - Cloverdale Peak, California White - Chardonnay Elouan Bottle 48.00 Oregon Simi Bottle 52.00 Sonoma Coast, California Jackson Estate Bottle 54.00 Santa Maria Valley, Santa Barbara County, CA Kumeu Village Glass 14.00 Bottle 56.00 New Zealand Sonoma Cutrer Glass 15.00 Bottle 60.00 Russian River Valley, CA La Crema – “Saralee’s Vineyard” Bottle 63.00 Russian River Valley, California Ramey Bottle 76.00 a Russian River Valley, Sonom Far Niente Bottle 118.00 Napa Valley, CA Other Whites White Cuvee- Spindrift Bottle 39.00 Willamette Valley, Oregon Muscadet- Oysterman-2020 Bottle 44.00 Loire Valley, France Pinot Grigio - Maso Canali Glass 13.00 Bottle 52.00 Controllata, Trentino, Italy Pinot Gris -Benton Lane -2017 Bottle 51.00 Willamette Valley, Oregon Albarino- Pazo Das Bruxas -2020 Bottle 53.00 Rias Baixas, Spain Chenin Blanc - Dirty & Rowdy - 2017 Bottle 63.00 Mendocino, California Ice Wine Rosé Justin - 2020 42.00 Central Coast, CA Famille Perrin - 2020 Glass 12.00 Bottle 46.00 Cotes Du Rhone, France Tablas Creek 54.00 Paso Robles, California Miraval- 2016 Bottle 58.00 Cotes de Provence, France Red - Pinot Noir Sokol Blosser- Evolution Bottle 46.00 Willamette, Oregon Castle Rock Glass 14.00 Bottle 54.00 Willamette Valley, Oregon Jackson Estate Bottle 56.00 Anderson Valley, Mendocino County Macmurray Bottle 60.00 Russian River Valley Belle Glos- Las Alturas Glass 18.00 Bottle 70.00 Monterey County, California Hartford Court Bottle 73.00 Russian River Valley Flowers Bottle 91.00 Sonoma Coast Penner-Ash Bottle 109.00 Willamette Valley, Oregon Patz & Hall - Hyde Vineyard Bottle 117.00 Carneros, Napa Valley Red - Merlot Alexander Valley Vineyards Bottle 44.00 Sonoma County Freemark Abbey Bottle 68.00 Napa Valley, California Red - Malbec A.F. - Achaval Ferrer- 2017 Glass 12.00 Bottle 46.00 Mendoza, Argentina Achaval Ferrer- 2017 Bottle 59.00 Mendoza, Argentina Caymus - “Red Schooner Voyage 9” Bottle 64.00 Mendoza, Argentina Luna De Esperanza-2013 Bottle 79.00 Uco Valley, Mendoza, Argentina Luna De Esperanza-2013- Barrel Fermented Bottle 109.00 Uco Valley, Mendoza, Argentina Red - Zinfandel Turley - 2020 - Old Vines Bottle 89.00 California Wonderment- 2012- Burton Ranch Bottle 91.00 Lake County Ridge- 2019- Pagani Ranch Bottle 93.00 Sonoma Valley Red - Syrah | Shiraz | Petite Sirah Wonderment-2012- Petite Sirah Bottle 83.00 Russian River Valley Molly Dooker \"2 Left Feet\" - 2019 - Shiraz Bottle 88.00 McLaren Vale, Australia Famille Perrin- 2013- Les Sinards Bottle 89.00 Chateauneuf Du Pape Orin Swift - Machete-2016 Bottle 94.00 St Helena, Napa Enfield- 2012- Syrah Bottle 98.00 Haynes Vineyard, Napa Red - Cabernet Sauvignon Newton- 2016 Skyside Bottle 50.00 North Coast, California Tabali - 2019 Glass 13.00 Bottle 50.00 Maipo Valley, Chile Truth Be Told - 2019 Bottle 54.00 Columbia Valley Quilt - 2019 Glass 17.00 Bottle 68.00 Napa Valley, California Simi- 2017 - Landslide Bottle 72.00 Alexander Valley Stonestreet- 2017 Bottle 81.00 Alexander Valley Capture -2017- Pine Mountain-Cloverdale Peak Bottle 98.00 Napa-Sonoma Justin - 2018 - Isosceles Bottle 105.00 Paso Robles, CA Groth - 2018 Bottle 116.00 Oakville, Napa Chimney Rock- 2018- Stags Leap Bottle 128.00 Napa Valley Flanagan - 2015 Bottle 130.00 Sonoma County Cakebread - 2018 Bottle 135.00 Napa Valley Red - Blends and Other Reds Castel Di Salve- Negroamaro Bottle 40.00 Salento, Apulia Locations - Red Blend- “Ca” Glass 13.00 Bottle 58.00 California Chateau Yvonne- 2016- Cabernet Franc Bottle 64.00 Saumur Champigny, Loire Valley Diora “Three Crowns”- 2012- San Bernabe Bottle 67.00 Monterey Enfield- 2013-Tempranillo Bottle 77.00 Snake Ridge Ranch, Amador County Strada Al Sasso-2017-Chianti Classico -Tenuta Di Arceno Bottle 87.00 Tuscany, Italy The Prisoner - 2019 Bottle 95.00 California The Federalist “Dueling Pistols”- 2011 Bottle 89.00 Dry Creek Valley Numanthia- 2011- Tinto De Toro Bottle 104.00 Valdefinjas, Spain Allegrini Amarone Della Valpolicella - 2016 Bottle 115.00 Verona, Italy Harvey & Harriet - 2019 Bottle 110.00 San Luis Obispo County Orin Swift – Papillon -2016 Bottle 117.00 Napa Valley Trilogy – Flora Springs - 2016 Bottle 119.00 Napa Valley Marco Abella “Clos Abella”- 2009 Bottle 139.00 Priorat, Spain Ramey Annum- 2013 Bottle 142.00 Napa Valley Meet the Bar's Cocktail Mastermind Passionate and inventive, Cocktail Artisan Allen Lancaster serves up artful cocktails packed with seasonal southern flair. “With my culinary background, food is a key component that has directly influenced the creative side of the style of cocktails I've crafted at The Spectator Bar.” Live Music Every Third Thursday | 6:00 PM - 9:00 PM Handcrafted cocktails never tasted better than with a front row seat to Charleston's best live music! Bring your friends and nosh on a selection of shared plates while enjoying live musical performances by a rotating cast of talented local musicians. Indulge in half-price bottles from The Spectator's wine program. A Decade of Spirited Hospitality FOOD & WINE Global Tastemakers 15 Best Bars in the U.S. USA TODAY 10BEST Awards Top 10 Best Hotel Bar Frequently asked questions What makes The Bar at The Spectator Hotel unique in Charleston? The Bar is celebrated for its award-winning cocktails, crafted by expert mixologists in a stylish, intimate setting. It’s frequently recognized among Charleston’s best hotel bars. Do guests need a reservation to visit The Bar? No reservations are required—it’s first-come, first-served. Guests can also enjoy cocktail service from their butler in the comfort of their own room. Has The Bar at The Spectator Hotel been featured in travel magazines? Yes, our bar has been highlighted by major travel publications for its style and craftsmanship, further cementing its reputation as one of Charleston’s finest cocktail experiences. Does The Spectator Hotel have an on-site restaurant? The Spectator Hotel does not have an on-site restaurant. However, The Spectator Hotel does have a craft cocktail bar and lounge, The Bar at The Spectator, which serves light bar food bites, and a variety of beer, wine, and cocktails. It is open daily — Sunday through Thursday from 3 - PM and 3 - 11 PM on Fridays and Saturdays. Additionally, there are dozens of restaurants within walking distance for your enjoyment. What time does the bar open? The Bar is open daily at 3 PM to the public. Any time after 10 AM, we pour beer, wine, champagne or a basic mixed drink (excluding our signature cocktails) for in-house guests. Our signature cocktails are available during The Bar's regular operating hours. Does The Spectator Hotel offer in-room dining? The Spectator Hotel offers a limited in-room dining menu, served from and inspired by The Bar. Our butler staff will deliver to your guest room from 3 - 9 PM daily. Additionally, the butler team is able to pick up food from local restaurants within a two block radius of The Spectator Hotel and deliver it to your room should you wish to dine in. This will incur a 20% convenience fee. Can The Spectator Hotel's Butlers help with dining requests? Yes, The Spectator Hotel's private butlers are here to help coordinate any dining needs you may have — making reservations, ordering from local restaurants, picking up your meal, and other special requests. Just ask!",
      "hash": "ac834d3a6be4",
      "downloadedAt": "2026-01-18T16:54:55.277Z",
      "trimmedAt": "2026-01-18T17:13:02.092Z",
      "sizeReduction": "89.1%"
    }
  ],
  "sizeReduction": "89.1%"
}