{
  "venueId": "ChIJX3apPVFx_ogRmPduJUREatQ",
  "venueName": "High Thyme Cuisine",
  "venueArea": "Sullivan's Island",
  "website": "https://www.highthyme.com/",
  "scrapedAt": "2026-01-18T17:04:26.937Z",
  "trimmedAt": "2026-01-18T17:08:06.011Z",
  "pages": [
    {
      "url": "https://www.highthyme.com/menus",
      "text": "Back Dinner Drinks Dinner Dinner service is available Monday through Saturday starting at 5:00pm, and our dinner menu* features an eclectic collection of American fare—fresh seafood, beloved comfort food and seasonal dishes. We even have a secret stash of chicken fingers for the pickiest of palates. *Please note that the dinner menu on this page is subject to availability. STARTERS 13 $ Baked Four Cheese Cauliflower Dip Grilled Pita, Italian Olives 13 $ 13 $ Butterbean & Chickpea Hummus Pickled Vegetables, Everything Seasoned Flatbread 13 $ 16 $ *Shrimp & Corn Chowder Green Chiles, Scallions 16 $ 14 $ Braised Beef Brisket Tacos Salsa Verde, Arugula, Cotija 14 $ 17 $ *Italian Sausage Ditalini Red Wine, Tomatoes, Cream, Parmesan 17 $ 18 $ *PEI Mussels Garlic Pesto Butter Broth, Tomatoes, Arugula, Parmesan, Sourdough 18 $ 22 $ *Seared Scallops Sweet Creamed Corn, Zucchini & Squash Salad, Blueberry Gastrique 22 $ 19 $ *Rare Seared Tuna Vegetable Fried Quinoa, Chili Pineapple Soy Glaze 19 $ SALADS 11 $ Arugula Toasted Pecans, Dried Cherries, Goat Cheese, Honey Basil Vinaigrette 11 $ 11 $ Romaine Seasoned Sourdough Croutons, Parmesan Cheese, Parmesan Dressing 11 $ Chicken $7 | Shrimp $10 | Scallops $12 | Salmon $10 | Tuna $12 | Crab & Shrimp Cake $13 Add... MAIN 22 $ *Pan-Fried Crab & Shrimp Cake Cheddar Cheese & Bacon Stoneground Grits, Jalapeño Slaw, Tomato Herb Aioli 22 $ 23 $ Sweet Potato & Spinach Risotto Candied Pecans, Maple Gastrique 23 $ 26 $ Veal, Pork & Beef Bolognese Lasagna Béchamel, Tomato Sauce, Parmesan, Basil 26 $ 34 $ *Grilled Yellowfin Tuna Wasabi Mashed Potatoes, Cucumber Mango & Edamame Salad, Honey Sesame Vinaigrette 34 $ 30 $ *Pan-Roasted Salmon Tomato Cous Cous, Roasted Red Cabbage, Horseradish Dill Aioli 30 $ 30 $ *Cioppino Shrimp, Mussels, Fish, Crushed Red Pepper, White Wine Tomato Butter Broth, Sourdough 30 $ 30 $ *Grilled Lamb Meatloaf Mashed Potatoes, Chickpea & Cucumber Salad, Curry Tomato Glaze 30 $ 34 $ *Grilled Pork Chop Fingerling Sweet Potatoes, Braised Collard Greens, Peach BBQ Chutney 34 $ 41 $ *Grilled Beef Tenderloin Roasted Baby Marble Potatoes & Asparagus, Bacon Mushroom Jus 41 $ *Consuming raw or undercooked meats, poultry, seafood, shellfish or eggs may increase your risk of foodborne illness.",
      "hash": "080eb818df49",
      "downloadedAt": "2026-01-18T17:01:52.241Z",
      "trimmedAt": "2026-01-18T17:08:05.968Z",
      "sizeReduction": "97.6%"
    },
    {
      "url": "https://www.highthyme.com/#home-contact",
      "text": "Back Dinner Drinks Menus High Thyme offers an eclectic mix of American fare in a laid-back, bistro atmosphere. Dinner Drinks PHONE We are currently not taking reservations and operate on a first come, first served basis. Please call with any questions… 843-883-3536 Hours MONDAY–SATURDAY5–10pm SUNDAYClosed Location 2213-C Middle Street, Sullivan's Island, SC 29482",
      "hash": "333066cd7183",
      "downloadedAt": "2026-01-18T17:01:53.340Z",
      "trimmedAt": "2026-01-18T17:08:05.977Z",
      "sizeReduction": "99.6%"
    },
    {
      "url": "https://www.highthyme.com/drinks",
      "text": "Back Dinner Drinks Drinks Wet your whistle with a selection from our extensive wine, beer and specialty cocktail menu! We offer half-price bottles of wine on Mondays. Join us for our Monday Wine Special! Ask for details. Excludes Reserve Wines. Beer & Non-Alcoholic Coors Original Miller Lite Blue Moon Stella Artois Lagunitas IPA Heineken 0/0 Michelob Ultra Bud Light Sol Bold Rock Cider Bell’s Two Hearted IPA High Rise D9 Seltzer Cocktails Aurora Fizz Local Nippitaty Aurora Gin, Simple Syrup, Club Soda, Lemon Spicy Margy Tanteo Jalapeño Tequila, Sour, Grand Marnier, OJ, Salted Rim, Lime Beyond Old Fashioned Local Beyond Distilling Bourbon Whiskey, Simple Syrup, Angostura Bitters, Orange Dead Eye Martini Local Holy City Dead Eye XXX Triple Espresso Vodka, Kahlúa, Half & Half Half Bottles Schramsberg Blanc de Blanc California Amalaya Malbec Salta Argentina Honig Sauvignon Blanc Napa Valley Alexander Valley Cabernet Sauvignon Sonoma William Hill Chardonnay Napa Valley La Crema Pinot Noir Sonoma Coast BUBBLES, ROSÉ & White Wine LaMarca Prosecco Italy Bisol Jeio Brut Rosé Veneto Italy Piper Sonoma Blanc de Blancs Sonoma County Delamotte Brut Champagne Le Mesnil-sur-Oger, Champagne France Fleur de Mer Rosé Provence France M.A.N. Unoaked Chardonnay South Africa Cambria Chardonnay Santa Maria Valley Sonoma Cutrer Chardonnay Russian River Valley Far Niente Chardonnay Napa Valley Bouchard Pouilly Fuissé White Burgundy Beaune France Whitehaven Sauvignon Blanc Marlborough New Zealand Domaine Cherrier Sancerre France Martín Códax Albariño Rías Baixas Spain Laurenz V. Grüner Veltliner Austria Paso Verde Picpoul Blend Paso Robles Dipinti Pinot Grigio Delle Dolomiti Italy Red Wine Proverb Merlot California Carmel Road Pinot Noir Monterey Elouan Pinot Noir Oregon Evolution Pinot Noir Willamette Valley Siduri Pinot Noir Willamette Valley Belle Glos Clark & Telephone Pinot Noir Santa Maria Valley Quilt Threadcount Red Blend California Robert Hall Cabernet Sauvignon Paso Robles Oberon Cabernet Sauvignon Napa Valley Honig Cabernet Sauvignon Napa Valley Far Niente Post & Beam Cabernet Sauvignon Napa Valley Marqués de Cáceres Red Blend Rioja Spain Donna Fugata Sedàra Red Blend Sicily Pala Oltreluna Monica Sardinia Arcanum Il Fauno Super Tuscan Blend Tuscany Italy Umani Ronchi Montepulciano D’Abruzzo Italy Alexander Valley Zinfandel Sonoma County Ink Blot Petite Sirah Lodi Perrin Vinsobres Blend Côtes Du Rhône France Kaiken Malbec Mendoza Argentina Reserve Wine Gran Moraine Pinot Noir Yamhill Carlton Willamette Valley Far Niente En Route Pinot Noir Russian River Valley Lion Tamer Red Blend Napa Valley Allegrini Amarone Valpolicella Italy Orin Swift Palermo Cabernet Sauvignon Napa Valley Freemark Abbey Cabernet Sauvignon Napa Valley Orin Swift Papillon Bordeaux Blend Napa Valley Château de Beaucastel Châteauneuf-Du-Pape, France Massolino Barolo Serralunga d’Alba, Italy",
      "hash": "72821ee6366c",
      "downloadedAt": "2026-01-18T17:01:51.352Z",
      "trimmedAt": "2026-01-18T17:08:05.996Z",
      "sizeReduction": "97.0%"
    },
    {
      "url": "https://www.highthyme.com/#home-menus-1",
      "text": "Back Dinner Drinks Menus High Thyme offers an eclectic mix of American fare in a laid-back, bistro atmosphere. Dinner Drinks PHONE We are currently not taking reservations and operate on a first come, first served basis. Please call with any questions… 843-883-3536 Hours MONDAY–SATURDAY5–10pm SUNDAYClosed Location 2213-C Middle Street, Sullivan's Island, SC 29482",
      "hash": "dfe943248133",
      "downloadedAt": "2026-01-18T17:01:52.791Z",
      "trimmedAt": "2026-01-18T17:08:06.003Z",
      "sizeReduction": "99.6%"
    },
    {
      "url": "https://www.highthyme.com/",
      "text": "Back Dinner Drinks Menus High Thyme offers an eclectic mix of American fare in a laid-back, bistro atmosphere. Dinner Drinks PHONE We are currently not taking reservations and operate on a first come, first served basis. Please call with any questions… 843-883-3536 Hours MONDAY–SATURDAY5–10pm SUNDAYClosed Location 2213-C Middle Street, Sullivan's Island, SC 29482",
      "hash": "e3bdd1eeec0e",
      "downloadedAt": "2026-01-18T17:01:51.287Z",
      "trimmedAt": "2026-01-18T17:08:06.011Z",
      "sizeReduction": "99.6%"
    }
  ],
  "sizeReduction": "98.7%"
}