{
  "venueId": "ChIJFbCKzFl8_ogRogeJuyuhwS4",
  "venueName": "Bushido Sushi & Hibachi Charleston",
  "venueArea": "West Ashley",
  "website": "https://www.bushidojapaneserestaurant.com/",
  "scrapedAt": "2026-01-18T17:04:24.617Z",
  "trimmedAt": "2026-01-18T17:05:26.384Z",
  "pages": [
    {
      "url": "https://www.bushidojapaneserestaurant.com/Locations",
      "text": "Our Locations Our Locations Restaurant Locations Charleston 1975 Magwood Dr West Ashley, SC 29414 (843) 573-2440 Order Now Summerville 9730 Dorchester Rd Ste 106Summerville, SC 29485 (843) 695-8777 Order Now",
      "hash": "3b0f26f13a75",
      "downloadedAt": "2026-01-18T17:02:00.550Z",
      "trimmedAt": "2026-01-18T17:05:26.325Z",
      "sizeReduction": "99.2%"
    },
    {
      "url": "https://www.bushidojapaneserestaurant.com/charleston-menu",
      "text": "Charleston Menu Charleston Menu Appetizer Edamame Young soy bean tossed with sea salt 6.00 Gyoza Chicken pot stickers 6.75 Rocky Shrimp Crispy tempura shrimp with Japanese dressing 9.75 Fried Shumai Shrimp dumpling 6.50 Crab Wonton Cream cheese wonton 7.00 Calamari Fresh fried squid dusted6 with panko, spicy mayo 6.75 Harumaki Cabbage, mushrooms, carrot, green beans, & vermicelli wrapped in wheat pastry with chili salsa 5.50 Beef Negimaki Thin slice beef rolled with scallion in teriyaki sauce 10.50 Bushido Stick Spinach, mozzarella spring roll 8.00 Age Tofu Silken firm tofu, cut into cubes, lightly dusted with cornstarch, served in golden crispy, bonito flakes 7.00 Tempura Vegetable or shrimp 10.00 Chicken Yakitori Japanese grilled skewered chicken 8.90 Soft Shell Crab 9.75 Soup Miso Soup 3.00 Seafood Soup 8.50 Clear Soup 3.00 Veggie Soup 6.00 Salad Squid Salad 7.00 Avocado Salad Mixed green topped with avocado 7.00 Seaweed Salad Marinated wakame tossed with sesame seeds. 7.00 Kani Salad Top choice kani shredded & tossed with temp flakes in spicy mayo dressing 8.50 Spicy Sashimi Salad Assorted sashimi mix with cube avocado 10.50 Salmon Skin Salad 8.50 Sushi Appetizer Tuna Tataki/Beef Tataki Lightly seared sliced tuna/steak served with ponzu 12.00 Tuna Tartar Chopped tuna with wasabi aoli sauce and avocado 12.00 Yellowtail Jalapeno 12.50 Fantasy Island Snow crab, shrimp, fish egg on top of avocado 12.00 Honey Salmon Salmon wrap, honey black pepper sp tuna with tobiko honey wasabi sauce 13.00 Fish Fried Fried fresh fish with ponzu sauce massago scallion 8.50 Donburi Entree Served with Fried Rice & Soup or Salad Fillet Bowl Mushroom 16.50 Chicken Bowl Pepper & Onion 12.50 Shrimp Donburi Broccoli 12.99 Ribeye Bowl Mushrooms 14.50 Vegetable Bowl Mushroom, broccoli, zucchini, onion, carrot 9.00 Noodle Yaki Udon Noodle Chicken or shrimp or steak or vegetable $10.00 15.00 Srira Yaki Udon Pan stir udon with sea scallop & jumbo shrimp in spicy siracha with yaki 18.50 Tempura & Katsu Entrees Served with white rice Vegetable Tempura 13.50 Shrimp Tempura 16.50 Ton Katsu 13.99 Tori Katsi 12.99 Classic Hibachi Entrees Served with fried rice, soup & salad Single (Choice one) 16.99 Combination (Choice one) 21.99 PICK 3 26.99 Fillet Scallop 28.99 Bushido Special Fillet, lobster, scallop, shrimp 40.99 Chicken/Shrimp/Ribeye/Salmon ($2 up charge)/Scallop ($5 up charge)/Fillet ($5 up charge)/Lobster ($10 up charge) Sushi & Sashimi Entree Soup & Salad Sushi Dinner 10 pc sushi with spicy tuna roll 25.00 Sashimi Dinner 15 pc assorted fresh sashimi 30.00 Sushi & Sashimi Dinner 5 pc sushi, 15 sashimi & spicy tuna roll 40.00 Sushi Sashimi Deluxe 8 pc assorted sushi, 18 pc assorted sashimi, spicy tuna roll, & dragon roll, krunchee roll 70.00 Sashimi Deluxe 12 pc assorted fresh sashimi 38.00 Sushi Deluxe 12 pc sushi with spicy tuna 28.00 Chirashi 15 pc assorted fish on top of sushi rice (3 pc crab meat and 3 ppc shrimp) 22.00 Sushi & Sashimi Entree Soup & Salad Sushi Dinner 10 pc sushi with spicy tuna roll 25.00 Sashimi Dinner 15 pc assorted fresh sashimi 30.00 Sushi & Sashimi Dinner 5 pc sushi, 15 sashimi & spicy tuna roll 40.00 Sushi Sashimi Deluxe 8 pc assorted sushi, 18 pc assorted sashimi, spicy tuna roll, & dragon roll, krunchee roll 70.00 Sashimi Deluxe 12 pc assorted fresh sashimi 38.00 Sushi Deluxe 12 pc sushi with spicy tuna 28.00 Chirashi 15 pc assorted fish on top of sushi rice (3 pc crab meat and 3 ppc shrimp) 22.00 Classic Roll California Roll Kani, cucumber, avocado 5.75 Eel Roll Eel, cucumber, avocado, eel sauce 7.25 Palmetto Shrimp, cucumber, spicy mayo eel sauce 6.00 Crab Crunch Roll Kani, tempura flackes, spicy mayo eel sauce 5.75 Krunchee Roll Shrimp tempura, spicy sauce, eel sauce 5.75 Veggie Roll Avocado, cucumber, oshinko 5.50 Cucumber Roll 4.95 Salmon Avocado Roll 6.50 Alaskan Roll Salmon, cucumber, avocado 6.75 Philadelphia Roll Smoked salmon, cucumber, cream cheese 6.75 Salmon Roll Sake Maki 5.50 Tuna Roll Tekka Maki 5.50 Spicy Tuna Roll Grand tuna, hot sauce, tempura 6.50 Yellow Tail Roll Yellow tail, scallion 5.99 Sumo Roll Kani, shrimp, cucumber, avocado, masago, cream cheese 6.75 Shrimp Tempura Roll Tempura shrimp, avocado, cucumber eel sauce 7.75 Sweet Potato Roll Eel sauce 5.50 Special Rolls Skrunch Roll Shrimp tempura, kani, cream cheese, tempura flakes spicy mayo eel sauce 10.50 Cooper River Roll Tuna, asparagus tempura, & spicy mayo topped with shrimp & avocado & pierto sauce 10.75 Rainbow Roll Kani, avocado, cucumber, topped with tuna, salmon, yellowtail 10.50 Champ Chop Roll Spicy tuna, shrimp tempura, cream cheese 9.50 Dragon Roll Kani, cucumber, with eel & avocado on top 11.00 The Detonator Roll Spicy tuna, cream cheese, cucumber, deep fried 9.00 Drifter Roll Kani, tempura flakes, tuna, yellowtail, salmon and wasabi mayo on top 9.95 Twist Roll Kani, tempura flakes, cream cheese, topped with shredded crab, in spicy mayo 10.50 Spider Roll Soft shell crab, cucumber, smelt eggs, eel sauce 10.50 Salad Roll Kani, shrimp, avocado, wrapped with cucumber with ponzu sauce 10.50 Sashimi Spicy Tuna Roll Spicy tuna, cucumber, rolled in sashimi tuna with ponzu sauce 10.50 Signature Rolls Naruto Roll Kani avocado tuna salmon white fish wrapped with cucumber with ponzu sauce 13.99 Out of Control Tuna, yellowtail, salmon, avocado, tempura asparagus with spicy mayo & eel sauce & torched 16.99 Angry Dragon (soy paper) Shrimp tempura, spicy tuna, papaya inside topped with sp crab & eel sauce 15.00 Sunshine Roll (soy paper) Salmon tempura avocado topped with salmonn & tempura flakes and spicy sauce 15.00 Amazing Tuna Roll (soy paper) White tuna tempura, spicy tuna, avocado, topped with pepper tuna with mango & eel sauce 16.50 Surf N Turf Shrimp tempura & cream cheese, topped with beef tataki & pietro dressing 14.75 Rasta Roll Spicy tuna, avocado, shrimp tempura, topped with albacore tuna, jalapeno, hot sauce & spicy mayo & torched 15.50 Mango Tango (soy paper) Shrimp tempura, avocado, cucumber, topped with mango coconut flakes and mango & eel sauce 15.50 Bold & Hot White fish, eel, cream cheese, shrimp tempura, crab meat & avocado deep fried, spicy mayo, eel sauce, wasabi mayo masago 15.95 Triple Tuna Spicy tuna, tempura flakes, avocado, cucumber, topped with tuna, albacore tuna, white tuna, sweet chili sauce 16.50 S.s.s Roll Tempura asparagus, tempura crab, cream cheese, topped with smoke salmon avocado & pietro 15.50 Hulk Roll Eel, shrimp tempura, cream cheese, topped with avocado on top, eel sauce 14.95 Kamikaze Shrimp tempura, cream cheese, eel and avocado on top, eel sauce 14.50 Phuket Island (soy paper) Spicy kani, avocado & & tempura asparagus topped with avocado fresh salmon & eel, spicy mayo sauce 16.95 Signature Rainbow Sushi rice, sp tuna, avocado tuna salmon yellowtail flakes, tobiko and lobster & wasabi sauce 18.95 Real Dragon (soy paper) Lobster tempura, lobster salad, avocado topped with sp tuna and lobster sauce and crispy sweet potato 18.50 Red Coral (soy paper) Spicy tuna, tempura shrimp, avocado, topped with lobster salad and fried kani lobster sauce, eel sauce 16.50 Nigiri or Sashimi (Add quail egg 1 pcs for $1.00) Tuna (maguro) Nigiri 2pc 6.00/Sashimi 3pc 7.50 Salmon (sake) Nigiri 2pc 6.00/Sashimi 3pc 7.50 Yellowtail (hamachi) Nigiri 2pc 6.50/Sashimi 3pc 8.00 Super White Tuna Nigiri 2pc 6.00/Sashimi 3pc 7.50 Eel (unagi) Nigiri 2pc 7.00/Sashimi 3pc 8.00 Salmon Roe (ikura) Nigiri 2pc 6.00/Sashimi 3pc 7.50 Mackerel (saba) Nigiri 2pc 6.00/Sashimi 3pc 7.00 *Scallop (kobashira) Nigiri 2pc 6.00/Sashimi 3pc 7.00 Red Snapper (tai) Nigiri 2pc 6.00/Sashimi 3pc 7.00 Squid (ika) Nigiri 2pc 6.00/Sashimi 3pc 7.00 Sea Urchin (uni) Nigiri 2pc MP/Sashimi 3pc MP Shrimp (ebi) Nigiri 2pc 5.00/Sashimi 3pc 6.00 Kani (crab) Nigiri 2pc 5.00/Sashimi 3pc 6.00 *Albacore Tuna (shiro Maguro) Nigiri 2pc 6.50/Sashimi 3pc 8.00 *Smoked Salmon Nigiri 2pc 6.50/Sashimi 3pc 7.50 Octopus (tako) Nigiri 2pc 6.00/Sashimi 3pc 7.00 HEALTH ADVISORY: Eating raw or undercooked meat, poultry, eggs, or seafood posed a health risk to everyone, but especially to the elderly, children under age four, pregnant women, and other highly susceptible individuals with compromised immune systems. Thorough cooking of animal food reduces the risk of illness. For further information, contact your physician or Public Health Department. Donburi Lunch Special Served with Fried Rice Steak Bowl Mushroom 11.99 Chicken Bowl Peppers & Onions 9.99 Shrimp Bowl Broccoli 10.50 Vegetable Bowl Broccoli, zucchini, mushroom, onion, and carrot 8.00 Fillet Bowl Mushroom 13.99 Classic Hibachi Lunch Single Item (Choice one) 12.99 Combination (Choice two) 15.99 Pick 3 19.99 Chicken/Shrimp/Ribeye/Salmon ($2 up charge)/Scallop ($5 up charge)/Fillet ($5 up charge) Special Roll Lunch Choose any two rolls for $17.99 Cooper River Roll Skurunch Roll Dragon Roll Drifter Roll Spider Roll Rainbow Roll Champ Roll The Detonator Roll Twist Roll Classic Maki Lunch Choose any two rolls for $11.50 or any three rolls for $14.50 Tuna Roll Yellowtail Roll Salmon Roll Avocado Roll Alaskan Roll California Roll Philadelphia Roll Eel Roll Spicy Tuna Roll Sumo Roll Shrimp Tempura Roll Sweet Potato Roll Crab Crunch Roll Palmetto Roll Veggie Roll Krunchee Roll Nigiri & Sashimi Lunch All served with soup or salad Traditional Sushi 5 pc. assorted sushi & California roll 12.99 Traditional Sashimi 12 pc. assorted sashimi 15.99 The Sushi & Sashimi 4 pc. assorted sushi, 8 pc. sashimi & spicy tuna 18.99",
      "hash": "6bfd30271bf2",
      "downloadedAt": "2026-01-18T17:02:01.788Z",
      "trimmedAt": "2026-01-18T17:05:26.373Z",
      "sizeReduction": "89.2%"
    },
    {
      "url": "https://www.bushidojapaneserestaurant.com/",
      "text": "Online Ordering Now Available Start Your Order View Charleston Menu Grid Photo Gallery Tell us about your experience! ★★★★★ Bushido is an awesome spot, super fresh sushi every time. The service is always on point. It’s a nice little date spot, nice casual relaxed environment . Definitely go if you're craving sushi. Bryan M. ★★★★★ We stopped in here on a spontaneous date night, and it turned out to be an excellent choice. The atmosphere was calm and relaxing, and the other guests were friendly and pleasant to be around. Our waitress was phenomenal—super attentive and informative. I’m not in this area often, but if I am and craving sushi or hibachi, you can bet I’ll be stopping by again. And be careful ordering the large carafe of sake. It's delicious and can sneak up on you. PJ F. ★★★★★ Literal bust sushi in Charleston. Kamikaze and sumo roll so good. We eat here twice a week I swear. My husband and daughter love the filet hibachi. Jessica O. Leave a Review Leave a Review Charleston Summerville Restaurant Locations Charleston 1975 Magwood Dr West Ashley, SC 29414 (843) 573-2440 Order Now Summerville 9730 Dorchester Rd Ste 106Summerville, SC 29485 (843) 695-8777 Order Now",
      "hash": "a4e95dbb2dcc",
      "downloadedAt": "2026-01-18T17:02:00.362Z",
      "trimmedAt": "2026-01-18T17:05:26.380Z",
      "sizeReduction": "96.4%"
    },
    {
      "url": "https://www.bushidojapaneserestaurant.com/locations",
      "text": "Our Locations Our Locations Restaurant Locations Charleston 1975 Magwood Dr West Ashley, SC 29414 (843) 573-2440 Order Now Summerville 9730 Dorchester Rd Ste 106Summerville, SC 29485 (843) 695-8777 Order Now",
      "hash": "a736ffc93530",
      "downloadedAt": "2026-01-18T17:02:01.182Z",
      "trimmedAt": "2026-01-18T17:05:26.384Z",
      "sizeReduction": "99.2%"
    }
  ],
  "sizeReduction": "93.6%"
}