{
  "venueId": "ChIJTzREvBF6_ogRgN_VGQg5-bI",
  "venueName": "The Elliott House Inn",
  "venueArea": "Downtown Charleston",
  "website": "https://www.elliotthouseinn.com/?utm_source=google&utm_medium=organic&utm_campaign=business_listing",
  "scrapedAt": "2026-01-18T17:04:26.702Z",
  "trimmedAt": "2026-01-18T17:08:03.722Z",
  "pages": [
    {
      "url": "https://www.elliotthouseinn.com/?utm_source=google&utm_medium=organic&utm_campaign=business_listing",
      "text": "SKIP TO CONTENT Your browser does not support the video tag. Charleston's Most Charming Historic Inn Welcome to the Elliott House Inn Intimate. Romantic. Indulgent. With its tranquil cobblestoned courtyard, original hardwood floors and breezy piazzas, the Elliott House Inn invites a fresh, yet historically rich, Charleston experience. Once a private residence, our Queen Street inn effortlessly pairs the comfort and intimacy of an inn with the chic style and contemporary services of a boutique hotel, delighting first-time visitors and charming returning friends. Book direct and enjoy late check out of 12pm Check Availability Featured offers 10% OFF + Bubbly We’re proud to be recognized among Charleston’s best by Condé Nast Traveler. Join us in raising a glass to this exciting honor! 10% Off Accommodations Bottle of Bubbly Learn More Featured offers Up To 25% Off Book early and save! Enjoy up to 25% off your stay when you book your stay in advance. Book 30+ Days in Advance & Receive 20% Off Book 61+ Days in Advance & Receive 25% Off Non-Refundable Learn More Featured offers Rosé + Holy City Keepsakes Enjoy intimate accommodations and Charleston favorites while staying at our beloved inn. Don't forget to pack your keepsakes to bring a little Southern charm home with you! Benne Wafers Bottle of Rosé 2 Wine Tumblers Custom Postcard Candle in scent Southern Magnolia Learn More Featured offers $75 Dining Credit, Sweet Treats + More Our Romance Package includes a bottle of sparkling wine, a chocolate treat, a $75 dining certificate, and late checkout*. Deluxe accommodations A Bottle Of Sparkling Wine Sweet Chocolate Treat Restaurants $75 Dining Certificate To One Of Our Preferred Late Checkout Depending On Availability Learn More Featured offers 10% OFF Are you a AAA Member? Receive 10% OFF your stay when you book this offer. 10% off accommodations Learn More Top reasons for staying Complimentary Bicycles Explore downtown Charleston's historic streets on two wheels with our complimentary beach cruisers. More about the inn Top reasons for staying Late checkout at 12PM Make the most of your time in Charleston with Late Checkout at 12PM. More about the inn Top reasons for staying Quiet Courtyard Moments Our tranquil interior courtyard is a hidden gem, perfect for enjoying a few moments of solitude, reading the newspaper, or enjoying breakfast. More about the inn Top reasons for staying Wine & Cheese Reception After sightseeing around Charleston, wind down with fellow guests at our complimentary Wine & Cheese reception every evening of the week. More about the inn Traveler Rating 0.2 Based on reviews inthe last 90 days \"Glorious Getaway\" The staff and service at Elliot House was incredible - the perfect combination of historic and local, paired with updated rooms and thoughtful touches. The location of this inn is perfect for someone wanting to explore Charleston. You can hop on a set of their complimentary bikes if you want to go a little further on your adventure. - Jessica H. \"Great Small Hotel in the Historic District\" This was a fine place with great staff who were helpful and friendly. Enjoyed the wine and cheese in the courtyard each afternoon. In the middle of the historic downtown, surrounded by great restaurants. Rooms were clean and comfortable. - WeddingRingStaysOn \"First Visit to Charleston\" Perfect location, very friendly staff and so charming. Happy hour wine and cheese bar and a fire going in the courtyard– what a beautiful way to start the evening. We will definitely go back and stay there again. - Lauren W. \"Wonderful Place to Stay\" I like the way this Inn feels and how everything is situated. The courtyard area is a very good communal area to hang out, with a fireplace and plenty of tables and chairs for everyone to fit comfortably. - EvanGuthrie Charleston, SC For eight years in a row, this genteel city has reigned as #1 in the U.S. [Travel + Leisure World’s Best Awards] thanks to an unmatched combination of history, hospitality, architecture, culture, and cuisine. Explore Map The Battery 14 Min - 0.8 Miles 6 Min - 0.8 Miles Explore Map Rainbow Row 10 Min - 0.5 Miles 4 Min - 0.5 Miles Explore Map Waterfront Park 9 Min - 0.4 Miles 3 Min - 0.4 Miles Explore Map Charleston City Market 9 Min - 0.5 Miles 3 Min - 0.5 Miles Explore Map",
      "hash": "6763a085541f",
      "downloadedAt": "2026-01-18T16:54:55.204Z",
      "trimmedAt": "2026-01-18T17:08:03.714Z",
      "sizeReduction": "95.0%"
    },
    {
      "url": "https://www.elliotthouseinn.com/offers",
      "text": "SKIP TO CONTENT Charleston Hotel Specials Sip & Celebrate 10% OFF + Bubbly We’re proud to be recognized among Charleston’s best by Condé Nast Traveler. Join us in raising a glass to this exciting honor! 10% Off Accommodations Bottle of Bubbly Check Availability Read More Advanced Purchase Up To 25% Off Book 30+ Days in Advance & Receive 20% Off Book 61+ Days in Advance & Receive 25% Off Non-Refundable BOOK NOW Read More Charleston Charms Rosé + Holy City Keepsakes Benne Wafers Bottle of Rosé 2 Wine Tumblers Custom Postcard Candle in scent Southern Magnolia BOOK NOW Read More Romantic Retreat $75 Dining Credit, Sweet Treats + More Deluxe accommodations A Bottle Of Sparkling Wine Sweet Chocolate Treat Restaurants $75 Dining Certificate To One Of Our Preferred Late Checkout Depending On Availability BOOK NOW Read More AAA Members 10% OFF 10% off accommodations BOOK NOW Read More Top Reasons to Stay Quiet Courtyard Moments Our tranquil interior courtyard is a hidden gem, perfect for enjoying a few moments of solitude, reading the newspaper, or enjoying breakfast. Late Checkout at 12PM Make the most of your time in Charleston with Late Checkout at 12PM. Complimentary Bicycles Explore downtown Charleston's historic streets on two wheels with our complimentary beach cruisers. Wine & Cheese Reception After sightseeing around Charleston, wind down with fellow guests at our complimentary Wine & Cheese reception every evening of the week.",
      "hash": "8324ba1a2e71",
      "downloadedAt": "2026-01-18T16:54:55.526Z",
      "trimmedAt": "2026-01-18T17:08:03.722Z",
      "sizeReduction": "98.0%"
    }
  ],
  "sizeReduction": "96.3%"
}