{
  "venueId": "ChIJReKq3V96_ogRn09bWz_XZHQ",
  "venueName": "The Royal American",
  "venueArea": "Mount Pleasant",
  "website": "http://theroyalamerican.com/",
  "scrapedAt": "2026-01-19T03:25:41.557Z",
  "trimmedAt": "2026-01-19T03:28:33.393Z",
  "pages": [
    {
      "url": "http://theroyalamerican.com/",
      "text": "[Page Title: The Royal American]\n\nCart 0 \nScroll\nSchedule \nNeighborhood Bar - Restaurant - Live Music VenueLocated in Downtown Charleston. Kitchen open ‘til 1am daily.\n\nAbout Us\n\nLocated in the Ole Charleston Forge building on Charleston’s Upper Peninsula, The Royal American has been serving up quality food, drink, and live music since 2011. Stop in any night of the week for dinner, and on the weekends to hear original live music from the best local, regional, and national artists. Our team of chefs, Brian “Beezle” Emery & Kirsten Lawton, have elevated our Classic American menu to new heights, with rotating soups, Red Plate Specials, and “Staff Meals.” We are proud to be able to have fun with our menu, while still carefully sourcing only the best and most local ingredients we can find. Royal menu classics include our 32oz Punches, House-made Beef Jerky, House-ground Hamburgers & Patty Melts, and Muffaletta Sandwiches. New dishes include Music City Hot Shrimp, a Philly Cheesesteak, Magic Wings, The Pharmacy Burger, and Disco Fries!\nOur Menu \nCheck out our menu, featuring American Classics from around the country.\nBook a Show \nContact our talent buyer.\nGear List \nSound and space specs here.",
      "hash": "4c5c1e5e8e61",
      "downloadedAt": "2026-01-19T02:12:38.381Z",
      "trimmedAt": "2026-01-19T03:28:33.385Z",
      "sizeReduction": "98.7%"
    },
    {
      "url": "http://theroyalamerican.com/menu",
      "text": "[Page Title: Menu — The Royal American]\n\nCart 0 \nScroll\n\n✯ Check out our New Menu ✯",
      "hash": "7f0b75016734",
      "downloadedAt": "2026-01-19T02:12:38.518Z",
      "trimmedAt": "2026-01-19T03:28:33.393Z",
      "sizeReduction": "99.9%"
    }
  ],
  "sizeReduction": "99.3%"
}