{
  "venueId": "ChIJa4hxAsRj_ogRFH-j6dajZIM",
  "venueName": "Five Guys",
  "venueArea": "North Charleston",
  "website": "https://restaurants.fiveguys.com/7250-rivers-ave",
  "scrapedAt": "2026-01-19T02:19:35.947Z",
  "trimmedAt": "2026-01-19T02:25:53.925Z",
  "pages": [
    {
      "url": "https://restaurants.fiveguys.com/7250-rivers-ave",
      "text": "[Page Title: Five Guys North Charleston: Cheeseburger, hot dog, fries, and milkshakes in North Charleston]\n\nSkip to content Return to Nav \nFive Guys\n® Five Guys North Charleston 11:00 AM - 10:00 PM 11:00 AM - 10:00 PM 11:00 AM - 10:00 PM 11:00 AM - 10:00 PM 11:00 AM - 10:00 PM 11:00 AM - 10:00 PM 11:00 AM - 10:00 PM Order Now Five Guys North Charleston 11:00 AM - 10:00 PM 11:00 AM - 10:00 PM 11:00 AM - 10:00 PM 11:00 AM - 10:00 PM 11:00 AM - 10:00 PM 11:00 AM - 10:00 PM 11:00 AM - 10:00 PM \nContact\n7250 Rivers Ave North Charleston , SC 29406 US \nMain Number\n\n(843) 203-6916\n(843) 203-6916 Get Directions \nHours\n\nStore Hours:\nDay of the Week Hours Monday 11:00 AM - 10:00 PM Tuesday 11:00 AM - 10:00 PM Wednesday 11:00 AM - 10:00 PM Thursday 11:00 AM - 10:00 PM Friday 11:00 AM - 10:00 PM Saturday 11:00 AM - 10:00 PM Sunday 11:00 AM - 10:00 PM \nDELIVERY HOURS\nDay of the Week Hours Monday 11:00 AM - 9:30 PM Tuesday 11:00 AM - 9:30 PM Wednesday 11:00 AM - 9:30 PM Thursday 11:00 AM - 9:30 PM Friday 11:00 AM - 9:30 PM Saturday 11:00 AM - 9:30 PM Sunday 11:00 AM - 9:30 PM Order Now \nAbout Five Guys North Charleston\n\nWelcome to your local Five Guys at 7250 Rivers Ave in North Charleston. With more than 250,000 ways to customize your burger and more than 1,000 milkshake combinations, your perfect meal is just a click away! Whether it’s using fresh ground beef (there are no freezers in our restaurants), double-cooking our fries in 100 percent peanut oil, hand-preparing fresh ingredients every morning or serving peanuts while you wait, we strive to provide the best experience each and every time you visit.\nView Menu Allergen Info Nutritional Info \nServices Available\nOutdoor Seating Delivery Takeout Dine-In \nPayment Methods\n\nAmerican Express\n\nGoogle Pay\n\nApple Pay\n\nCash\n\nDiscover\n\nMasterCard\n\nVisa\n\nFRESH OFF THE GRILL\n\nDownload the Five Guys app now\n\nFrequently Asked Questions\nDoes Five Guys offer delivery? \nMost North American locations offer delivery. The best way to find out if the location nearest to you offers delivery is to visit our website or download the app.\n\nAdditionally, we work with all major third-party delivery companies in the U.S., including DoorDash and Uber, so feel free to search for Five Guys through their platforms!\nDoes Five Guys menu items contain MSG? \nThere is no MSG added to our burgers, hot dogs, fries, seasonings or condiments. The only seasonings offered in our restaurants are salt and Cajun seasoning.\nIs the Five Guys veggie sandwich a veggie patty? \nOur veggie sandwich is not a veggie burger, but truthfully, it can be a mix of whatever you'd like. Choose any combination of our condiments and add cheese for an additional cost.\n\nOur standard veggie is a mix of peppers, onions and mushrooms with or without cheese.\nWhat is the best way to reheat leftover fries? \nLeftover fries are excellent reheated in the oven (or Air Fryer). According to Chad Murrell, one of the Five Guys, just pop them in a 350-degree oven for about 10-15 minutes.\n\nAlso, give those leftover fries a try as hash browns, home fries, or even as the filling in an omelet.\nHow many restaurants does Five Guys have? \nWe have more than 1,800 locations in over 26 countries! Most of our restaurants are located in North America.\n\nContact Us\n\nFive Guys Facts\n\nBurger Anatomy 101\n\nFive Guys burgers are hand formed in house and freshly prepared on a flat top grill. Buns are baked fresh with a secret recipe (of real ingredients) and warmed on a dedicated grill for the ideal toast. Choose as many toppings as you want!\nFind Out More \nIt's Fry-Day\n\nOur boardwalk-style fries are made to order each and every time. Cut fresh each morning by our amazing crew members, these are the same potatoes you see stacked in every one of our locations. Choose between Five Guys Style or Cajun, if you want to add some spice to your meal.\nLearn More \nShake It Up\n\nFive Guys introduced milkshakes in 2014 after years of saying no, and, boy, are we glad we did. With the ability to customize your shake, just like you can customize your burger, we think this is the one for us and hopefully for you! With 11 mix-in options, including Oreo cookie pieces, peanut butter, real strawberries and bacon (!), what will be your go-to combination?\nFind Out More $ Burger \nHandcrafted Opportunities for You\n\nAt Five Guys, we’re passionate about the food we serve, who we are as a company, and how we work as a team. We also love to have fun (hence the in-store tunes). Ready to join our family?\nJoin Our Team \nFive Guys Restaurants Nearby\nFive Guys Centre Point 11:00 AM - 10:00 PM 11:00 AM - 10:00 PM 11:00 AM - 10:00 PM 11:00 AM - 10:00 PM 11:00 AM - 10:00 PM 11:00 AM - 10:00 PM 11:00 AM - 10:00 PM 4959 Centre Point Drive North Charleston , SC 29418 US \n4.38 mi\nto your search Get Directions Visit Store Website Five Guys Goose Creek 10:30 AM - 10:00 PM 10:30 AM - 10:00 PM 10:30 AM - 10:00 PM 10:30 AM - 10:00 PM 10:30 AM - 10:00 PM 10:30 AM - 10:00 PM 10:30 AM - 10:00 PM 2820 North Main Street Suite G Summerville , SC 29486 US \n9.59 mi\nto your search Get Directions Visit Store Website Five Guys North Main Market 10:30 AM - 10:00 PM 10:30 AM - 10:00 PM 10:30 AM - 10:00 PM 10:30 AM - 10:00 PM 10:30 AM - 10:00 PM 10:30 AM - 10:00 PM 10:30 AM - 10:00 PM 1209 N. Main Street Summerville , SC 29483 US \n9.90 mi\nto your search Get Directions Visit Store Website Terms & Conditions Privacy Policy Your Privacy Choices \n© 2025 Five Guys",
      "hash": "4ccc6ef1a674",
      "downloadedAt": "2026-01-19T02:14:17.551Z",
      "trimmedAt": "2026-01-19T02:25:53.915Z",
      "sizeReduction": "98.1%"
    },
    {
      "url": "https://restaurants.fiveguys.com/index.html",
      "text": "[Page Title: All Five Guys Locations Restaurants in the United States]\n\nSkip to content Return to Nav All Five Guys Restaurants ® in the United States \nSearch by city, town or postcode\nCity, State/Provice, Zip or City & Country Submit a search. Use my Location \nAll Five Guys Restaurants\nAlabama Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington DC West Virginia Wisconsin Wyoming Terms & Conditions Privacy Policy Your Privacy Choices \n© 2025 Five Guys",
      "hash": "ef7b63c5c3d6",
      "downloadedAt": "2026-01-19T02:14:17.617Z",
      "trimmedAt": "2026-01-19T02:25:53.925Z",
      "sizeReduction": "99.4%"
    }
  ],
  "sizeReduction": "98.5%"
}