{
  "venueId": "ChIJbWioUQB9_ogR0q66VxfkjWg",
  "venueName": "EGY Dough",
  "venueArea": "West Ashley",
  "website": "https://www.the-egy-dough.com/",
  "scrapedAt": "2026-01-18T17:04:28.100Z",
  "trimmedAt": "2026-01-18T17:11:15.235Z",
  "pages": [
    {
      "url": "https://www.the-egy-dough.com/#menu",
      "text": "Skip to the main content Skip to the visit us section Skip to the footer Delicious Egyptian Pies and More... Experience the taste of Egypt with our authentic pies, mouthwatering pizzas, oriental desserts, and refreshing fresh juices. Visit us at 2578 Ashley River Rd, Suite I, Charleston. See Menu Order Online Now! Order your favorite Egyptian pies, pizzas, and oriental desserts online for a quick and convenient meal. Simply browse our menu, select your items, and enjoy the flavors of Egypt from the comfort of your own home! order now!!! Lunch & Dinner All Sandwiches wraps Egyptian Specials Large Pies Pie Roll Pies Pizza Dessert Pies Fresh Juice Desserts Fridge Hot Drinks Iced Coffee Appetizers and sauces Kids meals Mediterranean Grill Salads Sandwiches wraps Egyptian Specials Hawawshi Hawashi is here, Try the Egyptian Bread stuffed with meats for an authentic unforgettable taste ! $9.99 Lentil Soup Taste the Egyptian Lentil soup, makes your heart cozy and warm. $6.99 Large Pies Enjoy our large Egyptian pies, packed with savory fillings and bold flavors! (Large) Roman Cheese Pie A larger version of the classic, creamy Roman cheese and vegetable pie, perfect for sharing. $26.99 (Large) Mozzarella Pie Extra mozzarella and veggies for a cheesy delight that satisfies bigger cravings. $26.99 (Large) Mixed Cheese Pie Roman and mozzarella cheeses with veggies, all in a larger, shareable size for cheese lovers. $30.99 (Large) Pastrami Pie Generous portions of pastrami, cheeses, and veggies, ideal for meat and cheese fans. $30.99 (Large) Sausage Pie Packed with sausage, mozzarella, Roman cheese, and veggies for a heartier, larger treat. $30.99 (Large) Salami Pie Bold salami, Roman cheese, mozzarella, and vegetables in a large pie for rich, robust flavor. $30.99 (Large) Minced Meat Pie Juicy minced meat with cheeses and veggies for a savory, filling experience. $30.99 (Large) Chicken Shawarma Pie Marinated chicken shawarma with cheeses and veggies, offering a taste of the Mediterranean in a larger portion. $28.99 (Large) Beef Shawarma Pie Juicy beef shawarma with cheeses and veggies, perfect for those seeking rich, meaty flavors. $30.99 (Large) Mixed Shawarma Pie A blend of beef and chicken shawarma with cheeses and veggies in a shareable size. $34.99 (Large) Mixed Meat Pie Sausage, salami, and pastrami with cheeses and veggies, ideal for meat enthusiasts. $34.99 (Large) Seafood Pie Shrimp, tuna, and calamari with cheeses and veggies for a satisfying taste of the sea. $30.99 (Large) Mushroom Pie A generous portion of fresh mushrooms, cheeses, and veggies, perfect for mushroom lovers. $24.99 (Large) Egy Dough Pie A signature specialty pie with Egy Dough’s unique mix of cheese, and meat for a true Egyptian experience. $35.99 (Large) Deli Delight Pie $32.99 Pie Enjoy Egyptian pies with savory fillings like shawarma and spiced meats! Egy Dough Pie A signature specialty pie with a mix of cheese, and mix meat, capturing authentic Egy Dough flavors. $20.99 Mixed Cheese Pie A rich duo of Roman and mozzarella cheeses with veggies, perfect for cheese enthusiasts. $16.99 Chicken Shawarma Pie Chicken shawarma paired with mozzarella, Roman cheese, and veggies for a Mediterranean touch. $16.99 Roman Cheese Pie A creamy blend of Roman cheese and fresh vegetables, perfect for classic taste lovers. $15.99 Mozzarella Pie Smooth mozzarella with mixed veggies, delivering an authentic, cheesy delight. $15.99 Pastrami Pie Savory pastrami paired with Roman cheese, mozzarella, and veggies for a flavorful treat. $16.99 Sausage Pie A hearty combination of sausage, mozzarella, Roman cheese, and fresh veggies. $16.99 Salami Pie Bold salami, Roman cheese, and mozzarella meet vegetables for a robust flavor. $16.99 Minced Meat Pie Ground meat, cheeses, and vegetables for a satisfying and savory experience. $16.99 Beef Shawarma Pie Juicy beef shawarma with cheeses and vegetables, bringing rich flavors. $17.99 Mixed Shawarma Pie A perfect blend of beef and chicken shawarma with cheeses and veggies. $18.99 Mixed Meat Pie A mix of sausage, minced meat, and pastrami with cheeses and veggies, ideal for meat lovers. $18.99 Seafood Pie Shrimp, tuna, and calamari with mozzarella, Roman cheese, and veggies for a taste of the sea. $17.99 Mushroom Pie Fresh mushrooms with a blend of cheeses and vegetables, a must for mushroom lovers. $14.99 Roll Pies Try our Egyptian roll pies, filled with spiced meats or veggies in a flaky, golden crust! (Roll) Roman Cheese Pie Creamy Roman cheese and fresh vegetables wrapped into a handheld, crispy roll. $13.99 (Roll) Mozzarella Pie Smooth mozzarella with mixed veggies, wrapped up for easy enjoyment. $13.99 (Roll) Mixed Cheese Pie A cheesy delight with Roman and mozzarella cheeses and fresh veggies. $14.99 (Roll) Pastrami Bold pastrami combined with Roman cheese, mozzarella, and veggies in a convenient roll. $14.99 (Roll) Sausage Pie A satisfying sausage, mozzarella, Roman cheese, and veggie roll for hearty flavor. $14.99 (Roll) Salami Pie Savory salami with Roman cheese, mozzarella, and veggies in a crispy wrap. $14.99 (Roll) Minced Meat Pie Ground meat, cheeses, and veggies in a flavorful, easy-to-eat roll. $14.99 (Roll) Chicken Shawarma Pie Marinated chicken shawarma with mozzarella, Roman cheese, and veggies in a roll. $14.99 (Roll) Beef Shawarma Pie Juicy beef shawarma with cheeses and veggies for a handheld treat. $15.99 (Roll) Mixed Shawarma Pie A fusion of beef and chicken shawarma with cheeses and veggies in a roll. $16.99 (Roll) Mixed Meat Pie A meaty blend of sausage, salami, and pastrami with cheeses and veggies. $16.99 (Roll) Seafood Pie Shrimp, tuna, and calamari with cheeses and veggies for a fresh, ocean-inspired roll. $15.99 (Roll) Mushroom Pie Earthy mushrooms, cheeses, and vegetables, all wrapped up for a satisfying bite. $12.99 (Roll) Egy Dough Pie A unique roll featuring Egy Dough’s signature mix of cheese, and meat. $18.99 (Roll) Deli Delight Pie $15.99 Pizza Authentic Egyptian pizzas topped with shawarma, meats, and fresh veggies! Roman Cheese Pizza Creamy Roman cheese and fresh veggies on a large, crispy crust for classic pizza lovers. $12.99 Mozarella Pizza Smooth mozzarella with mixed veggies, creating a cheesy pizza everyone can enjoy. $12.99 Mixed Cheese Pizza A delightful blend of Roman and mozzarella cheeses with veggies, perfect for a crowd. $14.99 Pastrami Pizza Flavorful pastrami, Roman cheese, mozzarella, and veggies on a larger crust for meat fans. $14.99 Sausage Pizza A filling pizza with sausage, mozzarella, Roman cheese, and vegetables, ideal for hearty appetites. $14.99 Salami Pizza Bold salami, Roman cheese, mozzarella, and fresh veggies for a larger, savory experience. $14.99 Minced Meat Pizza A satisfying pizza with minced meat, cheeses, and veggies to fill you up. $13.99 Chicken Shawarma Pizza Marinated chicken shawarma with cheeses and veggies on a crispy crust for Mediterranean flavor. $13.99 Beef Shawarma Pizza Juicy beef shawarma with cheeses and veggies on a large crust, perfect for sharing. $14.99 Mixed Shawarma Pizza A fusion of beef and chicken shawarma with cheeses and veggies in a big pizza. $14.99 Mixed Meat Pizza Sausage, salami, and pastrami with cheeses and veggies for a meat-packed large pizza. $14.99 Seafood Pizza Shrimp, tuna, and calamari with cheeses and veggies for a fresh, ocean-inspired pizza. $16.99 Mushroom Pizza Fresh mushrooms with a blend of cheeses and vegetables on a large crust. $11.99 Dessert Pies Indulge in sweet Egyptian dessert pies with Nutella, honey, or pistachio Lotus Pie Filled with Lotus spread, custard, and milk cream, offering a creamy, spiced dessert. $15.99 Lotus Pistachio Pie A blend of Lotus spread, pistachios, custard, and milk cream for a sweet, nutty flavor. $16.99 Lotus Hazelnut Pie Lotus spread combined with hazelnuts, custard, and milk cream for a rich and indulgent treat. $16.99 Sugar Pie A simple, sweet pie made with sugar, coconut, custard, and milk cream. $10.99 Sugar Fatafet Pie Crunchy coconut and sugar, layered with custard and milk cream for a satisfying, sweet bite. $15.99 Custard Pie Classic custard pie made with sugar, coconut, custard, and milk cream for creamy goodness. $12.99 Raisins Coconut Pie Sweet coconut and raisins, with a blend of sugar, custard, and milk cream for a tropical twist. $14.99 Nutella Pie Rich Nutella with custard and milk cream, creating a chocolatey, creamy dessert. $14.99 Nutella Hazelnut Pie Nutella paired with hazelnuts, custard, and milk cream for hazelnut lovers. $16.99 Nutella Pistachio Pie A fusion of Nutella, pistachios, custard, and milk cream for a unique, nutty chocolate treat. $16.99 Apple Pie Sweet apple with custard, sugar, and milk cream for a tropical-inspired dessert. $13.99 Banana Pie A fruity mix with Banana, custard, sugar, and milk cream for a fresh dessert. $12.99 Mixed Fruits Pie A vibrant pie with apple, banana, strawberry, pineapple, custard, sugar, and milk cream for a fresh fruit medley. $15.99 Alexandria Sweet Pie A unique dessert pie combining the sweetness of custard, spread, powdered sugar, hazelnut, and milk cream soaked in milk with crunchy pistachios, creating a luxurious, nutty experience inspired by Alexandria’s rich flavors. $17.99 EGY Dough Sweet Pie A signature dessert with a blend of Nutella and fresh bananas, topped with strawberries and a drizzle of milk cream. This decadent treat embodies the sweetness of Egypt in every bite. $18.99 (Kunafa) Dubai Lotus $19.99 (Kunafa) Dubai Nutella Pie $19.99 (Kunafa) Dubai Pistachio Pie $22.99 Fresh Juice Refreshing Egyptian juices in flavors like lemon mint, pineapple, and watermelon! Banana w/Milk (16 oz) Creamy and naturally sweet, this blend of ripe bananas and milk is a satisfying treat. $6.49 Lemon (16 oz) Creamy and naturally sweet, this blend of ripe bananas and milk is a satisfying treat. $6.99 Orange (16 oz) Sweet and tangy, our freshly squeezed orange juice is sunshine in a glass. $7.99 Strawberry (16 oz) Made with juicy, ripe strawberries, this classic favorite is a crowd-pleaser. $6.99 Strawberry Banana (16 oz) A harmonious blend of strawberries and bananas, perfectly balanced for a deliciously fruity experience. $6.99 Strawberry Bannana w/Milk Add a creamy twist to the classic combo with fresh milk, making this drink irresistibly smooth. $7.49 Strawberry w/Milk (16 oz) Sweet strawberries and milk come together for a rich, creamy indulgence. $7.49 Watermelon (16 oz) Light, sweet, and hydrating, this watermelon juice is summer in a cup. $6.49 Dates W/Milk (16 oz) A rich and nourishing blend of sweet dates and creamy milk for a traditional Egyptian delight. $6.99 Pineapple (16 oz) Tropical and refreshing, our pineapple juice is pure paradise. $6.49 Desserts Indulge in classic Egyptian desserts like Om Ali, rice pudding, and basbousa! Om Ali Taste the oriental flakes baked in milk, and topped with nuts. $8.49 Baklava Flaky layers of pastry, nuts, and sweet syrup in a timeless treat. $4.99 Fridge Select a refrigerated drink of choice, to enjoy the best of your meal ! Soda A Soda of choice coke/sprite/etc.. (choice depends on availability) $2.99 Water Keep hydrated and get a chilled water bottle. $2.99 Ayran Your favorite yogurt drink ! $3.99 Small Soda A small soda Can/Bottle of choice coke/sprite/etc.. (choice depends on availability) $1.99 Hot Drinks Tea A calming brew with a delicate, refreshing flavor to soothe your senses. $1.99 Latte Velvety steamed milk and rich espresso combined for a warm, creamy indulgence. $3.99 Tea w/Milk A comforting blend of bold tea and creamy milk, perfect for cozy moments. $2.49 Turkish Coffee Authentically brewed, this bold and aromatic coffee delivers an unforgettable experience. $3.49 Green Tea A calming brew with a delicate, refreshing flavor to soothe your senses. $1.99 Iced Coffee Caramel Latte A chilled, creamy delight with a luscious swirl of caramel in every sip. $4.49 Iced Latte Smooth espresso meets frosty milk for a refreshing, energizing treat. $3.99 Appetizers and sauces Falafel 6 pieces $6.99 Grape leaves 6 pieces $6.99 Large fries $6.99 Small fries $4.99 Kids meals Mediterranean Grill Salads Our Gallery About Us At Egy Dough, we specialize in serving authentic Egyptian pies, mouthwatering pizzas, and delightful oriental desserts. Our mission is to bring the taste of Egypt to Charleston by using only fresh ingredients and traditional recipes passed down through generations. Discover Authentic Egyptian Cuisine Embark on a culinary journey to Egypt at Egy Dough. From savory pies filled with aromatic spices to cheesy pizzas bursting with flavors, every dish is crafted with love and authenticity. Visit Us 2578 ASHLEY RIVER RD, CHARLESTON, SC 29414, US SUITE I Phone: +1(843)225-4690 Email us: [email protected] Monday 7:00 AM-10:00 PM (Breakfast ONLY till 11 AM) Tuesday 7:00 AM-10:00 PM (Breakfast ONLY till 11 AM) Wednesday 7:00 AM-10:00 PM (Breakfast ONLY till 11 AM) Thursday 7:00 AM-10:00 PM (Breakfast ONLY till 11 AM) Friday 7:00 AM-11:00 PM (Breakfast ONLY till 11 AM) Saturday 7:00 AM-11:00 PM (Breakfast ONLY till 11 AM) Sunday 7:00 AM-10:00 PM (Breakfast ONLY till 11 AM) Menu Order Now 2026 Powered by SkyTab",
      "hash": "2b284023c563",
      "downloadedAt": "2026-01-18T17:02:23.975Z",
      "trimmedAt": "2026-01-18T17:11:15.180Z",
      "sizeReduction": "95.9%"
    },
    {
      "url": "https://www.the-egy-dough.com/",
      "text": "Skip to the main content Skip to the visit us section Skip to the footer Delicious Egyptian Pies and More... Experience the taste of Egypt with our authentic pies, mouthwatering pizzas, oriental desserts, and refreshing fresh juices. Visit us at 2578 Ashley River Rd, Suite I, Charleston. See Menu Order Online Now! Order your favorite Egyptian pies, pizzas, and oriental desserts online for a quick and convenient meal. Simply browse our menu, select your items, and enjoy the flavors of Egypt from the comfort of your own home! order now!!! Lunch & Dinner All Sandwiches wraps Egyptian Specials Large Pies Pie Roll Pies Pizza Dessert Pies Fresh Juice Desserts Fridge Hot Drinks Iced Coffee Appetizers and sauces Kids meals Mediterranean Grill Salads Sandwiches wraps Egyptian Specials Hawawshi Hawashi is here, Try the Egyptian Bread stuffed with meats for an authentic unforgettable taste ! $9.99 Lentil Soup Taste the Egyptian Lentil soup, makes your heart cozy and warm. $6.99 Large Pies Enjoy our large Egyptian pies, packed with savory fillings and bold flavors! (Large) Roman Cheese Pie A larger version of the classic, creamy Roman cheese and vegetable pie, perfect for sharing. $26.99 (Large) Mozzarella Pie Extra mozzarella and veggies for a cheesy delight that satisfies bigger cravings. $26.99 (Large) Mixed Cheese Pie Roman and mozzarella cheeses with veggies, all in a larger, shareable size for cheese lovers. $30.99 (Large) Pastrami Pie Generous portions of pastrami, cheeses, and veggies, ideal for meat and cheese fans. $30.99 (Large) Sausage Pie Packed with sausage, mozzarella, Roman cheese, and veggies for a heartier, larger treat. $30.99 (Large) Salami Pie Bold salami, Roman cheese, mozzarella, and vegetables in a large pie for rich, robust flavor. $30.99 (Large) Minced Meat Pie Juicy minced meat with cheeses and veggies for a savory, filling experience. $30.99 (Large) Chicken Shawarma Pie Marinated chicken shawarma with cheeses and veggies, offering a taste of the Mediterranean in a larger portion. $28.99 (Large) Beef Shawarma Pie Juicy beef shawarma with cheeses and veggies, perfect for those seeking rich, meaty flavors. $30.99 (Large) Mixed Shawarma Pie A blend of beef and chicken shawarma with cheeses and veggies in a shareable size. $34.99 (Large) Mixed Meat Pie Sausage, salami, and pastrami with cheeses and veggies, ideal for meat enthusiasts. $34.99 (Large) Seafood Pie Shrimp, tuna, and calamari with cheeses and veggies for a satisfying taste of the sea. $30.99 (Large) Mushroom Pie A generous portion of fresh mushrooms, cheeses, and veggies, perfect for mushroom lovers. $24.99 (Large) Egy Dough Pie A signature specialty pie with Egy Dough’s unique mix of cheese, and meat for a true Egyptian experience. $35.99 (Large) Deli Delight Pie $32.99 Pie Enjoy Egyptian pies with savory fillings like shawarma and spiced meats! Egy Dough Pie A signature specialty pie with a mix of cheese, and mix meat, capturing authentic Egy Dough flavors. $20.99 Mixed Cheese Pie A rich duo of Roman and mozzarella cheeses with veggies, perfect for cheese enthusiasts. $16.99 Chicken Shawarma Pie Chicken shawarma paired with mozzarella, Roman cheese, and veggies for a Mediterranean touch. $16.99 Roman Cheese Pie A creamy blend of Roman cheese and fresh vegetables, perfect for classic taste lovers. $15.99 Mozzarella Pie Smooth mozzarella with mixed veggies, delivering an authentic, cheesy delight. $15.99 Pastrami Pie Savory pastrami paired with Roman cheese, mozzarella, and veggies for a flavorful treat. $16.99 Sausage Pie A hearty combination of sausage, mozzarella, Roman cheese, and fresh veggies. $16.99 Salami Pie Bold salami, Roman cheese, and mozzarella meet vegetables for a robust flavor. $16.99 Minced Meat Pie Ground meat, cheeses, and vegetables for a satisfying and savory experience. $16.99 Beef Shawarma Pie Juicy beef shawarma with cheeses and vegetables, bringing rich flavors. $17.99 Mixed Shawarma Pie A perfect blend of beef and chicken shawarma with cheeses and veggies. $18.99 Mixed Meat Pie A mix of sausage, minced meat, and pastrami with cheeses and veggies, ideal for meat lovers. $18.99 Seafood Pie Shrimp, tuna, and calamari with mozzarella, Roman cheese, and veggies for a taste of the sea. $17.99 Mushroom Pie Fresh mushrooms with a blend of cheeses and vegetables, a must for mushroom lovers. $14.99 Roll Pies Try our Egyptian roll pies, filled with spiced meats or veggies in a flaky, golden crust! (Roll) Roman Cheese Pie Creamy Roman cheese and fresh vegetables wrapped into a handheld, crispy roll. $13.99 (Roll) Mozzarella Pie Smooth mozzarella with mixed veggies, wrapped up for easy enjoyment. $13.99 (Roll) Mixed Cheese Pie A cheesy delight with Roman and mozzarella cheeses and fresh veggies. $14.99 (Roll) Pastrami Bold pastrami combined with Roman cheese, mozzarella, and veggies in a convenient roll. $14.99 (Roll) Sausage Pie A satisfying sausage, mozzarella, Roman cheese, and veggie roll for hearty flavor. $14.99 (Roll) Salami Pie Savory salami with Roman cheese, mozzarella, and veggies in a crispy wrap. $14.99 (Roll) Minced Meat Pie Ground meat, cheeses, and veggies in a flavorful, easy-to-eat roll. $14.99 (Roll) Chicken Shawarma Pie Marinated chicken shawarma with mozzarella, Roman cheese, and veggies in a roll. $14.99 (Roll) Beef Shawarma Pie Juicy beef shawarma with cheeses and veggies for a handheld treat. $15.99 (Roll) Mixed Shawarma Pie A fusion of beef and chicken shawarma with cheeses and veggies in a roll. $16.99 (Roll) Mixed Meat Pie A meaty blend of sausage, salami, and pastrami with cheeses and veggies. $16.99 (Roll) Seafood Pie Shrimp, tuna, and calamari with cheeses and veggies for a fresh, ocean-inspired roll. $15.99 (Roll) Mushroom Pie Earthy mushrooms, cheeses, and vegetables, all wrapped up for a satisfying bite. $12.99 (Roll) Egy Dough Pie A unique roll featuring Egy Dough’s signature mix of cheese, and meat. $18.99 (Roll) Deli Delight Pie $15.99 Pizza Authentic Egyptian pizzas topped with shawarma, meats, and fresh veggies! Roman Cheese Pizza Creamy Roman cheese and fresh veggies on a large, crispy crust for classic pizza lovers. $12.99 Mozarella Pizza Smooth mozzarella with mixed veggies, creating a cheesy pizza everyone can enjoy. $12.99 Mixed Cheese Pizza A delightful blend of Roman and mozzarella cheeses with veggies, perfect for a crowd. $14.99 Pastrami Pizza Flavorful pastrami, Roman cheese, mozzarella, and veggies on a larger crust for meat fans. $14.99 Sausage Pizza A filling pizza with sausage, mozzarella, Roman cheese, and vegetables, ideal for hearty appetites. $14.99 Salami Pizza Bold salami, Roman cheese, mozzarella, and fresh veggies for a larger, savory experience. $14.99 Minced Meat Pizza A satisfying pizza with minced meat, cheeses, and veggies to fill you up. $13.99 Chicken Shawarma Pizza Marinated chicken shawarma with cheeses and veggies on a crispy crust for Mediterranean flavor. $13.99 Beef Shawarma Pizza Juicy beef shawarma with cheeses and veggies on a large crust, perfect for sharing. $14.99 Mixed Shawarma Pizza A fusion of beef and chicken shawarma with cheeses and veggies in a big pizza. $14.99 Mixed Meat Pizza Sausage, salami, and pastrami with cheeses and veggies for a meat-packed large pizza. $14.99 Seafood Pizza Shrimp, tuna, and calamari with cheeses and veggies for a fresh, ocean-inspired pizza. $16.99 Mushroom Pizza Fresh mushrooms with a blend of cheeses and vegetables on a large crust. $11.99 Dessert Pies Indulge in sweet Egyptian dessert pies with Nutella, honey, or pistachio Lotus Pie Filled with Lotus spread, custard, and milk cream, offering a creamy, spiced dessert. $15.99 Lotus Pistachio Pie A blend of Lotus spread, pistachios, custard, and milk cream for a sweet, nutty flavor. $16.99 Lotus Hazelnut Pie Lotus spread combined with hazelnuts, custard, and milk cream for a rich and indulgent treat. $16.99 Sugar Pie A simple, sweet pie made with sugar, coconut, custard, and milk cream. $10.99 Sugar Fatafet Pie Crunchy coconut and sugar, layered with custard and milk cream for a satisfying, sweet bite. $15.99 Custard Pie Classic custard pie made with sugar, coconut, custard, and milk cream for creamy goodness. $12.99 Raisins Coconut Pie Sweet coconut and raisins, with a blend of sugar, custard, and milk cream for a tropical twist. $14.99 Nutella Pie Rich Nutella with custard and milk cream, creating a chocolatey, creamy dessert. $14.99 Nutella Hazelnut Pie Nutella paired with hazelnuts, custard, and milk cream for hazelnut lovers. $16.99 Nutella Pistachio Pie A fusion of Nutella, pistachios, custard, and milk cream for a unique, nutty chocolate treat. $16.99 Apple Pie Sweet apple with custard, sugar, and milk cream for a tropical-inspired dessert. $13.99 Banana Pie A fruity mix with Banana, custard, sugar, and milk cream for a fresh dessert. $12.99 Mixed Fruits Pie A vibrant pie with apple, banana, strawberry, pineapple, custard, sugar, and milk cream for a fresh fruit medley. $15.99 Alexandria Sweet Pie A unique dessert pie combining the sweetness of custard, spread, powdered sugar, hazelnut, and milk cream soaked in milk with crunchy pistachios, creating a luxurious, nutty experience inspired by Alexandria’s rich flavors. $17.99 EGY Dough Sweet Pie A signature dessert with a blend of Nutella and fresh bananas, topped with strawberries and a drizzle of milk cream. This decadent treat embodies the sweetness of Egypt in every bite. $18.99 (Kunafa) Dubai Lotus $19.99 (Kunafa) Dubai Nutella Pie $19.99 (Kunafa) Dubai Pistachio Pie $22.99 Fresh Juice Refreshing Egyptian juices in flavors like lemon mint, pineapple, and watermelon! Banana w/Milk (16 oz) Creamy and naturally sweet, this blend of ripe bananas and milk is a satisfying treat. $6.49 Lemon (16 oz) Creamy and naturally sweet, this blend of ripe bananas and milk is a satisfying treat. $6.99 Orange (16 oz) Sweet and tangy, our freshly squeezed orange juice is sunshine in a glass. $7.99 Strawberry (16 oz) Made with juicy, ripe strawberries, this classic favorite is a crowd-pleaser. $6.99 Strawberry Banana (16 oz) A harmonious blend of strawberries and bananas, perfectly balanced for a deliciously fruity experience. $6.99 Strawberry Bannana w/Milk Add a creamy twist to the classic combo with fresh milk, making this drink irresistibly smooth. $7.49 Strawberry w/Milk (16 oz) Sweet strawberries and milk come together for a rich, creamy indulgence. $7.49 Watermelon (16 oz) Light, sweet, and hydrating, this watermelon juice is summer in a cup. $6.49 Dates W/Milk (16 oz) A rich and nourishing blend of sweet dates and creamy milk for a traditional Egyptian delight. $6.99 Pineapple (16 oz) Tropical and refreshing, our pineapple juice is pure paradise. $6.49 Desserts Indulge in classic Egyptian desserts like Om Ali, rice pudding, and basbousa! Om Ali Taste the oriental flakes baked in milk, and topped with nuts. $8.49 Baklava Flaky layers of pastry, nuts, and sweet syrup in a timeless treat. $4.99 Fridge Select a refrigerated drink of choice, to enjoy the best of your meal ! Soda A Soda of choice coke/sprite/etc.. (choice depends on availability) $2.99 Water Keep hydrated and get a chilled water bottle. $2.99 Ayran Your favorite yogurt drink ! $3.99 Small Soda A small soda Can/Bottle of choice coke/sprite/etc.. (choice depends on availability) $1.99 Hot Drinks Tea A calming brew with a delicate, refreshing flavor to soothe your senses. $1.99 Latte Velvety steamed milk and rich espresso combined for a warm, creamy indulgence. $3.99 Tea w/Milk A comforting blend of bold tea and creamy milk, perfect for cozy moments. $2.49 Turkish Coffee Authentically brewed, this bold and aromatic coffee delivers an unforgettable experience. $3.49 Green Tea A calming brew with a delicate, refreshing flavor to soothe your senses. $1.99 Iced Coffee Caramel Latte A chilled, creamy delight with a luscious swirl of caramel in every sip. $4.49 Iced Latte Smooth espresso meets frosty milk for a refreshing, energizing treat. $3.99 Appetizers and sauces Falafel 6 pieces $6.99 Grape leaves 6 pieces $6.99 Large fries $6.99 Small fries $4.99 Kids meals Mediterranean Grill Salads Our Gallery About Us At Egy Dough, we specialize in serving authentic Egyptian pies, mouthwatering pizzas, and delightful oriental desserts. Our mission is to bring the taste of Egypt to Charleston by using only fresh ingredients and traditional recipes passed down through generations. Discover Authentic Egyptian Cuisine Embark on a culinary journey to Egypt at Egy Dough. From savory pies filled with aromatic spices to cheesy pizzas bursting with flavors, every dish is crafted with love and authenticity. Visit Us 2578 ASHLEY RIVER RD, CHARLESTON, SC 29414, US SUITE I Phone: +1(843)225-4690 Email us: [email protected] Monday 7:00 AM-10:00 PM (Breakfast ONLY till 11 AM) Tuesday 7:00 AM-10:00 PM (Breakfast ONLY till 11 AM) Wednesday 7:00 AM-10:00 PM (Breakfast ONLY till 11 AM) Thursday 7:00 AM-10:00 PM (Breakfast ONLY till 11 AM) Friday 7:00 AM-11:00 PM (Breakfast ONLY till 11 AM) Saturday 7:00 AM-11:00 PM (Breakfast ONLY till 11 AM) Sunday 7:00 AM-10:00 PM (Breakfast ONLY till 11 AM) Menu Order Now 2026 Powered by SkyTab",
      "hash": "4428f8433562",
      "downloadedAt": "2026-01-18T17:02:23.901Z",
      "trimmedAt": "2026-01-18T17:11:15.235Z",
      "sizeReduction": "95.9%"
    }
  ],
  "sizeReduction": "95.9%"
}