{
  "venueId": "ChIJ14gaAaZz_ogRy0nQKfs-bZs",
  "venueName": "The Windjammer",
  "venueArea": "Isle of Palms",
  "website": "http://www.the-windjammer.com/",
  "scrapedAt": "2026-01-18T17:04:23.062Z",
  "trimmedAt": "2026-01-18T17:04:46.105Z",
  "pages": [
    {
      "url": "http://www.the-windjammer.com/",
      "text": "Skip to content Upcoming Events All 6PM Shows are 21Up Unless with their Parent...All shows 9PM and later are 21UP! 23 January ENTRYWAY of SC Party and Awards with High Society on the inside stage Friday, 9:00 pm 31 January Dos Gringos + Keith Hille and The Brickyard Saints sponsored by Winglore Spirits Co. to benefit the veteran nonprofit, Operation Encore: A Veteran Music Project Saturday, 7:00 pm 21 February THE YACHT CLUB on the inside stage Saturday, 9:00 pm 28 February The Piedmont Boys - on the inside stage Saturday, 8:00 pm 01 March Billy & the Goats on the inside Sunday, 11:30 am 28 March Stop Light Observations on the NÜTRL Beach Stage Saturday, 6:00 pm 29 March Braxton Keith - on the NÜTRL Beach Stage Sunday, 6:00 pm 23 April Daniel Donato's Cosmic Country on the NÜTRL Beach Stage - Thursday Thursday, 6:00 pm 24 April Daniel Donato's Cosmic Country on the NÜTRL Beach Stage - Friday Friday, 6:00 pm ALL EVENTS Need A Place To Stay? About The Windjammer Always a Jam Good Time! Located at Front Beach on the Isle of Palms, The Windjammer is Charleston's premier live music beach venue for over the last 50 years. From local bands to big name artists, guests can enjoy the best in live music. The Windjammer also offers delicious beach eats with menu items including buffalo chicken wings, cheeseburgers, fish & chips, and more. Relax and sip on a cold beer or refreshing cocktail while taking in the unbeatable beach views. The Windjammer where, it's always a JAM good time! Our Menu APPETIZERS SANDWICHES AND BURGERS FROM THE OCEAN SIDE ORDERS BEVERAGES Our Store Now you can shop T-shirts. Sweat Shirts, Hoodies, Hats, and lot of other things... SHOP NOW Download Our Mobile App For Android and IOS. Don't miss updates from us! Subscribe to our newsletter & stay updated!",
      "hash": "a243a4882e26",
      "downloadedAt": "2026-01-18T16:55:27.234Z",
      "trimmedAt": "2026-01-18T17:04:46.105Z",
      "sizeReduction": "98.2%"
    }
  ],
  "sizeReduction": "98.2%"
}