{
  "venueId": "ChIJrcHVo0Rj_ogRprBTu8Vgab8",
  "venueName": "Grand Buffet",
  "venueArea": "North Charleston",
  "website": "http://grandbuffetsc.com/",
  "scrapedAt": "2026-01-18T17:04:31.405Z",
  "trimmedAt": "2026-01-18T17:12:49.058Z",
  "pages": [
    {
      "url": "http://grandbuffetsc.com/",
      "text": "We're Open DINE-IN & TAKE OUT Now. Walk-in and all you can eat. Welcome to Grand Buffet of North Charleston Welcome to Grand Buffet of North Charleston Welcome to Grand Buffet of North Charleston Welcome to Grand Buffet of North Charleston Chinese • Seafood • Sushi • Hibachi • American | Eat-in • Take out Call for details/reservations (843) 746-9978 Welcome to Grand Buffet of North Charleston Welcome to Grand Buffet of North Charleston Welcome to Grand Buffet of North Charleston Welcome to Grand Buffet of North Charleston Chinese • Seafood • Sushi • Hibachi • American | Eat-in • Take out Call for details/reservations (843) 746-9978 Connect With Us About GRAND BUFFET Our Cuisine Our cuisine is a fusion of traditional and modern flavors, with a focus on using fresh and locally sourced ingredients. We pride ourselves on our handcrafted dishes, made with care and attention to detail. Our menu offers a variety of options, from classic comfort foods to innovative creations. Our Events We love hosting events and celebrations at GRAND BUFFET (North Charleston). From birthdays to weddings, our restaurant is the perfect venue for any occasion. We offer customized menus and can accommodate groups of all sizes. Our team is dedicated to making your event a memorable one. All You Can Eat Buffet Price List LUNCH BUFFET Monday - Saturday 11:00 am - 3:50 pm Adult $12.99 Kids $6.99 Under 9 yrs old Kids $4.99 3-4 yrs old DINNER BUFFET Monday - Thursday 3:50 pm - 9:30 pm; Friday & Saturday 3:50 pm - 10:00 pm; Sunday All Day 11:00 am 9:30 pm Adult $15.99 Monday - Saturday dinner price. Sunday all day dinner price Kids $9.99 Under 9 yrs old Kids $5.99 3-4 yrs old Special Offers Can not be combined with other discounts/offers Senior Citizens 10% Off (65+ yrs old) (Request ID) (Eat In only) Kids $2.99 2 yrs old * HOLIDAYS PRICE ARE SUBJECTED TO CHANGE WITHOUT NOTICE Take out menu available now! THE TASTE FOOD OF GRAND BUFFET GALLERY Show More Contact Us Feeback? Message us! Name* Phone* Email* Sign up for our email list for updates, promotions, and more. Send This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Get directions to Grand Buffet - local beet and largest Chinese restaurant in North Charleston We have party room for accepting wedding, group, event, baby shower or other. Ask for more details, please call us. We’re proud to serve you. (We accept Credit Cards & Cash for payment) GRAND BUFFET 4950 Centre Pointe Drive, North Charleston, South Carolina 29418, United States (843) 746-9978 Business Hours Open today 11:00 am – 09:30 pm Lunch Time: Monday - Saturday: 11:00 am - 3:50 pm Dinner Time: Monday - Thursday: 3:50 pm - 9:30 pm Friday & Saturday: 3:50 pm - 10:00 pm Sunday: 11:00 am - 9:30 pm Get directions GRAND BUFFET (North Charleston) 4950 Centre Pointe Drive, North Charleston, South Carolina 29418, United States (843) 746-9978 Copyright © 2025 GRAND BUFFET (North Charleston) - All Rights Reserved. Powered by 2025 Thanksgiving Day Announcement We’re open 11:00 am until 6 pm for Thanksgiving Day on Thursday November 27th, 2025. Come to celebrate your holiday with us. Ask for details about reservation or other details. Call us. *Happy Thabksgiving! Call for details",
      "hash": "7f2c8de31bc9",
      "downloadedAt": "2026-01-18T16:59:07.187Z",
      "trimmedAt": "2026-01-18T17:12:49.058Z",
      "sizeReduction": "98.4%"
    }
  ],
  "sizeReduction": "98.4%"
}