{
  "venueId": "ChIJex_shH97_ogRVVQ80es9svY",
  "venueName": "La Cave",
  "venueArea": "Mount Pleasant",
  "website": "https://lacavechs.com/",
  "scrapedAt": "2026-01-18T17:04:28.569Z",
  "trimmedAt": "2026-01-18T17:11:22.722Z",
  "pages": [
    {
      "url": "https://lacavechs.com/",
      "text": "Quintessential French Elegance La Cave is an intimate French dining room where a seasonal, ingredient-driven menu sets the tone, complemented by an exceptional selection of French wines, craft cocktails, and whiskies. A Taste of Provence in Charleston Seasonal French cooking and understated elegance inspired by the South of France. The Menu Private Events An elevated backdrop for rehearsal dinners, private brunches, cocktail parties, and beyond. Located right on King Street, La Cave’s European charm and curated interiors provide a retreat in the heart of downtown Charleston. Inquire Now Savor every moment in classic Provençal style Learn More",
      "hash": "6024fd145b99",
      "downloadedAt": "2026-01-18T16:56:28.545Z",
      "trimmedAt": "2026-01-18T17:11:22.705Z",
      "sizeReduction": "97.8%"
    },
    {
      "url": "https://lacavechs.com/menu/",
      "text": "Menu In the esprit de Provence, La Cave celebrates the rhythm of the seasons through the lens of Chef Alex Eaton. Each dish showcases the Lowcountry’s freshest ingredients, thoughtfully sourced from local farms and purveyors, and paired with organic French wines and garden-driven cocktails—all meant to be shared and savored at a leisurely pace. Dinner Cocktails Wines & Digestifs Petits Plats CAVIAR PROFITEROLE lemon craquelin, crème fraîche, kaluga caviar 18 OYSTERS elderberry mignonette 17 CRUDO local fish, grape/ginger consommé, apple, sumac 15 LA SALADE local lettuce, roquefort vinaigrette, poivron, capers, marcona almonds 15 CIDER GLAZED CARROTS pistachios, warm spice, espelette 9 POMMES FRITES rosemary-lemon aïoli 8 RACLETTE BURGER SLIDER double short rib-brisket patties, caramelized onion, dijonnaise, raclette, petit local bakery sesame roll 10 BOUILLABAISSE mussels, shrimp, and local fish, saffron broth, fennel, potato, grilled baguette 26 CHARRED OCTOPUS potato purée, salade mentonnaise, burnt orange, pine nuts 31 PROVENÇAL TARVIN SHRIMP saffron beurre blanc, castelvetrano olive, tarragon, micro chervil 23 FILET MIGNON TARTINE wild mushroom, fresh ricotta, hot honey, sea salt, grilled baguette 27 Plats CONFIT DUCK GNOCCHI cognac-soaked golden raisins, shaved brussels sprouts, parmesan 24 POULET ROUGE joyce farms half chicken, herbes de provence beurre blanc, roasted seasonal vegetables 35 WAGYU NY STRIP entrecôte sauce, charred broccolini, black garlic & lemon 62 POISSON whole fish, braised cabbage, herb butter, roasted vegetables, endive & carrot MKT BOEUF EN CROÛTE filet mignon, mushroom duxelles, puff pastry, prosciutto, sauce bordelaise 37 Desserts LEMON LAVENDER CRÈME BRÛLÉE 15 WARM SAINT ANGEL TARTE honey & orange soaked figs 15 GÂTEAU AU CHOCOLAT salted caramel sorbet 16",
      "hash": "6964fd67a6f3",
      "downloadedAt": "2026-01-18T16:56:28.617Z",
      "trimmedAt": "2026-01-18T17:11:22.710Z",
      "sizeReduction": "94.5%"
    },
    {
      "url": "https://lacavechs.com/private-events/",
      "text": "Private Events Private Events Inspired by the light-soaked villas of the South of France, La Cave provides an elevated backdrop for rehearsal dinners, private brunches, cocktail parties, and beyond. With cozy banquettes and antique mirrors, the lounge evokes classic Provençal style with natural wood finishes, curved light stone walls, organic lavender accents, and olive trees for added charm. Inquire The Space Featuring a semi-private room surrounded by flowing drapery and full bar, the space is available for partial or full buyouts. Capacity Semi-private: Up to 14 guests Full Buyout: Up to 35 guests seated or 80 standing Food & Beverage Menus are fully customizable, pulling options from La Cave’s French-inspired offerings, such as caviar profiteroles, filet tartine, and oysters on the half shell, or create your own with the help of our chef and events team. Inquire Inquire below for your private event at La Cave \"\" indicates required fields * Name This field is for validation purposes and should be left unchanged. First Name * Last Name * Email * Phone * Event Details Nature of Event (e.g. Birthday Party or Business Dinner) * Event Date * MM slash DD slash YYYY Start Time * 11:00 AM 12:00 PM 1:00 PM 2:00 PM 3:00 PM 4:00 PM 5:00 PM 6:00 PM 7:00 PM 8:00 PM 9:00 PM 10:00 PM End Time * 1:00 PM 2:00 PM 3:00 PM 4:00 PM 5:00 PM 6:00 PM 7:00 PM 8:00 PM 9:00 PM 10:00 PM 11:00 PM 12:00 AM Guest Count * Is there any additional info you would like to add? How did you hear about us? This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "b1f26706a64a",
      "downloadedAt": "2026-01-18T16:56:29.469Z",
      "trimmedAt": "2026-01-18T17:11:22.722Z",
      "sizeReduction": "97.5%"
    }
  ],
  "sizeReduction": "96.8%"
}