{
  "venueId": "ChIJ4yFmBdBj_ogRrTxJrig-g8k",
  "venueName": "Candlewood Suites Charleston - Northwoods, an IHG Hotel",
  "venueArea": "North Charleston",
  "website": "https://www.ihg.com/candlewood/hotels/us/en/north-charleston/chsnc/hoteldetail?cm_mmc=GoogleMaps-_-CW-_-US-_-CHSNC",
  "scrapedAt": "2026-01-18T17:04:23.588Z",
  "trimmedAt": "2026-01-18T17:04:59.232Z",
  "pages": [
    {
      "url": "https://www.ihg.com/candlewood/hotels/us/en/north-charleston/chsnc/hoteldetail?cm_mmc=GoogleMaps-_-CW-_-US-_-CHSNC",
      "text": "Skip To main content View prices View all Candlewood Suites Charleston - Northwoods Important Announcements Spacious suites and easy access to Charleston Welcome to the . We are recently fully renovated and are 100% Nonsmoking. Our hotel's location places you just minutes from and the . This offers in every spacious suite. This offers as well Candlewood Suites in North Charleston historic downtown Charleston Charleston International Airport extended stay Charleston hotel clean, safe and fully equipped kitchens Charleston long term stay hotel expanded truck parking If you are visiting Charleston for leisure, historic Charleston is just a short drive from our hotel. In Charleston, you can visit a plantation, take a tour of , or relax on one of South Carolina's beautiful beaches. Fort Sumter or the USS Yorktown Those in town for business will enjoy our hotel's ideal location near I-26 and just minutes from the new . Our hotel also provides convenient access to . Volvo Plant, Charleston Convention Center, Charleston Air Force Base, Naval Weapons Station, Boeing, Google and SPAWAR Trident Technical College, Charleston Southern University, the College of Charleston and MUSC Whether you stay for one night or an , we are ready to serve you. Our suites include fully equipped kitchens and the Candlewood Cupboard, our 24-hour convenience store, located in the lobby with a variety of items at great values. Our property also offers free laundry facilities to all guests. extended stay Fitness center Full kitchen On-site parking Pet-Friendly Smoke-free hotel Wi-fi Market Laundry facilities Complimentary coffee Fitness center Full kitchen On-site parking Pet-Friendly Smoke-free hotel Wi-fi Market Laundry facilities Complimentary coffee Explore all amenities Accommodations One Bedroom Suite Book Now Studio Suite Book Now One Bedroom Suite Book Now Studio Suite Book Now Reservations: Front desk: 1-843-7973535 Email: mnolan@candlewoodsuitesncharleston.com 2177 Northwoods Blvd. North Charleston, South Carolina 29406 United States Parking and transportation details : 4:00 PM Check-in : 11:00 AM Check-out : 21 Minimum check-in age Equipped Kitchens Unload your groceries and cook a great meal in a fully-equipped kitchen. Specialty kitchen appliances available to borrow at the front desk. Fitness Center Enjoy all day access to dumbbells, cardio machines, and stretching areas so you can stick to your exercise routine. Laundry Facilities Laundry facilites are open 24 hours a day with room key access. There is no charge for use of laundry machines. Weekly Housekeeping We perform one full service cleaning weekly. Pet Friendly Pets allowed with nonrefundable fee of 50.00 per day per pet up to 300.00 per stay. Max 2 pets each pet must weigh less than 60 lbs. Pet agreement must be signed at check in. Call hotel for details. Pets must be up to date on all vaccinations Explore Candlewood Suites Charleston - Northwoods Sleep well, rest easy View accommodations Make the most of your stay View amenities Take a look View photos Sleep well, rest easy View suites Make the most of your stay View amenities Take a look View photos Hotel packages available Prices shown reflect an average per night stay from View all offers View All Offers View in other languages English English (GB) 日本語 Deutsch 繁體中文 Español 中文 Français Español (España) Italiano Nederlands Русский Português 한국어 ไทย العربية Português (BR) Bahasa Indonesia Türkçe Polski Tiếng Việt",
      "hash": "6d041abe5bc9",
      "downloadedAt": "2026-01-18T16:58:17.221Z",
      "trimmedAt": "2026-01-18T17:04:59.210Z",
      "sizeReduction": "98.5%"
    },
    {
      "url": "https://www.ihg.com/candlewood/hotels/us/en/north-charleston/chsnc/hoteldetail/hotel-packages",
      "text": "Skip To main content View prices Candlewood Suites Charleston - Northwoods Offers Save on your hotel stay with these exclusive Candlewood Suites Charleston - Northwoods deals. Hotel packages available Prices shown reflect an average per night stay from VIEW ALL PACKAGES View in other languages English English (GB) 日本語 Deutsch 繁體中文 Español 中文 Français Español (España) Italiano Nederlands Русский Português 한국어 ไทย العربية Português (BR) Bahasa Indonesia Türkçe Polski Tiếng Việt",
      "hash": "9be46d524fa5",
      "downloadedAt": "2026-01-18T16:58:17.369Z",
      "trimmedAt": "2026-01-18T17:04:59.232Z",
      "sizeReduction": "99.6%"
    }
  ],
  "sizeReduction": "98.8%"
}