{
  "venueId": "ChIJLfcYdFNw_ogR0xZ7Y1LEzYE",
  "venueName": "Wood & Grain",
  "venueArea": "Mount Pleasant",
  "website": "http://www.owensdininggroup.com/woodandgrainmtp/",
  "scrapedAt": "2026-01-18T17:04:25.493Z",
  "trimmedAt": "2026-01-18T17:07:12.811Z",
  "pages": [
    {
      "url": "http://www.owensdininggroup.com/woodandgrainmtp/wine-cocktail-list/",
      "text": "MENU DINNER MENU COCKTAIL & WINE LIST PDF COCKTAILS OLD FASHIONED Rye, House Cocktail Syrup, Angostura Bitters 13 BEE'S KNEES London Dry Gin, Honey Syrup, Lemon 13 PALOMA Blanco Tequila, Grapefruit, Lime, Grapefruit Soda, Salt 12 WOOD & GRAIN MANHATTAN Bourbon, Carpano Antica Formula, Angostura Bitters 13 NEGRONI Hat Trick Gin, Carpano Antica Formula, Campari 13 PASSION FRUIT MARGARITA Blanco Tequila, agave, Lime, Passion Fruit, Salt 12 WINE WHITE Marques de Caceres Brut Cava NV, Spain 11/43 Benvolio Prosecco, Italy 9/35 Mirabelle Brut Rosè, N. Coast 15/59 Dipinti Pinot Grigio, Italy 10/39 Whitehaven Sauvignon Blanc, New Zealand 13/51 Patient Cottat Sauvignon Blanc, France 12/47 Martin Codax Albariño, Spain 12/47 Fleur de Mer Rosé, France 13/51 Sonoma-Cutrer Chardonnay, Sonoma 14/55 Allegrini Lugana, Italy 13/49 Domaine Delaporte Sancerre, France 75 Charles Heidsieck Brut Reserve, France 100 Far Niente Chardonnay, California 100 RED Evolution Pinot Noir, Willamette Valley 17/67 Belle Glos “Las Alturas” Pinot Noir, California 19/70 Renato Ratti Ochetti Nebbiolo Lange, Italy 16/63 Umani Ronchi Montepuliciano, Italy 11/43 Melipal Malbec, Mendoza 13/51 Robert Hall Cabernet, California 13/51 Sexual Chocolate, Napa 15/59 Merry Edwards Pinot Noir, Russian River 124 Honig Cabernet Sauvignon, Napa 85 Arceno Strada Al Sasso, Chianti Classico Reserva, Italy 95 Orin Swift Papillon, Napa 130 Nickel & Nickel Cabernet Sauvignon, Napa 189 BEER DRAFT Munkle Pilsner 7 Freehouse Premium Lager 7 Westbrook White Thai 7 Wild Leap Chance IPA 8 Rotating Seasonal Rotating IPA BOTTLES & CANS Avery Ellie’s Brown 6 Coast Hop Art IPA 7 Revelry Poke the Bear Pale 7 Edmunds Oast Something Cold 9 Heineken 5 Ceebo N/A 6 Athletic N/A 5 High Rise Delta 9 THC/CBD Seltzer 11 DINE WITH US 778 South Shelmore Blvd. 102 Mt Pleasant, SC 29464 Map Our Location HOURS No Reservations Open Daily at 5pm CONTACT US 843.971.6070 Email Inquiry *not for reservations Media Inquiries E-GIFT CARDS WordPress Themes COPYRIGHT © 2026 - ALL RIGHTS RESERVED - OWENS DINING GROUP Employment Opportunities",
      "hash": "4e89ade9243f",
      "downloadedAt": "2026-01-18T16:58:07.679Z",
      "trimmedAt": "2026-01-18T17:07:12.799Z",
      "sizeReduction": "96.6%"
    },
    {
      "url": "http://www.owensdininggroup.com/woodandgrainmtp/",
      "text": "MENU DINNER MENU COCKTAIL &WINE LIST E-GIFT CARDS Founded by Chef Patrick Owens in June 2017, Wood & Grain brings a unique culinary concept, marrying wood-fired cooking with the finest seafood. This modern and inviting eatery, centered around open hearth cooking, offers hand-crafted wood fired pizzas and sophisticated seafood dishes. We pride ourselves on using the finest seasonal bounty from regional farms and purveyors. Our selection of just the freshest seafood, much of it from local waters, pairs nicely with the clean and delicate notes in our salad and vegetable dishes. We use simple Lowcountry products but give them a unique global twist to create an unexpected combination of flavors. To purchase gift cards, please . click here The modern and welcoming restaurant interior, full of textures and woods, was designed by Amy Trowman Design. The space features a lively bar area with special seating at the raw bar. The state of the art wood fired brick oven fills the room and allows for the guests to take advantage of the energy in the open kitchen. Warm cherry wood dominates the space. Chef Owens embraced the open kitchen concept and combined it with high ceiling, industrial-inspired light fixtures and community tables to achieve an immersive and more casual feel. The restaurant features artwork created by artist John Duckworth. - Stephanie Burt, Condé Nast Traveler “Chef Patrick Owens has been doing his own thing in Mount Pleasant for years—head down, spreading red sauce on a pie or wiping plates at expo at one of his other restaurants on the daily; not so much in the spotlight as spotlighting the local bounty, which is the Charleston ethos. The flavor combinations, the balance, and the execution of his dishes are consistently excellent, be them atop a disc of dough, baked into the oysters, or on a salad.” DINE WITH US 778 South Shelmore Blvd. 102 Mt Pleasant, SC 29464 Map Our Location HOURS No Reservations Open Daily at 5pm CONTACT US 843.971.6070 Email Inquiry *not for reservations Media Inquiries E-GIFT CARDS E-Gift cards are available . HERE × WordPress Themes COPYRIGHT © 2026 - ALL RIGHTS RESERVED - OWENS DINING GROUP Employment Opportunities",
      "hash": "8ddef4382be8",
      "downloadedAt": "2026-01-18T16:58:06.183Z",
      "trimmedAt": "2026-01-18T17:07:12.804Z",
      "sizeReduction": "96.8%"
    },
    {
      "url": "http://www.owensdininggroup.com/woodandgrainmtp/dinner-menu/",
      "text": "MENU DINNER MENU COCKTAIL & WINE LIST PDF FIRST Roasted octopus with romesco + butter beans 24 Roasted broccolini, house ricotta, lemon, walnuts, fresnos + country wheat toast 17 Chef’s daily cheese selection cashew toffee + seasonal jam 21 Wood-roasted oysters with maitre d’ butter + roasted pepper gremolata 4.5 each (min. of 3) Prosciutto san danielle, smoked duck ham, calabrese + spicy mustard 24 Whole milk burrata with scallion pesto, toast, smoked bacon + arugula 19 RAW BAR Daily selection of raw oysters Mkt. Warm lobster roll with brown butter, lemon aioli + chives Mkt. Chef's daily oyster preparation Mkt. *Tuna with ginger, avocado, chilies, sesame, soy + chives 28 *Salmon crudo with serrano, radish, aioli, lime salt + cilantro 24 PIZZA MARGHARITA tomato, mozzarella, basil 17 FUNGHI tomato, roasted local mushrooms, fontina, taleggio, garlic 19 BLANCO roasted garlic, ricotta, fontina, mozzarella, arugula 18 PROSCIUTTO-TOMATO spinach, mozzarella, fresh prosciutto 21 OPAL roasted garlic, smoked duck ham, goat cheese, arugula, peppers 19 BACON-GORGONZOLA roasted garlic, melted leeks, fig, mozzarella, truffle honey 21 SALSICCIA tomato, fennel sausage, kale, ricotta 22 QUAD-PIECE tomato, sausage, sopressata, pork, duck ham, fontina, mozzarella 24 SALADS Local wood-roasted mushrooms with baby kale, lemon, reggiano + thyme 16 *Romaine, roasted peppers, caesar, reggiano + bread crumbs 15 Local greens, cucumber, red onion, tomatoes, gorgonzola dolce, seeds + mustard shallot vinaigrette 14 Kale, cabbage, jícama, mint, roasted shrimp, cashews + red thai vinaigrette 19 Warm roasted seasonal vegetables with pickled baby beets + harissa yogurt 15 *Add shrimp to any salad 9 DINE WITH US 778 South Shelmore Blvd. 102 Mt Pleasant, SC 29464 Map Our Location HOURS No Reservations Open Daily at 5pm CONTACT US 843.971.6070 Email Inquiry *not for reservations Media Inquiries E-GIFT CARDS WordPress Themes COPYRIGHT © 2026 - ALL RIGHTS RESERVED - OWENS DINING GROUP Employment Opportunities",
      "hash": "ce4efcf00fd6",
      "downloadedAt": "2026-01-18T16:58:06.338Z",
      "trimmedAt": "2026-01-18T17:07:12.811Z",
      "sizeReduction": "96.6%"
    }
  ],
  "sizeReduction": "96.7%"
}