{
  "venueId": "ChIJq3aHRV59_ogRnblEmdJjvmw",
  "venueName": "Ireland's Own / Jagerhaus Pub",
  "venueArea": "West Ashley",
  "website": "https://irelandsownsc.com/",
  "scrapedAt": "2026-01-18T17:04:30.781Z",
  "trimmedAt": "2026-01-18T17:12:06.986Z",
  "pages": [
    {
      "url": "https://irelandsownsc.com/",
      "text": "× Did you know we Cater? Whatever your occasion, however big or small, we have the perfect options to choose from. Cater your birthday party, holiday party, corporate events, wedding festivities and more! Inquire on our catering page! Catering Packages NFL Playoffs - Come watch the NFL Playoffs with us! Upcoming Events NFL Playoffs - Come watch the NFL Playoffs with us! Parties & Groups - Host your next party or get together with us! Book your party Parties & Groups - Host your next party or get together with us! 3025 Ashley Town Center Drive, Charleston, SC 29414 map marker pin Ireland’s Own Ireland’s Own is truly unique Here you’ll find an authentic dining experience. From the dark wooden tables to the low stained glass lighting, you’ll feel transported to a pub in Ireland. With 12+ Irish whiskeys and a long draft list, you’ll have plenty of options to quench your thirst. Read more about us Jaegerhaus Pub Fun for the whole family Jaegerhaus Pub provides fun for the whole family. Our arcade is full of games and has classics like Pac-Man and Ski Ball. We have 2 Golf Simulators where you can play courses from all over the country like The Ocean Course at Kiawah Island or Pebble Beach. Read more about us Happy hour Specials ALL SPECIALS Fresh Eats Check out some of our fan favorites from Ireland’s Own! View Menu Catering Let Us Cater Your Next Event! Inquire Catering Dot slide navigation number 1 Dot slide navigation number 2 Dot slide navigation number 3 slideshow start stop playing Reviews review by - Yelp Moriah L: Great service, yummy food and very good drinks! Came here for my our two year anniversary and we really enjoyed it! Would definitely come back if we're in Charleston! review by - Yelp Dennis M: Great place and nice cold beer also the food is 2die4 . Been there many times and always enjoy it. The staff and management are great. review by - Yelp Gigi L: Cool place! Service is great!Sandwiches are nice for lunch.Steak and ribs are good. I love the red potato. French fries portion is huge as a side. review by - Yelp Teresa J: We had a large family party for lunch on a Friday and decided on Ireland's Own from someone's recommendation for a great place to eat... review by - Yelp Saint S: Fun place! Good food. Reasonable prices and games to play! An awesome neighborhood spot. It is absolute huge inside. Stop reviews carousel Play reviews carousel Newsletter Location 3025 Ashley Town Center Drive Charleston, SC 29414 Hours Mon-Sun: 11am-Midnight Find us on... Facebook page Instagram page Yelp page Contact us (843)-872-9488 irelandsownsc@gmail.com Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "052327f75ce9",
      "downloadedAt": "2026-01-18T17:02:38.603Z",
      "trimmedAt": "2026-01-18T17:12:06.974Z",
      "sizeReduction": "98.2%"
    },
    {
      "url": "https://irelandsownsc.com/charleston-ireland-s-own-food-menu",
      "text": "Our Menu Menu",
      "hash": "1453808a95ed",
      "downloadedAt": "2026-01-18T17:02:39.328Z",
      "trimmedAt": "2026-01-18T17:12:06.977Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "https://irelandsownsc.com/charleston-ireland-s-own-events",
      "text": "Events We are updating our events Please stay tuned",
      "hash": "21ac8fe79d66",
      "downloadedAt": "2026-01-18T17:02:41.132Z",
      "trimmedAt": "2026-01-18T17:12:06.979Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "https://irelandsownsc.com/charleston-ireland-s-own-drink-menu",
      "text": "Our Drinks We are updating our menu Please stay tuned",
      "hash": "59d99cae6b66",
      "downloadedAt": "2026-01-18T17:02:39.930Z",
      "trimmedAt": "2026-01-18T17:12:06.981Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "https://irelandsownsc.com/charleston-ireland-s-own-happy-hours-specials",
      "text": "Specials Tuesday January 20th -Chicken Broccoli Alfredo Special- Delight in our creamy Chicken Broccoli Alfredo, featuring tender grilled chicken and fresh broccoli tossed in a rich, velvety Alfredo sauce. Served over perfectly cooked fettuccine and topped with a sprinkle of Parmesan, this dish is a comforting favorite that's sure to satisfy! Enjoy this special every Tuesday! 03:00 PM - 10:00 PM",
      "hash": "95f202a11ac6",
      "downloadedAt": "2026-01-18T17:02:40.528Z",
      "trimmedAt": "2026-01-18T17:12:06.983Z",
      "sizeReduction": "99.4%"
    },
    {
      "url": "https://irelandsownsc.com/-events?source=header&spot_id=93315&destination=events&promotion=nfl_playoffs",
      "text": "Events We are updating our events Please stay tuned",
      "hash": "c2a9d66c48ad",
      "downloadedAt": "2026-01-18T17:02:38.699Z",
      "trimmedAt": "2026-01-18T17:12:06.986Z",
      "sizeReduction": "99.9%"
    }
  ],
  "sizeReduction": "99.4%"
}