{
  "venueId": "ChIJT3hfKUVj_ogRueIycgr0aDg",
  "venueName": "Chipotle Mexican Grill",
  "venueArea": "North Charleston",
  "website": "https://locations.chipotle.com/sc/north-charleston/4953-centre-pointe-dr?utm_source=google&utm_medium=yext&utm_campaign=yext_listings?restaurant=2577",
  "scrapedAt": "2026-01-18T17:04:26.605Z",
  "trimmedAt": "2026-01-18T17:08:02.345Z",
  "pages": [
    {
      "url": "https://locations.chipotle.com/sc/north-charleston/4953-centre-pointe-dr/order-delivery",
      "text": "Chipotle Delivery 4953 Centre Pointe Dr North Charleston , SC 29418 Get Directions (843) 747-6707 Order Online Store Hours Monday - Sunday 10:45 AM - 10:00 PM Pickup Options In-Store Pickup, Delivery, No-Contact Delivery In-Store Pickup Delivery No-Contact Delivery Nearby Stores Delivery Too busy to come in? Chipotle’s on the way. Order all your favorites online and we’ll handle the rest. Order Now Try Our Featured Meals popular Burrito Your choice of freshly grilled meat or sofritas wrapped in a warm flour tortilla with rice, beans, or fajita veggies, and topped with guac, salsa, queso blanco, sour cream or cheese. See more Chicken, White Rice, Black Beans, Fresh Tomato Salsa, and Queso Blanco Order Now popular Burrito Bowl Your choice of freshly grilled meat or sofritas served in a delicious bowl with rice, beans, or fajita veggies, and topped with guac, salsa, queso blanco, sour cream or cheese. See more White Rice, Pinto Beans, Cheese, Romaine Lettuce, Roasted Chili-Corn Salsa, Fresh Tomato Salsa, Sour Cream, and Guacamole Order Now popular Burrito Your choice of freshly grilled meat or sofritas wrapped in a warm flour tortilla with rice, beans, or fajita veggies, and topped with guac, salsa, queso blanco, sour cream or cheese. See more Chicken, White Rice, Black Beans, Fresh Tomato Salsa, and Queso Blanco Order Now popular Burrito Bowl Your choice of freshly grilled meat or sofritas served in a delicious bowl with rice, beans, or fajita veggies, and topped with guac, salsa, queso blanco, sour cream or cheese. See more White Rice, Pinto Beans, Cheese, Romaine Lettuce, Roasted Chili-Corn Salsa, Fresh Tomato Salsa, Sour Cream, and Guacamole Order Now Frequently Asked Questions Who should I contact if I have a delivery issue? If you placed your delivery order through chipotle.com or the Chipotle App, our team is ready to help. For fastest service, you can Chat with Pepper or give us a ring at 1-800-CHIPOTLE. How long will it take to deliver my food? As many times as we've wished for psychic powers, we haven't gotten them YET. Even so, we'll try to provide a reasonable ETA when you place your order. After that, it's up to our delivery partners' to transport your food in a reasonable amount of time. Does Chipotle deliver? You bet we do. And it's super easy. Whether you place your order through our app, our online portal, or one of our partners' platforms, all you have to do is sit back, relax, and imagine your order, zooming its way to you. Can I schedule my delivery time? Kinda yes, kinda no. All online or mobile orders will be delivered as soon as possible--hangry folk, rejoice--but if you place a catering order, you’ll be able to choose when you’d like to receive your large-format deliciousness. Can I cancel my delivery after I've submitted my order? When you submit a delivery order, it's sent directly to our courier team and restaurant crew, so it can get cooked up and on its way to you. That makes canceling orders sort of a challenge. If you really must cancel, and you've ordered directly through our app or online, reach out to our Customer Service team through the Contact Us page. If you ordered through a partner, check your confirmation email to contact their team directly. Keep in mind that you may incur a cancelation fee. What if my delivery order is inaccurate? Did you place your order through us by using order.chipotle.com or our app? Our bad. Please get in touch with our customer service team through the Contact Us page. Can I modify my order after it's been submitted? Since our first priority is making sure there's no confusion around what your order is or where it should be going, we (sadly) aren't able to accept modifications after delivery orders have been submitted. Our delivery partners have the same policy. Does Chipotle deliver our food if I order through their online order website or mobile app? Yep. We partner with DoorDash's delivery team to fulfill delivery orders placed through our website and app. Do you partner with additional delivery companies other than those listed on Chipotle.com? We only work with partners that we know are able to provide Chipotle-quality service and deliver your order the way it deserves (AKA in style). Are there additional delivery costs? While your burrito should cost the same as it does with non-delivery orders, you may see a delivery fee, a service fee, or a minimum order amount. The fees also vary by partner. Just think of it as a small price to pay for getting deliciousness delivered to your door. IT'S FUN TO GET REWARDED The best way to FREE Chipotle Join Now Learn More about our rewards program High Protein Menu From the New High Protein Cup to the Double High Protein Bowl, Real protein never tasted so good. Explore More Applicant Privacy Notice California Transparency in Supply Chains Act Consumer Health Data Notice Terms of Use Cookie Policy Privacy Center Privacy Policy, including California Privacy Rights Your Privacy Choices",
      "hash": "51c7c626b151",
      "downloadedAt": "2026-01-18T16:58:33.968Z",
      "trimmedAt": "2026-01-18T17:08:02.327Z",
      "sizeReduction": "94.8%"
    },
    {
      "url": "https://locations.chipotle.com/index.html",
      "text": "Chipotle US Stores Chipotle CA Stores Chipotle UK Stores Chipotle FR Stores Chipotle DE Stores All Chipotle Locations in the US Alabama Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington DC West Virginia Wisconsin Wyoming Applicant Privacy Notice California Transparency in Supply Chains Act Consumer Health Data Notice Terms of Use Cookie Policy Privacy Center Privacy Policy, including California Privacy Rights Your Privacy Choices",
      "hash": "9030f1e52c37",
      "downloadedAt": "2026-01-18T16:58:34.513Z",
      "trimmedAt": "2026-01-18T17:08:02.333Z",
      "sizeReduction": "98.4%"
    },
    {
      "url": "https://locations.chipotle.com/sc/north-charleston/4953-centre-pointe-dr?utm_source=google&utm_medium=yext&utm_campaign=yext_listings?restaurant=2577",
      "text": "Chipotle Mexican Grill 4953 Centre Pointe Dr North Charleston , SC 29418 Near Centre Pointe Dr & Tanger Outlet Blvd Get Directions (843) 747-6707 Order Online Order Catering Delivery Details Store Hours Monday - Sunday 10:45 AM - 10:00 PM Pickup Options In-Store Pickup Available during store hours Delivery Available No-Contact Delivery Nearby Stores Try our Featured Meals popular Burrito Your choice of freshly grilled meat or sofritas wrapped in a warm flour tortilla with rice, beans, or fajita veggies, and topped with guac, salsa, queso blanco, sour cream or cheese. See more Chicken, White Rice, Black Beans, Fresh Tomato Salsa, and Queso Blanco Order Now popular Burrito Bowl Your choice of freshly grilled meat or sofritas served in a delicious bowl with rice, beans, or fajita veggies, and topped with guac, salsa, queso blanco, sour cream or cheese. See more White Rice, Pinto Beans, Cheese, Romaine Lettuce, Roasted Chili-Corn Salsa, Fresh Tomato Salsa, Sour Cream, and Guacamole Order Now popular Burrito Your choice of freshly grilled meat or sofritas wrapped in a warm flour tortilla with rice, beans, or fajita veggies, and topped with guac, salsa, queso blanco, sour cream or cheese. See more Chicken, White Rice, Black Beans, Fresh Tomato Salsa, and Queso Blanco Order Now popular Burrito Bowl Your choice of freshly grilled meat or sofritas served in a delicious bowl with rice, beans, or fajita veggies, and topped with guac, salsa, queso blanco, sour cream or cheese. See more White Rice, Pinto Beans, Cheese, Romaine Lettuce, Roasted Chili-Corn Salsa, Fresh Tomato Salsa, Sour Cream, and Guacamole Order Now IT'S FUN TO GET REWARDED The best way to FREE Chipotle Join Now Learn More about our rewards program High Protein Menu From the New High Protein Cup to the Double High Protein Bowl, Real protein never tasted so good. Explore More About Chipotle Mexican Grill 4953 Centre Pointe Dr North Charleston, SC 29418 Chipotle is a fast-casual restaurant chain known for its customizable menu featuring burritos, bowls, quesadillas, tacos, and salads. The company is cultivating a better world by serving responsibly sourced, classically-cooked, real food with wholesome ingredients without artificial colors, flavors or preservatives. Using only 53 real ingredients, the company’s \"Food with Integrity\" principles prioritize sourcing ingredients from farms that adhere to humane and sustainable practices. Chipotle team members use classic culinary techniques and serve handcrafted entrées in abundance at an extraordinary value. To get exclusive offers and earn free food, sign up for Chipotle Rewards. Order Now Chipotle.com Applicant Privacy Notice California Transparency in Supply Chains Act Consumer Health Data Notice Terms of Use Cookie Policy Privacy Center Privacy Policy, including California Privacy Rights Your Privacy Choices",
      "hash": "ada73d5d8b09",
      "downloadedAt": "2026-01-18T16:58:33.634Z",
      "trimmedAt": "2026-01-18T17:08:02.345Z",
      "sizeReduction": "96.2%"
    }
  ],
  "sizeReduction": "96.1%"
}