{
  "venueId": "ChIJv49FSRB6_ogRSeBPUs9dyLw",
  "venueName": "Gaulart & Maliclet Fast and French Inc.",
  "venueArea": "Downtown Charleston",
  "website": "https://www.fastandfrenchcharleston.com/",
  "scrapedAt": "2026-01-18T17:04:31.700Z",
  "trimmedAt": "2026-01-18T17:12:54.833Z",
  "pages": [
    {
      "url": "https://www.fastandfrenchcharleston.com/charleston-gaulart-and-maliclet-fast-and-french-inc-menus",
      "text": "Specials",
      "hash": "6f7d198dbd6a",
      "downloadedAt": "2026-01-18T16:54:06.401Z",
      "trimmedAt": "2026-01-18T17:12:54.784Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "https://www.fastandfrenchcharleston.com/menu",
      "text": "Our Menu Breakfast Lunch Soup Dinner Drinks Dessert MERCH BAR",
      "hash": "9891816b2911",
      "downloadedAt": "2026-01-18T16:54:05.830Z",
      "trimmedAt": "2026-01-18T17:12:54.807Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "https://www.fastandfrenchcharleston.com/",
      "text": "× Let us host your special event! Whether a birthday party, office function or any other special occasion - we take care of all the fine details, bringing your event to life, just as you imagined. Host your next party or get together Book your party Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! Job Listings Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! 98 Broad Street, Charleston, SC 29401 map marker pin Our Mission Is To provide fresh, affordable, healthy, global cuisine with French flair in a social environment that encourages community and the Arts. Private Parties Whatever the occasion, our tailored service will bring your vision to life. Search no more we have a perfect place for you! parties book now About Us Gaulart & Maliclet French Café opened its door during the summer of 1984 in Charleston, SC by artists Gwylene Gallimard & Jean-Marie Mauclet as a tool to build community through food. They remain advisors to the longtime employees that carry on their legacy. The shared tables that bring the height of the customer to the same height of the staff, the open kitchen, the focus on simple, fresh ingredients and our commitment to making fresh soups and specials daily are just as important today as they were when we opened. Charleston continues to expand outward and change demographically but the Café remains a place where people of all walks of life can gather, communicate, and enjoy a home cooked meal and an affordable glass of French Wine! our menu food menu Gallery Reviews review by - Yelp Marty M: Have visited this great place for over 20 years, always outstanding. Be warned it is small, no reservations, friendly helpful staff and food that is delightful. My favorite lunch place in Charleston! review by - Yelp Shawna W: Great service and excellent food. We were in from out of town and needed a quick bite to eat after walking all over all day. We were seated right away and our server popped right over. The food was delicious and quick. Definitely recommend! review by - Yelp Nicolas A: Great place to eat! Their logo doesn't lie -Fast and French- because it really is. Food is amazing especially for the low price you're paying. I always order take out so don't know how to service is, but just based off the food, its spectacular! review by - Yelp David Q: This place is a hidden gem and known as a locals spot. We go to this place at least once a week. You can't find a better deal in downtown and the staff is always amazing. Specials change daily and then they have a rotating ethic cuisine weekly special. These reasons keep us coming back over and over. review by - Yelp Sarah B: Gaulart & Maliclet is the best local eatery in Charleston. The menu features authentic French cuisine that is fresh and delicious. I've never had a bad meal here and it is the one restaurant I make sure to visit every time I come to town... Stop reviews carousel Play reviews carousel A Love Affair Since 1984! Our Menu Life is Too Short to Drink Bad Wine Order Roam Around the World at G&M Our Menu It's Good Everyday! Fondue Rendezvous Nightly! A Tree. A Rock. A Cloud. The Cafe. Dot slide navigation number 1 Dot slide navigation number 2 Dot slide navigation number 3 Dot slide navigation number 4 Dot slide navigation number 5 Dot slide navigation number 6 slideshow start stop playing Newsletter Location 98 Broad Street Charleston, SC 29401 Hours Our hours are: Sunday 8am to 8pm Monday 8am to 8pm Tuesday 8am to 8pm Wednesday 8am to 8pm Thursday 8am to 9pm Friday 8am to 9pm Saturday 8am to 9pm What are yours? Find us on... Facebook page Instagram page Yelp page Contact us (843)-577-9797 info@fastandfrenchcharleston.com Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "d8bfe9023e74",
      "downloadedAt": "2026-01-18T16:54:05.742Z",
      "trimmedAt": "2026-01-18T17:12:54.833Z",
      "sizeReduction": "97.4%"
    }
  ],
  "sizeReduction": "99.2%"
}