{
  "venueId": "ChIJ7a1na2Vx_ogR4jznifyjVkc",
  "venueName": "The Pass Mount Pleasant",
  "venueArea": "Mount Pleasant",
  "website": "https://thepasschs.com/",
  "scrapedAt": "2026-01-18T17:04:23.785Z",
  "trimmedAt": "2026-01-18T17:05:04.547Z",
  "pages": [
    {
      "url": "https://thepasschs.com/",
      "text": "View fullsize View fullsize View fullsize View fullsize Ciao, Paisan! Visit us in Downtown Charleston: Location: 207A Saint Philip St., Charleston, SC 29403 (Corner of Spring St. & Saint Philip St.) Shop Hours: Wednesday to Sunday, 10AM to 3PM Call: (854) 444.3960 Visit us in Mount Pleasant: Location: 976J Houston Northcutt Blvd., Mount Pleasant, SC 29464 (within Northcutt Plaza) Shop Hours: Monday to Saturday, 10AM to 3PM Call: (843) 284.8687 Please visit our Instagram (@thepasschs) for details and daily happenings. Dine-In | Take-Out | Delivery Hungry for More? Discover our nighttime concept, The Italian Boy After Dark",
      "hash": "4c2fdd3fd68a",
      "downloadedAt": "2026-01-18T16:57:38.462Z",
      "trimmedAt": "2026-01-18T17:05:04.529Z",
      "sizeReduction": "99.0%"
    },
    {
      "url": "https://thepasschs.com/market-menu",
      "text": "PANINO (SANDWICHES) INSALATAS (SALADS) SPUTINO (SNACKS) BEVANDE (BEVERAGES) Panino (Sandwiches) 19 $ Such a Nice Italian Boy Mortadella (with Pistachio), Hot & Sweet Soppressata, Chili Relish, Burrata, Red Onion, Greens, Tomato, Sharp Provolone, Housemade Italian Vinaigrette on a Ciabatta 19 $ 18 $ The Italian Girl Roasted Turkey, Gabagool, Sweet Cherry Pepper Aioli, Burrata, Red Onion, Greens, Tomato, Sharp Provolone, Housemade Italian Vinaigrette on a Toasted Ciabatta 18 $ 17 $ The Americano Roasted Turkey, White Cheddar, Duke’s Mayonnaise, Housemade Grain Mustard, Fermented Peppers, House Dill Pickles on a Toasted Ciabatta 17 $ 17 $ The Panino di Basilico Basil-Lemon Chicken Salad, Oven-Dried Tomato Tapenade, Olive Oil Dressed Greens on a Toasted Ciabatta 17 $ 16 $ The V-Card Spice Rubbed Broccoli, Smashed Avocado, Roasted Red Pepper, Greens, Balsamic Glaze, Sesame Seed Crunch on Pinsa Bread 16 $ 16 $ The #39 Mozzarella Frittata, Prosciutto, Oven-Dried Tomatoes, Housemade Taleggio Aioli on a Toasted Ciabatta 16 $ 17 $ The LCB Line House-Cured Lox, Cucumber, Pickled Red Onion, Scallion Cream Cheese on a Toasted Everything Holey City Bagel 17 $ 17 $ The Ranch Jawn Calabrian Hot Buffalo Roasted Chicken, Greens, Parm Rain, RANTCHA Sauce on Toasted Parmesan-Garlic Bread 17 $ 18 $ TACONY-6931 Prosciutto, Hot Coppa, Roasted Garlic Whipped Ricotta, Marinated Tomatoes, Pistachio-Herb Pesto on Foccacia 18 $ 17 $ The Bear Cool Roast Beef, Melted Provolone, Pepper Shooter Aioli on a Toasted, Seeded Long Roll 17 $ 16 $ The Cacio e Pepe Three Cheeses, Fresh Cracked Pepper pressed on Local Sourdough with Drizzled Housemade Truffle Honey 16 $ Make any Sandwich into a Salad +1 Gluten Free Bread +2.50 Add: Sharp Provolone +2, Burrata +4, Turkey +3, Hot & Sweet Soppressata +4, Gabagool +4, Prosciutto +5",
      "hash": "e2d5fdc4ebad",
      "downloadedAt": "2026-01-18T16:57:38.500Z",
      "trimmedAt": "2026-01-18T17:05:04.547Z",
      "sizeReduction": "97.7%"
    }
  ],
  "sizeReduction": "98.3%"
}