{
  "venueId": "ChIJf_cujqlz_ogRD9hFS7OJU04",
  "venueName": "Long Island Cafe",
  "venueArea": "Isle of Palms",
  "website": "http://www.longislandcafesc.com/",
  "scrapedAt": "2026-01-18T17:04:28.571Z",
  "trimmedAt": "2026-01-18T17:11:22.735Z",
  "pages": [
    {
      "url": "http://www.longislandcafesc.com/",
      "text": "Skip to main content Skip to footer The Long Island Cafe of SC est. 1986 Since first opening its doors in 1986, Long Island Café has been a hidden gem for locals and tourists alike, tucked within a strip mall on the Isle of Palms. Over its decades-long history, this beloved restaurant has become a staple of the Charleston community. Location 1515 Palm Blvd.Isle of Palms, SC (843) 886-8809 Hours of Operation Lunch Monday — Saturday11:00am — 2:00pm Brunch Sunday11:00am — 2:00pm Dinner Monday — Sunday5:00pm — until IOP Raw Monday — Sunday4:30pm — until rESERVATIONS Reservations are prioritized due to high demand, particularly on weekends.Fill out the form to secure your spot. Menus In 2012, the café underwent a revitalization with new ownership, breathing new life into the restaurant and menu. In 2019, the vision for the island’s finest seafood expanded as a sister location, IOP Raw, was opened right next door. Both restaurants were sold to longtime friends and loyal patrons in 2022. Though the menu has evolved through all the transitions, classic dishes remain, with a continued emphasis on fresh, local seafood. New items and regularly changing specials keep the offerings vibrant. This modern version of an island favorite has thrived, supporting local producers while serving up a diverse menu of seafood, pasta, American cuisine, and desserts. Sharing a kitchen allows guests to enjoy both menus in either dining room. Long Island Cafe Menu Lunch Dinner Brunch Drinks Kid's Menu Steamers FAQs What are you known for? We are known for our iconic fried seafood platters, fresh oysters, and our wildly popular Seafood Steamer Buckets. Guests love our coastal flavors, relaxed island atmosphere, and long-standing reputation as one of Isle of Palms’ favorite seafood destinations. What meals do you serve? We serve lunch and dinner daily, as well as a beloved Sunday brunch featuring coastal classics and island-inspired favorites. Do you offer delivery or takeout? Yes! We offer takeout and delivery, and highly recommend our Seafood Steamer Buckets for beach days, family gatherings, holidays, and at-home events. What areas do you serve? We proudly serve Isle of Palms, South Carolina, along with nearby beach communities. Are reservations required? Reservations are not required, but highly recommended, especially for weekends, holidays, and larger parties. Is there a dress code? No—island casual attire is perfectly welcome. Come as you are and enjoy fresh, local seafood by the coast. Now offering LIC Steamers! Making dinner as easy as 1-2-3 with L-I-C! Perfect for a solo feast, or a big celebration! Order Online View Menu",
      "hash": "18ac52e8eaad",
      "downloadedAt": "2026-01-18T16:55:17.770Z",
      "trimmedAt": "2026-01-18T17:11:22.735Z",
      "sizeReduction": "97.4%"
    }
  ],
  "sizeReduction": "97.4%"
}