{
  "venueId": "ChIJVcnHJOZk_ogRCLNqZTy3EoU",
  "venueName": "Maya Del Sol Kitchen",
  "venueArea": "North Charleston",
  "website": "https://raulsmayadelsol.com/",
  "scrapedAt": "2026-01-18T17:04:26.836Z",
  "trimmedAt": "2026-01-18T17:08:04.780Z",
  "pages": [
    {
      "url": "https://raulsmayadelsol.com/",
      "text": "Our chef table dinners are back for the remainder of the year! See below for details. Maya del Sol Kitchen Maya del Sol Kitchen Maya del Sol Kitchen Maya del Sol Kitchen An experience you won't forget! (843) 225-2390 Maya del Sol Kitchen Maya del Sol Kitchen Maya del Sol Kitchen Maya del Sol Kitchen An experience you won't forget! (843) 225-2390 Welcome to our kitchen! is a full-service restaurant specializing in featuring unique dining and beverage experiences. Dining options are engineered for the foodie with a broad international flare designed and curated by Chef Raul Sanchez. Menus change weekly to reflect availability of fresh seasonal ingredients. Maya del Sol Kitchen Hours of Operation Tuesday thru Friday 11 am - 9 pm Lunch served 11am - 3pm Lite bites and a dinner special after 3pm Rotating menu (see ) Instagram Saturday Brunch 10 am - 2 pm No reservations needed for brunch Rotating menu (see ) Instagram Thursday, Friday, and Saturday evening Chef's Table Dinners Reservation only 6 pm and 8 pm seating only Follow us on or for themed dinner events Instagram Facebook Our Chef's Table Dinners Know before you go.... Saturday Only Reservations are a must, as seating is limited. Credit card details are required at the time the reservation is made. Cancellations or changes must be made at least 48 hours before the reserved date and time. No-shows will be charged half price of meals. We will be happy to reschedule. Doors will open at 6 p.m. and 8 p.m. If you do not arrive by the end of the first course, your reservation will be re­-scheduled. The evening's menu is Chef's choice, and will remain a surprise until your arrival. Chef Raul's five-course menu is constantly evolving, and the Chef plans for your experience in advance. A limited vegetarian menu is available upon request, but we are unable to accommodate vegan or dietary restrictions. When making reservations, please let us know if any guests in your party are severely allergic to nuts or shellfish. Reservations & Questions Send us an email so we can get started making your dinner reservations and answer any questions. Name* Phone* Email* Send This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Special Requests? Questions about an upcoming dinner? Drop us a line, and we'll contact you as soon as we're out of the kitchen! Kitchen Address 1813 Reynolds Ave. Suite B, North Charleston, SC (843) 225-2390 Get directions Social About Us Chef Raul Chef Raul Chef Raul Chef Raul Chef Raul Chef Raul Copyright © 2025 Raul’s Maya del Sol - All Rights Reserved. Powered by",
      "hash": "abd5dff06419",
      "downloadedAt": "2026-01-18T17:00:04.621Z",
      "trimmedAt": "2026-01-18T17:08:04.780Z",
      "sizeReduction": "97.3%"
    }
  ],
  "sizeReduction": "97.3%"
}