{
  "venueId": "ChIJR1Hb2ERj_ogR0x0JDl3RyWQ",
  "venueName": "Sake House Japanese Sushi & Hibachi Restaurant",
  "venueArea": "North Charleston",
  "website": "https://www.sakehousechs.com/",
  "scrapedAt": "2026-01-18T17:04:26.151Z",
  "trimmedAt": "2026-01-18T17:07:22.133Z",
  "pages": [
    {
      "url": "https://www.sakehousechs.com/",
      "text": "Sake House Welcome to our restaurant! Come and try our dishes! Online Order Our Story From Our Grill to Your Backyard At Sake House in North Charleston, we bring the excitement of hibachi cooking and fresh sushi straight to your table — and now, to your home. Our chefs blend traditional Japanese flavors with unforgettable showmanship, creating a fun, delicious experience for the whole family. Whether you’re dining in our lively restaurant or hosting a private hibachi party at home, every meal is made with the freshest ingredients and a passion for great food. We believe that good times and great food go hand in hand. That’s why we now offer at-home hibachi service — bringing the fire, the flavor, and the fun right to your backyard or special event. From our famous grilled steaks and seafood to our handcrafted sushi rolls, Sake House makes every gathering memorable. Join us at Sake House, or let us come to you. We’ll take care of the cooking — you just enjoy the show! HIBACHI Our restaurant is decorated in a very Japanese style and can accommodate 120 people for gatherings. View Menu SUSHI Specializing in sushi,sashimi, and classic rolls, Our restaurant combines traditional techniques with modern flair, emphasizing fresh, high-quality ingredients sourced daily. View Menu Hibachi at Home We also provide home service, which requires advance appointment. We Serve With Pride The Hibachi Food on our Menu Hibachi Chef at Home serves freshly prepared meals made with the finest ingredients and topped with delightful presentations. ㅤㅤㅤㅤㅤㅤㅤㅤPricingㅤㅤㅤㅤㅤㅤㅤㅤ ㅤㅤㅤㅤㅤㅤㅤㅤSide Ordersㅤㅤㅤㅤㅤㅤㅤㅤ ㅤㅤㅤㅤㅤㅤBuffet Style Optionㅤㅤㅤㅤㅤㅤ Hibachi Packages: Hibachi Regular – $50/person (Choose two entrees) Hibachi Special – $60/person (Includes chicken, shrimp, and NY strip) Hibachi Kids – $25/child (Choose one entree) Entree Choices (for Hibachi Packages): Chicken (5oz) Jumbo shrimp (7pcs) Prime NY Strip (5oz) Scallops (5oz) Salmon (5oz) Filet Mignon (4.5oz) – Additional $5 Lobster – Additional $10 All Hibachi Packages Include: Ginger dress salad Mixed Vegetables Egg fried rice Mixed Vegetables (Included in Hibachi Packages): Broccoli, mushroom, onion, carrot, and zucchini Noodles $8 Mixed Veggies $10 Egg Fried Rice $6 Additional Chicken$12 (5oz) Additional Shrimp$15 (7pcs) Additional Prime NY Strip$15 (5oz) Additional Salmon$15 (5oz) Additional Scallops$15 (5oz) Additional Filet Mignon$15 (5oz) Additional Lobster $30 Additional Information There is a $500 minimum for all parties. The price does not include sales tax or gratuity. A traveling fee may be charged for distances exceeding 30 miles. Returning customer or customer was refer by existing customer get a 5% discount deposit $300 can be paid online Buffet Style Buffet Style – $35/person (Includes chicken, shrimp, steak, mixed vegetables, and egg fried rice). A minimum of 30 people is required for the buffet style option. Note that the buffet style does not include the hibachi show. Table Rental (for Parties) Table, chair, utensils per person $15 Hungry? Order online now! Order your favorite food online at your convenience. Order Online Now Contact Us Mon - Thur 11:00 AM - 10:00 PM Fri 11:00 AM - 10:30 PM Sat 11:30 AM - 10:30 PM Sun 11:30 AM - 10:00 PM  843-566-8863  4952 Centre Pointe Dr #112, North Charleston, SC 29418",
      "hash": "2f62c724fca7",
      "downloadedAt": "2026-01-18T17:00:22.911Z",
      "trimmedAt": "2026-01-18T17:07:22.133Z",
      "sizeReduction": "98.4%"
    }
  ],
  "sizeReduction": "98.4%"
}