{
  "venueId": "ChIJkWlOg8tj_ogRIJ2riwxz3C4",
  "venueName": "IHOP",
  "venueArea": "North Charleston",
  "website": "https://restaurants.ihop.com/en-us/sc/n-charleston/breakfast-7361-mazyck-rd-4421?utm_source=google&utm_medium=organic&utm_campaign=google_my_business&utm_term=4421&utm_content=website",
  "scrapedAt": "2026-01-18T17:04:29.016Z",
  "trimmedAt": "2026-01-18T17:11:36.802Z",
  "pages": [
    {
      "url": "https://restaurants.ihop.com/en-us/",
      "text": "Select Search Type Find an IHOP Near You Enter address, city, or zip code Search Takeout & Phone Orders Catering Open Now There are no locations in your search area. Please try a different search area. PREVIOUS Next IHOP® Restaurant Locations | Breakfast, Lunch & Dinner - Pancakes 24/7 Home / LOCATIONS Whether you're hungry for one of our popular breakfast items or looking for lunch, dinner, or late night dining ideas there is an IHOP® location near you ready to serve. Did You Know?... For 67 years, the IHOP® family restaurant chain has served our world-famous pancakes and a wide variety of breakfast, lunch and dinner items that are loved by people of all ages - offering an affordable, everyday dining experience with warm and friendly service. Come as You Are Don't worry about formal attire, come as you are, as we offer a casual dining experience. See what other guests have enjoyed about their experiences by visiting our pages on or . Facebook YouTube Browse IHOP Restaurants by State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware District of Columbia Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Virginia Washington West Virginia Wisconsin Puerto Rico Connect with this IHOP",
      "hash": "08913b472751",
      "downloadedAt": "2026-01-18T16:59:56.166Z",
      "trimmedAt": "2026-01-18T17:11:36.738Z",
      "sizeReduction": "99.1%"
    },
    {
      "url": "https://restaurants.ihop.com/en-us/sc/n-charleston/breakfast-7361-mazyck-rd-4421?utm_source=google&utm_medium=organic&utm_campaign=google_my_business&utm_term=4421&utm_content=website",
      "text": "Select Search Type Find an IHOP Near You Enter address, city, or zip code Search IHOP Breakfast Restaurants Near You at 7361 Mazyck Rd 7361 Mazyck Rd N. Charleston, SC 29406 (843) 824-9390 Start Order Directions Restaurant Hours Monday Open 24 Hours Tuesday Open 24 Hours Wednesday Open 24 Hours Thursday Open 24 Hours Friday Open 24 Hours Saturday Open 24 Hours Sunday Open 24 Hours Restaurant Amenities Curbside Pickup Open 24 Hours Wi-Fi Available Dine-In Online Ordering Late Night Food Offered in N. Charleston Takeout Delivery Late Night Food Careers Specials Burgers Omelettes Pancakes Waffles Restaurant Amenities Curbside Pickup Open 24 Hours Wi-Fi Available Dine-In Online Ordering Late Night Food Home / Locations / SOUTH CAROLINA / N. Charleston / IHOP 7361 Mazyck Rd Visit your Favorite Breakfast Restaurant in N. Charleston As you make your way down Ashley Phosphate Rd or Northside Dr, take a break and dine in at your local IHOP restaurant! Our menu is full of variety and ready for you any time of day. For the breakfast lovers, we’ve got stacks of world-famous and an array of delicious freshly made , or you can dive into our newest breakfast items and try our tasty or our . And if you happen to be gluten intolerant, never fear! We’ve now launched our options with pancakes and more! IHOP Pancakes Omelettes Eggs Benedicts Sweet and Savory Crepes Gluten-Friendly Maybe you’re on your way to Charleston International Airport and hungry for mouth-watering food? Why not try our popular like Grilled or ? Or peruse our or Menus – we serve it all! Entrées Atlantic Salmon Sirloin Steak Tips Big Breakfast Burrito Platters At IHOP, we invite the whole family to join us - Appetites big and small, we cater to all. Choose one of our fun-filled or order from our exclusive just for . The best part – use the convenient App and get 20% off by using code IHOP20 on your 1st order. Now that is savings the whole family will love! Kids Menu 55+ Menu IHOP 'N Go This IHOP breakfast restaurant is located at 7361 Mazyck Rd, N. Charleston 29406 between Realm St and Mazyck Rd. Our nearest bus stop is Ashley Phosphate Rd / Stall Rd. GET DIRECTIONS Trending in N. Charleston Takeout In N. Charleston Delivery In N. Charleston Late Night Food In N. Charleston Careers In N. Charleston Specials In N. Charleston Burgers In N. Charleston Omelettes In N. Charleston Pancakes In N. Charleston Waffles In N. Charleston The Best Lunch and Dinner Spots Near 29406 Fuel up with a mouthwatering lunch or dinner at this N. Charleston IHOP at the intersection of Ashley Phosphate Rd and Northside Dr. Try our , or any of our juicy and more menu favorites that are sure to delight! Country Fried Steak Bacon Avocado Ranch Start Order What's on the Menu at IHOP N. Charleston Family Feasts (IHOP ‘N GO only) Omelettes Burritos & Bowls World-Famous Buttermilk Pancakes & Crepes Hand-Crafted Melts 55+ Menu Combos Burgers & Chicken Sandwiches Kids Menu (12 & Under) See Full Menu So Many Delicious Menu Choices at IHOP Our pancakes are world-famous, but we pride ourselves on continuously updating our current offerings! for a sure way to satisfy every appetite. The or would make the perfect feast for today. Take advantage of each limited time offer of discounted menu items. Come on in and enjoy the food you love with the people you love! Try Our New Menu Items Juicy Steakburger Chicken Sandwich PREVIOUS Next Enjoy IHOP and Soak up Some Sunshine at Roma Rd Park Whether you’re looking to enjoy the outdoors or just want some flavorful food at home, order some IHOP favorites for or and live your best life! Takeout Delivery Here are some easy locations nearby to savor your IHOP meal: Pepperhill Park Bessinger-Kelly Park We’ve got the answer for your next fiesta too – IHOP offers for events like team-building, birthday parties, family reunions, you name it! Place a quick and convenient order that will put a smile on your plate! Catering Our Breakfast Restaurant Bordering Hanahan, SCand Near These N. Charleston Destinations When you visit this IHOP location for our world-famous pancakes and delicious lunch and dinner specials, you’re in great company with nearby Old South Plaza shopping. This local community is host to celebrated annual events! St. Patrick's Day Harvest Festival We also salute those serving our local neighborhood, including the staff at Savannah Civic Center and NCPD North Bureau, and the hard-working teams at MASA and North Charleston Fire Department Station 10. We’re thrilled to share this vibrant N. Charleston neighborhood with you! Making a hunger stop on your road trip? You’ll find our location nestled near these cities and landmarks: Hanahan, SC Goose Creek, SC Charleston, SC Ladson, SC Goose Creek Reservoir Goose Creek Frequently Asked Questions About IHOP Restaurant in N. Charleston Does IHOP in N. Charleston, SC Have a Senior Discount? IHOP’s special senior menu offers guests 55+ delicious menu items at lower prices! Find Another IHOP Nearby IHOP Centre Point Dr Close 4936 Centre Point Dr N. Charleston, SC 29418 Distance 4.4 mi Curbside Pickup Open 24 Hours Wi-Fi Available Dine-In Online Ordering Takeout Available Delivery Available Late Night Food (854) 222-3743 View Menu Directions Start Order IHOP N Main St Close 1217 N Main St Summerville, SC 29483 Distance 9.4 mi Curbside Pickup Wi-Fi Available Dine-In Online Ordering Takeout Available Delivery Available (843) 851-3400 View Menu Directions Start Order IHOP N. Hwy 17 Close 1787 N. Hwy 17 Mount Pleasant, SC 29464 Distance 14.4 mi Curbside Pickup Open 24 Hours Wi-Fi Available Dine-In Online Ordering Takeout Available Delivery Available Late Night Food (843) 849-0639 View Menu Directions Start Order There are no locations in your search area. Please try a different search area.",
      "hash": "681187aecb09",
      "downloadedAt": "2026-01-18T16:59:56.112Z",
      "trimmedAt": "2026-01-18T17:11:36.776Z",
      "sizeReduction": "97.6%"
    },
    {
      "url": "https://restaurants.ihop.com/en-us/sc/n-charleston/breakfast-7361-mazyck-rd-4421/specials",
      "text": "Select Search Type Find an IHOP Near You Enter address, city, or zip code Search All-Day Breakfast & Daily Lunch Specials in N. Charleston 7361 Mazyck Rd N. Charleston, SC 29406 (843) 824-9390 At IHOP, we serve breakfast and lunch specials all-day in N. Charleston. Whether you're craving fluffy Pancakes, Waffles, savory breakfast combos, or a hearty entrée, we have something to satisfy any taste. Restaurant Hours Monday Open 24 Hours Tuesday Open 24 Hours Wednesday Open 24 Hours Thursday Open 24 Hours Friday Open 24 Hours Saturday Open 24 Hours Sunday Open 24 Hours Directions Start Order View Menu Location Amenities Let's put a smile on your plate Curbside Pickup Open 24 Hours Wi-Fi Available Dine-In Online Ordering N. Charleston Takeout N. Charleston Delivery N. Charleston Late Night Food N. Charleston Specials N. Charleston Burgers N. Charleston Omelettes N. Charleston Pancakes N. Charleston Waffles Home / Locations / SOUTH CAROLINA / N. Charleston / IHOP 7361 Mazyck Rd / Specials Takeout Breakfast Specials in N. Charleston - Get 20% off your first online order ** IHOP in N. Charleston has amazing takeout specials just for you! Order online with code IHOP20 for 20% off at checkout until 12/31/26. Don't miss out on the excitement- order now! Order Takeout ** Valid for 1-time use only and limit 1 per order. Tax and gratuity excluded. Not valid with other coupons and discounts. No cash value. Offer expires 12/31/26. Account sign up required. Online orders via IHOP site or app only. At participant restaurants. Further restrictions apply. 2026 IHOP Restaurants LLC. Share Joy with an IHOP Gift Card Enjoy delicious breakfast food with those who matter most with an IHOP gift card! Whether it's a birthday, anniversary, or just because, an IHOP gift card is sure to bring a smile to their face. Visit your local IHOP in N. Charleston to pick up a gift card today or send a card and make someone's day a little sweeter! digital gift Buy Now Get Free Birthday Pancakes! Join IHOP rewards and get the gift of a free birthday stack and other exclusive offers. Redeem points for free treats, and specialty items from the Stack Market. Sign up today!. Join Now Try Family Feasts To Go in N. Charleston - IHOP 'N GO Specials Looking for a delicious meal to satisfy the whole family? Check out our Family Feast meal, available only with IHOP 'N Go.With IHOP's Family Feast, you can enjoy all your favorite IHOP classics, including pancakes, French toast, waffles, and burgers in the comfort if your own home! Simply order online and we'll have your Family Feast ready for pick-up or delivery in N. Charleston. Start Order PREVIOUS Next Frequently Asked Questions About IHOP Specials in N. Charleston Does IHOP have a special for birthdays? Yes! Get a free short stack of pancakes on your birthday at IHOP when you sign up for our rewards program. Does IHOP have a breakfast special? Our breakfast specials are always changing, so be sure to check in with your local IHOP or on our website to see what delicious deals we're serving up. Where can I find IHOP specials and coupons? You can find the latest IHOP specials and coupons by signing up for our free rewards program. By signing up, you can earn points towards free food and gain access to special offers. Find Another IHOP Nearby IHOP Centre Point Dr Close 4936 Centre Point Dr N. Charleston, SC 29418 Distance 4.4 mi Curbside Pickup Open 24 Hours Wi-Fi Available Dine-In Online Ordering Takeout Available Delivery Available Late Night Food (854) 222-3743 View Menu Directions Start Order IHOP N Main St Close 1217 N Main St Summerville, SC 29483 Distance 9.4 mi Curbside Pickup Wi-Fi Available Dine-In Online Ordering Takeout Available Delivery Available (843) 851-3400 View Menu Directions Start Order IHOP N. Hwy 17 Close 1787 N. Hwy 17 Mount Pleasant, SC 29464 Distance 14.4 mi Curbside Pickup Open 24 Hours Wi-Fi Available Dine-In Online Ordering Takeout Available Delivery Available Late Night Food (843) 849-0639 View Menu Directions Start Order There are no locations in your search area. Please try a different search area. Connect with this IHOP *Prices may vary, see server for details. Available while supplies last. © 2026 IHOP Restaurants LLC.",
      "hash": "e15f0707af0e",
      "downloadedAt": "2026-01-18T16:59:56.971Z",
      "trimmedAt": "2026-01-18T17:11:36.802Z",
      "sizeReduction": "97.9%"
    }
  ],
  "sizeReduction": "98.1%"
}