{
  "venueId": "ChIJg169_stj_ogRK99CVUPUsew",
  "venueName": "Staybridge Suites Charleston-Ashley Phosphate by IHG",
  "venueArea": "North Charleston",
  "website": "https://www.ihg.com/staybridge/hotels/us/en/north-charleston/chsal/hoteldetail?cm_mmc=GoogleMaps-_-SB-_-US-_-CHSAL",
  "scrapedAt": "2026-01-19T02:19:36.467Z",
  "trimmedAt": "2026-01-19T02:26:03.311Z",
  "pages": [
    {
      "url": "https://www.ihg.com/staybridge/hotels/us/en/north-charleston/chsal/hoteldetail/hotel-offers",
      "text": "[Page Title: Staybridge Suites Charleston-Ashley Phosphate Discounts & OffersSelecting will reload the IHG website in this browser window.Selecting will reload the IHG website in this browser window.Selecting will load the Six Senses website in a new browser window.Selecting will reload the Regent hotels website in this browser window.Selecting will reload the InterContinental Hotels & Resorts website in this browser window.Selecting will reload the Vignette Collection Website in this browser window.Selecting will reload the Kimpton® Hotels & Restaurants website in this browser window.Selecting will reload the Hotel Indigo website in this browser window.Selecting will reload the voco hotels website in this browser window.Selecting will reload the Ruby hotels website in this browser window.Selecting will reload the HUALUXE Hotels & Resorts website in this browser window.Selecting will reload the Crowne Plaza Hotels & Resorts website in this browser window.Selecting will reload Iberostar Beachfront Resorts in this browser window.Selecting will reload the EVEN Hotels website in this browser window.Selecting will reload the Holiday Inn Express Hotels website in this browser window.Selecting will reload the Holiday Inn website in this browser window.Selecting will reload the Garner Hotels Website in this browser window.Selecting will reload the avid hotels website in this browser window.Selecting will reload the Atwell Suites website in this browser window.Selecting will reload the Staybridge Suites website in this browser window.Selecting will reload the Holiday Inn Club Vacations website in this browser window.Selecting will reload the Candlewood Suites website in this browser window.Selecting opens the IHG One Rewards website in this browser window.]\n\nSkip To main content View Prices Staybridge Suites Charleston-Ashley Phosphate Offers & Packages Hotel packages available \nPrices shown reflect an average per night stay from\nVIEW ALL PACKAGES \nAdditional Offers\nBrand Offers & Packages \nPay your way with Points & Cash​\n\nBook your next trip by combining points with cash. With Points & Cash you get the flexibility to choose how many points you use.​\nBook Now \nBuy points and get there faster​\n\nWith two ways to buy points, you can reach what you want faster. Buy points to stock up for future travel or add Elite Qualifying points to a booking.\nLearn More \nFind A Perfect Gift\n\nFrom gift cards to unique travel destinations, our new rewards catalog is full of ideas and experiences for you to enjoy.\nShop Our Catalog IHG® One Rewards Member Offers \nBuy, gift, or transfer points\n\nEnjoy endless possibilities with Points Purchase.\nBuy Points \nGreat rates are just a click away\n\nWith IHG One Rewards, you can get access to our exclusive Member Rate.\nBook Now \nReward yourself with a Reward Night​\n\nWith your IHG One Rewards points, you can book a Reward Night at one of our 6,000+ hotels around the world. Reward Nights start at just 5K points.\nBook Now",
      "hash": "2fe5a48f9b99",
      "downloadedAt": "2026-01-19T02:16:04.210Z",
      "trimmedAt": "2026-01-19T02:26:03.208Z",
      "sizeReduction": "97.8%"
    },
    {
      "url": "https://www.ihg.com/staybridge/hotels/us/en/north-charleston/chsal/hoteldetail?cm_mmc=GoogleMaps-_-SB-_-US-_-CHSAL",
      "text": "[Page Title: Hotel Suites in North Charleston, SC | Staybridge Suites Charleston-Ashley PhosphateSelecting will reload the IHG website in this browser window.Selecting will reload the IHG website in this browser window.Selecting will load the Six Senses website in a new browser window.Selecting will reload the Regent hotels website in this browser window.Selecting will reload the InterContinental Hotels & Resorts website in this browser window.Selecting will reload the Vignette Collection Website in this browser window.Selecting will reload the Kimpton® Hotels & Restaurants website in this browser window.Selecting will reload the Hotel Indigo website in this browser window.Selecting will reload the voco hotels website in this browser window.Selecting will reload the Ruby hotels website in this browser window.Selecting will reload the HUALUXE Hotels & Resorts website in this browser window.Selecting will reload the Crowne Plaza Hotels & Resorts website in this browser window.Selecting will reload Iberostar Beachfront Resorts in this browser window.Selecting will reload the EVEN Hotels website in this browser window.Selecting will reload the Holiday Inn Express Hotels website in this browser window.Selecting will reload the Holiday Inn website in this browser window.Selecting will reload the Garner Hotels Website in this browser window.Selecting will reload the avid hotels website in this browser window.Selecting will reload the Atwell Suites website in this browser window.Selecting will reload the Staybridge Suites website in this browser window.Selecting will reload the Holiday Inn Club Vacations website in this browser window.Selecting will reload the Candlewood Suites website in this browser window.Selecting opens the IHG One Rewards website in this browser window.]\n\nSkip To main content View Prices \nImportant Announcements\nStaybridge Suites Charleston-Ashley Phosphate \n7329 Mazyck Road North Charleston, South Carolina 29406 United States\nGet Directions Beautiful Charleston Hotel near Tanger Outlets and Downtown Our 93 room all-suite hotel is breath-taking from a distance Hotel Exterior Our well lit hotel is located off I26, close to downtown Relax on our beautiful patio featuring grill stations & a firepit Covered outdoor seating for guests to enjoy Exterior Feature Our hotel is located near shopping, close to Downtown, and more Staybridge Suites Beautiful View at Sunset Hotel Front Exterior Sunset Lobby Lounge Area Bathroom and Shower Second Bedroom Double Queen Guest Room Living and Workspace Two Bedroom Living Space Double Queen Kitchen Fully Stocked ADA Studio ADA Kitchen Fully Stocked Kitchen King Bed Studio Suite Workspace Living Room and Kitchen One Bedroom Suite Double Queen One-Bedroom Suite Front Desk Guest Patio and Grill Area Outside Patio Fully Stocked with Sundries Free guest laundry - no quarters needed. Breakfast and Social Bar Delicious Breakfast Bar Breakfast and Social Dining Complimentary drinks & appetizers on select nights Breakfast and Social Lounge Our multi purpose coffee station is available 24/7 State-of-the-art business center is open 24 hours Heated Indoor Pool Fitness \n: 3:00 PM\nCheck-in \n: 12:00 PM\nCheck-out \n: 21\nMinimum check-in Age Email: GUESTSERVICES@STAYCHARLESTONSC.COM Contact Front Desk: 1-843-3774600 Reservation: Parking & Transportation Details View FAQ Chat with US Suites near Charleston beaches and history \nCharleston, South Carolina is home to historic sites, exciting attractions, beautiful beaches and outstanding restaurants. Designed for extended stay and centrally located near Interstate-26, the offers amenities to help you feel comfortable whether you are visiting for the weekend or planning to stay an entire week, month, or year. North Charleston puts the hotel's guests just minutes from Charleston International Airport (CHS), as well as many local businesses. This North Charleston hotel's property is the perfect home base for those exploring Charleston's many offerings. Historic sites and world-class restaurants in downtown Charleston are minutes away. The Tanger Outlet Center offers great shopping less than five miles from the hotel. The North Charleston Coliseum & Performing Arts Center, which hosts a variety of shows, concerts and sporting events, is also nearby. At this all suite hotel in North Charleston, you'll enjoy apartment-style accommodations and indispensable resources, such as free wired and wireless Internet access throughout the hotel. We're also pleased to provide a complimentary breakfast buffet each morning, as well as our evening social Mon - Wednesday. Begin planning your extended stay in North Charleston today!\n\nFeel at home at Staybridge Suites - this Charleston, SC all suites Hotel.\nStaybridge Suites® Hotel Charleston - Ashley Phosphate ACCOMMODATIONS Explore Our Suites \nWhether you are staying for a short trip or an extended stay, our spacious suites are designed so you can flex from productivity to relaxation.\nEXPLORE OUR SUITES ACCOMMODATIONS Explore Our Suites \nWhether you are staying for a short trip or an extended stay, our spacious suites are designed so you can flex from productivity to relaxation.\nAmenities \nParking\n\nPet friendly\n\nPool\n\nFitness center\n\nWi-Fi included\n\nParking\n\nPet friendly\n\nPool\n\nFitness center\n\nWi-Fi included\nVIEW ALL AMENITIES \nSocial Hour\n\nJoin us for a variety of free appetizers and beverages at our evening reception.\n\nMonday,Tuesday and Wednesday\n5:30 PM - 7:00 PM \nComplimentary Breakfast\n\nYour stay at our hotel with breakfast included offers a delicious hot meal freshly prepared every day, featuring healthy options, daily specials, and a wide variety for our long-term guests.\n6:30 AM - 9:30 AM Monday, Tuesday, Wednesday, Thursday, Friday Hotel packages available \nPrices shown reflect an average per night stay from\nView All Packages \nAdditional Offers\nView All Offers \nHotel Highlights\n\nWhile You're With Us\n\nGrilling pavillion and fire pit\n\nHealth and fitness center\n\nFull Hot Buffet Breakfast\n\nRelax in our indoor pool\n\nGrilling pavillion and fire pit\n\nWhat a great way to end the day that grilling a steak or enjoying a drink sitting around the fire pit.\n\nHealth and fitness center\n\nOpen 24/7 our facility offers the best in cardio and weight training.\n\nFull Hot Buffet Breakfast\n\nServed 7 days a week. Our hot breakfast includes meat, eggs, and all of your Southern favorites.\n\nRelax in our indoor pool\n\nOur indoor pool is heated and open all year.\n\nFAQ for Staybridge Suites Charleston-Ashley Phosphate\nHow much is parking at Staybridge Suites Charleston-Ashley Phosphate? \nComplimentary parking is available at Staybridge Suites Charleston-Ashley Phosphate for hotel guests.\nCan I cancel my booking at Staybridge Suites Charleston-Ashley Phosphate for a full refund? \nAlways check the hotel's cancellation policy before booking a rate. Room cancellation is subject to rate booked at time of reservation and cancellation policy varies by rate.\nDoes Staybridge Suites Charleston-Ashley Phosphate have a restaurant on site? \nNo, there is no on site restaurant at Staybridge Suites Charleston-Ashley Phosphate.\nIs there free breakfast available at Staybridge Suites Charleston-Ashley Phosphate? \nBreakfast is free with your stay at the Staybridge Suites Charleston-Ashley Phosphate.\nWhen is breakfast at Staybridge Suites Charleston-Ashley Phosphate? \nBreakfast at Staybridge Suites Charleston-Ashley Phosphate is available from 6:30 AM to 9:30 AM.\nIs there a complimentary shuttle available at Staybridge Suites Charleston-Ashley Phosphate? \nNo, there is not a complimentary local area shuttle available at Staybridge Suites Charleston-Ashley Phosphate.\nWhat are the check-in and check-out times for Staybridge Suites Charleston-Ashley Phosphate? \nCheck-in at Staybridge Suites Charleston-Ashley Phosphate is from 3:00 PM, and check-out time is 12:00 PM. Contact the hotel directly for options available for early check-in or late check-out.\nDoes Staybridge Suites Charleston-Ashley Phosphate have a pool? \nYes, Staybridge Suites Charleston-Ashley Phosphate has an indoor pool.\nIs there a fitness center at Staybridge Suites Charleston-Ashley Phosphate? \nYes, there is an onsite fitness center at Staybridge Suites Charleston-Ashley Phosphate.\nDoes Staybridge Suites Charleston-Ashley Phosphate offer free Wi-Fi? \nYes, the Staybridge Suites Charleston-Ashley Phosphate offers free WiFi!\nCan I bring my pet to Staybridge Suites Charleston-Ashley Phosphate? \nPets are welcome at Staybridge Suites Charleston-Ashley Phosphate. There is a pet deposit per stay of 75 USD . Our Pet Policy: Pets allowed with nonrefundable fee of 75.00 per stay. Pet agreement must be signed on arrival. No aggressive breeds. Record of complete and up to date vaccinations required. No charge for SERVICE ANIMALS.\nRead more FAQs",
      "hash": "5e4a019d42bb",
      "downloadedAt": "2026-01-19T02:15:48.340Z",
      "trimmedAt": "2026-01-19T02:26:03.292Z",
      "sizeReduction": "95.9%"
    },
    {
      "url": "https://www.ihg.com/staybridge/hotels/us/en/north-charleston/chsal/hoteldetail/meetings-events",
      "text": "[Page Title: Group Rates & Events | Staybridge Suites Charleston-Ashley PhosphateSelecting will reload the IHG website in this browser window.Selecting will reload the IHG website in this browser window.Selecting will load the Six Senses website in a new browser window.Selecting will reload the Regent hotels website in this browser window.Selecting will reload the InterContinental Hotels & Resorts website in this browser window.Selecting will reload the Vignette Collection Website in this browser window.Selecting will reload the Kimpton® Hotels & Restaurants website in this browser window.Selecting will reload the Hotel Indigo website in this browser window.Selecting will reload the voco hotels website in this browser window.Selecting will reload the Ruby hotels website in this browser window.Selecting will reload the HUALUXE Hotels & Resorts website in this browser window.Selecting will reload the Crowne Plaza Hotels & Resorts website in this browser window.Selecting will reload Iberostar Beachfront Resorts in this browser window.Selecting will reload the EVEN Hotels website in this browser window.Selecting will reload the Holiday Inn Express Hotels website in this browser window.Selecting will reload the Holiday Inn website in this browser window.Selecting will reload the Garner Hotels Website in this browser window.Selecting will reload the avid hotels website in this browser window.Selecting will reload the Atwell Suites website in this browser window.Selecting will reload the Staybridge Suites website in this browser window.Selecting will reload the Holiday Inn Club Vacations website in this browser window.Selecting will reload the Candlewood Suites website in this browser window.Selecting opens the IHG One Rewards website in this browser window.]\n\nSkip To main content View Prices Staybridge Suites Charleston-Ashley Phosphate groups & Events \nAt a Glance\n\nMeeting and event rooms:\n0 \nGuest rooms:\n93 Plan Your Event \nBooking Details\n\nTo find availability and pricing information for your meeting or event, please request a meeting quote or book your event online.\nReady to book? REQUEST A QUOTE \nEmail us at\n1800meeting@ihg.com \nCall us at 1-800-MEETING\n\nContact Information\n\nFor questions or to book by phone: or by email:\n1-843-3774600 . sales@staycharlestonsc.com",
      "hash": "ecc7c8f34a20",
      "downloadedAt": "2026-01-19T02:16:03.543Z",
      "trimmedAt": "2026-01-19T02:26:03.311Z",
      "sizeReduction": "98.0%"
    }
  ],
  "sizeReduction": "96.9%"
}