{
  "venueId": "ChIJxyKLuw16_ogRPnMyVsir2eo",
  "venueName": "Henry's On The Market",
  "venueArea": "Downtown Charleston",
  "website": "http://www.henrysonthemarket.com/",
  "scrapedAt": "2026-01-18T17:04:32.075Z",
  "trimmedAt": "2026-01-18T17:13:05.625Z",
  "pages": [
    {
      "url": "http://www.henrysonthemarket.com/charleston-henry-s-on-the-market-events",
      "text": "In-House Happenings National Margarita Day Sunday February 22nd Come celebrate National Margarita day with us on February 22nd. 11:00 AM - 02:00 AM St. Patrick's Day Tuesday March 17th Grab your best green garb and join us for St. Patrick's Day! 11:00 AM - 02:00 AM",
      "hash": "060ff34b45c9",
      "downloadedAt": "2026-01-18T16:54:09.100Z",
      "trimmedAt": "2026-01-18T17:13:05.518Z",
      "sizeReduction": "99.7%"
    },
    {
      "url": "http://www.henrysonthemarket.com/charleston-henry-s-on-the-market-party-inquiry",
      "text": "Party Inquiry Private Event Software powered by Tripleseat",
      "hash": "07f73d107e50",
      "downloadedAt": "2026-01-18T16:54:09.773Z",
      "trimmedAt": "2026-01-18T17:13:05.521Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "http://www.henrysonthemarket.com/",
      "text": "× Let us host your special event! Whether a birthday party, office function or any other special occasion - we take care of all the fine details, bringing your event to life, just as you imagined. Host your next party or get together Book your party Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! Job Listings Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! 54 North Market Street, Charleston, SC 29401 Visit us at map marker pin Every Day 11:00 AM - 2:00 AM (843)-723-4363 Call us at - Restaurant Bar & Music Hall Henry’s is centrally located in historic downtown Charleston at 54 North Market Street, across from the Charleston city market. Established in 1932, Henry’s is the oldest continuous restaurant in Charleston and the state of South Carolina. Read more about us Groups & parties Tailored events for all occasions Create memories to last a lifetime with our personalized private party options. Let our team help you plan an unforgettable celebration. Book now a private party slideshow start stop playing Slide 1 content Slide 2 content Slide 3 content previous slide next slide Dedicated To Quality Enjoy Delicious Food & Cocktails Our Menu Live Music & Entertainment Grab a drink and enjoy the Atmosphere Entertainment Schedule Private Dining Perfection Moments Of Joy And Celebration Private Events In-House Happenings Start stop events carousel National Margarita Day Sunday February 22nd Come celebrate National Margarita day with us on February 22nd. St. Patrick's Day Tuesday March 17th Grab your best green garb and join us for St. Patrick's Day! Skip Photo Gallery The interior with upholstered seats and tables Served Shrimp Grits Mary's Greek Salad and other dishes A served Spicy Shrimp Roll A plate of Jambalaya Served Mary's Greek Salad A served Charcuterie plate Bourbon Bread Pudding Two meals and a drink Market Burger Southern Shrimp Tacos The outdoor patio A closeup on a Seafood Pasta plate The interior of the restaurant with tables, chairs, and decorations Reviews Start stop reviews carousel Review by - Google Rebecca L: five star review by Oldest restaurant in CHS; Live music nightly; outstanding service, great atmosphere, and delicious food; try the She soup, best chicken salad sandwich I have ever ate Review by - Google Aldo P: five star review by Comfortable atmosphere. The old fashion is excellent made with Ben&Steal local whiskey. Roof top Bar keeps it more of a quiet experience. Review by - Google Les H: five star review by Great place to stop in for a bite to eat. Service and food was excellent, and being the oldest running restaurant it's a cool piece of history. Would definitely come back next time in town. Review by - Google Philip C: five star review by What a great venue multiple levels of bars music restaurants great drinks great service beautiful vibe Great atmosphere. Review by - Google Susan D: five star review by Recently did a girls trip to Charleston and discovered this place. We loved it so much we went 3 times! Delicious jambalaya and the rum punch is amazing! Newsletter Location 54 North Market Street Charleston, SC 29401 Hours Every day 11:00 AM - 2:00 AM Thursday/Friday/Saturday 23+ after 8:30pm Cover charge may begin at variable times depending on nightly activity and capacity. Please check with our staff upon arrival for the most up-to-date information. Find us on... Facebook page Instagram page Google page Contact us (843)-723-4363 Call us at info@henrysonthemarket.com Write us at Careers Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "1cd3fb46a145",
      "downloadedAt": "2026-01-18T16:54:06.385Z",
      "trimmedAt": "2026-01-18T17:13:05.547Z",
      "sizeReduction": "98.2%"
    },
    {
      "url": "http://www.henrysonthemarket.com/charleston-henry-s-on-the-market-drink-menu",
      "text": "Our Drinks Wine Cocktails",
      "hash": "22d153b99291",
      "downloadedAt": "2026-01-18T16:54:07.782Z",
      "trimmedAt": "2026-01-18T17:13:05.555Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://www.henrysonthemarket.com/charleston-henry-s-on-the-market-music-calendar",
      "text": "Live Music Calendar Date Band Location Time Music Genre Thursday, January 1 Thursday, January 1 Market Street Cowboy Band Henry’s Music Hall 9:30pm-12:30am Country/Top 40 Thursday, January 1 Gracious Day Anson Lounge 7-10pm Country Thursday, January 1 Joe Wheaton Henry’s Stage 9:30pm-12:30am Folk/Americana Friday, January 2 Friday, January 2 Bubba and Dale Patio 2-5pm Country/Top 40 Friday, January 2 Kelly Sanchez Anson Lounge 6-9pm Rock Friday, January 2 Loren Griste Anson Lounge 9:30pm-12:30am Country/Alternative Friday, January 2 Market Street Cowboy Band Henry’s Music Hall 10pm-1am Country/Top 40 Friday, January 2 Joe Wheaton Whiskey Room 10pm-1am Rock/Alt Friday, January 2 JJZ Henry’s Stage 10pm-1am Classic Rock Saturday, January 3 Saturday, January 3 Joe Fisher Patio 2-5pm Classic Rock Saturday, January 3 Louie Dixon Anson Lounge 6-9pm Jazz/R&B Saturday, January 3 Loren Griste Anson Lounge 9:30pm-12:30am Country/Alternative Saturday, January 3 Market Street Cowboy Band Henry’s Music Hall 10pm-1am Country/Top 40 Saturday, January 3 Chris Williams Whiskey Room 10pm-1am Jazz/R&B Saturday, January 3 Benderfunk Henry’s Stage 10pm-1am Rock/Pop Sunday, January 4 Sunday, January 4 Spud Fisher Patio 2-5pm Folk/Country Sunday, January 4 Gracious Day Henry’s Stage 9:30pm-12:30am Country Monday, January 5 Monday, January 5 Market Street Cowboy Band Henry’s Stage 9:30pm-12:30am Country/Top 40 Tuesday, January 6 Tuesday, January 6 Chris Williams Henry’s Stage 10pm-1am Jazz/R&B Wednesday, January 7 Wednesday, January 7 The Ben Whitney Band Henry’s Stage 9:30pm-12:30am Indie/Alt Jam Thursday, January 8 Thursday, January 8 Gracious Day Anson Lounge 7-10pm Country Thursday, January 8 Joe Wheaton Henry’s Stage 9:30pm-12:30am Americana/Folk Friday, January 9 Friday, January 9 Bubba and Dale Patio 2-5pm Country/Top 40 Friday, January 9 Zach Quillen Anson Lounge 6-9pm Country/Top 40 Friday, January 9 Dave Landeo Anson Lounge 9:30pm-12:30am Indie Rock Friday, January 9 VYNL Henry’s Music Hall 10pm-1am Rock/Top 40 Friday, January 9 Loren Griste Whiskey Room 10pm-1am Pop/Top 40 Friday, January 9 Gator Food Henry’s Stage 10pm-1am Alternative Saturday, January 10 Saturday, January 10 Dacota Muckey Patio 2-5pm Alternative Saturday, January 10 Louie Dixon Anson Lounge 6-9pm Jazz/R&B Saturday, January 10 Nathan Davis Anson Lounge 9:30pm-12:30am Saturday, January 10 VYNL Henry’s Music Hall 10pm-1am Country/Top 40 Saturday, January 10 Chris Williams Whiskey Room 10pm-1am Jazz/R&B Saturday, January 10 Dirt Road Disciples Henry’s Stage 10pm-1am Country Rock Sunday, January 11 Sunday, January 11 Spoda Patio 2-5pm Alt Rock Sunday, January 11 Gracious Day Henry’s Stage 9:30pm-12:30am Country Monday, January 12 Monday, January 12 Market Street Cowboy Band Henry’s Stage 9:30pm-12:30am Country/Top 40 Tuesday, January 13 Tuesday, January 13 Chris Williams Henry’s Stage 10pm-1am Jazz/R&B Wednesday, January 14 Wednesday, January 14 The Ben Whitney Band Henry’s Stage 9:30pm-12:30am Indie/Alt Jam Thursday, January 15 Thursday, January 15 Gracious Day Anson Lounge 7-10pm Country Thursday, January 15 Suffering Moses Henry’s Stage 9:30pm-12:30am Southern Rock Friday, January 16 Friday, January 16 Bubba and Dale Patio 2-5pm Country/Top 40 Friday, January 16 Zach Quillen Anson Lounge 6-9pm Country/Top 40 Friday, January 16 Loren Griste Anson Lounge 9:30pm-12:30am Pop/Country Friday, January 16 Palmetto Drive Henry’s Music Hall 10pm-1am Country/Southern Rock Friday, January 16 Lola Grace Trio Whiskey Room 10pm-1am Indie/Rock Friday, January 16 Good Company Henry’s Stage 10pm-1am Rock/Country Saturday, January 17 Saturday, January 17 Hunter Fieck Patio 2-5pm Indie/Pop Saturday, January 17 Jeff Caldwell Anson Lounge 6-9pm Blues/Rock/Pop Saturday, January 17 Spoda Anson Lounge 9:30pm-12:30am Alt Rock Saturday, January 17 East Bay Band Henry’s Music Hall 10pm-1am Country/Top 40 Saturday, January 17 Chris Williams Whiskey Room 10pm-1am Jazz/R&B Saturday, January 17 Benderfunk Henry’s Stage 10pm-1am Rock/Pop Sunday, January 18 Sunday, January 18 Joe Fisher Patio 2-5pm Classic Rock Sunday, January 18 Gracious Day Henry’s Stage 9:30pm-12:30am Country Monday, January 19 Monday, January 19 Market Street Cowboy Band Henry’s Stage 9:30pm-12:30am Country/Top 40 Tuesday, January 20 Tuesday, January 20 Chris Williams Henry’s Stage 10pm-1am Jazz/R&B Wednesday, January 21 Wednesday, January 21 The Ben Whitney Band Henry’s Stage 9:30pm-12:30am Indie/Alt Jam Thursday, January 22 Thursday, January 22 Market Street Cowboy Band Henry’s Music Hall 9:30pm-12:30am Country/Top 40 Thursday, January 22 Gracious Day Anson Lounge 7-10pm Country Thursday, January 22 Suffering Moses Henry’s Stage 9:30pm-12:30am Southern Rock Friday, January 23 Friday, January 23 Bubba and Dale Patio 2-5pm Country/Top 40 Friday, January 23 Zach Quillen Anson Lounge 6-9pm Country/Top 40 Friday, January 23 Loren Griste Anson Lounge 9:30pm-12:30am Pop/Country Friday, January 23 Market Street Cowboy Band Henry’s Music Hall 10pm-1am Country/Top 40 Friday, January 23 Lola Grace Trio Whiskey Room 10pm-1am Indie/Rock Friday, January 23 Joe Fisher Trio Henry’s Stage 10pm-1am Classic Rock Saturday, January 24 Saturday, January 24 Evelyn Ivory Patio 2-5pm Pop/Soul Saturday, January 24 Jeff Caldwell Anson Lounge 6-9pm Blues/Rock/Pop Saturday, January 24 Evelyn Ivory Anson Lounge 9:30pm-12:30am Pop/Soul Saturday, January 24 Market Street Cowboy Band Henry’s Music Hall 10pm-1am Country/Top 40 Saturday, January 24 Chris Williams Whiskey Room 10pm-1am Jazz/R&B Saturday, January 24 Token Mary Henry’s Stage 10pm-1am R&B/Pop Sunday, January 25 Sunday, January 25 Joe Fisher Patio 2-5pm Classic Rock Sunday, January 25 Gracious Day Henry’s Stage 9:30pm-12:30am Country Monday, January 26 Monday, January 26 Market Street Cowboy Band Henry’s Stage 9:30pm-12:30am Country/Top 40 Tuesday, January 27 Tuesday, January 27 Chris Williams Henry’s Stage 10pm-1am Jazz/R&B Wednesday, January 28 Wednesday, January 28 The Ben Whitney Band Henry’s Stage 9:30pm-12:30am Indie/Alt Jam Thursday, January 29 Thursday, January 29 Gracious Day Anson Lounge 7-10pm Country Thursday, January 29 Suffering Moses Henry’s Stage 9:30pm-12:30am Southern Rock Friday, January 30 Friday, January 30 Bubba and Dale Patio 2-5pm Country/Top 40 Friday, January 30 Zach Quillen Anson Lounge 6-9pm Country/Top 40 Friday, January 30 Spoda Anson Lounge 9:30pm-12:30am Alt Rock Friday, January 30 Chief Brody Henry’s Music Hall 10pm-1am Top 40/Rock Friday, January 30 Joe Wheaton Whiskey Room 10pm-1am Folk/Americana Friday, January 30 Gator Food Henry’s Stage 10pm-1am Alternative Saturday, January 31 Saturday, January 31 Evelyn Ivory Patio 2-5pm Pop/Soul Saturday, January 31 Zach Quillen Anson Lounge 6-9pm Country/Top 40 Saturday, January 31 Spoda Anson Lounge 9:30pm-12:30am Alt Rock Saturday, January 31 Chief Brody Henry’s Music Hall 10pm-1am Top 40/Rock Saturday, January 31 Joe Wheaton Whiskey Room 10pm-1am Folk/Americana Saturday, January 31 Poke The Bear Henry’s Stage 10pm-1am Top 40",
      "hash": "4e6e0de4e2f7",
      "downloadedAt": "2026-01-18T16:54:08.448Z",
      "trimmedAt": "2026-01-18T17:13:05.590Z",
      "sizeReduction": "93.3%"
    },
    {
      "url": "http://www.henrysonthemarket.com/Charleston-Henry-s-on-the-Market-party-inquiry",
      "text": "Party Inquiry Private Event Software powered by Tripleseat",
      "hash": "5a3d3e313e5f",
      "downloadedAt": "2026-01-18T16:54:11.079Z",
      "trimmedAt": "2026-01-18T17:13:05.593Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "http://www.henrysonthemarket.com/#",
      "text": "× Let us host your special event! Whether a birthday party, office function or any other special occasion - we take care of all the fine details, bringing your event to life, just as you imagined. Host your next party or get together Book your party Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! Job Listings Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! 54 North Market Street, Charleston, SC 29401 Visit us at map marker pin Every Day 11:00 AM - 2:00 AM (843)-723-4363 Call us at - Restaurant Bar & Music Hall Henry’s is centrally located in historic downtown Charleston at 54 North Market Street, across from the Charleston city market. Established in 1932, Henry’s is the oldest continuous restaurant in Charleston and the state of South Carolina. Read more about us Groups & parties Tailored events for all occasions Create memories to last a lifetime with our personalized private party options. Let our team help you plan an unforgettable celebration. Book now a private party slideshow start stop playing Slide 1 content Slide 2 content Slide 3 content previous slide next slide Dedicated To Quality Enjoy Delicious Food & Cocktails Our Menu Live Music & Entertainment Grab a drink and enjoy the Atmosphere Entertainment Schedule Private Dining Perfection Moments Of Joy And Celebration Private Events In-House Happenings Start stop events carousel National Margarita Day Sunday February 22nd Come celebrate National Margarita day with us on February 22nd. St. Patrick's Day Tuesday March 17th Grab your best green garb and join us for St. Patrick's Day! Skip Photo Gallery The interior with upholstered seats and tables Served Shrimp Grits Mary's Greek Salad and other dishes A served Spicy Shrimp Roll A plate of Jambalaya Served Mary's Greek Salad A served Charcuterie plate Bourbon Bread Pudding Two meals and a drink Market Burger Southern Shrimp Tacos The outdoor patio A closeup on a Seafood Pasta plate The interior of the restaurant with tables, chairs, and decorations Reviews Start stop reviews carousel Review by - Google Rebecca L: five star review by Oldest restaurant in CHS; Live music nightly; outstanding service, great atmosphere, and delicious food; try the She soup, best chicken salad sandwich I have ever ate Review by - Google Aldo P: five star review by Comfortable atmosphere. The old fashion is excellent made with Ben&Steal local whiskey. Roof top Bar keeps it more of a quiet experience. Review by - Google Les H: five star review by Great place to stop in for a bite to eat. Service and food was excellent, and being the oldest running restaurant it's a cool piece of history. Would definitely come back next time in town. Review by - Google Philip C: five star review by What a great venue multiple levels of bars music restaurants great drinks great service beautiful vibe Great atmosphere. Review by - Google Susan D: five star review by Recently did a girls trip to Charleston and discovered this place. We loved it so much we went 3 times! Delicious jambalaya and the rum punch is amazing! Newsletter Location 54 North Market Street Charleston, SC 29401 Hours Every day 11:00 AM - 2:00 AM Thursday/Friday/Saturday 23+ after 8:30pm Cover charge may begin at variable times depending on nightly activity and capacity. Please check with our staff upon arrival for the most up-to-date information. Find us on... Facebook page Instagram page Google page Contact us (843)-723-4363 Call us at info@henrysonthemarket.com Write us at Careers Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "882c616f7d64",
      "downloadedAt": "2026-01-18T16:54:06.511Z",
      "trimmedAt": "2026-01-18T17:13:05.615Z",
      "sizeReduction": "98.2%"
    },
    {
      "url": "http://www.henrysonthemarket.com/charleston-henry-s-on-the-market-happy-hours-specials",
      "text": "Specials SundayJanuary 18th Mary's Bloody Mary: Tito’s Handmade Vodka, Zing Zang Bloody Mary Mix 11:00 AM - 10:00 PM MondayJanuary 19th Cowboy Gold: Woodford Reserve Whiskey, lemon juice, simple syrup 11:00 AM - 10:00 PM MondayJanuary 19th HAPPY HOUR $4 Domestic Beers/ $6 Well Liquor 04:00 PM - 06:00 PM TuesdayJanuary 20th Henry’s Margarita: Lunazul Blanco Tequila, lime juice, orange liqueur 11:00 AM - 10:00 PM TuesdayJanuary 20th Taco Tuesday *Tacos change weekly 11:00 AM - 10:00 PM TuesdayJanuary 20th HAPPY HOUR $4 Domestic Beers/ $6 Well Liquor 04:00 PM - 06:00 PM WednesdayJanuary 21st Spiked Arnold Palmer: Local Firefly Sweet Tea & Lemonade Vodka, lemon juice, simple syrup 11:00 AM - 10:00 PM WednesdayJanuary 21st HAPPY HOUR $4 Domestic Beers/ $6 Well Liquor 04:00 PM - 06:00 PM ThursdayJanuary 22nd Raspberry Mule: Cathead Raspberry Vodka, lime juice, ginger beer 11:00 AM - 10:00 PM ThursdayJanuary 22nd HAPPY HOUR $4 Domestic Beers/ $6 Well Liquor 04:00 PM - 06:00 PM FridayJanuary 23rd White Sangria: Alverdi Pinot Grigio, lime & lemon juice, peach schnapps, simple syrup 11:00 AM - 10:00 PM FridayJanuary 23rd Red Sangria: Coastal Vines Cabernet, lime & lemon juice, peach schnapps, simple syrup 11:00 AM - 10:00 PM SaturdayJanuary 24th Mimosa: Caposaldo Prosecco, orange juice 11:00 AM - 10:00 PM",
      "hash": "9818216e114c",
      "downloadedAt": "2026-01-18T16:54:10.429Z",
      "trimmedAt": "2026-01-18T17:13:05.620Z",
      "sizeReduction": "98.4%"
    },
    {
      "url": "http://www.henrysonthemarket.com/charleston-henry-s-on-the-market-food-menu",
      "text": "Dining Room Dining Room",
      "hash": "f006e05afd32",
      "downloadedAt": "2026-01-18T16:54:07.124Z",
      "trimmedAt": "2026-01-18T17:13:05.625Z",
      "sizeReduction": "100.0%"
    }
  ],
  "sizeReduction": "98.4%"
}