{
  "venueId": "ChIJNz0pmhN6_ogR5laaX7NUnVs",
  "venueName": "Basic Kitchen",
  "venueArea": "Downtown Charleston",
  "website": "http://www.basickitchen.com/",
  "scrapedAt": "2026-01-18T17:04:25.674Z",
  "trimmedAt": "2026-01-18T17:07:14.407Z",
  "pages": [
    {
      "url": "http://www.basickitchen.com/private-events-1/",
      "text": "× Reservations Location - Required Location Basic Kitchen | Charleston, South Carolina Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service Main content starts here, tab to start navigating Slide 1 of 3 Slide 2 of 3 Slide 3 of 3 Large Party Catering Basic Kitchen’s catering makes it easy to serve fresh, seasonal food for a big crowd. Please use the form below to submit an inquiry. Someone from our team will be in touch soon! View menu (opens in a new tab) Inquire now Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service Private Event Software powered by Tripleseat",
      "hash": "190d23ad905e",
      "downloadedAt": "2026-01-18T16:52:11.587Z",
      "trimmedAt": "2026-01-18T17:07:14.391Z",
      "sizeReduction": "96.2%"
    },
    {
      "url": "http://www.basickitchen.com/private-events/",
      "text": "× Reservations Location - Required Location Basic Kitchen | Charleston, South Carolina Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service Main content starts here, tab to start navigating Slide 1 of 3 Slide 2 of 3 Slide 3 of 3 Private Events & Large Parties We offer for groups of 12-18 and we also offer for larger groups. To inquire about a large party or private event offering, please use the form below to submit a request. Someone from our team will be in touch soon! prix-fixe reservations private events Inquire Now Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service Private Event Software powered by Tripleseat",
      "hash": "4176ad16da43",
      "downloadedAt": "2026-01-18T16:52:11.044Z",
      "trimmedAt": "2026-01-18T17:07:14.396Z",
      "sizeReduction": "96.1%"
    },
    {
      "url": "http://www.basickitchen.com/",
      "text": "× Reservations Location - Required Location Basic Kitchen | Charleston, South Carolina Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service Home Main content starts here, tab to start navigating Book a Table Slide 1 of 7 Slide 2 of 7 Slide 3 of 7 Slide 4 of 7 Slide 5 of 7 Slide 6 of 7 Slide 7 of 7 Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service",
      "hash": "e3b90c95976d",
      "downloadedAt": "2026-01-18T16:52:10.412Z",
      "trimmedAt": "2026-01-18T17:07:14.401Z",
      "sizeReduction": "96.9%"
    },
    {
      "url": "http://www.basickitchen.com/location/hours-and-location/",
      "text": "× Reservations Location - Required Location Basic Kitchen | Charleston, South Carolina Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service Main content starts here, tab to start navigating Hours & Location 82 Wentworth St., Charleston, SC 29401 (opens in a new tab) (843) 789-4568 info@basickitchen.com Monday - Friday 11am-3pm, 5pm-9pm Saturday - Sunday 10am-3pm, 5pm-9pm Get Directions (opens in a new tab) Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service",
      "hash": "fc54f007b42f",
      "downloadedAt": "2026-01-18T16:52:10.501Z",
      "trimmedAt": "2026-01-18T17:07:14.407Z",
      "sizeReduction": "96.5%"
    }
  ],
  "sizeReduction": "96.4%"
}