{
  "venueId": "ChIJT2PTq2B6_ogRIrWFtaGTRrU",
  "venueName": "Taco Boy Charleston",
  "venueArea": "Mount Pleasant",
  "website": "http://www.tacoboy.net/",
  "scrapedAt": "2026-01-18T17:04:26.596Z",
  "trimmedAt": "2026-01-18T17:08:02.310Z",
  "pages": [
    {
      "url": "http://www.tacoboy.net/location/loso/",
      "text": "Main content starts here, tab to start navigating LoSo, Charlotte View Hours View Menu In-House Events Off-Site Catering Events & Happenings Parking Reservations Hours & Location 3700 South Blvd STE 100, Charlotte, NC 28209 980.341.8226 Monday - Saturday, 11:30am – 9pmSunday, 11:30am – 8pm Daily Food Happy Hour, 3 – 6pm Happenings & Events Trivia Night Charlotte Restaurant Week Tequila Tuesday $5 Casa Margaritas Tequila Tuesday & Saturday DJ Beats 1/2 PRICE WINGS ON MONDAY Daily Happy Hour PARKING Free on-site street parking within LoSo Station development Taco Boy will validate 1.5 hours of parking in the garage connected to the MAA apartment building behind Taco Boy, at the corner of Script Ln and Craft St. IMPORTANT: Those seeking validated parking must only use lane 2 and 3 to enter the garage. There is a text-to-park parking lot adjacent to Taco Boy at the corner of South Blvd and Whitton St. 8-hr parking for $3. Our Story Taco Boy LoSo, established in January 2024, is our newest addition located in LoSo Station, Charlotte, NC. It features a large mural by Jen Hill, an in-house tortilleria, in-house DJ booth, bar and dining room seating, as well as a sunroom with retractable doors that open to the patio. : We offer validated parking up to 90 minutes. Just turn your ticket into the host stand to be validated. Guests should use lanes 2 and 3 to enter the garage. Parking Menus Restaurant Week Menu Food Menu Happy Hour Menu Beverage Menu Kids Menu Click to Download the Taco Boy Restaurant Week Menu Below: Download PDF Small Plates SCRATCH-MADE GUACAMOLE / 15 fresh avocado, salsa cruda, lime vegan Wings 6 crispy chicken wings served with chipotle ranch dry rubbed: blend of seasonings & brown sugar / 12 elote: tossed with chipotle aioli, cotija cheese, lime / 14 Mexican Street Corn Dip / 12 vegetarian Chips & Queso / 10 vegetarian SALSA DUO / 6 roja, verde vegetarian TACO BOY APPETIZER TRIO / 16 queso, guacamole, salsa roja vegetarian TAQUITOS / 10 crispy corn tortillas, tinga chicken, cotija cheese, green chile sauce, salsa cruda, crema Loaded Queso Fries / 11 sidewinder fries, black beans, queso, guacamole, lettuce, salsa cruda, crema, green onions add: bacon +4 vegetarian NACHOS / 13 choice of black or refried beans, queso, guacamole, lettuce, salsa cruda, crema, green onions, protein vegan chorizo, ground beef, carnitas, grilled chicken, birria, carne asada, grilled shrimp Salads MEXICAN CAESAR SALAD / 11 romaine, roasted corn, cotija cheese, toasted pepitas, tajín breadcrumbs, caesar-lime dressing vegetarian TACO BOY SALAD / 12 mixed greens, avocado, bell peppers, roasted corn, queso fresco, salsa cruda, corn tortilla strips, chipotle ranch dressing or cilantro-lime vinaigrette vegetarian Add-Ons select your protein: morningstar vegan chorizo (vegan), ground beef, carnitas, grilled or crispy chicken, tinga chicken birria, carne asada, grilled or crispy shrimp, grilled mahi Monday – Friday until 4pm Weekday Lunch Combo $14 2 tacos • rice & beans • plus a drink choose any 2 tacos served with rice & beans, iced tea, soda, or agua fresca ... add a side of chips & guac +5 choose 2 tacos for $15 or 3 tacos for $20 served with rice & beans tortilla choices: corn, flour, (lettuce wrap *vegan* +1) add a side of chips & guac for your taco platter +5 Tacos & Platters Crispy Avocado / 6 crispy avocado, rainbow slaw, thai chile sauce, green onion vegan Carnitas / 6 braised pork, queso fresco, pickled red onions, green chile sauce, cilantro Kimchi Beef / 6 steak, korean bbq sauce, kimchi, toasted sesame seeds, cilantro Tinga / 6 tinga chicken, cotija cheese, pickled red onions, cilantro Chicken, Bacon, Ranch / 6 grilled chicken, crispy smoked bacon, spring mix, chipotle ranch Birria / 6 braised birria-style beef, mexican cheeses, onions, cilantro, consommé Grilled Fish / 6 mahi, spring mix, cilantro dijon, salsa cruda Carne Asada / 6 steak, green chile sauce, salsa cruda Firecracker / 6 crispy shrimp, rainbow slaw, firecracker sauce, cilantro Americano / 5 seasoned ground beef, mexican cheeses, lettuce, salsa cruda (sub crispy corn shell) Baja / 6 crispy shrimp or mahi, rainbow slaw, chipotle aioli, cilantro Grilled Shrimp / 6 rainbow slaw, queso fresco, salsa cruda, green onions, chipotle aioli More than Tacos Rice Bowl / 14 black beans (vegan) or refried beans, mexican rice, roasted corn, avocado, rainbow slaw, queso fresco, roasted pepitas, salsa cruda, green chile sauce or roasted tomato salsa vegetarian Burrito / 12 black beans (vegan) or refried beans, mexican rice, mexican cheeses, lettuce, salsa cruda, crema, served with a side salad always extra guac: add guac (vegan) +2 make it a california burrito: add sidewinder fries +2 vegetarian Tijuana Hot Dog / 10 bacon wrapped all-beef hot dog in a bun, peppers & onions, salsa cruda, pickled jalapeños, chipotle aioli, served with sidewinder fries Add-Ons select your protein: morningstar vegan chorizo (vegan), ground beef, carnitas, grilled or crispy chicken, tinga chicken birria, carne asada, grilled or crispy shrimp, grilled mahi served with guacamole & crema Quesadillas Classic Cheese / 10 mexican cheeses + add-ons: grilled chicken, carne asada, grilled shrimp add: salsa cruda (vegan) vegetarian Veggie / 14 mexican cheeses, black beans (vegan), roasted corn, onions, poblano vegetarian Cheeseburger Dilla / 15 seasoned ground beef, mexican cheeses, lettuce, pickles, salsa cruda, special sauce Texas Fajita Dilla / 16 carne asada, grilled shrimp, chicken, peppers & onions, salsa verde QUESABIRRIA / 16 mexican cheeses, braised birria-style beef, onions, cilantro, consommé Sides MEXICAN RICE / 4 vegan BLACK BEANS / 4 vegan Sidewinder Fries / 4 vegan STREET CORN / 6 order on or off the cob! vegetarian Guacamole / 5 vegan REFRIED BEANS / 4 SIDE SALAD / 5 vegan Desserts CHURROS / 8 pistachio sugar, dulce de leche vegetarian TRES LECHES / 8 three-milks, brandy-infused, sponge cake, cinnamon vegetarian every day 3-6pm see our menu for rotating selections Happy Hour Attention to our guests with allergies or dietary preferences: We're committed to meeting your needs. Please note, despite our best efforts, cross-contamination can occur. Dishes could come into contact with allergens like dairy, eggs, wheat, soy, tree nuts, peanuts, fish, and shellfish. Crispy and fried offerings are prepared in soybean oil. Kindly be aware that a 3% processing fee applies to all credit card payments. This fee does not apply to debit card transactions. For ease of transaction with parties of eight or more, a 20% suggested tip will be applied to your check. Thank you for choosing Taco Boy! free chips & salsa!!! every day 3 – 6pm Happy Hour Snacks Chips & Queso / 5 vegetarian Mini Nachos / 6 black beans (vegan) or refried beans, queso, guacamole, lettuce, salsa cruda, crema, green onions Tacos Americano / 3 seasoned ground beef, mexican cheeses, lettuce, salsa cruda Tinga / 4 tinga chicken, cotija cheese, pickled red onions, cilantro Carnitas / 4 braised pork, queso fresco, pickled red onions, green chile sauce, cilantro $5 house margaritas Tequila Tuesdays! in our search for the best local mexican-style lager, we teamed up with our friends at munkle brewing co. in charleston to develop an original brew especially for taco boy Taco Boy's Own Contigo Lager / 6 Draft Beers PACIFICO / 6 Dos Equis Lager • Ambar / 6 Modelo Especial / 6 PBR / 4 Bottles & Cans Tecate / 5 BUD LIGHT / 5 Miller Lite / 5 MICHELOB ULTRA / 6 Corona • Corona Light / 6 Sierra Nevada Hazy Little Thing / 6 Athletic Brewing Co. (Non-Alcoholic) / 6 mexican-style copper Hemp-Derived Cans & Spirits Ask your server about our rotating selections Wine Cans / 9 white red bubbly rosé Beverages Topo Chico / 4 Jarritos Soda / 4 Mexican Coke / 4 Frozen Lemonade 4 $ Lemonade / 3 Sodas / 3 Iced Tea / 3 Agua Fresca / 4 rotating flavors of fresh fruit, lime, water, agave Suéro Serum / 5 mexico's hangover cure MAKE IT A PITCHER! serves 6 pitchers need 2 guests (or more) to pour Cold Margs & Cocktails Casa or Casa Frozen / 10 • 50 the classic: tequila blanco, triple sec, organic lime juice, orange juice, splash of simple, salt add a flavor: strawberry, pineapple-passion fruit, mango + 2 $ tequila tuesday: $5 casa margs every tuesday! Cadillac / 12 • 60 casa margarita topped with grand marnier floater Skinny Casa / 11 • 55 lighter version of the casa margarita, organic lime juice, splash of orange juice, agave, salt Spicy Margarita / 12 • 60 tequila blanco infused with hot peppers, triple sec, agave, organic lime juice, salt Tito-Rita / 12 • 60 tito’s vodka, house made sour mix, tajín rim add a flavor: strawberry, pineapple-passion fruit, mango + 1 $ Pineapple Margarita / 12 • 60 pineapple-infused tequila, cinnamon, vanilla, organic lime juice, splash of orange juice, agave, salt Blood Orange Margarita / 13 • 65 tequila reposado, triple sec, blood orange, organic lime juice, agave, agave worm salt Tropical Frozen Margaritas / 11 • 55 3 options to choose from: mango + salt strawberry + salt pineapple-passion fruit + tajín HIBISCUS MARGARITA / 13 • 65 tequila blanco, triple sec, hibiscus, fresh lime, orange juice, cinnamon-fennel salt Cocktails & More Ms. Prickly Punch / 11 tequila blanco, aperol, pineapple juice, agave, passion fruit puree, fresh lime Mexican Ashtray + Shot / 10 tecate with valentina, tajín rim + lunazul blanco shot create your own flight of 3 one ounce pours or try them individually! price as marked *not available in a flight Tequila Flights / 22 made by filtering añejo or extra añejo tequila with activated charcoal hints of: crisp citrus & agave Cristalino “Crystal Clear” Herradura Ultra* / 16 Komos Añejo* / 30 Hornitos Añejo* / 12 Maestro Dobel Diamante* / 14 Gran Coramino* / 14 clear & colorless, typically bottled after distillation hints of: citrus, earthiness, & pepper Blanco “White” Casamigos* / 14 Don Julio* / 15 Espolòn / 11 Lunazul / 10 Patrón* / 15 Cazadores / 10 Herradura* / 14 Tres Gen* / 14 Tequila Ocho Plata* / 14 aged two months to one year in oak or steel barrels hints of: vanilla, caramel, & spices Reposado “Rested” Casamigos* / 14 Don Julio* / 14 Espolòn / 10 Lunazul / 10 Patrón* / 14 Cazadores / 11 Herradura* / 14 La Gritona* / 14 aged one to three years in oak barrels hints of: vanilla, caramel, & oak Añejo “Old” Casamigos* / 15 Don Julio* / 16 Espolòn / 11 Lunazul / 10 Patrón* / 15 Cazadores / 11 Herradura* / 14 Tres Gen* / 14 tequila’s smoky cousin hints of: smokiness, earthiness, & a fruit-forward presence Mezcal “Made from Agave” Casamigos* / 14 Creyente* / 12 Monte Alban / 10 Los Siete Misterios / 11 Union / 11 Banhez / 11 Alcohol Consumption Notice: Taco Boy is committed to the safety of our patrons and community. To support this, we provide the availability of transportation after the consumption of alcohol. Please notify your server should you need assistance or a safe ride home and we will gladly make the appropriate arrangements. Alcohol consumption is a personal choice. It is your responsibility to drink responsibly and take appropriate precautions to protect yourself, other patrons, and the community from harm. We proudly serve alcohol responsibly and appreciate your patience as we ask for ID for all alcoholic beverages. children 10 & under sub sidewinder fries +2 Kids Menu Kids Taco / 5 served with rice & beans mexican cheeses and choice of: grilled chicken, black beans, seasoned ground beef, or crispy chicken Chicken Quesadilla / 7 served with rice & beans grilled chicken and mexican cheeses Cheese Quesadilla / 6 served with rice & beans mexican cheeses Hot Dog / 6 all-beef hot dog in a bun, served with sidewinder fries and ketchup For Dessert / 2 served with dulce de leche add a single churro Get Directions Order Online Reservations Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Please, enter a valid location Location - Required Location Folly Beach Downtown Charleston Summerville Biltmore Park LoSo, Charlotte Please leave blank or enter a valid phone number Phone Number - Optional I consent to receive SMS from Taco Boy. MSG & Data Rates May Apply. - Optional I consent to receive SMS from Taco Boy. MSG & Data Rates May Apply. Yes No Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Folly Beach Downtown Charleston Summerville Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "0f7688f23047",
      "downloadedAt": "2026-01-18T16:57:28.203Z",
      "trimmedAt": "2026-01-18T17:08:02.064Z",
      "sizeReduction": "88.3%"
    },
    {
      "url": "http://www.tacoboy.net/summerville-events/",
      "text": "Main content starts here, tab to start navigating Summerville Events Special Events Tequila Tuesday $5 Casa Margaritas Drag Queen Bingo 1/2 PRICE WINGS ON MONDAY Daily Happy Hour Tequila Tuesdays $5 Casa Margaritas(rocks, frozen, skinny) Daily Happy Hour Happy Hour is our new favorite excuse to slow down and savor the moment. From 3-6 PM daily, imbibe on free chips & salsa, daily deals, share stories with friends, and enjoy a little time to just be together. 1/2 PRICE WINGS ON MONDAYS Because Mondays deserve a little something extra!Mondays are tough. Let’s get through them together! Half-price wings and $2 PBRs every Monday at Taco Boy—it’s the perfect excuse to gather and brighten up your day. Order Online Reservations Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Please, enter a valid location Location - Required Location Folly Beach Downtown Charleston Summerville Biltmore Park LoSo, Charlotte Please leave blank or enter a valid phone number Phone Number - Optional I consent to receive SMS from Taco Boy. MSG & Data Rates May Apply. - Optional I consent to receive SMS from Taco Boy. MSG & Data Rates May Apply. Yes No Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Folly Beach Downtown Charleston Summerville Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "2459aaee561b",
      "downloadedAt": "2026-01-18T16:57:29.869Z",
      "trimmedAt": "2026-01-18T17:08:02.073Z",
      "sizeReduction": "96.3%"
    },
    {
      "url": "http://www.tacoboy.net/",
      "text": "Homepage Main content starts here, tab to start navigating Slide 1 of 8 Slide 2 of 8 Slide 3 of 8 Slide 4 of 8 Slide 5 of 8 Slide 6 of 8 Slide 7 of 8 Slide 8 of 8 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides A Taqueria for The Soul Reservations Start Earning Rewards Earn 1 point for every $2 spent and unlock $10 off every 100 points! Bonus: You'll also receive a $10 birthday month reward! Sign Up for Our Loyalty Program Check Your Reward Status Catering We can do it all From corporate lunches to wedding celebrations, bachelor/bachelorette parties, and off-site catering events for large parties. — Make it easy We offer online ordering and delivery through EZ Cater — perfect for office meetings and small parties under 60 people! — Click to Learn More! In-House Events We are Taco Boy — a fun, vibrant, and community-centric taqueria serving up delicious vibes in five eclectic, inviting spaces across the Carolinas. We love to host and welcome all to an exuberant party! Book Your Next Event! Join The Newsletter We get it. We all get too many emails. Which is why when you join our newsletter, we promise you'll only receive news about upcoming events, promotions, and exclusive offers you won't want to miss. Sign Up Today Upcoming Events & Happenings Charlotte Restaurant Week Asheville Restaurant Week Charleston Restaurant Week Tequila Tuesday $5 Casa Margaritas Drag Queen Bingo 1/2 PRICE WINGS ON MONDAY Daily Happy Hour Let's Socialize! @TacoBoyEats Order Online Reservations Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Please, enter a valid location Location - Required Location Folly Beach Downtown Charleston Summerville Biltmore Park LoSo, Charlotte Please leave blank or enter a valid phone number Phone Number - Optional I consent to receive SMS from Taco Boy. MSG & Data Rates May Apply. - Optional I consent to receive SMS from Taco Boy. MSG & Data Rates May Apply. Yes No Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Folly Beach Downtown Charleston Summerville Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "36fbf6eb4300",
      "downloadedAt": "2026-01-18T16:57:25.377Z",
      "trimmedAt": "2026-01-18T17:08:02.087Z",
      "sizeReduction": "96.6%"
    },
    {
      "url": "http://www.tacoboy.net/folly-beach-events/",
      "text": "Main content starts here, tab to start navigating Folly Beach Events Special Events Charleston Restaurant Week Tequila Tuesday $5 Casa Margaritas Live Entertainment at Club Taco Boy Drag Queen Bingo 1/2 PRICE WINGS ON MONDAY 5th Annual Folly Beach Litter Sweep Daily Happy Hour Live Music + DJ Schedule Rooftop Jaguar Bar Hours Thursday & Friday, 4pm – Close Saturday, Noon – Close Sunday, Noon – 4pm Tequila Tuesdays $5 Casa Margaritas(rocks, frozen, skinny) 1/2 PRICE WING ON MONDAYS Because Mondays deserve a little something extra!Mondays are tough. Let’s get through them together! Half-price wings and $2 PBRs every Monday at Taco Boy—it’s the perfect excuse to gather and brighten up your day. Order Online Reservations Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Please, enter a valid location Location - Required Location Folly Beach Downtown Charleston Summerville Biltmore Park LoSo, Charlotte Please leave blank or enter a valid phone number Phone Number - Optional I consent to receive SMS from Taco Boy. MSG & Data Rates May Apply. - Optional I consent to receive SMS from Taco Boy. MSG & Data Rates May Apply. Yes No Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Folly Beach Downtown Charleston Summerville Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "7e07b5ff87fb",
      "downloadedAt": "2026-01-18T16:57:28.750Z",
      "trimmedAt": "2026-01-18T17:08:02.096Z",
      "sizeReduction": "96.5%"
    },
    {
      "url": "http://www.tacoboy.net/biltmore-events/",
      "text": "Main content starts here, tab to start navigating Biltmore Park Events Slide 1 of 2 Slide 2 of 2 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Special Events Asheville Restaurant Week Tequila Tuesday $5 Casa Margaritas 1/2 PRICE WINGS ON MONDAY Daily Happy Hour Tequila Tuesdays $5 Casa Margaritas(rocks, frozen, skinny) Daily Happy Hour Happy Hour is our new favorite excuse to slow down and savor the moment. From 3-6 PM daily, imbibe on free chips & salsa, daily deals, share stories with friends, and enjoy a little time to just be together. 1/2 PRICE WING ON MONDAYS Because Mondays deserve a little something extra!Mondays are tough. Let’s get through them together! Half-price wings and $2 PBRs every Monday at Taco Boy—it’s the perfect excuse to gather and brighten up your day. Order Online Reservations Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Please, enter a valid location Location - Required Location Folly Beach Downtown Charleston Summerville Biltmore Park LoSo, Charlotte Please leave blank or enter a valid phone number Phone Number - Optional I consent to receive SMS from Taco Boy. MSG & Data Rates May Apply. - Optional I consent to receive SMS from Taco Boy. MSG & Data Rates May Apply. Yes No Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Folly Beach Downtown Charleston Summerville Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "878d51fba00c",
      "downloadedAt": "2026-01-18T16:57:30.416Z",
      "trimmedAt": "2026-01-18T17:08:02.105Z",
      "sizeReduction": "96.3%"
    },
    {
      "url": "http://www.tacoboy.net/downtown-charleston-events/",
      "text": "Main content starts here, tab to start navigating Downtown Charleston Events Special Events Charleston Restaurant Week Tequila Tuesday $5 Casa Margaritas 1/2 PRICE WINGS ON MONDAY Daily Happy Hour 2026 Cooper River Bridge Run: Team Taco! Tequila Tuesdays $5 Casa Margaritas(rocks, frozen, skinny) Daily Happy Hour Happy Hour is our new favorite excuse to slow down and savor the moment. From 3-6 PM daily, imbibe on free chips & salsa, daily deals, share stories with friends, and enjoy a little time to just be together. 1/2 PRICE WING ON MONDAYS Because Mondays deserve a little something extra!Mondays are tough. Let’s get through them together! Half-price wings and $2 PBRs every Monday at Taco Boy—it’s the perfect excuse to gather and brighten up your day. Order Online Reservations Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Please, enter a valid location Location - Required Location Folly Beach Downtown Charleston Summerville Biltmore Park LoSo, Charlotte Please leave blank or enter a valid phone number Phone Number - Optional I consent to receive SMS from Taco Boy. MSG & Data Rates May Apply. - Optional I consent to receive SMS from Taco Boy. MSG & Data Rates May Apply. Yes No Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Folly Beach Downtown Charleston Summerville Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "904697ee6991",
      "downloadedAt": "2026-01-18T16:57:29.306Z",
      "trimmedAt": "2026-01-18T17:08:02.113Z",
      "sizeReduction": "96.3%"
    },
    {
      "url": "http://www.tacoboy.net/location/summerville/",
      "text": "Main content starts here, tab to start navigating Summerville View Hours View Menu In-House Events Off-Site Catering Events & Happenings Reservations Slide 1 of 2 Slide 2 of 2 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Hours & Location 106 Front Street, Summerville, SC 29486 843.851.8226 Sunday – , 11am – 9pm Saturday Daily Happy Hour, 3 – 6pm Happenings & Events Tequila Tuesday $5 Casa Margaritas Drag Queen Bingo 1/2 PRICE WINGS ON MONDAY Daily Happy Hour Our Story Our Summerville location opened in 2019 in the buzzing Nexton community. Our interior is warmly lit with soaring ceilings and authentic Mexican art adorning the walls, while our four-season greenhouse is a go-to spot for soaking up the sunshine in a cheery, green space. We host occasional cornhole tournaments, drag shows, and other festive events that benefit our charitable community partners. Ample parking is available. Menus Food Menu Happy Hour Menu Beverage Menu Kids Menu Small Plates SCRATCH-MADE GUACAMOLE / 15 fresh avocado, salsa cruda, lime vegan Wings 6 crispy chicken wings served with chipotle ranch dry rubbed: blend of seasonings & brown sugar / 12 elote: tossed with chipotle aioli, cotija cheese, lime / 14 Mexican Street Corn Dip / 12 vegetarian Chips & Queso / 10 vegetarian SALSA DUO / 6 roja, verde vegetarian TACO BOY APPETIZER TRIO / 16 queso, guacamole, salsa roja vegetarian TAQUITOS / 10 crispy corn tortillas, tinga chicken, cotija cheese, green chile sauce, salsa cruda, crema Loaded Queso Fries / 11 sidewinder fries, black beans, queso, guacamole, lettuce, salsa cruda, crema, green onions add: bacon +4 vegetarian NACHOS / 13 choice of black or refried beans, queso, guacamole, lettuce, salsa cruda, crema, green onions, protein vegan chorizo, ground beef, carnitas, grilled chicken, birria, carne asada, grilled shrimp Salads MEXICAN CAESAR SALAD / 11 romaine, roasted corn, cotija cheese, toasted pepitas, tajín breadcrumbs, caesar-lime dressing vegetarian TACO BOY SALAD / 12 mixed greens, avocado, bell peppers, roasted corn, queso fresco, salsa cruda, corn tortilla strips, chipotle ranch dressing or cilantro-lime vinaigrette vegetarian Add-Ons select your protein: morningstar vegan chorizo (vegan), ground beef, carnitas, grilled or crispy chicken, tinga chicken birria, carne asada, grilled or crispy shrimp, grilled mahi choose 2 tacos for $15 or 3 tacos for $20 served with rice & beans tortilla choices: corn, flour, (lettuce wrap *vegan* +1) Tacos & Platters Crispy Avocado / 6 crispy avocado, rainbow slaw, thai chile sauce, green onion vegan Carnitas / 6 braised pork, queso fresco, pickled red onions, green chile sauce, cilantro Kimchi Beef / 6 steak, korean bbq sauce, kimchi, toasted sesame seeds, cilantro Tinga / 6 tinga chicken, cotija cheese, pickled red onions, cilantro Chicken, Bacon, Ranch / 6 grilled chicken, crispy smoked bacon, spring mix, chipotle ranch Birria / 6 braised birria-style beef, mexican cheeses, onions, cilantro, consommé Grilled Fish / 6 mahi, spring mix, cilantro dijon, salsa cruda Carne Asada / 6 steak, green chile sauce, salsa cruda Firecracker / 6 crispy shrimp, rainbow slaw, firecracker sauce, cilantro Americano / 5 seasoned ground beef, mexican cheeses, lettuce, salsa cruda (sub crispy corn shell) Baja / 6 crispy shrimp or mahi, rainbow slaw, chipotle aioli, cilantro Grilled Shrimp / 6 rainbow slaw, queso fresco, salsa cruda, green onions, chipotle aioli Monday – Friday until 4pm Weekday Lunch Combo $14 2 tacos • rice & beans • plus a drink choose any 2 tacos served with rice & beans, iced tea, soda, or agua fresca ... add a side of chips & guac +5 More than Tacos Rice Bowl / 14 black beans (vegan) or refried beans, mexican rice, roasted corn, avocado, rainbow slaw, queso fresco, roasted pepitas, salsa cruda, green chile sauce or roasted tomato salsa vegetarian Burrito / 12 black beans (vegan) or refried beans, mexican rice, mexican cheeses, lettuce, salsa cruda, crema, served with a side salad always extra guac: add guac (vegan) +2 make it a california burrito: add sidewinder fries +2 vegetarian Add-Ons select your protein: morningstar vegan chorizo (vegan), ground beef, carnitas, grilled or crispy chicken, tinga chicken birria, carne asada, grilled or crispy shrimp, grilled mahi Tijuana Hot Dog / 10 bacon wrapped all-beef hot dog in a bun, peppers & onions, salsa cruda, pickled jalapeños, chipotle aioli, served with sidewinder fries served with guacamole & crema Quesadillas Classic Cheese / 10 mexican cheeses + add-ons: grilled chicken, carne asada, grilled shrimp add: salsa cruda (vegan) vegetarian Veggie / 14 mexican cheeses, black beans (vegan), roasted corn, onions, poblano vegetarian Cheeseburger Dilla / 15 seasoned ground beef, mexican cheeses, lettuce, pickles, salsa cruda, special sauce Texas Fajita Dilla / 16 carne asada, grilled shrimp, chicken, peppers & onions, salsa verde QUESABIRRIA / 16 mexican cheeses, braised birria-style beef, onions, cilantro, consommé Sides MEXICAN RICE / 4 vegan BLACK BEANS / 4 vegan Sidewinder Fries / 4 vegan STREET CORN / 6 order on or off the cob! vegetarian Guacamole / 5 vegan REFRIED BEANS / 4 SIDE SALAD / 5 vegan Desserts CHURROS / 8 pistachio sugar, dulce de leche vegetarian TRES LECHES / 8 three-milks, brandy-infused, sponge cake, cinnamon vegetarian every day 3-6pm see our menu for rotating selections Happy Hour Attention to our guests with allergies or dietary preferences: We're committed to meeting your needs. Please note, despite our best efforts, cross-contamination can occur. Dishes could come into contact with allergens like dairy, eggs, wheat, soy, tree nuts, peanuts, fish, and shellfish. Crispy and fried offerings are prepared in soybean oil. Kindly be aware that a 3% processing fee applies to all credit card payments. This fee does not apply to debit card transactions. For ease of transaction with parties of eight or more, a 20% suggested tip will be applied to your check. Thank you for choosing Taco Boy! free chips & salsa every day 3 – 6pm Happy Hour Drinks Well, Well, Well, $5 Well Liquors high spirits, low prices – just add your mixer! Snacks Chips & Queso / 5 vegetarian Mini Nachos / 6 black beans (vegan) or refried beans, queso, guacamole, lettuce, salsa cruda, crema, green onions Tacos Americano / 3 seasoned ground beef, mexican cheeses, lettuce, salsa cruda Carnitas / 4 braised pork, queso fresco, pickled red onions, green chile sauce, cilantro Tinga / 4 tinga chicken, cotija cheese, pickled red onions, cilantro $5 house margaritas Tequila Tuesdays! in our search for the best local mexican-style lager, we teamed up with our friends at munkle brewing co. in charleston to develop an original brew especially for taco boy Taco Boy's Own Contigo Lager / 6 Draft Beers PACIFICO / 6 Dos Equis Lager • Ambar / 6 Modelo Especial / 6 PBR / 4 Bottles & Cans Tecate / 5 BUD LIGHT / 5 Miller Lite / 5 MICHELOB ULTRA / 6 Corona • Corona Light / 6 Sierra Nevada Hazy Little Thing / 7 Athletic Brewing Co. (Non-Alcoholic) / 6 mexican-style copper high vibes, no booze Ask us about our rotating selection of hemp-derived beverages Chill Sips Wine Cans / 9 white red bubbly rosé Beverages Topo Chico / 4 Jarritos Soda / 4 Mexican Coke / 4 Lemonade / 3 Frozen Lemonade / 4 Sodas / 3 Iced Tea / 3 Agua Fresca / 4 rotating flavors of fresh fruit, lime, water, agave Suéro Serum / 5 mexico's hangover cure MAKE IT A PITCHER! serves 6 pitchers need 2 guests (or more) to pour add a Cointreau Floater to any marg +3 Cold Margs & Cocktails Casa or Casa Frozen / 10 • 50 the classic: tequila blanco, triple sec, organic lime juice, orange juice, splash of simple, salt add a flavor: strawberry, pineapple-passion fruit, mango + 2 $ tequila tuesday: $5 casa margs every tuesday! Cadillac / 12 • 60 casa margarita topped with grand marnier floater Skinny Casa / 11 • 55 lighter version of the casa margarita, organic lime juice, splash of orange juice, agave, salt Spicy Margarita / 12 • 60 tequila blanco infused with hot peppers, triple sec, agave, organic lime juice, salt Tito-Rita / 12 • 60 tito’s vodka, house made sour mix, tajín rim add a flavor: strawberry, pineapple-passion fruit, mango + 1 $ Pineapple Margarita / 12 • 60 pineapple-infused tequila, cinnamon, vanilla, organic lime juice, splash of orange juice, agave, salt Blood Orange Margarita / 13 • 65 tequila reposado, triple sec, blood orange, organic lime juice, agave, agave worm salt HIBISCUS MARGARITA / 13 • 65 tequila blanco, triple sec, hibiscus, fresh lime, orange juice, cinnamon-fennel salt Tropical Frozen Margaritas / 11 • 55 3 options to choose from: mango + salt strawberry + salt pineapple-passion fruit + tajín Cocktails & More Ms. Prickly Punch / 11 tequila blanco, aperol, pineapple juice, agave, passion fruit puree, fresh lime Mexican Ashtray + Shot / 10 tecate with valentina, tajín rim + lunazul blanco shot Rosé Sangria / 11 rosé, brandy, strawberry, lime juice made by filtering añejo or extra añejo tequila with activated charcoal hints of: crisp citrus & agave Cristalino “Crystal Clear” Herradura Ultra / 14 Komos Añejo* / 35 Hornitos Añejo / 13 Maestro Dobel Diamante / 12 Gran Coramino / 14 clear & colorless, typically bottled after distillation hints of: citrus, earthiness, & pepper Blanco “White” Casamigos / 12 Don Julio* / 13 Espolòn / 10 Lunazul / 6 Patron / 13 Cazadores / 8 Herradura / 12 Tres Gen / 11 Tequila Ocho Plata / 12 aged two months to one year in oak or steel barrels hints of: vanilla, caramel, & spices Reposado “Rested” Casamigos* / 13 Don Julio / 15 Espolòn / 9 Lunazul / 8 Patron / 13 Cazadores / 8 Herradura / 12 Don Gato / 12 La Gritona / 13 aged one to three years in oak barrels hints of: vanilla, caramel, & oak Añejo “Old” Casamigos* / 12 Don Julio* / 15 Espolòn / 9 Lunazul / 8 Patron* / 14 Cazadores / 8 Herradura* / 13 Tres Gen / 11 tequila’s smoky cousin hints of: smokiness, earthiness, & a fruit-forward presence Mezcal “Made from Agave” Casamigos* / 14 Creyente / 13 Monte Alban / 8 Los Siete Misterios / 11 Union / 8 Banhez / 10 create your own flight of 3 one ounce pours or try them individually! price as marked Tequila Flights / 22 Alcohol Consumption Notice: Taco Boy is committed to the safety of our patrons and community. To support this, we provide the availability of transportation after the consumption of alcohol. Please notify your server should you need assistance or a safe ride home and we will gladly make the appropriate arrangements. Alcohol consumption is a personal choice. It is your responsibility to drink responsibly and take appropriate precautions to protect yourself, other patrons, and the community from harm. We proudly serve alcohol responsibly and appreciate your patience as we ask for ID for all alcoholic beverages. children 10 & under sub sidewinder fries +2 Kids Menu Kids Taco / 5 served with rice & beans mexican cheeses and choice of: grilled chicken, black beans, seasoned ground beef, or crispy chicken Chicken Quesadilla / 7 served with rice & beans grilled chicken and mexican cheeses Cheese Quesadilla / 6 served with rice & beans mexican cheeses Hot Dog / 6 all-beef hot dog in a bun, served with sidewinder fries and ketchup For Dessert / 2 served with dulce de leche add a single churro Get Directions Order Online Reservations Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Please, enter a valid location Location - Required Location Folly Beach Downtown Charleston Summerville Biltmore Park LoSo, Charlotte Please leave blank or enter a valid phone number Phone Number - Optional I consent to receive SMS from Taco Boy. MSG & Data Rates May Apply. - Optional I consent to receive SMS from Taco Boy. MSG & Data Rates May Apply. Yes No Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Folly Beach Downtown Charleston Summerville Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "9efecea18c90",
      "downloadedAt": "2026-01-18T16:57:27.097Z",
      "trimmedAt": "2026-01-18T17:08:02.160Z",
      "sizeReduction": "88.7%"
    },
    {
      "url": "http://www.tacoboy.net/tacoboy-locations/",
      "text": "Main content starts here, tab to start navigating South Carolina Folly Beach 106 East Ashley Avenue, Folly Beach, SC 29439 843.588.9761 View More Order Delivery or Takeout Make a Reservation Charleston 217 Huger Street Charleston, SC 29403 843.789.3333 View More Order Delivery or Takeout Make a Reservation Summerville 106 Front Street Summerville, SC 29486 843.851.8226 View More Order Delivery or Takeout Make a Reservation North Carolina Biltmore Park 2 Town Square Blvd STE 120 Asheville, NC 28803 828.829.8226 View More Order Delivery or Takeout Make a Reservation Charlotte 3700 South Blvd STE 100 Charlotte, NC 28209 980.341.8226 View More Order Delivery or Takeout Make a Reservation Order Online Reservations Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Please, enter a valid location Location - Required Location Folly Beach Downtown Charleston Summerville Biltmore Park LoSo, Charlotte Please leave blank or enter a valid phone number Phone Number - Optional I consent to receive SMS from Taco Boy. MSG & Data Rates May Apply. - Optional I consent to receive SMS from Taco Boy. MSG & Data Rates May Apply. Yes No Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Folly Beach Downtown Charleston Summerville Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "b551d77c58da",
      "downloadedAt": "2026-01-18T16:57:25.437Z",
      "trimmedAt": "2026-01-18T17:08:02.169Z",
      "sizeReduction": "96.1%"
    },
    {
      "url": "http://www.tacoboy.net/location/biltmore-park/",
      "text": "Main content starts here, tab to start navigating Biltmore Park View Hours View Menu In-House Events Off-Site Catering Events & Happenings Reservations Hours & Location 2 Town Square Blvd STE 120, Asheville, NC 28803 828.829.8226 Sunday - Thursday, 12pm – 8pmFriday & Saturday, 12pm – 9pm Daily Food Happy Hour, 3 – 6pm Reservations Reservations for Biltmore Park Happenings & Events Asheville Restaurant Week Tequila Tuesday $5 Casa Margaritas 1/2 PRICE WINGS ON MONDAY Daily Happy Hour Our Story Taco Boy Biltmore Park is located in the main roundabout of Biltmore Park Town Square. It features a large mural by Wyatt Grant, bar and dining room seating, as well as a sunroom with retractable doors that open to the patio. Menus Restaurant Week Menu Food Menu Happy Hour Menu Beverage Menu Kids Menu Click to Download the Taco Boy Restaurant Week Menu Below: Download PDF Small Plates SCRATCH-MADE GUACAMOLE / 15 fresh avocado, salsa cruda, lime vegan Wings 6 crispy chicken wings served with chipotle ranch dry rubbed: blend of seasonings & brown sugar / 12 elote: tossed with chipotle aioli, cotija cheese, lime / 14 Mexican Street Corn Dip / 12 vegetarian Chips & Queso / 10 vegetarian SALSA DUO / 6 roja, verde vegetarian TACO BOY APPETIZER TRIO / 16 queso, guacamole, salsa roja vegetarian TAQUITOS / 10 crispy corn tortillas, tinga chicken, cotija cheese, green chile sauce, salsa cruda, crema Loaded Queso Fries / 11 sidewinder fries, black beans, queso, guacamole, lettuce, salsa cruda, crema, green onions add: bacon +4 vegetarian NACHOS / 13 choice of black or refried beans, queso, guacamole, lettuce, salsa cruda, crema, green onions, protein vegan chorizo, ground beef, carnitas, grilled chicken, birria, carne asada, grilled shrimp Salads MEXICAN CAESAR SALAD / 11 romaine, roasted corn, cotija cheese, toasted pepitas, tajín breadcrumbs, caesar-lime dressing vegetarian TACO BOY SALAD / 12 mixed greens, avocado, bell peppers, roasted corn, queso fresco, salsa cruda, corn tortilla strips, chipotle ranch dressing or cilantro-lime vinaigrette vegetarian Add-Ons select your protein: morningstar vegan chorizo (vegan), ground beef, carnitas, grilled or crispy chicken, tinga chicken birria, carne asada, grilled or crispy shrimp, grilled mahi Monday – Friday until 4pm Weekday Lunch Combo $14 2 tacos • rice & beans • plus a drink choose any 2 tacos served with rice & beans, iced tea, soda, or agua fresca ... add a side of chips & guac +5 choose 2 tacos for $15 or 3 tacos for $20 served with rice & beans tortilla choices: corn, flour, (lettuce wrap *vegan* +1) add a side of chips & guac for your taco platter +5 Tacos & Platters Crispy Avocado / 6 crispy avocado, rainbow slaw, thai chile sauce, green onion vegan Carnitas / 6 braised pork, queso fresco, pickled red onions, green chile sauce, cilantro Kimchi Beef / 6 steak, korean bbq sauce, kimchi, toasted sesame seeds, cilantro Tinga / 6 tinga chicken, cotija cheese, pickled red onions, cilantro Chicken, Bacon, Ranch / 6 grilled chicken, crispy smoked bacon, spring mix, chipotle ranch Birria / 6 braised birria-style beef, mexican cheeses, onions, cilantro, consommé Grilled Fish / 6 mahi, spring mix, cilantro dijon, salsa cruda Carne Asada / 6 steak, green chile sauce, salsa cruda Firecracker / 6 crispy shrimp, rainbow slaw, firecracker sauce, cilantro Americano / 5 seasoned ground beef, mexican cheeses, lettuce, salsa cruda (sub crispy corn shell) Baja / 6 crispy shrimp or mahi, rainbow slaw, chipotle aioli, cilantro Grilled Shrimp / 6 rainbow slaw, queso fresco, salsa cruda, green onions, chipotle aioli More than Tacos Rice Bowl / 14 black beans (vegan) or refried beans, mexican rice, roasted corn, avocado, rainbow slaw, queso fresco, roasted pepitas, salsa cruda, green chile sauce or roasted tomato salsa vegetarian Burrito / 12 black beans (vegan) or refried beans, mexican rice, mexican cheeses, lettuce, salsa cruda, crema, served with a side salad always extra guac: add guac (vegan) +2 make it a california burrito: add sidewinder fries +2 vegetarian Tijuana Hot Dog / 10 bacon wrapped all-beef hot dog in a bun, peppers & onions, salsa cruda, pickled jalapeños, chipotle aioli, served with sidewinder fries Add-Ons select your protein: morningstar vegan chorizo (vegan), ground beef, carnitas, grilled or crispy chicken, tinga chicken birria, carne asada, grilled or crispy shrimp, grilled mahi served with guacamole & crema Quesadillas Classic Cheese / 10 mexican cheeses + add-ons: grilled chicken, carne asada, grilled shrimp add: salsa cruda (vegan) vegetarian Veggie / 14 mexican cheeses, black beans (vegan), roasted corn, onions, poblano vegetarian Cheeseburger Dilla / 15 seasoned ground beef, mexican cheeses, lettuce, pickles, salsa cruda, special sauce Texas Fajita Dilla / 16 carne asada, grilled shrimp, chicken, peppers & onions, salsa verde QUESABIRRIA / 16 mexican cheeses, braised birria-style beef, onions, cilantro, consommé Sides MEXICAN RICE / 4 vegan BLACK BEANS / 4 vegan Sidewinder Fries / 4 vegan STREET CORN / 6 order on or off the cob! vegetarian Guacamole / 5 vegan REFRIED BEANS / 4 SIDE SALAD / 5 vegan Desserts CHURROS / 8 pistachio sugar, dulce de leche vegetarian TRES LECHES / 8 three-milks, brandy-infused, sponge cake, cinnamon vegetarian every day 3-6pm see our menu for rotating selections Happy Hour Attention to our guests with allergies or dietary preferences: We're committed to meeting your needs. Please note, despite our best efforts, cross-contamination can occur. Dishes could come into contact with allergens like dairy, eggs, wheat, soy, tree nuts, peanuts, fish, and shellfish. Crispy and fried offerings are prepared in soybean oil. Kindly be aware that a 3% processing fee applies to all credit card payments. This fee does not apply to debit card transactions. For ease of transaction with parties of eight or more, a 20% suggested tip will be applied to your check. Thank you for choosing Taco Boy! free chips & salsa!!! every day 3 – 6pm Happy Hour Snacks Chips & Queso / 5 vegetarian Mini Nachos / 6 black beans (vegan) or refried beans, queso, guacamole, lettuce, salsa cruda, crema, green onions Tacos Americano / 3 seasoned ground beef, mexican cheeses, lettuce, salsa cruda Tinga / 4 tinga chicken, cotija cheese, pickled red onions, cilantro Carnitas / 4 braised pork, queso fresco, pickled red onions, green chile sauce, cilantro $5 house margaritas Tequila Tuesdays! in our search for the best local mexican-style lager, we teamed up with our friends at munkle brewing co. in charleston to develop an original brew especially for taco boy Taco Boy's Own Contigo Lager / 6 Draft Beers PACIFICO / 6 Dos Equis Lager • Ambar / 6 Modelo Especial / 6 PBR / 4 MICHELOB ULTRA / 6 Sierra Nevada Hazy Little Thing / 6 Bold Rock Cider / 7 Wicked Weed Pernicious / 8 Greenman Brewing Porter / 7 Ginger's Revenge Lime Agave / 8 Bottles & Cans Tecate / 5 Corona • Corona Light / 6 Athletic Brewing Co. (Non-Alcoholic) / 6 mexican-style copper Wine Cans / 9 white red bubbly rosé Beverages Topo Chico / 4 Jarritos Soda / 4 Mexican Coke / 4 Lemonade / 3 Sodas / 3 Iced Tea / 3 Agua Fresca / 4 rotating flavors of fresh fruit, lime, water, agave Suéro Serum / 5 mexico's hangover cure MAKE IT A PITCHER! serves 6 pitchers need 2 guests (or more) to pour Cold Margs & Cocktails Casa or Casa Frozen / 10 • 50 the classic: tequila blanco, triple sec, organic lime juice, orange juice, splash of simple, salt add a flavor: strawberry, pineapple-passion fruit, mango + 2 $ tequila tuesday: $5 casa margs every tuesday! Cadillac / 12 • 60 casa margarita topped with grand marnier floater Skinny Casa / 11 • 55 lighter version of the casa margarita, organic lime juice, splash of orange juice, agave, salt Spicy Margarita / 12 • 60 tequila blanco infused with hot peppers, triple sec, agave, organic lime juice, salt Tito-Rita / 12 • 60 tito’s vodka, house made sour mix, tajín rim add a flavor: strawberry, pineapple-passion fruit, mango + 1 $ Pineapple Margarita / 12 • 60 pineapple-infused tequila, cinnamon, vanilla, organic lime juice, splash of orange juice, agave, salt Blood Orange Margarita / 13 • 65 tequila reposado, triple sec, blood orange, organic lime juice, agave, agave worm salt Frozen Screwdriver / 10 taco boy classic, vodka, fresh orange juice Mexican Ashtray + Shot / 10 tecate with valentina, tajín rim + lunazul blanco shot Tropical Frozen Margaritas / 11 • 55 3 options to choose from: mango + salt strawberry + salt pineapple-passion fruit + tajín Cocktails & More Mexican Candy Shooter / 10 Lunazul Blanco, mango orange juice, Valentina hot sauce Ms. Prickly Punch / 11 tequila blanco, aperol, pineapple juice, agave, passion fruit puree, fresh lime Mexican Ashtray + Shot / 10 tecate with valentina, tajín rim + lunazul blanco shot Rosé Sangria / 11 rosé, brandy, strawberry, lime juice create your own flight of 3 one ounce pours or try them individually! price as marked *not available in a flight Tequila Flights / 22 made by filtering añejo or extra añejo tequila with activated charcoal hints of: crisp citrus & agave Cristalino “Crystal Clear” Herradura Ultra* / 16 Komos Añejo* / 30 Hornitos Añejo* / 12 Maestro Dobel Diamante* / 14 Gran Coramino* / 14 clear & colorless, typically bottled after distillation hints of: citrus, earthiness, & pepper Blanco “White” Casamigos* / 14 Don Julio* / 15 Espolòn / 11 Lunazul / 10 Patrón* / 15 Cazadores / 10 Herradura* / 14 Tres Gen* / 14 Tequila Ocho Plata* / 14 aged two months to one year in oak or steel barrels hints of: vanilla, caramel, & spices Reposado “Rested” Casamigos* / 14 Don Julio* / 14 Espolòn / 10 Lunazul / 10 Patrón* / 14 Cazadores / 11 Herradura* / 14 La Gritona* / 14 aged one to three years in oak barrels hints of: vanilla, caramel, & oak Añejo “Old” Casamigos* / 15 Don Julio* / 16 Espolòn / 11 Lunazul / 10 Patrón* / 15 Cazadores / 11 Herradura* / 14 Tres Gen* / 14 tequila’s smoky cousin hints of: smokiness, earthiness, & a fruit-forward presence Mezcal “Made from Agave” Casamigos* / 14 Creyente* / 12 Monte Alban / 10 Los Siete Misterios / 11 Union / 11 Banhez / 11 Alcohol Consumption Notice: Taco Boy is committed to the safety of our patrons and community. To support this, we provide the availability of transportation after the consumption of alcohol. Please notify your server should you need assistance or a safe ride home and we will gladly make the appropriate arrangements. Alcohol consumption is a personal choice. It is your responsibility to drink responsibly and take appropriate precautions to protect yourself, other patrons, and the community from harm. We proudly serve alcohol responsibly and appreciate your patience as we ask for ID for all alcoholic beverages. children 10 & under sub sidewinder fries +2 Kids Menu Kids Taco / 5 served with rice & beans mexican cheeses and choice of: grilled chicken, black beans, seasoned ground beef, or crispy chicken Chicken Quesadilla / 7 served with rice & beans grilled chicken and mexican cheeses Cheese Quesadilla / 6 served with rice & beans mexican cheeses Hot Dog / 6 all-beef hot dog in a bun, served with sidewinder fries and ketchup For Dessert / 2 served with dulce de leche add a single churro Get Directions Order Online Reservations Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Please, enter a valid location Location - Required Location Folly Beach Downtown Charleston Summerville Biltmore Park LoSo, Charlotte Please leave blank or enter a valid phone number Phone Number - Optional I consent to receive SMS from Taco Boy. MSG & Data Rates May Apply. - Optional I consent to receive SMS from Taco Boy. MSG & Data Rates May Apply. Yes No Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Folly Beach Downtown Charleston Summerville Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "bd1ceea4e79b",
      "downloadedAt": "2026-01-18T16:57:27.648Z",
      "trimmedAt": "2026-01-18T17:08:02.215Z",
      "sizeReduction": "88.6%"
    },
    {
      "url": "http://www.tacoboy.net/location/downtown-taco-boy/",
      "text": "Main content starts here, tab to start navigating Downtown Charleston View Hours View Menu In-House Events Off-Site Catering Events & Happenings Reservations Hours & Location 217 Huger Street, Charleston, SC 29403 843.789.3333 Sunday - Thursday, 11am – 9pm Friday & Saturday, 11am – 10pm Daily Happy Hour, 3 – 6pm Happenings & Events Charleston Restaurant Week Tequila Tuesday $5 Casa Margaritas 1/2 PRICE WINGS ON MONDAY Daily Happy Hour 2026 Cooper River Bridge Run: Team Taco! Our Story Open since 2009, Taco Boy Downtown Charleston presents a colorfully rustic den full of authentic Mexican folk art, as well as a spacious outdoor dining and lawn area that’s perfect for parties large and small. Warm nights bring outdoor DJs and dance parties, while festive events occur year-round that support our charitable partners. Well-behaved and leashed dogs are welcome for outdoor dining. Ample parking is available. Menus Restaurant Week Menu Food Menu Happy Hour Menu Beverage Menu Kids Menu Click to Download the Taco Boy Restaurant Week Menu Below: Download PDF Small Plates SCRATCH-MADE GUACAMOLE / 15 fresh avocado, salsa cruda, lime vegan Wings 6 crispy chicken wings served with chipotle ranch dry rubbed: blend of seasonings & brown sugar / 12 elote: tossed with chipotle aioli, cotija cheese, lime / 14 Mexican Street Corn Dip / 12 vegetarian Chips & Queso / 10 vegetarian SALSA DUO / 6 roja, verde vegetarian TACO BOY APPETIZER TRIO / 16 queso, guacamole, salsa roja vegetarian TAQUITOS / 10 crispy corn tortillas, tinga chicken, cotija cheese, green chile sauce, salsa cruda, crema Loaded Queso Fries / 11 sidewinder fries, black beans, queso, guacamole, lettuce, salsa cruda, crema, green onions add: bacon +4 vegetarian NACHOS / 13 choice of black or refried beans, queso, guacamole, lettuce, salsa cruda, crema, green onions, protein vegan chorizo, ground beef, carnitas, grilled chicken, birria, carne asada, grilled shrimp Salads MEXICAN CAESAR SALAD / 11 romaine, roasted corn, cotija cheese, toasted pepitas, tajín breadcrumbs, caesar-lime dressing vegetarian TACO BOY SALAD / 12 mixed greens, avocado, bell peppers, roasted corn, queso fresco, salsa cruda, corn tortilla strips, chipotle ranch dressing or cilantro-lime vinaigrette vegetarian Add-Ons select your protein: morningstar vegan chorizo (vegan), ground beef, carnitas, grilled or crispy chicken, tinga chicken birria, carne asada, grilled or crispy shrimp, grilled mahi choose 2 tacos for $15 or 3 tacos for $20 served with rice & beans tortilla choices: corn, flour, (lettuce wrap *vegan* +1) Tacos & Platters Crispy Avocado / 6 crispy avocado, rainbow slaw, thai chile sauce, green onion vegan Carnitas / 6 braised pork, queso fresco, pickled red onions, green chile sauce, cilantro Kimchi Beef / 6 steak, korean bbq sauce, kimchi, toasted sesame seeds, cilantro Tinga / 6 tinga chicken, cotija cheese, pickled red onions, cilantro Chicken, Bacon, Ranch / 6 grilled chicken, crispy smoked bacon, spring mix, chipotle ranch Birria / 6 braised birria-style beef, mexican cheeses, onions, cilantro, consommé Grilled Fish / 6 mahi, spring mix, cilantro dijon, salsa cruda Carne Asada / 6 steak, green chile sauce, salsa cruda Firecracker / 6 crispy shrimp, rainbow slaw, firecracker sauce, cilantro Americano / 5 seasoned ground beef, mexican cheeses, lettuce, salsa cruda (sub crispy corn shell) Baja / 6 crispy shrimp or mahi, rainbow slaw, chipotle aioli, cilantro Grilled Shrimp / 6 rainbow slaw, queso fresco, salsa cruda, green onions, chipotle aioli Monday – Friday until 4pm Weekday Lunch Combo $14 2 tacos • rice & beans • plus a drink choose any 2 tacos served with rice & beans, iced tea, soda, or agua fresca ... add a side of chips & guac +5 More than Tacos Rice Bowl / 14 black beans (vegan) or refried beans, mexican rice, roasted corn, avocado, rainbow slaw, queso fresco, roasted pepitas, salsa cruda, green chile sauce or roasted tomato salsa vegetarian Burrito / 12 black beans (vegan) or refried beans, mexican rice, mexican cheeses, lettuce, salsa cruda, crema, served with a side salad always extra guac: add guac (vegan) +2 make it a california burrito: add sidewinder fries +2 vegetarian Add-Ons select your protein: morningstar vegan chorizo (vegan), ground beef, carnitas, grilled or crispy chicken, tinga chicken birria, carne asada, grilled or crispy shrimp, grilled mahi Tijuana Hot Dog / 10 bacon wrapped all-beef hot dog in a bun, peppers & onions, salsa cruda, pickled jalapeños, chipotle aioli, served with sidewinder fries served with guacamole & crema Quesadillas Classic Cheese / 10 mexican cheeses + add-ons: grilled chicken, carne asada, grilled shrimp add: salsa cruda (vegan) vegetarian Veggie / 14 mexican cheeses, black beans (vegan), roasted corn, onions, poblano vegetarian Cheeseburger Dilla / 15 seasoned ground beef, mexican cheeses, lettuce, pickles, salsa cruda, special sauce Texas Fajita Dilla / 16 carne asada, grilled shrimp, chicken, peppers & onions, salsa verde QUESABIRRIA / 16 mexican cheeses, braised birria-style beef, onions, cilantro, consommé Sides MEXICAN RICE / 4 vegan BLACK BEANS / 4 vegan Sidewinder Fries / 4 vegan STREET CORN / 6 order on or off the cob! vegetarian Guacamole / 5 vegan REFRIED BEANS / 4 SIDE SALAD / 5 vegan Desserts CHURROS / 8 pistachio sugar, dulce de leche vegetarian TRES LECHES / 8 three-milks, brandy-infused, sponge cake, cinnamon vegetarian every day 3-6pm see our menu for rotating selections Happy Hour Attention to our guests with allergies or dietary preferences: We're committed to meeting your needs. Please note, despite our best efforts, cross-contamination can occur. Dishes could come into contact with allergens like dairy, eggs, wheat, soy, tree nuts, peanuts, fish, and shellfish. Crispy and fried offerings are prepared in soybean oil. Kindly be aware that a 3% processing fee applies to all credit card payments. This fee does not apply to debit card transactions. For ease of transaction with parties of eight or more, a 20% suggested tip will be applied to your check. Thank you for choosing Taco Boy! free chips & salsa every day 3 – 6pm Happy Hour Drinks Well, Well, Well, $5 Well Liquors high spirits, low prices – just add your mixer! Snacks Chips & Queso / 5 vegetarian Mini Nachos / 6 black beans (vegan) or refried beans, queso, guacamole, lettuce, salsa cruda, crema, green onions Tacos Americano / 3 seasoned ground beef, mexican cheeses, lettuce, salsa cruda Carnitas / 4 braised pork, queso fresco, pickled red onions, green chile sauce, cilantro Tinga / 4 tinga chicken, cotija cheese, pickled red onions, cilantro $5 house margaritas Tequila Tuesdays! in our search for the best local mexican-style lager, we teamed up with our friends at munkle brewing co. in charleston to develop an original brew especially for taco boy Taco Boy's Own Contigo Lager / 6 Draft Beers PACIFICO / 6 Dos Equis Lager • Ambar / 6 Modelo Especial / 6 PBR / 4 Bottles & Cans Tecate / 5 BUD LIGHT / 5 Miller Lite / 5 MICHELOB ULTRA / 6 Corona • Corona Light / 6 Sierra Nevada Hazy Little Thing / 7 Athletic Brewing Co. (Non-Alcoholic) / 6 mexican-style copper high vibes, no booze Ask us about our rotating selection of hemp-derived beverages Chill Sips Wine Cans / 9 white red bubbly rosé Beverages Topo Chico / 4 Jarritos Soda / 4 Mexican Coke / 4 Lemonade / 3 Frozen Lemonade / 4 Sodas / 3 Iced Tea / 3 Agua Fresca / 4 rotating flavors of fresh fruit, lime, water, agave Suéro Serum / 5 mexico's hangover cure MAKE IT A PITCHER! serves 6 pitchers need 2 guests (or more) to pour add a Cointreau Floater to any marg +3 Cold Margs & Cocktails Casa or Casa Frozen / 10 • 50 the classic: tequila blanco, triple sec, organic lime juice, orange juice, splash of simple, salt add a flavor: strawberry, pineapple-passion fruit, mango + 2 $ tequila tuesday: $5 casa margs every tuesday! Cadillac / 12 • 60 casa margarita topped with grand marnier floater Skinny Casa / 11 • 55 lighter version of the casa margarita, organic lime juice, splash of orange juice, agave, salt Spicy Margarita / 12 • 60 tequila blanco infused with hot peppers, triple sec, agave, organic lime juice, salt Tito-Rita / 12 • 60 tito’s vodka, house made sour mix, tajín rim add a flavor: strawberry, pineapple-passion fruit, mango + 1 $ Pineapple Margarita / 12 • 60 pineapple-infused tequila, cinnamon, vanilla, organic lime juice, splash of orange juice, agave, salt Blood Orange Margarita / 13 • 65 tequila reposado, triple sec, blood orange, organic lime juice, agave, agave worm salt HIBISCUS MARGARITA / 13 • 65 tequila blanco, triple sec, hibiscus, fresh lime, orange juice, cinnamon-fennel salt Tropical Frozen Margaritas / 11 • 55 3 options to choose from: mango + salt strawberry + salt pineapple-passion fruit + tajín Cocktails & More Ms. Prickly Punch / 11 tequila blanco, aperol, pineapple juice, agave, passion fruit puree, fresh lime Mexican Ashtray + Shot / 10 tecate with valentina, tajín rim + lunazul blanco shot Rosé Sangria / 11 rosé, brandy, strawberry, lime juice made by filtering añejo or extra añejo tequila with activated charcoal hints of: crisp citrus & agave Cristalino “Crystal Clear” Herradura Ultra / 14 Komos Añejo* / 35 Hornitos Añejo / 13 Maestro Dobel Diamante / 12 Gran Coramino / 14 clear & colorless, typically bottled after distillation hints of: citrus, earthiness, & pepper Blanco “White” Casamigos / 12 Don Julio* / 13 Espolòn / 10 Lunazul / 6 Patron / 13 Cazadores / 8 Herradura / 12 Tres Gen / 11 Tequila Ocho Plata / 12 aged two months to one year in oak or steel barrels hints of: vanilla, caramel, & spices Reposado “Rested” Casamigos* / 13 Don Julio / 15 Espolòn / 9 Lunazul / 8 Patron / 13 Cazadores / 8 Herradura / 12 Don Gato / 12 La Gritona / 13 aged one to three years in oak barrels hints of: vanilla, caramel, & oak Añejo “Old” Casamigos* / 12 Don Julio* / 15 Espolòn / 9 Lunazul / 8 Patron* / 14 Cazadores / 8 Herradura* / 13 Tres Gen / 11 tequila’s smoky cousin hints of: smokiness, earthiness, & a fruit-forward presence Mezcal “Made from Agave” Casamigos* / 14 Creyente / 13 Monte Alban / 8 Los Siete Misterios / 11 Union / 8 Banhez / 10 create your own flight of 3 one ounce pours or try them individually! price as marked Tequila Flights / 22 Alcohol Consumption Notice: Taco Boy is committed to the safety of our patrons and community. To support this, we provide the availability of transportation after the consumption of alcohol. Please notify your server should you need assistance or a safe ride home and we will gladly make the appropriate arrangements. Alcohol consumption is a personal choice. It is your responsibility to drink responsibly and take appropriate precautions to protect yourself, other patrons, and the community from harm. We proudly serve alcohol responsibly and appreciate your patience as we ask for ID for all alcoholic beverages. children 10 & under sub sidewinder fries +2 Kids Menu Kids Taco / 5 served with rice & beans mexican cheeses and choice of: grilled chicken, black beans, seasoned ground beef, or crispy chicken Chicken Quesadilla / 7 served with rice & beans grilled chicken and mexican cheeses Cheese Quesadilla / 6 served with rice & beans mexican cheeses Hot Dog / 6 all-beef hot dog in a bun, served with sidewinder fries and ketchup For Dessert / 2 served with dulce de leche add a single churro Get Directions Order Online Reservations Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Please, enter a valid location Location - Required Location Folly Beach Downtown Charleston Summerville Biltmore Park LoSo, Charlotte Please leave blank or enter a valid phone number Phone Number - Optional I consent to receive SMS from Taco Boy. MSG & Data Rates May Apply. - Optional I consent to receive SMS from Taco Boy. MSG & Data Rates May Apply. Yes No Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Folly Beach Downtown Charleston Summerville Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "d11d86e88cd8",
      "downloadedAt": "2026-01-18T16:57:26.540Z",
      "trimmedAt": "2026-01-18T17:08:02.262Z",
      "sizeReduction": "88.6%"
    },
    {
      "url": "http://www.tacoboy.net/location/folly-beach-taco-boy/",
      "text": "Main content starts here, tab to start navigating Folly Beach View Hours View Menu In-House Events Off-Site Catering Events & Happenings Reservations Hours & Location 106 East Ashley Avenue, Folly Beach, SC 29439 843.588.9761 Winter Hours: Thursday – Tuesday, 12pm – 9pm Closed Wednesdays Daily Happy Hour, 3 – 6pm Happenings & Events Charleston Restaurant Week Tequila Tuesday $5 Casa Margaritas Live Entertainment at Club Taco Boy Drag Queen Bingo 1/2 PRICE WINGS ON MONDAY 5th Annual Folly Beach Litter Sweep Daily Happy Hour Our Story Our flagship location opened on Folly Beach in 2006. In 2020, we moved into our current location on East Ashley Avenue, in a colorful three-story hideaway in the trees located just steps away from Center Street and a block off the beach. A main-level dining room can serve large and small groups, while the patio deck and \"Octopus bar,” featuring a soaring upcycled octopus by artist Jeff Kopish, provide ample seating for families, friends, and sun-kissed beachgoers. A mid-floor services private parties, while the lantern-lit top-floor bar and rooftop deck serve as overflow on busy nights and as a private event space. Street parking available. Menus Restaurant Week Menu Beverage Menu Food Menu Happy Hour Menu Kids Menu Click to Download the Taco Boy Restaurant Week Menu Below: Download PDF Beverages Build A Bucket / 22 mix & match any 6 bottles below Topo Chico / 4 Jarritos Soda / 4 pineapple, lime, fruit punch, guava Mexican Coke / 4 Mexican Fanta / 4 Lemonade / 3 Frozen Pink Lemonade / 4 Sodas / 3 Iced Tea / 3 Hibiscus Agua Fresca / 4 hibiscus, lime, water, agave Suéro / 5 Mexico’s hangover cure MAKE IT A PITCHER! Pitchers need 2 (or more) to pour add a cointreau floater to any marg +3 Cold Margs Casa or Casa Frozen / 10 • 50 the classic: tequila blanco, triple sec, organic lime juice, orange juice, splash of simple, salt add a flavor: strawberry, pineapple-passion fruit, mango + 2 $ tequila tuesday: $5 casa margs every tuesday! Cadillac / 12 • 60 casa margarita topped with grand marnier floater Skinny Casa / 11 • 55 lighter version of the casa margarita, organic lime juice, splash of orange juice, agave, salt Spicy Margarita / 12 • 60 tequila blanco infused with hot peppers, triple sec, agave, lime juice, salt Pineapple Margarita / 12 • 60 pineapple-infused tequila, cinnamon, vanilla, lime juice, splash of orange juice, agave, salt Tito-Rita / 12 • 60 tito’s vodka, house made sour mix, tajín rim add a flavor: + $2 strawberry, pineapple-passion fruit, mango Blood Orange Margarita / 13 • 65 lunazul reposado, triple sec, blood orange, agave, lime juice, agave, agave worm salt HIBISCUS MARGARITA / 13 • 65 tequila blanco, triple sec, hibiscus cordial, lime juice, splash of orange juice, cinnamon-fennel salt Tropical Frozen Margaritas / 12 • 60 3 options to choose from: mango + salt, strawberry + salt, pineapple-passion fruit + tajín Cocktails & More! Ms. Prickly Punch / 11 tequila blanco, aperol, agave, passion fruit, pineapple, lime juice Frozen Screwdriver / 10 taco boy classic, vodka, fresh orange juice Mexican Ashtray + Tequila Shot / 10 tecate with valentina hot sauce, tajín rim + lunazul blanco shot About Taco Boy’s Contigo Lager Contigo is a Mexican-style lager brewed for Taco Boy with Munkle Brewing Co. in CHS. It took home bronze at the 2024 Great American Beer Festival—the world’s largest beer competition! Make any draft a pitcher! Draft Beers Taco Boy’s Own Contigo Lager / 6 • 24 Pacifico / 6 • 24 Dos Equis Ambar / 6 • 24 Modelo Especial / 6 • 24 PBR / 4 • 16 Bottles, Cans, & Buckets The Boat Beers / 6 for 28 miller lite, tecate, bud light, michelob ultra The Primo Pack / 6 for 34 corona, corona light The Hydrators / 6 for 52 sunboy spiked coconut water, pineapple, passion fruit TECATE / 5 BUD LIGHT / 5 MILLER LITE / 5 Michelob Ultra / 6 Corona • Corona Light • Non-Alcoholic / 6 Sierra Nevada Hazy Little Thing / 7 Sunboy Spiked Coconut Water / 9 pineapple, passionfruit Athletic Brewing Co. / 6 non-alcoholic mexican-style copper high vibes, no booze Ask us about our rotating selection of hemp-derived beverages Chill Sips Wine 12 Ounce Cans / 12 white, red, rosé, bubbly Create your own flight of 3 one ounce pours, or try them individually! Price as marked * = Not available in a flight Tequila Flights aged two months to one year in oak or steel barrels hints of: vanilla, caramel, & spices Reposado “Rested” Casamigos* / 13 Don Julio* / 15 Espolòn / 9 Lunazul / 8 Patrón* / 14 Cazadores / 8 Herradura* / 12 Don Gato* / 12 La Gritona* / 13 Komos Rosa* / 35 made by filtering añejo or extra añejo tequila with activated charcoal hints of: crisp citrus & agave Cristalino \"Crystal Clear\" Casamigos* / 12 Herradura Ultra* / 14 Hornitos Añejo* / 13 Maestro Dobel Diamante* / 12 Gran Coramino* / 14 Komos Añejo* / 35 aged one to three years in oak barrels hints of: vanilla, caramel, & oak Añejo “Old” Casamigos* / 12 Don Julio* / 15 Espolòn / 11 Lunazul / 8 Patrón* / 14 Cazadores / 11 Herradura* / 13 Tres Gen* / 12 Komos Añejo Reserva* / 38 Komos Extra Añejo* / 38 clear & colorless, typically bottled afterer distillation hints of: citrus, earthiness, & pepper Blanco “White” Casamigos* / 12 Don Julio* / 13 Espolòn / 10* Lunazul / 6 Patrón* / 13 Cazadores / 8 Herradura / 11 Tres Gen / 11 Tequila Ocho Plata* 12 $ Tequila’s smoky cousin hints of: smokiness, earthiness, & a fruit-forward presence Mezcal \"Made from Agave\" Casamigos* / 14 Creyente* / 13 Monte Alban / 8 Los Siete Misterios / 11 Union / 8 Banhez / 10 Alcohol Consumption Notice: Taco Boy is committed to the safety of our patrons and community. To support this, we provide the availability of transportation after the consumption of alcohol. Please notify your server should you need assistance or a safe ride home and we will gladly make the appropriate arrangements. Alcohol consumption is a personal choice. It is your responsibility to drink responsibly and take appropriate precautions to protect yourself, other patrons, and the community from harm. We proudly serve alcohol responsibly and appreciate your patience as we ask for ID for all alcoholic beverages. Small Plates SCRATCH-MADE GUACAMOLE / 15 fresh avocado, salsa cruda, lime vegan Wings 6 crispy chicken wings served with chipotle ranch dry rubbed: blend of seasonings & brown sugar / 12 elote: tossed with chipotle aioli, cotija cheese, lime / 14 Mexican Street Corn Dip / 12 vegetarian Chips & Queso / 10 vegetarian SALSA DUO / 6 roja, verde vegetarian TACO BOY APPETIZER TRIO / 16 queso, guacamole, salsa roja vegetarian TAQUITOS / 10 crispy corn tortillas, tinga chicken, cotija cheese, green chile sauce, salsa cruda, crema Loaded Queso Fries / 11 sidewinder fries, black beans, queso, guacamole, lettuce, salsa cruda, crema, green onions add: bacon +4 vegetarian NACHOS / 13 choice of black or refried beans, queso, guacamole, lettuce, salsa cruda, crema, green onions, protein vegan chorizo, ground beef, carnitas, grilled chicken, birria, carne asada, grilled shrimp Salads MEXICAN CAESAR SALAD / 11 romaine, roasted corn, cotija cheese, toasted pepitas, tajín breadcrumbs, caesar-lime dressing vegetarian TACO BOY SALAD / 12 mixed greens, avocado, bell peppers, roasted corn, queso fresco, salsa cruda, corn tortilla strips, chipotle ranch dressing or cilantro-lime vinaigrette vegetarian Add-Ons select your protein: morningstar vegan chorizo (vegan), ground beef, carnitas, grilled or crispy chicken, tinga chicken birria, carne asada, grilled or crispy shrimp, grilled mahi choose 2 tacos for $15 or 3 tacos for $20 served with rice & beans tortilla choices: corn, flour, (lettuce wrap *vegan* +1) Tacos & Platters Crispy Avocado / 6 crispy avocado, rainbow slaw, thai chile sauce, green onion vegan Carnitas / 6 braised pork, queso fresco, pickled red onions, green chile sauce, cilantro Kimchi Beef / 6 steak, korean bbq sauce, kimchi, toasted sesame seeds, cilantro Tinga / 6 tinga chicken, cotija cheese, pickled red onions, cilantro Chicken, Bacon, Ranch / 6 grilled chicken, crispy smoked bacon, spring mix, chipotle ranch Birria / 6 braised birria-style beef, mexican cheeses, onions, cilantro, consommé Grilled Fish / 6 mahi, spring mix, cilantro dijon, salsa cruda Carne Asada / 6 steak, green chile sauce, salsa cruda Firecracker / 6 crispy shrimp, rainbow slaw, firecracker sauce, cilantro Americano / 5 seasoned ground beef, mexican cheeses, lettuce, salsa cruda (sub crispy corn shell) Baja / 6 crispy shrimp or mahi, rainbow slaw, chipotle aioli, cilantro Grilled Shrimp / 6 rainbow slaw, queso fresco, salsa cruda, green onions, chipotle aioli Monday – Friday until 4pm Weekday Lunch Combo $14 2 tacos • rice & beans • plus a drink choose any 2 tacos served with rice & beans, iced tea, soda, or agua fresca ... add a side of chips & guac +5 More than Tacos Rice Bowl / 14 black beans (vegan) or refried beans, mexican rice, roasted corn, avocado, rainbow slaw, queso fresco, roasted pepitas, salsa cruda, green chile sauce or roasted tomato salsa vegetarian Burrito / 12 black beans (vegan) or refried beans, mexican rice, mexican cheeses, lettuce, salsa cruda, crema, served with a side salad always extra guac: add guac (vegan) +2 make it a california burrito: add sidewinder fries +2 vegetarian Add-Ons select your protein: morningstar vegan chorizo (vegan), ground beef, carnitas, grilled or crispy chicken, tinga chicken birria, carne asada, grilled or crispy shrimp, grilled mahi Tijuana Hot Dog / 10 bacon wrapped all-beef hot dog in a bun, peppers & onions, salsa cruda, pickled jalapeños, chipotle aioli, served with sidewinder fries served with guacamole & crema Quesadillas Classic Cheese / 10 mexican cheeses + add-ons: grilled chicken, carne asada, grilled shrimp add: salsa cruda (vegan) vegetarian Veggie / 14 mexican cheeses, black beans (vegan), roasted corn, onions, poblano vegetarian Cheeseburger Dilla / 15 seasoned ground beef, mexican cheeses, lettuce, pickles, salsa cruda, special sauce Texas Fajita Dilla / 16 carne asada, grilled shrimp, chicken, peppers & onions, salsa verde QUESABIRRIA / 16 mexican cheeses, braised birria-style beef, onions, cilantro, consommé Sides MEXICAN RICE / 4 vegan BLACK BEANS / 4 vegan Sidewinder Fries / 4 vegan STREET CORN / 6 order on or off the cob! vegetarian Guacamole / 5 vegan REFRIED BEANS / 4 SIDE SALAD / 5 vegan Desserts CHURROS / 8 pistachio sugar, dulce de leche vegetarian TRES LECHES / 8 three-milks, brandy-infused, sponge cake, cinnamon vegetarian every day 3-6pm see our menu for rotating selections Happy Hour Attention to our guests with allergies or dietary preferences: We're committed to meeting your needs. Please note, despite our best efforts, cross-contamination can occur. Dishes could come into contact with allergens like dairy, eggs, wheat, soy, tree nuts, peanuts, fish, and shellfish. Crispy and fried offerings are prepared in soybean oil. Kindly be aware that a 3% processing fee applies to all credit card payments. This fee does not apply to debit card transactions. For ease of transaction with parties of eight or more, a 20% suggested tip will be applied to your check. Thank you for choosing Taco Boy! free chips & salsa every day 3 – 6pm Happy Hour Drinks Well, Well, Well, $5 Well Liquors high spirits, low prices – just add your mixer! Snacks Chips & Queso / 5 vegetarian Mini Nachos / 6 black beans (vegan) or refried beans, queso, guacamole, lettuce, salsa cruda, crema, green onions Tacos Americano / 3 seasoned ground beef, mexican cheeses, lettuce, salsa cruda Carnitas / 4 braised pork, queso fresco, pickled red onions, green chile sauce, cilantro Tinga / 4 tinga chicken, cotija cheese, pickled red onions, cilantro $5 house margaritas Tequila Tuesdays! children 10 & under sub sidewinder fries +2 Kids Menu Kids Taco / 5 served with rice & beans mexican cheeses and choice of: grilled chicken, black beans, seasoned ground beef, or crispy chicken Chicken Quesadilla / 7 served with rice & beans grilled chicken and mexican cheeses Cheese Quesadilla / 6 served with rice & beans mexican cheeses Hot Dog / 6 all-beef hot dog in a bun, served with sidewinder fries and ketchup For Dessert / 2 served with dulce de leche add a single churro Get Directions Order Online Reservations Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Please, enter a valid location Location - Required Location Folly Beach Downtown Charleston Summerville Biltmore Park LoSo, Charlotte Please leave blank or enter a valid phone number Phone Number - Optional I consent to receive SMS from Taco Boy. MSG & Data Rates May Apply. - Optional I consent to receive SMS from Taco Boy. MSG & Data Rates May Apply. Yes No Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Folly Beach Downtown Charleston Summerville Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "f9d82d988cec",
      "downloadedAt": "2026-01-18T16:57:25.990Z",
      "trimmedAt": "2026-01-18T17:08:02.310Z",
      "sizeReduction": "88.3%"
    }
  ],
  "sizeReduction": "91.7%"
}