{
  "venueId": "ChIJA02cgRF6_ogRnuEzBVCywJM",
  "venueName": "Kings Courtyard Inn",
  "venueArea": "Downtown Charleston",
  "website": "https://www.kingscourtyardinn.com/?utm_source=google&utm_medium=organic&utm_campaign=business-listing",
  "scrapedAt": "2026-01-19T03:25:39.186Z",
  "trimmedAt": "2026-01-19T03:26:22.287Z",
  "pages": [
    {
      "url": "https://www.kingscourtyardinn.com/?utm_source=google&utm_medium=organic&utm_campaign=business-listing",
      "text": "[Page Title: Kings Courtyard Inn | Hotel on King Street Charleston SC]\n\nSkip to Main Content \nHistory & Southern Hospitality\n\nIn the heart of iconic King Street\nOccupying one of the oldest buildings in Charleston, Kings Courtyard Inn is awash in decorative details, including original gas fireplaces, hardwood floors, and hand-carved plaster moldings. Step out the door onto King Street, an iconic thoroughfare that’s home to some of Charleston’s most stylish boutiques and world-class restaurants. Gracious hospitality, charming and intimate interior courtyards and thoughtful guest amenities await you at one of Charleston’s most beloved and captivating historic hotels. Book Now \nIncluded With Every Stay\n\nLife’s Little Luxuries\n\nFree Wi-Fi\n\n24-hour concierge\n\nMorning newspaper\n\nContinental breakfast in the courtyard or delivered to your room.\n\nEvening wine & cheese reception\n\nEvening sherry\nBook Now View More \nYour Charleston Home Awaits\n\nTop Reasons to Stay\n\nUnmatched Location\n\nThe Kings Courtyard Inn occupies one of the oldest buildings on King Street, an iconic thoroughfare that's home to some of Charleston's most stylish shops, boutiques, and restaurants.\n\nThree Intimate Courtyards\n\nOur charming and intimate interior courtyards prove there’s nothing new about “green walls” and “modern gardens.” In fact, we’ve been nurturing these ivy-covered beauties for decades.\n\nOriginal Architectural Features\n\nOriginal architectural details, including beautifully restored hardwood floors and gas fireplaces in select rooms, add a sense of history to your stay at Kings Courtyard Inn.\n\nTime-Honored Traditions\n\nChannel your inner Charlestonian with us. At Kings Courtyard Inn, we embrace Charleston’s cherished traditions, including sherry in the lobby every evening.\n\nRooms & Suites\n\nRetreats With Timeless Style\n\nOur 41 guest rooms and suites vary in size, furnishings, and unique architectural details, including some mohogany four-poster rice beds and original gas fieplaces.\nSee Accommodations \nOffers & Packages\n\nMake The Most Of Your Stay\n\nGuests can choose from a range of packages designed to fit our guests’ interests and budget\nExplore \nDiscover Charleston\n\nUnmatched Location\n\nKings Courtyard Inn is located in the heart of Iconic King Street!\nExplore \n\"Our stay in Charleston was wonderful\"\n\nI loved the quaintness of the hotel. It has that Charleston charm. We look forward to returning and will be booking at The Kings Courtyard Inn.\n\nKimberly 4/11/25\n\n\"Your searching stops here!\"\n\nThis hotel has all the charm of the past with all of the convenience of the present. I took my teenage daughters and we walked everywhere. Super safe area. 5-7 minute walk to everywhere you want to go. Around the corner from the open Market where you will want to go for sure. Carriage rides are there. The BEST seafood is by there as well. You are literally ON King Street where all the beautiful shops are. The parking lot is behind the hotel, but it connected to it so you park and walk into the lobby. Beautiful rooms, free delicious warm breakfast served to you at your table (or delivered to your room), easy parking, the sweetest staff. This has everything. We will be back and will not stay anywhere else.\n\nKayla B | 4/9/25\n\n\"Great three night stay\"\n\nThe location is absolutely perfect. Staff is friendly and room was nice and clean. This is an older building but room felt new and updated. Breakfast delivered to your room in the morning is a game changer.\n\nMelissa S. | 3/30/25\n\n\"Did I just stumble up on the best hotel in town?\"\n\nThis little hidden gem of an historic hotel is tucked away in THE PERFECT location. Out the front door is King Street, with all the big name shops. Out the back door, across the small lot where your car is parked, the Charleston market is only a short two minutes away. You are truly in the middle of everything, with no need to move your car unless you want to go to the beach or leave the historic district. The hotel itself is stunning. Hospitality is as Southern as it gets, with breakfast in the morning, wine and cheese reception in the evening, and a sherry night cap before bed, all complimentary. The room was unbelievably spacious and comfortable. The option to light the gas fire place was a nice touch. Every employee we spoke to was so kind and helpful. I'd stay here again in a heartbeat.\n\nStephanie | 3/28/25\n\nGUIDE TO EVENTS IN AND AROUND CHARLESTON\n\nTop Seasonal Events in Charleston\n\nHappening In\n\nSpring\n\nHappening in\n\nSummer\n\nHappening In\n\nFall\n\nHappening In\n\nWinter\nMore Guides to Charleston kingscourtyardinn View Instagram post by kingscourtyardinn Jan 17 Open post by kingscourtyardinn with ID 18077458262047544 kingscourtyardinn View Instagram post by kingscourtyardinn Jan 15 Open post by kingscourtyardinn with ID 17971495043993895 kingscourtyardinn View Instagram post by kingscourtyardinn Jan 12 Open post by kingscourtyardinn with ID 17908292529312651 kingscourtyardinn View Instagram post by kingscourtyardinn Jan 10 Open post by kingscourtyardinn with ID 18094685483488783 kingscourtyardinn View Instagram post by kingscourtyardinn Jan 8 Open post by kingscourtyardinn with ID 18026025746607401 kingscourtyardinn View Instagram post by kingscourtyardinn Jan 5 Open post by kingscourtyardinn with ID 18173056060338731 kingscourtyardinn View Instagram post by kingscourtyardinn Jan 3 Open post by kingscourtyardinn with ID 18375092959152166 kingscourtyardinn View Instagram post by kingscourtyardinn Dec 31 Open post by kingscourtyardinn with ID 18066311438442159 kingscourtyardinn View Instagram post by kingscourtyardinn Dec 29 Open post by kingscourtyardinn with ID 18098493529665612 kingscourtyardinn View Instagram post by kingscourtyardinn Dec 25 Open post by kingscourtyardinn with ID 18169526461378969 kingscourtyardinn View Instagram post by kingscourtyardinn Dec 23 Open post by kingscourtyardinn with ID 18038566490711516 kingscourtyardinn View Instagram post by kingscourtyardinn Dec 21 Open post by kingscourtyardinn with ID 17952566505025262 kingscourtyardinn View Instagram post by kingscourtyardinn Dec 19 Open post by kingscourtyardinn with ID 17898619734357501 kingscourtyardinn View Instagram post by kingscourtyardinn Dec 16 Open post by kingscourtyardinn with ID 18083321039160118 kingscourtyardinn View Instagram post by kingscourtyardinn Dec 14 Open post by kingscourtyardinn with ID 18048612755449570 kingscourtyardinn View Instagram post by kingscourtyardinn Dec 11 Open post by kingscourtyardinn with ID 18037336883721360 kingscourtyardinn View Instagram post by kingscourtyardinn Dec 8 Open post by kingscourtyardinn with ID 18032003858542141 kingscourtyardinn View Instagram post by kingscourtyardinn Dec 6 Open post by kingscourtyardinn with ID 18108686773623111 kingscourtyardinn View Instagram post by kingscourtyardinn Dec 3 Open post by kingscourtyardinn with ID 18441085180102600 kingscourtyardinn View Instagram post by kingscourtyardinn Nov 30 Open post by kingscourtyardinn with ID 18046077206700778 Follow on Instagram \nManage Consent\n\nTo provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions.\nFunctional Always active Functional The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} \nManage Consent\n\nTo provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions.\nFunctional Always active Functional The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent Manage consent \nKeep in Touch!\n\nStay connected for promotions, announcements, & more!\nYes, I would like to receive updates. Get Updates",
      "hash": "8de949640b1e",
      "downloadedAt": "2026-01-19T02:08:55.914Z",
      "trimmedAt": "2026-01-19T03:26:22.287Z",
      "sizeReduction": "97.0%"
    }
  ],
  "sizeReduction": "97.0%"
}