{
  "venueId": "ChIJu7vkhD9__ogRmlOuDYAGS8M",
  "venueName": "ZEPPELIN PIZZA CO. Johns Island",
  "venueArea": "West Ashley",
  "website": "http://zeppelinpizzacojohnsisland.com/",
  "scrapedAt": "2026-01-18T17:04:31.609Z",
  "trimmedAt": "2026-01-18T17:12:51.126Z",
  "pages": [
    {
      "url": "http://zeppelinpizzacojohnsisland.com/johns-island-zeppelin-pizza-co-johns-island-drink-menu",
      "text": "Our Drinks Beer Cocktails",
      "hash": "1b64dbb973cd",
      "downloadedAt": "2026-01-18T17:04:18.679Z",
      "trimmedAt": "2026-01-18T17:12:51.098Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://zeppelinpizzacojohnsisland.com/johns-island-zeppelin-pizza-co-johns-island-happy-hours-specials",
      "text": "Specials Sunday January 18th WEEKEND DRINK SPECIAL: Mimosa (choice of orange juice or cranberry) $4.00 | Bottomless Mimosa $15.00 | Bloody Mary (tito's vodka, Bloody Mary mix, olive) $5.00 11:00 AM - 03:00 PM Monday January 19th Every Monday enjoy $2 OFF Deluxe Vinyls and $3 Margaritas. 11:00 AM - 10:00 PM We've got the best happy hour on Johns Island! Join us from 4-7pm Monday-Friday! $3 Domestic Bottles I $3.50 House Liquors I $1 OFF House Wines I $1 OFF ZPC Cocktails I $1 OFF Low Tide Drafts I $4 Select Shots! 04:00 PM - 07:00 PM See you all for Music Trivia with Charleston Charm Entertainment every Monday from 7-9PM! 07:00 PM - 09:00 PM Tuesday January 20th Hey ya'll. We've got trivia with Grey Matter Games from 7-9 every Tuesday! 07:00 PM - 09:00 PM Wednesday January 21st We've got the best happy hour on Johns Island! $3 Domestic Bottles I $3.50 House Liquors I $1 OFF House Wines I $1 OFF ZPC Cocktails I $1 OFF Low Tide Drafts I $4 Select Shots! 04:00 PM - 07:00 PM Live music! 09:00 PM - 12:00 AM Thursday January 22nd We've got the best happy hour on Johns Island! $3 Domestic Bottles I $3.50 House Liquors I $1 OFF House Wines I $1 OFF ZPC Cocktails I $1 OFF Low Tide Drafts I $4 Select Shots! 04:00 PM - 07:00 PM Saturday January 24th WEEKEND SPECIAL: Mimosa (choice of orange juice or cranberry) $4.00 | Bottomless Mimosa $15.00 | Bloody Mary (tito's vodka, Bloody Mary mix, olive) $5.00 11:00 AM - 03:00 PM",
      "hash": "1f47c26b66ac",
      "downloadedAt": "2026-01-18T17:04:19.352Z",
      "trimmedAt": "2026-01-18T17:12:51.102Z",
      "sizeReduction": "98.2%"
    },
    {
      "url": "http://zeppelinpizzacojohnsisland.com/",
      "text": "× Did you know we do catering? Whatever your occasion, however big or small, we have the perfect options to choose from. Cater your birthday party, holiday party, corporate events, wedding festivities and more! Catering Packages × We are taking online reservations! Let’s ensure you get a great table: Book today! We recommend making a reservation ahead of time. Book your table today! Book Table × Order your favorite dishes in seconds! Order Online × Let us host your special event! Whether a birthday party, office function or any other special occasion - we take care of all the fine details, bringing your event to life, just as you imagined. Host your next party or get together Book your party Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! Job Listings Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! 2817 Maybank Highway, Johns Island, SC 29455 map marker pin Your Go To Johns Island Pizza Joint reservations book a table Catering Effortless Catering, Impeccable Results. Let us handle the details, so you can enjoy the occasion to the fullest. catering order now Order Online Don't feel like cooking today? Enjoy the same great food, now with the added convenience of online ordering. order Zeppelin Pizza When we first conceived the idea of a pizza joint, we realized we wanted to bring amazing pizza to Johns Island. Come join us at Zeppelin Pizza Co. in our full service restaurant—offering up apps, pizza, subs, salads and more. jobs Eat. Drink. Enjoy. Our Menu Planning a party? parties book now Yes, we cater! catering order now Dot slide navigation number 1 Dot slide navigation number 2 Dot slide navigation number 3 slideshow start stop playing Reviews Review by - Yelp Jeff D: This restaurant had some of the best personal pizza I've ever had. My wife agreed, and said the same thing that I thought, the crust was excellent, and the pizza and the sauce and everything about it was high quality and great food... Review by - Yelp Crystal G: Great pizza and wings. My family loves to go for dinner. Service is always great too. Review by - Yelp Jonathan A: Best pizza on John's island. Great staff. I enjoy their food on a weekly basis. Great atmosphere in the restaurant. Great place to watch sports and listen to live music! Review by - Yelp Emily V: Wonderful spot! We swung by after running some errands and will definitely be back. The fried Mozzarella is really good and their marinara is excellent. We split the white caps pizza and chicken parm sandwich - both were really good... Review by - Yelp Danika J: Always consistent. Food is always delicious and delivered HOT. This is my go to for pizza but definitely tried many things and love the food... Stop reviews carousel Play reviews carousel Newsletter Location 2817 Maybank Highway Johns Island, SC 29455 Hours Sun, Mon, Tue, Wed, Thur, Fri, Sat 11:00 AM - 2:00 AM Find us on... Facebook page Instagram page Yelp page Contact us (843)-764-9597 info@zeppelinpizzco.com Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "ae1495ebafda",
      "downloadedAt": "2026-01-18T17:04:17.932Z",
      "trimmedAt": "2026-01-18T17:12:51.119Z",
      "sizeReduction": "98.0%"
    },
    {
      "url": "http://zeppelinpizzacojohnsisland.com/johns-island-zeppelin-pizza-co-johns-island-food-menu",
      "text": "Our Menu Menu",
      "hash": "cc8941938858",
      "downloadedAt": "2026-01-18T17:04:18.038Z",
      "trimmedAt": "2026-01-18T17:12:51.123Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://zeppelinpizzacojohnsisland.com/johns-island-zeppelin-pizza-co-johns-island-events",
      "text": "Events St. Patrick's Day Tuesday March 17th Grab your best green garb and join us for St. Patrick's Day! 11:00 AM - 02:00 AM 2026-03-17 11:00:00 2026-03-17 02:00:00 America/New_York St. Patrick's Day Grab your best green garb and join us for St. Patrick's Day! Zeppelin Pizza Co. - Johns Island Zeppelin Pizza Co. - Johns Island info@zeppelinpizzco.com",
      "hash": "dc0248b3f63d",
      "downloadedAt": "2026-01-18T17:04:19.995Z",
      "trimmedAt": "2026-01-18T17:12:51.126Z",
      "sizeReduction": "99.5%"
    }
  ],
  "sizeReduction": "99.0%"
}