{
  "venueId": "ChIJseCKouhk_ogRPA_ddGj0rEw",
  "venueName": "Commonhouse Aleworks",
  "venueArea": "North Charleston",
  "website": "http://commonhousealeworks.com/",
  "scrapedAt": "2026-01-19T02:45:58.679Z",
  "trimmedAt": "2026-01-19T02:54:10.885Z",
  "pages": [
    {
      "url": "https://commonhousealeworks.com/our-beer/core-beer/",
      "text": "[Page Title: Core Beer - Commonhouse Aleworks]\n\nCore Beer\n\nPark Circle\n\nJuicy Pale Ale, 5.5% ABV\n\nThis American Pale Ale is our year-round hop-forward pale offering. Expect strong tropical aromas, a soft body, with subtle juiciness and haze.\n\nLooking East\n\nWest Coast IPA, 6.2% ABV\n\nThis hop-forward IPA is Commonhouse’s West Coast IPA, bursting with citrusy and resinous flavors. Centennial, Chinook and Simcoe hops lend flavors that will remind you of citrus peel, piney mango, and grapefruit.\n\nRed Fox\n\nIrish Style Red Ale, 5% ABV\n\nA classic Irish Red, the hallmark toasty cocoa first impression puts you squarely in one place—Ireland—sharing a pint elbow to elbow at the neighborhood pub. Layers of subtle fruit—apricot, plum, even tomato—underpin the classic malty tones.\n\nThe Air is Salty\n\nGose Style Sour Ale, 5.2% ABV\n\nThe Air Is Salty is our interpretation of a traditional Gose-style beer. This zingy sour beer is accented with notes of coriander, as well as the addition of locally-sourced Bull’s Bay Sea Salt. A refreshingly tart beer, great for the beach and boat.\n\nWhite Point\n\nAmerican Style Lager, 5.3% ABV\n\nWhite Point Lager is a crisp and refreshing American-style craft beer brewed for hot Charleston summers, yet enjoyed all year round.\n\nDouble Parked\n\nDouble IP, 8% ABV\nWe share a lot in common\n \n Including being old enough to drink. ID please?\n\n Are you over 21 years of age?\n\n Yes No",
      "hash": "421c7e1ee518",
      "downloadedAt": "2026-01-19T02:13:44.177Z",
      "trimmedAt": "2026-01-19T02:54:10.844Z",
      "sizeReduction": "98.6%"
    },
    {
      "url": "https://commonhousealeworks.com/our-beer/uncommonly-good/",
      "text": "[Page Title: unCOMMONly Good - Commonhouse Aleworks]\n\nunCOMMONly Good\n\nProducing and serving quality beer is table stakes for our organization. Celebrating what we all share in common and making a positive impact in the communities we serve is what drives our team. Our  beer series has been a dream since we opened. We were ecstatic to finally launch it in conjunction with our 3rd anniversary in January of 2021 because we believe it will allow us to expand our positive impact on the common good.\nunCOMMONly GOOD \nThis series includes beer releases and a sharing of our platform to celebrate and support organizations doing great work. Proceeds from the  are given to community impact organizations across Commonhouse’s market footprint. We have enjoyed collaborating with these organizations in the past and believe our  will allow us to do more for and with these organizations.\nunCOMMONly GOOD Beer Series unCOMMONly GOOD Beer Series \n“Do all the good you can, by all the means you can, in all the ways you can, in all the places you can, at all the times you can, to all the people you can, as long as you ever can.”\nJohn Wesley, Theologian \nSUPPORT FOR THE COMMON GOOD\n\nWe support organizations linked to charitable works around the area. If your organization thinks the way we do, we would love to hear from you! Please tell us a little bit about yourself and your ideas around giving back to the community. While we cannot support every cause, we are committed to evaluating every single submission and reaching out if there is a fit. Thanks for being part of the Common Good!\nBeyond our unCOMMONly GOOD beer series, a portion of every Commonhouse beer sold is donated back to local community groups making an impact in and around Park Circle. Name * First Last Email * Organization Name Commonhouse Aleworks donates a portion of every beer sold back to local community groups with impact in or around Park Circle. Briefly describe how we could benefit your organization. Submit We share a lot in common\n \n Including being old enough to drink. ID please?\n\n Are you over 21 years of age?\n\n Yes No",
      "hash": "52725ee53d8b",
      "downloadedAt": "2026-01-19T02:13:43.616Z",
      "trimmedAt": "2026-01-19T02:54:10.849Z",
      "sizeReduction": "98.0%"
    },
    {
      "url": "http://commonhousealeworks.com/events/",
      "text": "[Page Title: Events - Commonhouse Aleworks]\n\nEvents\nWe share a lot in common\n \n Including being old enough to drink. ID please?\n\n Are you over 21 years of age?\n\n Yes No",
      "hash": "80215cc1c58d",
      "downloadedAt": "2026-01-19T02:13:45.309Z",
      "trimmedAt": "2026-01-19T02:54:10.853Z",
      "sizeReduction": "99.8%"
    },
    {
      "url": "https://commonhousealeworks.com/our-beer/",
      "text": "[Page Title: Beer With Purpose - Commonhouse Aleworks]\n\nBeer With Purpose\n\nCommonhouse Aleworks originated in the friendship between Hank Hanna and Pearce Fleming and through the love of craft beers, which were often shared amongst them and friends in what became known as Back Porch Beer sessions.\n\nBeer is a central component of communities throughout the history of civilization. And while beer is what we make, it is not our why. We are a community impact organization hoping to serve in the development of people and relationships that celebrate all we share in common which in turn positively impacts our community and world.\n\nCheck out our  to see what’s on tap today!\ntap list \n“Great beer makes great times. Great times make great friends. Great friends make great neighbors. Great neighbors make great cities. Great cities make great nations. Great nations make a great world. Therefore the greatness of the world depends on great beer.”\nBert Grant, father of the brewpub movement Powered by Live Tap Lists We share a lot in common\n \n Including being old enough to drink. ID please?\n\n Are you over 21 years of age?\n\n Yes No",
      "hash": "c0b7220ddeb5",
      "downloadedAt": "2026-01-19T02:13:43.060Z",
      "trimmedAt": "2026-01-19T02:54:10.857Z",
      "sizeReduction": "98.9%"
    },
    {
      "url": "https://commonhousealeworks.com/product-locator/",
      "text": "[Page Title: Product Locator - Commonhouse Aleworks]\n\nProduct Locator\nWe share a lot in common\n \n Including being old enough to drink. ID please?\n\n Are you over 21 years of age?\n\n Yes No",
      "hash": "eced85fef668",
      "downloadedAt": "2026-01-19T02:13:42.485Z",
      "trimmedAt": "2026-01-19T02:54:10.860Z",
      "sizeReduction": "99.8%"
    },
    {
      "url": "http://commonhousealeworks.com/",
      "text": "[Page Title: Home - Commonhouse Aleworks]\n\nDid you know that Commonhouse Aleworks is now open 7 days a week for lunch and dinner? Stay up to date by for the latest updates.\ndownloading the Commonhouse Aleworks app \nOrder for yourself or gift one to a friend for use in the taproom.\nDigital Gift Cards Now Available! Buy Digital Gift Cards \nA Park Circle Brewery celebrating what we all share in common.\n\nPark Circle is an amazing jewel in the greater North Charleston area. It has a rich history and a diverse and inclusive community full of people who care deeply about their neighborhood and neighbors. The Park Circle area was one of the first garden style communities in the United States, and most of the original planning concept remains today. Beyond the flora and fauna, sections of industrial, commercial, and residential usage teem with life. Commonhouse provides a central location for everyone to walk, ride bikes, push strollers, and drive to for an inviting, safe, and inclusive space in which to relax and celebrate what we all share in common.\nUnCOMMONly Good Beer \nSwig & Swine & Commonhouse\n\nWe are very excited to announce that Swig & Swine has opened their fourth Lowcountry location inside of Commonhouse as our new food partner! Beer & BBQ are a perfect match in our book. Anyone who knows Pearce knows that BBQ ranks at the top of his favorite food groups! Swig & Swine not only serves delicious BBQ but they place a high value on community service, action and impact, which is at the heart of who we are here at Commonhouse. We are thrilled to be able to partner with them and see all the ways that we can serve our community together.\nLet’s Eat! \nOur team works hard and plays hard.\n\nOur  are a diverse group! We come from all different backgrounds, yet we all share one thing in common: a love of Park Circle (and craft beer or course!). Stop in and see us. We are happy to serve you a pint with a smile, 6 days a week.\nteam members \nAre you a servant leader desiring to put your passion, talent, and skill to work make an impact on the community, one pint at a time? Check out our  for info!\nJobs Page Meet the Team \nA portion of the proceeds from every Commonhouse beer sold is donated to community impact organizations.\n\nAre you an organization linked to charitable works and positive community impact in or around Park Circle? We want to hear about you! Visit our  for details and a donation request form.\nCommunity Support page Support Park Circle \nWhat’s happening on social\nCame hungry. Left happy. Stayed a little longer th Dry January but make it Commonhouse 🍃\n\nIntroducing We’re open regular hours today, but our kitchen is 🎄✨ It’s almost that time, folks… our annual Christ Facebook Instagram \nLive Tap List\nPowered by Live Tap Lists \nfor news & discounts!\nInstall our app Friends of Commonhouse \nGet 20% off your next beer tab! Download the today and stay up to date on the latest news, events, and beer releases. And join for $20/month and enjoy discounts on drafts, cans, and more!\nCommonhouse App Friends of Commonhouse \nLet’s connect!\nName * First Last Email * Comment or Message * Submit We share a lot in common\n \n Including being old enough to drink. ID please?\n\n Are you over 21 years of age?\n\n Yes No",
      "hash": "ecfa4d957829",
      "downloadedAt": "2026-01-19T02:13:42.419Z",
      "trimmedAt": "2026-01-19T02:54:10.881Z",
      "sizeReduction": "97.9%"
    },
    {
      "url": "https://commonhousealeworks.com/connect/semi-private-events/",
      "text": "[Page Title: Semi Private Events - Commonhouse Aleworks]\n\nSemi Private Events\n\nWe are a production brewery and taphouse, not a traditional event venue. While we do have options for semi-private or full site rental, events at Commonhouse need to fit within our day-to-day operations.\n\nOur beautiful semi-private space comfortably fits groups ranging in size from 10 to 125+ with a combination of tables, Adirondack chairs, and standing room. This option is great for birthdays, rehearsal dinners, networking mixers, etc. Catering is available through Florie’s at Commonhouse for larger groups, and we have many beverage order options including drink tickets, individual tabs, and a private bar setup. In addition to our craft beer, we offer a variety of wines, cider, ready-to-drink canned cocktails, frozen cocktails, as well as numerous non-alcoholic options including soda, tea, and kombucha.\nSemi-private: \nPrices vary depending on the time, day, and month. If you are interested in hosting your next event at Commonhouse, please fill out this  and a member of our team will be in touch to provide a more detailed quote. Cheers!\nform We share a lot in common\n \n Including being old enough to drink. ID please?\n\n Are you over 21 years of age?\n\n Yes No",
      "hash": "f029c4bd693b",
      "downloadedAt": "2026-01-19T02:13:44.735Z",
      "trimmedAt": "2026-01-19T02:54:10.885Z",
      "sizeReduction": "98.7%"
    }
  ],
  "sizeReduction": "98.7%"
}