{
  "venueId": "ChIJdbUtM4p7_ogRnIf8Fbneg3Y",
  "venueName": "Sorelle",
  "venueArea": "Downtown Charleston",
  "website": "https://www.sorellecharleston.com/",
  "scrapedAt": "2026-01-18T17:04:28.433Z",
  "trimmedAt": "2026-01-18T17:11:20.811Z",
  "pages": [
    {
      "url": "https://www.sorellecharleston.com/location/visit-us/",
      "text": "Main content starts here, tab to start navigating Hours & Location 88 Broad St, Charleston, SC 29401 (843) 974-1575 *Please note Sorelle will be closed on Sunday, January 11th.Tuesday Mercato Monday - Sunday8:00AM - 4:00PM Dinner Mondays - Closed Tuesday - Sunday5:00PM - 10:00PM Brunch Sunday10:00AM - 2:00PM Bar Monday - Sunday4:30PM- Close Parking Exclusive to our Sorelle guests, we offer complimentary parking in our private parking lot. Available after 5PM, our private parking lot is located at , a short walk from the restaurant. Please note, that availability is limited and not guaranteed.Additional parking can be found via street meter parking or the King & Queen Parking Garage, 85 Queen St Charleston, SC 29401. 101 Broad Street, Charleston SC 29401 Get Directions Reservations Email Signup Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Sorelle | Italian Restaurant in Charleston, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "7579a18d4b7a",
      "downloadedAt": "2026-01-18T16:54:56.160Z",
      "trimmedAt": "2026-01-18T17:11:20.459Z",
      "sizeReduction": "95.3%"
    },
    {
      "url": "https://www.sorellecharleston.com/",
      "text": "Home Main content starts here, tab to start navigating Slide 1 of 5 Slide 2 of 5 Slide 3 of 5 Slide 4 of 5 Slide 5 of 5 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides SI ACCOMODI SOUTHERN ITALY MEETS SOUTHERN HOSPITALITY at Sorelle, a dining destination like no other on Charleston’s storied Broad Street. Inspired by Italy’s all-day cafes, abundant markets and rich culinary traditions, Sorelle features a mercato, central bar, wine room, and a grand dining room offering a variety of experiences for every food lover. Our Story Mangiamo Helmed by Chef Nick Dugan, Sorelle's kitchen offers a modern spin on classic Southern Italian cuisine made with Lowcountry ingredients, from fresh pastas and wood-fired pizzas to refined seafood dishes. Inspired by Italy’s convivial drinking culture, the cocktail and wine menus feature an extensive collection of Italian spirits and wines that celebrate the diverse regions of the country. Menus Private Dining Sorelle’s 3rd-floor private dining area offers an intimate experience with a touch of luxury. Designed by Meyer Davis Studios, the interior boasts a ten-person, round, marble dining table with comfortable velvet chairs, a billiards table, and a relaxing lounge area. Private Dining Room: (10 seated or 25 standing reception) Full Restaurant Buyout: (60 seated) Learn More Follow Us @sorelle_chs | 88 BROAD ST (843) 974-1575 Reservations Email Signup Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Sorelle | Italian Restaurant in Charleston, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "8c4e37368cbf",
      "downloadedAt": "2026-01-18T16:54:54.538Z",
      "trimmedAt": "2026-01-18T17:11:20.468Z",
      "sizeReduction": "94.8%"
    },
    {
      "url": "https://www.sorellecharleston.com/menus/",
      "text": "Main content starts here, tab to start navigating Menus NON SO CHE EVERY DAY “It’s Got That Certain Something Special, Every Day” Slide 1 of 7 Slide 2 of 7 Slide 3 of 7 Slide 4 of 7 Slide 5 of 7 Slide 6 of 7 Slide 7 of 7 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Dinner Chef's Experience Menu Brunch Dessert Cocktails Wine Spuntini Pane Sorelle’s Bread Service, World’s Best Olive Oil 9 $ Ostriche Crudo* East Coast Oysters on the Half Shell, Negroni Mignonette 25 $ Arancini Milanese Acquerello Rice, Royal Saffron, Caciocavallo 15 $ Aperitivo Plate Prosciutto San Daniele, Burrata di Bufala, Marinated Olives, Pasta Fritta 30 $ Caviale Petrossian Imperial Daurenki Caviar* Fennel Pollen Schiacciatina, Burrata di Bufala, Riserva di Nonna Rosa 140 $ Petrossian Imperial Ossetra Caviar* Fennel Pollen Schiacciatina, Burrata di Bufala, Riserva di Nonna Rosa 195 $ Antipasti Grilled Sardinian Octopus Chickpea Conserva, Pancetta, Saffron Broth 29 $ Crudo Di Tonno* Sliced Atlantic Ahi Tuna, Calabrian Pepper, Preserved Bergamot 28 $ Zucca Parmigiana Roasted Pumpkin, Pomodoro, Pistachio Pesto, Fonduta 18 $ Shrimp Catalana Sweet Pepper Agrodolce, ‘Nudja Ragu 21 $ Insalata Broccoli Caesar Grilled Broccolini, Soppressata, Fennel Breadcrumbs 19 $ Rucola E Finocchio Wild Arugula, Shaved Fennel, Grana Padano 20 $ Winter Squash Caprese Sweet Roasted Squash, Mozzarella di Bufala, Medjool Dates, Calabrian Pepper 25 $ Pizzette Fichi E Gorgonzola Caramelized Black Mission Fig, Gorgonzola Dolce, Horsecreek Honey 27 $ Sorelle Carpaccio Shaved A5 Wagyu, Roasted Garlic, Sicilian Caper, King Tide Arugula 46 $ Burrata Di Bufala San Marzano Tomato, Bagna Cauda, Sicilian Olive Oil 30 $ Pasta Baked Fazzoletti Tomato Handkerchief Pasta, Boar Creek Ragu, Pecorino, Bechamel 34 $ Mezzaluna Di Pera Bosch Pear Composta, Taleggio Fonduta, Vin Cotto 32 $ Sorelle Spaghetti Pomodoro, Burrata di Bufala, Crispy Zucchini, Garden Basil 29 $ Tajarin Al Ragù Hand-Cut Egg Yolk Pasta, Bolognese, Pecorino Romano 33 $ ‘Pillows of Gold’ Ricotta Tortelloni, Prosciutto Cotto, Very Good Butter, Balsamico Extravecchio 35 $ Rotolo Al Forno Wood-Fired Rolled Lasagna, Suckling Pig Sugo, Rapini 32 $ Secondi Line-Caught Swordfish* Piccata-Style, Sicilian Capers, Brown Butter 42 $ Olive Oil-Poached Flounder* Baby Artichokes, Sweet Vermouth, Sorrento Lemon 42 $ Branzino Al Forno* Pasta-Baked Mediterranean Sea Bass, Oven-Roasted Puttanesca Prepared at the Table 85 $ Pork Chop Alla Griglia* Cabbage Agrodolce, Garlic-Honey, Natural Jus 51 $ Chicken Milanese Local Tomatoes, Calabrian Pepper, Parmigiano Vacche Rosse 35 $ Bistecca Fiorentina* Cherry Pepper Salmoriglio, Porcini Mushroom Bearnaise, Rosemary Beef Jus 8oz Australian Wagyu 98 $ 40oz Dry-Aged Porterhouse 168 $ Contorni Patates Olive Oil-Fried Potatoes, Rosemary, Castelmagno 12 $ Polenta Signature Meatball 20 $ Spinaci Sauteed Spinach, Sicilian Chili Crunch 13 $ *consuming raw or undercooked meats, poultry, seafood, shellfish, or eggs may increase your risk of food bourne illness, especially if you have certain medical conditions Centro Tavola Center of the Table $124++ Per Person Aperitivo Pane e Burrata e Prosciutto di Parma Warm Sicilian Olives & Calabrian Chili Pepper Marinated Ricotta Salata & Sardinian Bottarga Petrossian Caviar Zeppole Prosciutto, Stracciatella per person 36 $ ANTIPASTI Crudo di Tonno Rucola E Finocchio PRIMI Zucca Parmigiana ‘Pillows of Gold’ Tortelloni Sorelle Spaghetti SECONDI Line-Caught Swordfish* Piccata-Style, Sicilian Capers, Brown Butter 42 $ Pork Chop Alla Griglia Wagyu New York Strip per person 85 $ CONTORNI Olive Oil-Fried Patates Spinaci e Chili Wine Pairing Classico 99 $ Riserva 195 $ DOLCE Budino di Cioccolato ZEPPOLE E ‘CAFFE’ Per La Tavola, Pizza, e Contorni Appetizers SHRIMP COCKTAIL Citrus-Poached, Cocktail Sauce, Garlic Aioli 20 $ OYSTERS* East Coast Oysters On the Half Shell, Mignonette 25 $ SORELLE CAVIAR SERVICE* Fennel Pollen Schiacciatina, Burrata di Bufala, Riserva di Nonna, Petrossian Imperial Daurenki Caviar - 195 140 $ $ WILD ARUGULA Wild Arugula, Shaved Fennel, Grana Padano 20 $ STONEFRUIT CAPRESE Heirloom Tomato, Mozzarella Di Bufala, Sesame Crunch 24 $ CRUDO DI TONNO* Sliced Atlantic Ahi Tuna, Calabrian Pepper, Preserved Bergamot 28 $ PASTRY BASKET Assorted Fresh-Baked Italian Pastries 16 $ YOGURT PARFAIT Fruits Picked At Their Peak, Lemon Tree Honey, Pistachio Granola 16 $ Entrée LOBSTER BENEDICT* Toasted Tigelle, Butter-Poached Maine Lobster 49 $ PROSCIUTTO BENEDICT* Toasted Tigelle, Prosciutto Cotto 26 $ ROMAN TOAST Berry Conserva, Vanilla Mascarpone, Maple Syrup 21 $ AMERICAN IN ROME* Two Eggs, Toast, Olive-Oil Fried Potatoes, Maple-Glazed Bacon Or House Made Sausage Patty 24 $ AVOCADO BRUSCHETTA* Grilled Sourdough, Two Poached Eggs, Garden Hot Sauce, Castelmagno Cheese 21 $ LITTLE GEM CAESAR Soppressata Dressing, Parmigiano Reggiano 8oz Grilled Chicken Breast 7 6ea Marinated Shrimp 7 20 $ POLENTA & SHRIMP Creamy Polenta, Grilled Mangrove Shrimp, ‘Nudja Ragu, Pepper Agrodole 27 $ BISTECCA & EGGS* 8oz Australian Waygu, 2 Storey Farm Eggs, Olive Oil Fried Potatoes, Cherry Pepper Salmoriglio, Calabrian Hollandaise 49 $ CHICKEN PARM Critically Acclaimed, Only Available At Brunch 29 $ Pasta Pillows of Gold Prosciutto Cotto, Very Good Butter, Balsamico 35 $ SORELLE SPAGHETTI Crispy Zucchini, Pomodoro, Burrata, Fresh Basil 29 $ GNOCCHETTI Pecorino Romano, Toasted Peppercorns 31 $ RIGATONI AMATRICIANA Guanciale, Arrabbiata, Toasted Garlic 31 $ Sides Olive Oil Potatoes 10 $ 2 Storey Farm Eggs* 8 $ Toast, Butter & Jam 9 $ Just Spaghetti With Butter Or Pomodoro 14 $ Maple-Glazed Bacon 10 $ Italian Sausage Patty 10 $ Croissant 5 $ Chocolate Croissant 6 $ Sfogliatelle 5 $ Almond Croissant 6 $ Pizza MARGHERITA San Marzano Tomatoes, Fresh Mozzarella, Garden Basil 21 $ CALABRIAN Pepperoni, Calabrian Pepper Honey, Toasted Sesame 25 $ MORTADELLA Pistachio Pesto, Mozzarella, Parmigiano Reggiano 26 $ CARBONARA Guanciale, Pecorino Romano, Egg Yolk, Black Pepper 24 $ Dolce Chocolate Budino 16 $ Zeppole E Caffe 16 $ 2 Scoops Gelato 7 $ 2 Scoops Sorbet 7 $ Lamill Coffee MINA BLEND DRIP 3 $ ESPRESSO 3 $ MACCHIATO 3.25 $ CORTADO 3.50 $ AMERICANO 3.75 $ CAPPUCCINO 4 $ CAFFÉ LATTE 5 $ CARAMEL LATTE 6 $ MOCHA LATTE 6 $ COLD BREW 7 $ Choice of almond or oat milk 0.75 $ Rishi Tea HOT TEA Jasmine Green, English Breakfast, Earl Grey. Decaf Peppermint, Decaf Chamomile 6 $ MATCHA GREEN TEA LATTE 8 $ MASALA CHAI LATTE 8 $ ASSAM ICED TEA 4.50 $ Fresh Juice ORANGE 7 $ GRAPEFRUIT 7 $ Dolce Zeppole e ‘Caffè Vanilla Bean Sugar Doughnuts, Marsala Zabaglione, Mocha 16 $ Limone Whipped Ricotta, Coosaw Farms Blueberry, Graham Cracker Crumbs 17 $ Budino Di Cioccolato Chocolate Custard, Hazelnut, Candied Orange, Soft-Whipped Cream 16 $ Sorelle Affogato Brown Sugar Gelato, Cocoa Nib, LaMill Espresso 14 $ Mascarpone Semifreddo Pistachio Sponge, Strawberry-Basil Sorbet, Honey Tuile 15 $ Olive Oil Torta Warm Olive Oil Cake, Almond Sorbet, Salted Caramel 15 $ Apertivo MARTINI TAVOLATA Nonna’s Secret Recipe featuring Grey Goose Vodka 18 $ LA BEFANA Domaine de Canton, Pear Eau de Vie, Apple Syrup, Prosecco, Thyme 16 $ GARDEN VARIETY Ginger Canton with Pear Brandy, White Port, Lemon & Bay Laurel 16 $ GARIBALDI A must-have blend of Campari & fresh, fluffy Orange Juice 16 $ intermezzo ROSETTA Wonderbird Gin & Rinomato Bianco shaken with Lavender Simple Syrup & Egg White Foam 18 $ SORRENTO SUN Ilegal Mezcal, Luxardo Bianco shaken with Lime, Passion Fruit & Carrot 18 $ FINALE PAGLIACCI OLD FASHIONED Russell’s 6-year Rye, See Elephant Amaro, Orange & Aromatic Bitters 18 $ SORELLE NEGRONI Hendrick’s Gin, Campari, Mirto, Carpano Classico & Coconut Essence 18 $ La Dolce Vita ESPRESSO MARTINI Grey Goose Vodka, Borghetti Italian Coffee, LAMILL Espresso, Vanilla Bean Teecino 16 $ Zero Proof SORELLE ITALIAN SODA Vanilla Cream Soda & Whipped Cream 10 $ ST. AGRESTIS ‘PHONY NEGRONI’ Bittersweet, Bubbly & Served Tall 10 $ FEVER TREE Ginger Ale, Ginger Beer, or Mediterranean Tonic 8 $ Beer BIRRA LUCANA Lager, Italy 8 $ FATTY’S Italian Pilsner, Charleston, SC 9 $ EDMUND’S OAST Seasonal Sour, Charleston, SC 10 $ Revelry ‘Poke the Bear’ American Pale Ale Charleston, SC 9 $ Untitled Art Non-Alcoholic Lager 9 $ Sorelle takes pride in its rotating selection of more than 300 wines that celebrate the finest from Italy and with something for every taste. The program emphasizes wines from Northern and Central Italy, showcasing both well-known and highly acclaimed producers, as well as lesser known producers for guests to discover. Sorelle’s wine list also features several “verticals” of iconic wines, including some dating back to the 1980s. In addition to benchmark wines from renowned wine regions such as Champagne, Bordeaux, and Burgundy, Sorelle’s wine list includes a unique selection dedicated to wines made outside of Italy using Italian varietals. Wines from California, Washington, Australia, and Argentina can also be found on the curated list. Guests may browse the wine list before your next visit using the button below. Corkage Fee $50 each for the first two 750ml bottles, $100 for the 3rd bottle. 3 bottle maximum. Download PDF Reservations Email Signup Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Sorelle | Italian Restaurant in Charleston, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "9d43648d3305",
      "downloadedAt": "2026-01-18T16:54:54.579Z",
      "trimmedAt": "2026-01-18T17:11:20.668Z",
      "sizeReduction": "93.0%"
    },
    {
      "url": "https://www.sorellecharleston.com/weekly-specials/",
      "text": "Main content starts here, tab to start navigating Weekly Mercato Specials Slide 1 of 2 Slide 2 of 2 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides A new reason to visit the mercato each week. Every Saturday, we introduce a weekly drink and panino special, crafted with seasonal ingredients and inspired by Italian flavors. These limited-time offerings bring a fresh twist to your favorites—stop by to see what’s new and savor the flavors of the moment or follow along on our . Instagram page Reservations Email Signup Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Sorelle | Italian Restaurant in Charleston, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "bdfad6159e16",
      "downloadedAt": "2026-01-18T16:54:55.632Z",
      "trimmedAt": "2026-01-18T17:11:20.676Z",
      "sizeReduction": "96.0%"
    },
    {
      "url": "https://www.sorellecharleston.com/menus",
      "text": "Main content starts here, tab to start navigating Menus NON SO CHE EVERY DAY “It’s Got That Certain Something Special, Every Day” Slide 1 of 7 Slide 2 of 7 Slide 3 of 7 Slide 4 of 7 Slide 5 of 7 Slide 6 of 7 Slide 7 of 7 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Dinner Chef's Experience Menu Brunch Dessert Cocktails Wine Spuntini Pane Sorelle’s Bread Service, World’s Best Olive Oil 9 $ Ostriche Crudo* East Coast Oysters on the Half Shell, Negroni Mignonette 25 $ Arancini Milanese Acquerello Rice, Royal Saffron, Caciocavallo 15 $ Aperitivo Plate Prosciutto San Daniele, Burrata di Bufala, Marinated Olives, Pasta Fritta 30 $ Caviale Petrossian Imperial Daurenki Caviar* Fennel Pollen Schiacciatina, Burrata di Bufala, Riserva di Nonna Rosa 140 $ Petrossian Imperial Ossetra Caviar* Fennel Pollen Schiacciatina, Burrata di Bufala, Riserva di Nonna Rosa 195 $ Antipasti Grilled Sardinian Octopus Chickpea Conserva, Pancetta, Saffron Broth 29 $ Crudo Di Tonno* Sliced Atlantic Ahi Tuna, Calabrian Pepper, Preserved Bergamot 28 $ Zucca Parmigiana Roasted Pumpkin, Pomodoro, Pistachio Pesto, Fonduta 18 $ Shrimp Catalana Sweet Pepper Agrodolce, ‘Nudja Ragu 21 $ Insalata Broccoli Caesar Grilled Broccolini, Soppressata, Fennel Breadcrumbs 19 $ Rucola E Finocchio Wild Arugula, Shaved Fennel, Grana Padano 20 $ Winter Squash Caprese Sweet Roasted Squash, Mozzarella di Bufala, Medjool Dates, Calabrian Pepper 25 $ Pizzette Fichi E Gorgonzola Caramelized Black Mission Fig, Gorgonzola Dolce, Horsecreek Honey 27 $ Sorelle Carpaccio Shaved A5 Wagyu, Roasted Garlic, Sicilian Caper, King Tide Arugula 46 $ Burrata Di Bufala San Marzano Tomato, Bagna Cauda, Sicilian Olive Oil 30 $ Pasta Baked Fazzoletti Tomato Handkerchief Pasta, Boar Creek Ragu, Pecorino, Bechamel 34 $ Mezzaluna Di Pera Bosch Pear Composta, Taleggio Fonduta, Vin Cotto 32 $ Sorelle Spaghetti Pomodoro, Burrata di Bufala, Crispy Zucchini, Garden Basil 29 $ Tajarin Al Ragù Hand-Cut Egg Yolk Pasta, Bolognese, Pecorino Romano 33 $ ‘Pillows of Gold’ Ricotta Tortelloni, Prosciutto Cotto, Very Good Butter, Balsamico Extravecchio 35 $ Rotolo Al Forno Wood-Fired Rolled Lasagna, Suckling Pig Sugo, Rapini 32 $ Secondi Line-Caught Swordfish* Piccata-Style, Sicilian Capers, Brown Butter 42 $ Olive Oil-Poached Flounder* Baby Artichokes, Sweet Vermouth, Sorrento Lemon 42 $ Branzino Al Forno* Pasta-Baked Mediterranean Sea Bass, Oven-Roasted Puttanesca Prepared at the Table 85 $ Pork Chop Alla Griglia* Cabbage Agrodolce, Garlic-Honey, Natural Jus 51 $ Chicken Milanese Local Tomatoes, Calabrian Pepper, Parmigiano Vacche Rosse 35 $ Bistecca Fiorentina* Cherry Pepper Salmoriglio, Porcini Mushroom Bearnaise, Rosemary Beef Jus 8oz Australian Wagyu 98 $ 40oz Dry-Aged Porterhouse 168 $ Contorni Patates Olive Oil-Fried Potatoes, Rosemary, Castelmagno 12 $ Polenta Signature Meatball 20 $ Spinaci Sauteed Spinach, Sicilian Chili Crunch 13 $ *consuming raw or undercooked meats, poultry, seafood, shellfish, or eggs may increase your risk of food bourne illness, especially if you have certain medical conditions Centro Tavola Center of the Table $124++ Per Person Aperitivo Pane e Burrata e Prosciutto di Parma Warm Sicilian Olives & Calabrian Chili Pepper Marinated Ricotta Salata & Sardinian Bottarga Petrossian Caviar Zeppole Prosciutto, Stracciatella per person 36 $ ANTIPASTI Crudo di Tonno Rucola E Finocchio PRIMI Zucca Parmigiana ‘Pillows of Gold’ Tortelloni Sorelle Spaghetti SECONDI Line-Caught Swordfish* Piccata-Style, Sicilian Capers, Brown Butter 42 $ Pork Chop Alla Griglia Wagyu New York Strip per person 85 $ CONTORNI Olive Oil-Fried Patates Spinaci e Chili Wine Pairing Classico 99 $ Riserva 195 $ DOLCE Budino di Cioccolato ZEPPOLE E ‘CAFFE’ Per La Tavola, Pizza, e Contorni Appetizers SHRIMP COCKTAIL Citrus-Poached, Cocktail Sauce, Garlic Aioli 20 $ OYSTERS* East Coast Oysters On the Half Shell, Mignonette 25 $ SORELLE CAVIAR SERVICE* Fennel Pollen Schiacciatina, Burrata di Bufala, Riserva di Nonna, Petrossian Imperial Daurenki Caviar - 195 140 $ $ WILD ARUGULA Wild Arugula, Shaved Fennel, Grana Padano 20 $ STONEFRUIT CAPRESE Heirloom Tomato, Mozzarella Di Bufala, Sesame Crunch 24 $ CRUDO DI TONNO* Sliced Atlantic Ahi Tuna, Calabrian Pepper, Preserved Bergamot 28 $ PASTRY BASKET Assorted Fresh-Baked Italian Pastries 16 $ YOGURT PARFAIT Fruits Picked At Their Peak, Lemon Tree Honey, Pistachio Granola 16 $ Entrée LOBSTER BENEDICT* Toasted Tigelle, Butter-Poached Maine Lobster 49 $ PROSCIUTTO BENEDICT* Toasted Tigelle, Prosciutto Cotto 26 $ ROMAN TOAST Berry Conserva, Vanilla Mascarpone, Maple Syrup 21 $ AMERICAN IN ROME* Two Eggs, Toast, Olive-Oil Fried Potatoes, Maple-Glazed Bacon Or House Made Sausage Patty 24 $ AVOCADO BRUSCHETTA* Grilled Sourdough, Two Poached Eggs, Garden Hot Sauce, Castelmagno Cheese 21 $ LITTLE GEM CAESAR Soppressata Dressing, Parmigiano Reggiano 8oz Grilled Chicken Breast 7 6ea Marinated Shrimp 7 20 $ POLENTA & SHRIMP Creamy Polenta, Grilled Mangrove Shrimp, ‘Nudja Ragu, Pepper Agrodole 27 $ BISTECCA & EGGS* 8oz Australian Waygu, 2 Storey Farm Eggs, Olive Oil Fried Potatoes, Cherry Pepper Salmoriglio, Calabrian Hollandaise 49 $ CHICKEN PARM Critically Acclaimed, Only Available At Brunch 29 $ Pasta Pillows of Gold Prosciutto Cotto, Very Good Butter, Balsamico 35 $ SORELLE SPAGHETTI Crispy Zucchini, Pomodoro, Burrata, Fresh Basil 29 $ GNOCCHETTI Pecorino Romano, Toasted Peppercorns 31 $ RIGATONI AMATRICIANA Guanciale, Arrabbiata, Toasted Garlic 31 $ Sides Olive Oil Potatoes 10 $ 2 Storey Farm Eggs* 8 $ Toast, Butter & Jam 9 $ Just Spaghetti With Butter Or Pomodoro 14 $ Maple-Glazed Bacon 10 $ Italian Sausage Patty 10 $ Croissant 5 $ Chocolate Croissant 6 $ Sfogliatelle 5 $ Almond Croissant 6 $ Pizza MARGHERITA San Marzano Tomatoes, Fresh Mozzarella, Garden Basil 21 $ CALABRIAN Pepperoni, Calabrian Pepper Honey, Toasted Sesame 25 $ MORTADELLA Pistachio Pesto, Mozzarella, Parmigiano Reggiano 26 $ CARBONARA Guanciale, Pecorino Romano, Egg Yolk, Black Pepper 24 $ Dolce Chocolate Budino 16 $ Zeppole E Caffe 16 $ 2 Scoops Gelato 7 $ 2 Scoops Sorbet 7 $ Lamill Coffee MINA BLEND DRIP 3 $ ESPRESSO 3 $ MACCHIATO 3.25 $ CORTADO 3.50 $ AMERICANO 3.75 $ CAPPUCCINO 4 $ CAFFÉ LATTE 5 $ CARAMEL LATTE 6 $ MOCHA LATTE 6 $ COLD BREW 7 $ Choice of almond or oat milk 0.75 $ Rishi Tea HOT TEA Jasmine Green, English Breakfast, Earl Grey. Decaf Peppermint, Decaf Chamomile 6 $ MATCHA GREEN TEA LATTE 8 $ MASALA CHAI LATTE 8 $ ASSAM ICED TEA 4.50 $ Fresh Juice ORANGE 7 $ GRAPEFRUIT 7 $ Dolce Zeppole e ‘Caffè Vanilla Bean Sugar Doughnuts, Marsala Zabaglione, Mocha 16 $ Limone Whipped Ricotta, Coosaw Farms Blueberry, Graham Cracker Crumbs 17 $ Budino Di Cioccolato Chocolate Custard, Hazelnut, Candied Orange, Soft-Whipped Cream 16 $ Sorelle Affogato Brown Sugar Gelato, Cocoa Nib, LaMill Espresso 14 $ Mascarpone Semifreddo Pistachio Sponge, Strawberry-Basil Sorbet, Honey Tuile 15 $ Olive Oil Torta Warm Olive Oil Cake, Almond Sorbet, Salted Caramel 15 $ Apertivo MARTINI TAVOLATA Nonna’s Secret Recipe featuring Grey Goose Vodka 18 $ LA BEFANA Domaine de Canton, Pear Eau de Vie, Apple Syrup, Prosecco, Thyme 16 $ GARDEN VARIETY Ginger Canton with Pear Brandy, White Port, Lemon & Bay Laurel 16 $ GARIBALDI A must-have blend of Campari & fresh, fluffy Orange Juice 16 $ intermezzo ROSETTA Wonderbird Gin & Rinomato Bianco shaken with Lavender Simple Syrup & Egg White Foam 18 $ SORRENTO SUN Ilegal Mezcal, Luxardo Bianco shaken with Lime, Passion Fruit & Carrot 18 $ FINALE PAGLIACCI OLD FASHIONED Russell’s 6-year Rye, See Elephant Amaro, Orange & Aromatic Bitters 18 $ SORELLE NEGRONI Hendrick’s Gin, Campari, Mirto, Carpano Classico & Coconut Essence 18 $ La Dolce Vita ESPRESSO MARTINI Grey Goose Vodka, Borghetti Italian Coffee, LAMILL Espresso, Vanilla Bean Teecino 16 $ Zero Proof SORELLE ITALIAN SODA Vanilla Cream Soda & Whipped Cream 10 $ ST. AGRESTIS ‘PHONY NEGRONI’ Bittersweet, Bubbly & Served Tall 10 $ FEVER TREE Ginger Ale, Ginger Beer, or Mediterranean Tonic 8 $ Beer BIRRA LUCANA Lager, Italy 8 $ FATTY’S Italian Pilsner, Charleston, SC 9 $ EDMUND’S OAST Seasonal Sour, Charleston, SC 10 $ Revelry ‘Poke the Bear’ American Pale Ale Charleston, SC 9 $ Untitled Art Non-Alcoholic Lager 9 $ Sorelle takes pride in its rotating selection of more than 300 wines that celebrate the finest from Italy and with something for every taste. The program emphasizes wines from Northern and Central Italy, showcasing both well-known and highly acclaimed producers, as well as lesser known producers for guests to discover. Sorelle’s wine list also features several “verticals” of iconic wines, including some dating back to the 1980s. In addition to benchmark wines from renowned wine regions such as Champagne, Bordeaux, and Burgundy, Sorelle’s wine list includes a unique selection dedicated to wines made outside of Italy using Italian varietals. Wines from California, Washington, Australia, and Argentina can also be found on the curated list. Guests may browse the wine list before your next visit using the button below. Corkage Fee $50 each for the first two 750ml bottles, $100 for the 3rd bottle. 3 bottle maximum. Download PDF Reservations Email Signup Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Sorelle | Italian Restaurant in Charleston, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "da8dc5389f0a",
      "downloadedAt": "2026-01-18T16:54:56.848Z",
      "trimmedAt": "2026-01-18T17:11:20.744Z",
      "sizeReduction": "93.0%"
    },
    {
      "url": "https://www.sorellecharleston.com/menus/#brunch",
      "text": "Main content starts here, tab to start navigating Menus NON SO CHE EVERY DAY “It’s Got That Certain Something Special, Every Day” Slide 1 of 7 Slide 2 of 7 Slide 3 of 7 Slide 4 of 7 Slide 5 of 7 Slide 6 of 7 Slide 7 of 7 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Dinner Chef's Experience Menu Brunch Dessert Cocktails Wine Spuntini Pane Sorelle’s Bread Service, World’s Best Olive Oil 9 $ Ostriche Crudo* East Coast Oysters on the Half Shell, Negroni Mignonette 25 $ Arancini Milanese Acquerello Rice, Royal Saffron, Caciocavallo 15 $ Aperitivo Plate Prosciutto San Daniele, Burrata di Bufala, Marinated Olives, Pasta Fritta 30 $ Caviale Petrossian Imperial Daurenki Caviar* Fennel Pollen Schiacciatina, Burrata di Bufala, Riserva di Nonna Rosa 140 $ Petrossian Imperial Ossetra Caviar* Fennel Pollen Schiacciatina, Burrata di Bufala, Riserva di Nonna Rosa 195 $ Antipasti Grilled Sardinian Octopus Chickpea Conserva, Pancetta, Saffron Broth 29 $ Crudo Di Tonno* Sliced Atlantic Ahi Tuna, Calabrian Pepper, Preserved Bergamot 28 $ Zucca Parmigiana Roasted Pumpkin, Pomodoro, Pistachio Pesto, Fonduta 18 $ Shrimp Catalana Sweet Pepper Agrodolce, ‘Nudja Ragu 21 $ Insalata Broccoli Caesar Grilled Broccolini, Soppressata, Fennel Breadcrumbs 19 $ Rucola E Finocchio Wild Arugula, Shaved Fennel, Grana Padano 20 $ Winter Squash Caprese Sweet Roasted Squash, Mozzarella di Bufala, Medjool Dates, Calabrian Pepper 25 $ Pizzette Fichi E Gorgonzola Caramelized Black Mission Fig, Gorgonzola Dolce, Horsecreek Honey 27 $ Sorelle Carpaccio Shaved A5 Wagyu, Roasted Garlic, Sicilian Caper, King Tide Arugula 46 $ Burrata Di Bufala San Marzano Tomato, Bagna Cauda, Sicilian Olive Oil 30 $ Pasta Baked Fazzoletti Tomato Handkerchief Pasta, Boar Creek Ragu, Pecorino, Bechamel 34 $ Mezzaluna Di Pera Bosch Pear Composta, Taleggio Fonduta, Vin Cotto 32 $ Sorelle Spaghetti Pomodoro, Burrata di Bufala, Crispy Zucchini, Garden Basil 29 $ Tajarin Al Ragù Hand-Cut Egg Yolk Pasta, Bolognese, Pecorino Romano 33 $ ‘Pillows of Gold’ Ricotta Tortelloni, Prosciutto Cotto, Very Good Butter, Balsamico Extravecchio 35 $ Rotolo Al Forno Wood-Fired Rolled Lasagna, Suckling Pig Sugo, Rapini 32 $ Secondi Line-Caught Swordfish* Piccata-Style, Sicilian Capers, Brown Butter 42 $ Olive Oil-Poached Flounder* Baby Artichokes, Sweet Vermouth, Sorrento Lemon 42 $ Branzino Al Forno* Pasta-Baked Mediterranean Sea Bass, Oven-Roasted Puttanesca Prepared at the Table 85 $ Pork Chop Alla Griglia* Cabbage Agrodolce, Garlic-Honey, Natural Jus 51 $ Chicken Milanese Local Tomatoes, Calabrian Pepper, Parmigiano Vacche Rosse 35 $ Bistecca Fiorentina* Cherry Pepper Salmoriglio, Porcini Mushroom Bearnaise, Rosemary Beef Jus 8oz Australian Wagyu 98 $ 40oz Dry-Aged Porterhouse 168 $ Contorni Patates Olive Oil-Fried Potatoes, Rosemary, Castelmagno 12 $ Polenta Signature Meatball 20 $ Spinaci Sauteed Spinach, Sicilian Chili Crunch 13 $ *consuming raw or undercooked meats, poultry, seafood, shellfish, or eggs may increase your risk of food bourne illness, especially if you have certain medical conditions Centro Tavola Center of the Table $124++ Per Person Aperitivo Pane e Burrata e Prosciutto di Parma Warm Sicilian Olives & Calabrian Chili Pepper Marinated Ricotta Salata & Sardinian Bottarga Petrossian Caviar Zeppole Prosciutto, Stracciatella per person 36 $ ANTIPASTI Crudo di Tonno Rucola E Finocchio PRIMI Zucca Parmigiana ‘Pillows of Gold’ Tortelloni Sorelle Spaghetti SECONDI Line-Caught Swordfish* Piccata-Style, Sicilian Capers, Brown Butter 42 $ Pork Chop Alla Griglia Wagyu New York Strip per person 85 $ CONTORNI Olive Oil-Fried Patates Spinaci e Chili Wine Pairing Classico 99 $ Riserva 195 $ DOLCE Budino di Cioccolato ZEPPOLE E ‘CAFFE’ Per La Tavola, Pizza, e Contorni Appetizers SHRIMP COCKTAIL Citrus-Poached, Cocktail Sauce, Garlic Aioli 20 $ OYSTERS* East Coast Oysters On the Half Shell, Mignonette 25 $ SORELLE CAVIAR SERVICE* Fennel Pollen Schiacciatina, Burrata di Bufala, Riserva di Nonna, Petrossian Imperial Daurenki Caviar - 195 140 $ $ WILD ARUGULA Wild Arugula, Shaved Fennel, Grana Padano 20 $ STONEFRUIT CAPRESE Heirloom Tomato, Mozzarella Di Bufala, Sesame Crunch 24 $ CRUDO DI TONNO* Sliced Atlantic Ahi Tuna, Calabrian Pepper, Preserved Bergamot 28 $ PASTRY BASKET Assorted Fresh-Baked Italian Pastries 16 $ YOGURT PARFAIT Fruits Picked At Their Peak, Lemon Tree Honey, Pistachio Granola 16 $ Entrée LOBSTER BENEDICT* Toasted Tigelle, Butter-Poached Maine Lobster 49 $ PROSCIUTTO BENEDICT* Toasted Tigelle, Prosciutto Cotto 26 $ ROMAN TOAST Berry Conserva, Vanilla Mascarpone, Maple Syrup 21 $ AMERICAN IN ROME* Two Eggs, Toast, Olive-Oil Fried Potatoes, Maple-Glazed Bacon Or House Made Sausage Patty 24 $ AVOCADO BRUSCHETTA* Grilled Sourdough, Two Poached Eggs, Garden Hot Sauce, Castelmagno Cheese 21 $ LITTLE GEM CAESAR Soppressata Dressing, Parmigiano Reggiano 8oz Grilled Chicken Breast 7 6ea Marinated Shrimp 7 20 $ POLENTA & SHRIMP Creamy Polenta, Grilled Mangrove Shrimp, ‘Nudja Ragu, Pepper Agrodole 27 $ BISTECCA & EGGS* 8oz Australian Waygu, 2 Storey Farm Eggs, Olive Oil Fried Potatoes, Cherry Pepper Salmoriglio, Calabrian Hollandaise 49 $ CHICKEN PARM Critically Acclaimed, Only Available At Brunch 29 $ Pasta Pillows of Gold Prosciutto Cotto, Very Good Butter, Balsamico 35 $ SORELLE SPAGHETTI Crispy Zucchini, Pomodoro, Burrata, Fresh Basil 29 $ GNOCCHETTI Pecorino Romano, Toasted Peppercorns 31 $ RIGATONI AMATRICIANA Guanciale, Arrabbiata, Toasted Garlic 31 $ Sides Olive Oil Potatoes 10 $ 2 Storey Farm Eggs* 8 $ Toast, Butter & Jam 9 $ Just Spaghetti With Butter Or Pomodoro 14 $ Maple-Glazed Bacon 10 $ Italian Sausage Patty 10 $ Croissant 5 $ Chocolate Croissant 6 $ Sfogliatelle 5 $ Almond Croissant 6 $ Pizza MARGHERITA San Marzano Tomatoes, Fresh Mozzarella, Garden Basil 21 $ CALABRIAN Pepperoni, Calabrian Pepper Honey, Toasted Sesame 25 $ MORTADELLA Pistachio Pesto, Mozzarella, Parmigiano Reggiano 26 $ CARBONARA Guanciale, Pecorino Romano, Egg Yolk, Black Pepper 24 $ Dolce Chocolate Budino 16 $ Zeppole E Caffe 16 $ 2 Scoops Gelato 7 $ 2 Scoops Sorbet 7 $ Lamill Coffee MINA BLEND DRIP 3 $ ESPRESSO 3 $ MACCHIATO 3.25 $ CORTADO 3.50 $ AMERICANO 3.75 $ CAPPUCCINO 4 $ CAFFÉ LATTE 5 $ CARAMEL LATTE 6 $ MOCHA LATTE 6 $ COLD BREW 7 $ Choice of almond or oat milk 0.75 $ Rishi Tea HOT TEA Jasmine Green, English Breakfast, Earl Grey. Decaf Peppermint, Decaf Chamomile 6 $ MATCHA GREEN TEA LATTE 8 $ MASALA CHAI LATTE 8 $ ASSAM ICED TEA 4.50 $ Fresh Juice ORANGE 7 $ GRAPEFRUIT 7 $ Dolce Zeppole e ‘Caffè Vanilla Bean Sugar Doughnuts, Marsala Zabaglione, Mocha 16 $ Limone Whipped Ricotta, Coosaw Farms Blueberry, Graham Cracker Crumbs 17 $ Budino Di Cioccolato Chocolate Custard, Hazelnut, Candied Orange, Soft-Whipped Cream 16 $ Sorelle Affogato Brown Sugar Gelato, Cocoa Nib, LaMill Espresso 14 $ Mascarpone Semifreddo Pistachio Sponge, Strawberry-Basil Sorbet, Honey Tuile 15 $ Olive Oil Torta Warm Olive Oil Cake, Almond Sorbet, Salted Caramel 15 $ Apertivo MARTINI TAVOLATA Nonna’s Secret Recipe featuring Grey Goose Vodka 18 $ LA BEFANA Domaine de Canton, Pear Eau de Vie, Apple Syrup, Prosecco, Thyme 16 $ GARDEN VARIETY Ginger Canton with Pear Brandy, White Port, Lemon & Bay Laurel 16 $ GARIBALDI A must-have blend of Campari & fresh, fluffy Orange Juice 16 $ intermezzo ROSETTA Wonderbird Gin & Rinomato Bianco shaken with Lavender Simple Syrup & Egg White Foam 18 $ SORRENTO SUN Ilegal Mezcal, Luxardo Bianco shaken with Lime, Passion Fruit & Carrot 18 $ FINALE PAGLIACCI OLD FASHIONED Russell’s 6-year Rye, See Elephant Amaro, Orange & Aromatic Bitters 18 $ SORELLE NEGRONI Hendrick’s Gin, Campari, Mirto, Carpano Classico & Coconut Essence 18 $ La Dolce Vita ESPRESSO MARTINI Grey Goose Vodka, Borghetti Italian Coffee, LAMILL Espresso, Vanilla Bean Teecino 16 $ Zero Proof SORELLE ITALIAN SODA Vanilla Cream Soda & Whipped Cream 10 $ ST. AGRESTIS ‘PHONY NEGRONI’ Bittersweet, Bubbly & Served Tall 10 $ FEVER TREE Ginger Ale, Ginger Beer, or Mediterranean Tonic 8 $ Beer BIRRA LUCANA Lager, Italy 8 $ FATTY’S Italian Pilsner, Charleston, SC 9 $ EDMUND’S OAST Seasonal Sour, Charleston, SC 10 $ Revelry ‘Poke the Bear’ American Pale Ale Charleston, SC 9 $ Untitled Art Non-Alcoholic Lager 9 $ Sorelle takes pride in its rotating selection of more than 300 wines that celebrate the finest from Italy and with something for every taste. The program emphasizes wines from Northern and Central Italy, showcasing both well-known and highly acclaimed producers, as well as lesser known producers for guests to discover. Sorelle’s wine list also features several “verticals” of iconic wines, including some dating back to the 1980s. In addition to benchmark wines from renowned wine regions such as Champagne, Bordeaux, and Burgundy, Sorelle’s wine list includes a unique selection dedicated to wines made outside of Italy using Italian varietals. Wines from California, Washington, Australia, and Argentina can also be found on the curated list. Guests may browse the wine list before your next visit using the button below. Corkage Fee $50 each for the first two 750ml bottles, $100 for the 3rd bottle. 3 bottle maximum. Download PDF Reservations Email Signup Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Sorelle | Italian Restaurant in Charleston, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "dce7777db67f",
      "downloadedAt": "2026-01-18T16:54:55.107Z",
      "trimmedAt": "2026-01-18T17:11:20.811Z",
      "sizeReduction": "93.0%"
    }
  ],
  "sizeReduction": "93.6%"
}