{
  "venueId": "ChIJweL6YVhz_ogRw9GrijbX0fs",
  "venueName": "IOP Raw Bar",
  "venueArea": "Isle of Palms",
  "website": "http://longislandcafesc.com/",
  "scrapedAt": "2026-01-18T17:04:31.964Z",
  "trimmedAt": "2026-01-18T17:13:03.208Z",
  "pages": [
    {
      "url": "https://longislandcafesc.com/dinner-menu/",
      "text": "Skip to main content Skip to footer Dinner Menu Lunch Dinner Brunch Drinks Kid's Menu Steamers From The Raw Bar HALF DOZEN $25 | DOZEN $40 OYSTERS - EAST COAST & LOCAL changes daily; cocktail, fresh horseradish & mignonette HALF POUND $20 | 1 POUND $40 PEEL & EAT LOCAL SHRIMP old bay | chilled MKT OYSTER OF THE WEEK changes weekly, MINIMUM OF 3 21 GROUPER BITES fried and served with tartar sauce 18 *TUNA TARTARE crispy wontons, seaweed salad, tobiko, and sweet soy 24 SMOKED FISH BURRATA TARTINE smoked fish spread on toasted baguette with burrata, sliced tomato, arugula, salmon roe, fresh herbs 16 BLISTERED SHISHITOS seared peppers, lemon juice, benne seed, remoulade MKT DAILY CRUDO changes daily 26 CRAB STACK ump crab meat, cucumber, mango, cherry tomato, red onion, arugula, confit tomato vinaigrette, crispy wontons Appetizers CUP | BOWL ISLAND FAMOUS SOUPS 11 | 13 TRADITIONAL SHE CRAB 8 | 10 CLAM CHOWDER 24 LUMP CRAB CAKES 2 cakes, seasoned with old bay and lemon 18 CRISPY RHODE ISLAND CALAMARI buttermilk ranch & marinara dipping sauce 13 TRUFFLE PARMESAN FRIES truffle oil, freshly grated parmesan cheese Salads HOUSE MADE DRESSINGS balsamic vinaigrette, creamy garlic, blue cheese, buttermilk ranch,warm bacon vinaigrette, lemon basil vinaigrette 18 CHOPPED SALAD smoked almond, bacon, gruyere, red onion,celery, artichoke hearts, grape tomatoes, lemonbasil vinaigrette 15 BABY SPINACH SALAD bacon, red onion, tomatoes, and feta, warm bacon dressing 14 CAESAR SALAD romaine, croutons, and house Caesar dressing 12 BABY LETTUCE MIX cucumber, carrot, and tomatoes Add Protein to Any Salad: 15 PEPPERED SALMON 14 CRAB CAKE 12 SHRIMP ried, grilled, or blackened 12 OYSTERS fried or blackened 8 CHICKEN grilled or blackened Fresh Seafood Cracker Meal Breaded and Lightly Fried, Broiled, orBlackened; comes with your choice of 2 sides 32 LOCAL FLOUNDER 30 WILD EAST COAST SHRIMP 30 EAST COAST OYSTERS 42 NEW BEDFORD SEA SCALLOPS 35 COMBO (choose two) 40 LIC COMBO (shrimp, oysters, flounder) Entrees all served with your choice of two sides except shrimp & grits, pasta special, & burger 35 Parmesan Crusted Salmon baked until golden brown or... 33 SIMPLY GRILLED SALMON 35 PAN FRIED FLOUNDER dredged in flour and egg, sauteed in butter, finished with lemons 32 *SESAME CRUSTED TUNA served rare with soy & sriracha citrus sauce 26 GRILLED CHICKEN topped with arugula, tomatoes, goat cheese, and lemon vinaigrette 50 CRAB MEAT CRUSTED GROUPER meyer lemon prosecco cream sauce 40 LUMP CRAB CAKES 3 cakes, panko bread crumb, old bay, and lemon 38 CRAB STUFFED SHRIMP baked with white wine and butter 50 *8 oz Filet Mignon demi glace and shoestring onion rings add crab cake +14 28 SHRIMP AND GRITS topped with frizzled leaks MKT Local Handmade Seafood Pasta Special 24 *BLACK ANGUS 8 oZ CHEESEBURGER ettuce, onion, & tomato, choice of cheddar, swiss, orjack cheese, served with your choice of a side add bacon +0.75 Sides 6 COLE SLAW 6 WHITE CHEDDAR GRITS 6 DAILY VEGETABLE 6 GARLIC MASHED POTATOES 6 House Cut French Fries 7 SWEET POTATO FRIES 8 TRUFFLE PARMESAN FRIES SIDE Consuming raw or undercooked meats, poultry, seafood, shellfish or eggs may increase your risk of foodborne illness. Young children, the elderly or anyone whose health is compromised should not consume undercooked seafood, meats and shellfish. 18% gratuity will be added to parties of 8 or more.*Contains ingredients that are raw or undercooked.Menu items are subject to change according to seasonality and availability. Now offering LIC Steamers! Making dinner as easy as 1-2-3 with L-I-C! Perfect for a solo feast, or a big celebration! Order Online View Menu",
      "hash": "18a3852e705d",
      "downloadedAt": "2026-01-18T16:55:18.359Z",
      "trimmedAt": "2026-01-18T17:13:03.107Z",
      "sizeReduction": "95.9%"
    },
    {
      "url": "https://longislandcafesc.com/drinks-menu/",
      "text": "Skip to main content Skip to footer Drinks Menu Lunch Dinner Brunch Drinks Kid's Menu Steamers Cocktails 15 BOURBON RENEWAL bourbon, creme de cassis, lime, simple, bitters 15 RUM PUNCH light rum, dark rum, pineapple, oj, lime, grenadine 14 PINK CHAMPAGNE MARGARITA tequila, triple sec, lime juice, pink lemonade, topped with sparkling wine 14 LOW COUNTRY TEA firefly sweet tea vodka, lemonade 15 POMEGRANATE MARTINI vodka,cointreau, lime juice, pomegranate juice 14 PALOMA SOUR tequila, grapefruit juice, simple, lime juice, soda 15 ESPRESSO MARTINI vanilia vodka, kahlua, espresso cold brew, splash baileys Whites 13 | 42 BIELER ROSE “CUVEE SABINE” Provence, France 12 | 39 J LOHR “BAY MIST” RIESLING Monteray, California 10 | 41 RUFFINO PINOT GRIGIO Veneto, Italy 65 SANTA MARGHERITA PINOT GRIGIO Trentino-Alto Adige, Italy 13 | 48 MOHUA SAUVIGNON BLANC Marlborough, New Zealand 12 | 45 PINE RIDGE CHENIN BLANC/VIOGNIER California 15 | 65 LA CREMA CHARDONNAY Sonoma County, CA 90 DAROUGH ESTATE CHARDONNAY Sonoma County, CA 18 | 75 LOUIS JADOT POUILLY-FUISSE Burgundy, France Reds 12 | 49 HAHN PINOT NOIR Monterey, CA 14 | 50 MEIOMI PINOT NOIR Santa Barbara, CA 75 KING ESTATE PINOT NOIR Willamette Valley, OR 24 | 90 CHATEAU GREYSAC Bordeaux, France 12 | 42 ROBERT MONDAVI PRIVATE SELECT MERLOT Central Coast, CA 12 | 46 ALEXANDER BROWN RED BLEND Central Valley, CA 12 | 46 JOSH CABERNET SAUVIGNON Sonoma County, CA 16 | 55 DAOU CABERNET Paso Robles, CA 16 | 61 SMITH & HOOK CABERNET SAUVIGNON Sonoma, CA 12 | 41 VIVE ALTA VISTA MALBEC Mendoza, Argentina 140 BANFI BRUNELLO DIMONTALCINO Tuscany, Italy Champagne | Sparkling 10 | 40 FREIXENET CORDON NEGRO Cava, Spain 10 | 40 LUNETTA PROSECCO BRUT Veneto, Italy 10 glass CHANDON ROSE Napa, CA 60 DOMAINE CARNEROS TAITTINGER Napa, CA 50 split | 95 VEUVE CLIQUOT YELLOW LABEL Champagne, France Beer | Seltzer | NA OUR LOCAL, DRAFT, AND NA SELECTIONS CHANGE REGULARLY PLEASE ASK YOUR BARTENDER BUD LIGHT COORS LIGHT GUINNESS DRAUGHT CORONA MICHELOB ULTRA BLUE MOON STELLA ARTOIS MILLER LIGHT HIGHRISE D9 SELTZER Consuming raw or undercooked meats, poultry, seafood, shellfish or eggs may increase your risk of foodborne illness. Young children, the elderly or anyone whose health is compromised should not consume undercooked seafood, meats and shellfish. 18% gratuity will be added to parties of 8 or more.*Contains ingredients that are raw or undercooked.Menu items are subject to change according to seasonality and availability. Now offering LIC Steamers! Making dinner as easy as 1-2-3 with L-I-C! Perfect for a solo feast, or a big celebration! Order Online View Menu",
      "hash": "4a30c6f2e326",
      "downloadedAt": "2026-01-18T16:55:19.566Z",
      "trimmedAt": "2026-01-18T17:13:03.128Z",
      "sizeReduction": "97.0%"
    },
    {
      "url": "https://longislandcafesc.com/lunch-menu/",
      "text": "Skip to main content Skip to footer Lunch Menu Lunch Dinner Brunch Drinks Kid's Menu Steamers Appetizers CUP 11 | BOWL 13 TRADITIONAL SHE CRAB SOUP creamy and rich served with sherry CUP 8 | BOWL 10 CLAM CHOWDER the best in the biz 24 LUMP CRAB CAKES 2 cakes, seasoned with old bay and lemon 18 CRISPY FRIED RHODE ISLAND CALAMARI buttermilk ranch & marinara dipping sauce 13 TRUFFLE PARMESAN FRIES truffle oil, freshly grated parmesan cheese 19 | 28 SHRIMP & GRITS topped with frizzled leaks Salads HOUSE MADE DRESSINGS balsamic vinaigrette, creamy garlic, blue cheese, buttermilk ranch, warm bacon vinaigrette, lemon basil vinaigrette 18 CHOPPED SALAD smoked almond, bacon, gruyere, red onion, celery, artichoke hearts, grape tomatoes, lemon basil vinaigrette 15 Baby Spinach Salad bacon, red onion, tomatoes, and feta, warm bacon dressing 14 CAESAR SALAD romaine, croutons, and house Caesar dressing 12 BABY LETTUCE MIX cucumber, carrot, and tomatoes Add Protein to Any Salad: 15 PEPPERED SALMON 14 CRAB CAKE 12 SHRIMP ried, grilled, or blackened 12 OYSTERS fried or blackened 8 CHICKEN grilled or blackened Fresh Seafood Cracker Meal Breaded and Lightly Fried Blackened or Broiledcomes with your choice of:1 side (lunch portion) | 2 sides (dinner portion) 22 | 32 LOCAL FLOUNDER 20 | 30 WILD EAST COAST SHRIMP 22 | 30 EAST COAST OYSTERS 35 | 42 NEW BEDFORD SEA SCALLOPS -- | 35 COMBO (choose two) -- | 40 LIC COMBO (shrimp, oysters, flounder) SANDWICHES All Sandwiches Come with Your Choice of Side 20 FISH TACOS 3 tacos, fried or blackened flounder, pineapple pico, lettuce, tomato, remoulade 22 *SALMON BLT basil mayo on hearty wheat toast 20 *GRILLED FRESH TUNA lettuce & tomato on wheat toast with basil mayo 20 FRIED FLOUNDER SANDWICH ettuce, tomato, & tartar sauce on a toasted bun 26 CRAB MELT open faced English muffin, tomato, melted monterey jack cheese shrimp 20 | oyster 20 PO BOY lettuce, tomato, & remoulade on an Amoroso roll 18 CHICKEN CORDON BLEU grilled chicken, bacon, ham, swiss cheese, honey mustard on a toasted bun 16 CLASSIC CLUB turkey, bacon, ham, swiss, lettuce, tomato, and mayo on toasted sourdough 26 CRAB BURGER toasted brioche bun, lettuce, tomato, remoulade 24 *BLACK ANGUS 8 oz CHEESEBURGER lettuce, onion & tomato, choice of cheddar, swiss, or jack cheese add bacon +0.75 Sides 6 COLE SLAW 6 WHITE CHEDDAR GRITS 6 DAILY VEGETABLE 6 House Cut French Fries 7 SWEET POTATO FRIES 8 TRUFFLE PARMESAN FRIES SIDE Consuming raw or undercooked meats, poultry, seafood, shellfish or eggs may increase your risk of foodborne illness. Young children, the elderly or anyone whose health is compromised should not consume undercooked seafood, meats and shellfish. 18% gratuity will be added to parties of 8 or more.*Contains ingredients that are raw or undercooked.Menu items are subject to change according to seasonality and availability. Now offering LIC Steamers! Making dinner as easy as 1-2-3 with L-I-C! Perfect for a solo feast, or a big celebration! Order Online View Menu",
      "hash": "9505394ef88a",
      "downloadedAt": "2026-01-18T16:55:17.779Z",
      "trimmedAt": "2026-01-18T17:13:03.144Z",
      "sizeReduction": "96.5%"
    },
    {
      "url": "https://longislandcafesc.com/kids-menu/",
      "text": "Skip to main content Skip to footer Kid’s Menu Lunch Dinner Brunch Drinks Kid's Menu Steamers Fried Choices 10 Chicken Fingers 10 Fried Shrimp 10 Fried Fish 10 Fried Scallops 10 Fried Oysters Sandwiches 7 Grilled Cheese Sandwich 7 Peanut Butter & Jelly 10 Hamburger 10 Cheese Burger Grilled Choices 10 Chicken Breast 10 Salmon Desserts 4 Vanilla Ice Cream-one Scoop 5.50 Kids Sundae Consuming raw or undercooked meats, poultry, seafood, shellfish or eggs may increase your risk of foodborne illness. Young children, the elderly or anyone whose health is compromised should not consume undercooked seafood, meats and shellfish. 18% gratuity will be added to parties of 8 or more.*Contains ingredients that are raw or undercooked.Menu items are subject to change according to seasonality and availability. Now offering LIC Steamers! Making dinner as easy as 1-2-3 with L-I-C! Perfect for a solo feast, or a big celebration! Order Online View Menu",
      "hash": "ab27c6d93138",
      "downloadedAt": "2026-01-18T16:55:20.600Z",
      "trimmedAt": "2026-01-18T17:13:03.154Z",
      "sizeReduction": "98.8%"
    },
    {
      "url": "http://longislandcafesc.com/",
      "text": "Skip to main content Skip to footer The Long Island Cafe of SC est. 1986 Since first opening its doors in 1986, Long Island Café has been a hidden gem for locals and tourists alike, tucked within a strip mall on the Isle of Palms. Over its decades-long history, this beloved restaurant has become a staple of the Charleston community. Location 1515 Palm Blvd.Isle of Palms, SC (843) 886-8809 Hours of Operation Lunch Monday — Saturday11:00am — 2:00pm Brunch Sunday11:00am — 2:00pm Dinner Monday — Sunday5:00pm — until IOP Raw Monday — Sunday4:30pm — until rESERVATIONS Reservations are prioritized due to high demand, particularly on weekends.Fill out the form to secure your spot. Menus In 2012, the café underwent a revitalization with new ownership, breathing new life into the restaurant and menu. In 2019, the vision for the island’s finest seafood expanded as a sister location, IOP Raw, was opened right next door. Both restaurants were sold to longtime friends and loyal patrons in 2022. Though the menu has evolved through all the transitions, classic dishes remain, with a continued emphasis on fresh, local seafood. New items and regularly changing specials keep the offerings vibrant. This modern version of an island favorite has thrived, supporting local producers while serving up a diverse menu of seafood, pasta, American cuisine, and desserts. Sharing a kitchen allows guests to enjoy both menus in either dining room. Long Island Cafe Menu Lunch Dinner Brunch Drinks Kid's Menu Steamers FAQs What are you known for? We are known for our iconic fried seafood platters, fresh oysters, and our wildly popular Seafood Steamer Buckets. Guests love our coastal flavors, relaxed island atmosphere, and long-standing reputation as one of Isle of Palms’ favorite seafood destinations. What meals do you serve? We serve lunch and dinner daily, as well as a beloved Sunday brunch featuring coastal classics and island-inspired favorites. Do you offer delivery or takeout? Yes! We offer takeout and delivery, and highly recommend our Seafood Steamer Buckets for beach days, family gatherings, holidays, and at-home events. What areas do you serve? We proudly serve Isle of Palms, South Carolina, along with nearby beach communities. Are reservations required? Reservations are not required, but highly recommended, especially for weekends, holidays, and larger parties. Is there a dress code? No—island casual attire is perfectly welcome. Come as you are and enjoy fresh, local seafood by the coast. Now offering LIC Steamers! Making dinner as easy as 1-2-3 with L-I-C! Perfect for a solo feast, or a big celebration! Order Online View Menu",
      "hash": "bc565f79469c",
      "downloadedAt": "2026-01-18T16:55:17.700Z",
      "trimmedAt": "2026-01-18T17:13:03.176Z",
      "sizeReduction": "97.4%"
    },
    {
      "url": "https://longislandcafesc.com/brunch-menu/",
      "text": "Skip to main content Skip to footer Brunch Menu Lunch Dinner Brunch Drinks Kid's Menu Steamers Appetizers MINIMUM OF 3, MKT OYSTER OF THE WEEK changes weekly CUP | BOWL ISLAND FAMOUS SOUPS 11 | 13 TRADITIONAL SHE CRAB SOUP 8 | 10 CLAM CHOWDER 24 LUMP CRAB CAKES 2 cakes, seasoned with old bay and lemon 19 | 28 SHRIMP & GRITS topped with frizzled leaks 13 TRUFFLE PARMESAN FRIES truffle oil, freshly grated parmesan cheese Salads HOUSE MADE DRESSINGS balsamic vinaigrette, creamy garlic, blue cheese, buttermilk ranch, warm bacon vinaigrette, lemon basil vinaigrette 18 CHOPPED SALAD smoked almond, bacon, gruyere, red onion, celery, artichoke hearts, grape tomatoes, lemon basil vinaigrette 15 Baby Spinach Salad bacon, red onion, tomatoes, and feta, warm bacon dressing 14 CAESAR SALAD romaine, croutons, and house Caesar dressing 12 BABY LETTUCE MIX cucumber, carrot, and tomatoes Add Protein to Any Salad: 15 PEPPERED SALMON 14 CRAB CAKE 12 SHRIMP ried, grilled, or blackened 12 OYSTERS fried or blackened 8 CHICKEN grilled or blackened Eggs served with one side; egg whites may be subbed +1 15 TWO EGGS ANY STYLE bacon or ham 22 SHRIMP OMELETTE onions and peppers, topped with jack cheese 18 WESTERN OMELETTE ham, bell peppers, onion, and cheddar 26 FRESH LUMP CRAB MEAT OMELETTE onions and bell peppers add cheese +0.75 18 GREEK OMELETTE spinach, tomato, red onion, feta, olives 17 LOADED VEGGIE OMELETTE swiss cheese 15 CHEESE OMELETTE choice of jack, cheddar, or swiss MKT DAILY FRITTATA OR QUICHE rotates daily, chef’s choice Entrees 16 IOP MONTE CRISTO french toast style challah bread, ham, swiss, tomato, fried egg, served with your choice of a side 16 ALMOND CRUSTED FRENCH TOAST local braided challah bread, sliced almonds, berry compote, cinnamon cream cheese whip 18 CHEDDAR BACON CORNBREAD WAFFLE large belgian style waffle made with cheddar bacon cornbread batter, topped with bacon, fresh corn, and scallions, served with whipped butter add egg +2 26 CHICKEN AND WAFFLE large belgian style cheddar bacon corn bread waffle, topped with fried chicken, bacon, fresh corn, and scallions, served with whipped butter 24 *BLACK ANGUS 8 oz CHEESEBURGER lettuce, onion & tomato, choice of cheddar, swiss, or jack cheese, served with your choice of a side add bacon +0.75 Fresh Seafood Cracker Meal Breaded and Lightly Fried or Broiledcomes with your choice of:1 side (lunch portion) | 2 sides (dinner portion) 22 | 32 LOCAL FLOUNDER 20 | 30 WILD EAST COAST SHRIMP 22 | 30 EAST COAST OYSTERS 35 | 42 NEW BEDFORD SEA SCALLOPS -- | 35 COMBO (choose two) -- | 40 LIC COMBO (shrimp, oysters, flounder) Benedicts 18 CLASSIC EGGS BENEDICT grilled ham, served with a side 22 ISLAND EGGS BENEDICT fried flounder & grilled tomato, served with a side 24 EGG DEWEES BENEDICT grilled salmon & sauteed spinach, served with a side 26 CRAB CAKE BENEDICT 2 lump crab cakes, served with a side Sides 1.25 TOAST - white or wheat 6 WHITE CHEDDAR GRITS 7 BACON 6 HOME FRIES 6 HOUSE CUT FRENCH FRIES 8 TRUFFLE PARMESAN FRIES SIDE 7 SWEET POTATO FRIES 6 DAILY VEGETABLE 6 COLE SLAW Consuming raw or undercooked meats, poultry, seafood, shellfish or eggs may increase your risk of foodborne illness. Young children, the elderly or anyone whose health is compromised should not consume undercooked seafood, meats and shellfish. 18% gratuity will be added to parties of 8 or more.*Contains ingredients that are raw or undercooked.Menu items are subject to change according to seasonality and availability. Now offering LIC Steamers! Making dinner as easy as 1-2-3 with L-I-C! Perfect for a solo feast, or a big celebration! Order Online View Menu",
      "hash": "e5cb47d5f9c2",
      "downloadedAt": "2026-01-18T16:55:18.992Z",
      "trimmedAt": "2026-01-18T17:13:03.193Z",
      "sizeReduction": "96.0%"
    },
    {
      "url": "https://longislandcafesc.com/lic-steamers-menu/",
      "text": "Skip to main content Skip to footer LIC Steamers Menu Ready to Heat and Eat All orders must be placed in advance through our online ordering. Order Takeout & Delivery Online View Heating Instructions Download Lunch Dinner Brunch Drinks Kid's Menu Steamers 55 ISLE OF PALMS STEAMER - ebb tide *perfect for 2* 1 lb Peel and Eat Shrimp, 1/2 Pound Jalapeño Cheddar Sausage, Sweet Corn, Red Bliss Potatoes, classic or cajun seasoning, cocktail sauce, and butter 100 ISLE OF PALMS STEAMER - high water *serves 4-5* 2 1/2 lbs Peel and Eat Shrimp, 1 lb Jalapeño Cheddar Sausage, Sweet Corn, Red Bliss Potatoes, classic or cajun seasoning, cocktail sauce, and butter 90 SULLIVANS STEAMER - ebb tide *serves 2-3* 1 lb Snow Crab, 1 lb Peel and Eat Shrimp, Sweet Corn, Red Bliss Potatoes, classic or cajun seasoning, cocktail sauce, and butter 150 SULLIVANS STEAMER - high water *serves 4-5* 2 lbs Snow Crabs, 2 lbs Peel and Eat Shrimp, Sweet Corn, Red Bliss Potatoes, classic or cajun seasoning, cocktail sauce, and butter 105 FOLLY STEAMER - ebb tide *serves 3-4* 1 lb Peel and Eat Shrimp, 1 Dozen Clams, 1 lb Snow Crab, 1/2 lb Jalapeño Cheddar Sausage, Sweet Corn, Red Bliss Potatoes, classic or cajun seasoning, cocktail sauce, and butter 210 FOLLY STEAMER - high water *serves 5-6* 2 lbs Peel and Eat Shrimp, 2 Dozen Clams, 2 lbs. Snow Crab, 1 lb Jalapeño Cheddar Sausage, Sweet Corn, Red Bliss Potatoes, classic or cajun seasoning, cocktail sauce, and butter 150 FORT MOULTRIE STEAMER - ebb tide *serves 3-4* 1 lb Snow Crab, two 5 oz Lobster Tails, 1 Dozen Clams, 1 lb Peel and Eat Shrimp, 1/2 lb Jalapeño Cheddar Sausage, Sweet Corn, Red Bliss Potatoes, classic or cajun seasoning, cocktail sauce, and butter 250 FORT MOULTRIE STEAMER - high water *serves 5-6* 2 lbs Snow Crab, four 5 oz Lobster Tails, 2 Dozen Clams, 1 1/2 lb Peel and Eat Shrimp,1 lb Jalapeño Cheddar Sausage, Sweet Corn, Red Bliss Potatoes, classic or cajun seasoning, cocktail sauce, and butter ADD ONS Add on to the above buckets for some extra eats, or build your own bucket starting with a BYOB!Call to find out about our Party Buckets for 20 or 30 guests or more!All BYOB come with sweet corn, red bliss potatoes, cajun or classic seasoning, cocktail sauce, and butter(enough for 2-3, please add each item accordingly) +10 1 LB CORN & 1 LB POTATOES +25 OYSTERS 1 DOZEN +45 OYSTERS 2 DOZEN +30 SNOW CRAB 1 POUND +60 SNOW CRAB 2 POUNDS +90 SNOW CRAB 3 POUNDS +25 LOBSTER TAIL (5oz) +25 PEEL & EAT SHRIMP 1 LB +50 PEEL & EAT SHRIMP 2 LBS +75 PEEL & EAT SHRIMP 3 LBS +5 JALAPEÑO CHEDDAR SAUSAGE LINK +2 EXTRA COCKTAIL SAUCE (8oz) +12 6 PACK MILLER LITE +60 WHOLE KEY LIME OR PECAN PIE Consuming raw or undercooked meats, poultry, seafood, shellfish or eggs may increase your risk of foodborne illness. Young children, the elderly or anyone whose health is compromised should not consume undercooked seafood, meats and shellfish. 18% gratuity will be added to parties of 8 or more.*Contains ingredients that are raw or undercooked.Menu items are subject to change according to seasonality and availability. Heat & Eat Instructions refrigerate pot until ready to cook. open your pot, remove bagged seafood (shrimp, clams) and place in refrigerator pour in 2 cups of water or your favorite beer (2.5 cups for electric coil cooktops) replace lid (not too tight) place your pot on largest burner. Gas Burner – cook on medium high for 30 minutes Glass Cooktop – cook on high for 40 minutes. Electric Coil Cooktop – cook on medium for 35 minutes. remove seafood from packaging. carefully remove lid (with pot holders) and add the seafood. add additional seasoning. replace lid (not too tight) steam for an additional 7 to 9 minutes (if shrimp are not all pink, stir them and steam for an additional 2 to 4 minutes) remove pot from heat (be careful – it’s HOT), carefully remove lid. drain. serve on your favorite platter or spread out some paper, empty on the table (foil under the paper will protect your table!), gather round, and enjoy! Now offering LIC Steamers! Making dinner as easy as 1-2-3 with L-I-C! Perfect for a solo feast, or a big celebration! Order Online View Menu",
      "hash": "fad2de93950c",
      "downloadedAt": "2026-01-18T16:55:21.179Z",
      "trimmedAt": "2026-01-18T17:13:03.208Z",
      "sizeReduction": "95.2%"
    }
  ],
  "sizeReduction": "96.7%"
}