{
  "venueId": "ChIJe4JJXd5x_ogRTEppc599qog",
  "venueName": "The Wine Bar",
  "venueArea": "Mount Pleasant",
  "website": "http://www.thewinebarmtp.com/",
  "scrapedAt": "2026-01-18T17:04:28.486Z",
  "trimmedAt": "2026-01-18T17:11:21.770Z",
  "pages": [
    {
      "url": "https://www.thewinebarmtp.com/community/",
      "text": "Community We love supporting our Charleston community. Below you will find just a few of the local causes that we support! Belle Hall Elementary School Toys For Tots Charleston Make a Wish South Carolina Junior League of Charleston",
      "hash": "22a38acd7863",
      "downloadedAt": "2026-01-18T16:58:01.522Z",
      "trimmedAt": "2026-01-18T17:11:21.605Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "https://www.thewinebarmtp.com/charcuterie/",
      "text": "Charcuterie All selections served with toasted baguette, honey, Dijon mustard, olives, cornichons, and assorted fruit and nuts. Soft Cheeses St. Andre – Organic cow’s milk, buttery, creamyBrie – Triple cream, cow’s milkWild Mushroom Brie – Buttery, earthy, triple cream, exotic mushroomsGorgonzola – Creamed blue cheese Semi-Soft Cheeses Dill Havarti – Creamy cow’s milk, infused with dill &amp; herbsJalapeño Havarti – Havarti with a light jalapeño flavorButterkase – Silky, buttery, nuttyPort Derby – English derby cheese infused with Port wineRed Dragon – Soft Cheddar with British ale &amp; whole grain mustard Semi-Firm Cheeses Aged Asiago – Sweet &amp; salty with grassy notesRosemary Asiago – Infused with Rosemary, nutty notesChipotle Gouda – Smokey, light spice, full of flavor5 Year Aged Gouda – Flavorful, rich and creamySmoked Gouda – Creamy Gouda finished with a smokey flavor5 Year Reserve Cheddar – Sharp white cheddar, tangy, saltyHorseradish Cheddar – Aged white Cheddar, infused with tangy horseradishSmoked Cheddar – Beechwood smoked Wisconsin CheddarTruffled Goat – Flecked with black truffle shavings &amp; spicesBlueberry Goat – Creamy goat cheese covered in sweet &amp; tangy blueberriesManchego – Unpasteurized sheep’s milk, nutty notes Firm Cheeses Caramella – Rich with hints of Parmesan & caramelBlack Pepper Parmesan – Aged 24 months, black pepper crustedParmesan Grande Pedano – Classic, nutty notesTruffled Pecorino – Crumbly, earthy, truffle-infused Meats Italian Dry Salami – Traditional hard salami with garlic &amp; Italian herbsPinot Grigio Hard Salami – Dry-aged salami infused with Pinot GrigioSweet Soppressata – Spiced, hard Salami infused with Burgundy wineHot Soppressata* – Robust pork sausage with garlic, spices, peppercornsBlack Pepper Salami – Bold, black pepper encrustedCapicola – Italian cured pork shoulderPicante Coppa* – Capicola rubbed with hot Italian spicesAbruzzo Picante* – Abruzzo area, Old-World sausage, herbed &amp; spicedPepperoni – Traditional Italian favoriteChorizo* – Spanish spicy sausagePate – Truffle chicken mousseProsciutto – Italian cured pork, salty &amp; sweetSweet Tavern Ham – Sweet, Beechwood-smoked ham",
      "hash": "24d2bfc59297",
      "downloadedAt": "2026-01-18T16:57:55.948Z",
      "trimmedAt": "2026-01-18T17:11:21.615Z",
      "sizeReduction": "99.0%"
    },
    {
      "url": "https://www.thewinebarmtp.com/wine-list/",
      "text": "Wine List Bubbles Lunata Lambrusco – Sorbara, ItalyCoppola Prosecco – ItalyLos Monteros Cava Brut – Catalonia, SpainLos Monteros Cava Brut Rose – Catalonia, SpainVeuve Clicquot* – Champagne, France Rosés – Tuscany, ItalyKlinker Brick – Lodi, CAWhispering Angel – Provence, France Carpineto Dogajolo Rosato Bieler – Provence, France White Wines Pinot Grigio/Pinot Gris Banfi Pinot Grigio – Tuscany, ItalyBarnard Griffin Pinot Gris – Willamette Valley, ORSanta Margherita – Valdadige, Italy Sauvignon Blanc Overstone – Marlborough, NZJ. Lohr Flume Crossing – Monterey, CASancerre – Sancerre, France Chardonnay Noah River – Napa Valley, CAChahalem Unoaked – Willamette Valley, OR – Napa Valley, CAGehricke – Russian River, CA Cakebread Riesling Single Post – Mosel, Germany Blend Pine Ridge Chenin Blanc/Viognier – Napa Valley, CA Interesting Whites Left Coast White Pinot Noir – Willamette Valley, ORHughes Beaulieu Picpoul – Languedoc, FranceSepp Gruner Veltliner (Liter) – Weinland, AustriaA Veira do Mar Alberino – Galicia, SpainLa Perlina Moscato – Veneto, ItalyEncostas Do Lima Vinho Verde – Minho, Portugal Red Wines Pinot Noir Coppola Family – Paso Robles, CAMontinore Estate – Willamette Valley, ORFel by Cliff Lede – Anderson Valley, CA Merlot J. Lohr – Paso Robles, CASwanson – Napa Valley, CAPlumpjack – Napa Valley, CA Cabernet Sauvignon Coppola Family – Paso Robles, CABarnard Griffin – Columbia Valley, WAJ. Lohr Hilltop – Paso Robles, CAPrisoner 2018 (1/2) bottle – Napa Valley, CABlack Stallion – Napa Valley, CAAdaptation by Plumpjack – Napa Valley, CAPine Ridge – Napa Valley, CACakebread 2019 – Napa Valley, CASilver Oak 2019 – Alexander Valley, CACade 2019 – Howell Mountain, CAPACT by Faust 2019 – Coombsville, CAJustin Isoceles – Paso Robles, CAJ. Lohr Signature – Paso Robles, Plumpjack* – Oakville, Napa Valley, CASam Jasper by Black Stallion* 2019 – Napa Valley, CAOdette* – Stags Leap, Napa Valley, CA Blends Lapis Luna – Lodi, CATamarack Firehouse Red – Columbia Valley, CAJ. Lohr Pure Paso – Paso Robles, CAKrupp Brothers “The Doctor” 2019 – Stagecoach, Napa Valley, CA Spanish & South American Alta Vista Estate Malbec – Mendoza, ArgentinaTerrazas Grand Malbec – Mendoza, ArgentinaCoterro Rioja Crianza – Rioja, SpainMontes Purple Angel Carmenere 2019 – Colchagua Valley, Chile South African – – Simonsig Redhill Pinotage 2018 Stellenbosch, S. Africa Simonsig Cape Blend 2017 Stellenbosch, S. Africa French – Bordeaux, France – , France – Beaune, France – Loire Valley, France Château Blouin Bordeaux Chateau Lalande Saint-Julien 2016 Girande Louis Jadot Beaujolais Lieu-dit Beauregard Cab Franc Italian – Tuscany, Italy – Sicily, Italy – Chianti, Italy – La Morra, Italy – , Italy – La Morra, Italy – Veneto, Italy – , Italy Carpineto Dogajolo Super Tuscan Amira Nero D’Avola Sassoregale Sangiovese Batasiolo Langhe Nebbiolo 2019 Michele Chiarlo Cipressi Barbera 2021 Calamandrana Batasiolo Barolo 2019 Cesari Amarone 2019 Guidalberto Toscana 2022 Castagneto Carducci South African Simonsig Redhill Pinotage 2018 – Stellenbosch, S. AfricaSimonsig Cape Blend 2017 – Stellenbosch, S. Africa Interesting Reds – Lodi, CA – Monterey, CATerro d’Oro Petite Sirah – Amador County, CA Klinker Brick Old Vine Zin J. Lohr Wildflower Valdiguie Any wine to take home is 20% off! Take a look at our retail selections! *Some exclusions apply. Flights Rosé Flight Klinker Brick – Lodi, CA – Beiler Cuvee – Provance, France Carpineto Dogajolo Rosato Tuscany, Italy Cab Flight Barnard Griffin – Columbia Valley, WA – Paso Robles, CA – Napa J. Lohr Hilltop Black Stallion Valley, CA Italian Flight – Sicily, Italy – Chianti – Paglieta, Italy Amira Nero D’ Avola Sassoregale Sangiovese , Italy Carpineto Dogajolo Rosso French Flight – – – Louis Jadot Beaujolais Beaune, France Château Pilet Bordeaux Bordeaux, France Lieu-dit Beauregard Cab Franc Loire Valley, France Beverages Coke, Diet Coke, SpriteFiji Still WaterSaratoga Sparkling Water",
      "hash": "37df974dbfc6",
      "downloadedAt": "2026-01-18T16:57:53.186Z",
      "trimmedAt": "2026-01-18T17:11:21.634Z",
      "sizeReduction": "98.3%"
    },
    {
      "url": "http://www.thewinebarmtp.com/",
      "text": "The Wine Bar Open Monday – Saturday 4pm-12am Happy Hour Daily from 4-6pm Wine List Contact Us \" The Wine Bar Open Monday – Saturday 4pm-12am Happy Hour Daily from 4-6pm Wine List \" Welcome to The Wine Bar Welcome to The Wine Bar Happy Hour – Daily specials from 4-6pm 1/2 Off Wine Wednesday every week! Join us for a glass or choose a bottle to take home from our retail section. Choose from a small plate, charcuterie platter, or indulge in one of our decadent desserts. There is ALWAYS something happening at The Wine Bar! us for details. We would love to host your next event! Dates fill up quickly, so email For 2026, we are introducing our ! Join for exclusive access to Reserve Tier wines and monthly members-only events! Wine Club Find us in the Belle Hall Shopping Center: 664 Long Point Rd. Unit G Mount Pleasant, SC 29464 Discover The Wine Bar Check out what our favorite Charleston DJ, Brooke Ryan, had to say about The Wine Bar in her podcast about things she loves! Charleston friends, you can listen to Brooke on the Two Girls and a Guy show weekdays from 5am – 10am on Mix 95.9 · Two Girls and a Guy 2GG Podcast: 3 Things Brooke Loves 4 20 2023 Bites Bites CHARCUTERIE All selections are served with toasted baguette, honey, Dijon mustard, olives, cornichons, and assorted fruit and nuts. MEATS & CHEESES We offer a unique variety of 60 + artisan cheeses and charcuterie meats from around the world. HOUSE-MADE DIPS Choose from five different house-made dips, served with sliced, toasted baguette. Gluten free crackers also available. SMALL PLATES From Brie en Croute to Stuffed Mushrooms to Escargot, choose from seven different small plates to please every palate. FLATBREADS From our classic Quattro Formaggi to our decadent Prosciutto Flatbread, we’ve got something for vegetarians and meat-eaters alike. DESSERTS Try our delicious mousse flight or mini cheesecakes. Craving chocolate? We’ve got you covered with our fudge plate and homemade bark. Private Events Private Events We would love to host your next event: Holiday Parties Corporate Events Bridal Showers Birthdays We can host a special event for any occasion! us for details. Email Event Gallery The Wine Bar To Go! Hosting an event at your home? Let us do the work! We would love to provide a customized charcuterie tray and any other small plates that you require. We also have a large selection of wines for sale. Reviews of The Wine Bar “” Great place to enjoy both in or out of doors. ““ The presentation was beautiful and it was all delicious. We really enjoyed our visit to the Wine Bar and are looking forward to returning. – FinGin79 “” Loved it! “O“ ne of the most enjoyable meals we had this vacation long weekend! Service was friendly and relaxed. – JV G “” Don’t miss out!! ““ Cozy, relaxing and the food & wine are equally as amazing!! – Bridget B “Really Enjoyable!” “ Great atmosphere, extensive wine list, wonderful appetizers, charcuterie and cheeses and chocolates. “ – Jmsi1956 Read More Reviews Hours MON – SATURDAY 4:00pm – 12:00am Happy Hour 4-6 Daily Kitchen Open Until 11PM Nightly Great late-night option for food! CLOSED ON SUNDAY Drop Us A Line We would love to hear from you. Let us know if you have any questions! Contact Us Find Us",
      "hash": "4561af9d2ec8",
      "downloadedAt": "2026-01-18T16:57:50.888Z",
      "trimmedAt": "2026-01-18T17:11:21.660Z",
      "sizeReduction": "98.8%"
    },
    {
      "url": "https://www.thewinebarmtp.com/wine-club/",
      "text": "Join The Wine Club 2026 brings the launch of our monthly Wine Club! Details of each Reserve Tier are below. Space is filling up fast, so us today to join! email Reserve Member $45/month + tax includes: (2) Select “Reserve” bottles Member discount to purchase more All-inclusive, members-only party with a guest Last Sunday of each month Tasting of monthly bottles Food pairings 25% off any menu bottles*+ 15% off The Wine Bar merchandise+ Sign On Bonus: (1) Wine Bar Wine Key (1) Wine Bar Koozie (1) Wine Bar Drip Stop *Allocated bottles excluded* +Day of pick up only+ Grand Reserve Member $90/month + tax includes: (2) Select “Grand Reserve” bottles Member discount to purchase more All-inclusive, members-only party with a guest Last Sunday of each month Tasting of monthly bottles Food pairings 25% off any menu bottles*+ 15% off The Wine Bar merchandise+ Sign On Bonus: (1) Wine Bar Wine Key (1) Wine Bar Koozie (1) Wine Bar Drip Stop (2) Etched The Wine Bar Wine Glasses *Allocated bottles excluded* +Day of pick up only+ January Selections Reserve Tier Daou Sauvignon Blanc, Paso Robles, CA Ride Cabernet, Paso Robles, CA Grand Reserve Tier Cade Sauvignon Blanc, Napa Valley, CA Ride Cabernet, Napa Valley, CA 2026 Pickup Parties Reserve Members 1-3:30 Grand Reserve Members 4-6:30 1/25 2/22 3/29 4/26 5/31 6/28 7/26 8/30 9/27 10/25 11/29 12/27 Can’t make the party? No problem! Pick up your bottles any day the following month. Email us at with any questions! twbwineclub@gmail.com",
      "hash": "6f90d7487620",
      "downloadedAt": "2026-01-18T16:57:59.325Z",
      "trimmedAt": "2026-01-18T17:11:21.675Z",
      "sizeReduction": "99.4%"
    },
    {
      "url": "https://www.thewinebarmtp.com/contact-us/",
      "text": "Contact Us We love hearing from our customers. Whether you have questions, feedback, or would like a quote for an event, get in touch with us! Get In Touch Name Email Address Phone Number Subject Message = 3 + 4 Send Contact 664 Long Point Rd Unit G Mount Pleasant, SC 29464 Belle Hall Shopping Center Tel: (843) 849-5185",
      "hash": "823a24b2c746",
      "downloadedAt": "2026-01-18T16:58:03.079Z",
      "trimmedAt": "2026-01-18T17:11:21.688Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "http://www.thewinebarmtp.com/#",
      "text": "The Wine Bar Open Monday – Saturday 4pm-12am Happy Hour Daily from 4-6pm Wine List Contact Us \" The Wine Bar Open Monday – Saturday 4pm-12am Happy Hour Daily from 4-6pm Wine List \" Welcome to The Wine Bar Welcome to The Wine Bar Happy Hour – Daily specials from 4-6pm 1/2 Off Wine Wednesday every week! Join us for a glass or choose a bottle to take home from our retail section. Choose from a small plate, charcuterie platter, or indulge in one of our decadent desserts. There is ALWAYS something happening at The Wine Bar! us for details. We would love to host your next event! Dates fill up quickly, so email For 2026, we are introducing our ! Join for exclusive access to Reserve Tier wines and monthly members-only events! Wine Club Find us in the Belle Hall Shopping Center: 664 Long Point Rd. Unit G Mount Pleasant, SC 29464 Discover The Wine Bar Check out what our favorite Charleston DJ, Brooke Ryan, had to say about The Wine Bar in her podcast about things she loves! Charleston friends, you can listen to Brooke on the Two Girls and a Guy show weekdays from 5am – 10am on Mix 95.9 · Two Girls and a Guy 2GG Podcast: 3 Things Brooke Loves 4 20 2023 Bites Bites CHARCUTERIE All selections are served with toasted baguette, honey, Dijon mustard, olives, cornichons, and assorted fruit and nuts. MEATS & CHEESES We offer a unique variety of 60 + artisan cheeses and charcuterie meats from around the world. HOUSE-MADE DIPS Choose from five different house-made dips, served with sliced, toasted baguette. Gluten free crackers also available. SMALL PLATES From Brie en Croute to Stuffed Mushrooms to Escargot, choose from seven different small plates to please every palate. FLATBREADS From our classic Quattro Formaggi to our decadent Prosciutto Flatbread, we’ve got something for vegetarians and meat-eaters alike. DESSERTS Try our delicious mousse flight or mini cheesecakes. Craving chocolate? We’ve got you covered with our fudge plate and homemade bark. Private Events Private Events We would love to host your next event: Holiday Parties Corporate Events Bridal Showers Birthdays We can host a special event for any occasion! us for details. Email Event Gallery The Wine Bar To Go! Hosting an event at your home? Let us do the work! We would love to provide a customized charcuterie tray and any other small plates that you require. We also have a large selection of wines for sale. Reviews of The Wine Bar “” Great place to enjoy both in or out of doors. ““ The presentation was beautiful and it was all delicious. We really enjoyed our visit to the Wine Bar and are looking forward to returning. – FinGin79 “” Loved it! “O“ ne of the most enjoyable meals we had this vacation long weekend! Service was friendly and relaxed. – JV G “” Don’t miss out!! ““ Cozy, relaxing and the food & wine are equally as amazing!! – Bridget B “Really Enjoyable!” “ Great atmosphere, extensive wine list, wonderful appetizers, charcuterie and cheeses and chocolates. “ – Jmsi1956 Read More Reviews Hours MON – SATURDAY 4:00pm – 12:00am Happy Hour 4-6 Daily Kitchen Open Until 11PM Nightly Great late-night option for food! CLOSED ON SUNDAY Drop Us A Line We would love to hear from you. Let us know if you have any questions! Contact Us Find Us",
      "hash": "93a293693e66",
      "downloadedAt": "2026-01-18T16:57:54.871Z",
      "trimmedAt": "2026-01-18T17:11:21.714Z",
      "sizeReduction": "98.8%"
    },
    {
      "url": "https://www.thewinebarmtp.com/",
      "text": "The Wine Bar Open Monday – Saturday 4pm-12am Happy Hour Daily from 4-6pm Wine List Contact Us \" The Wine Bar Open Monday – Saturday 4pm-12am Happy Hour Daily from 4-6pm Wine List \" Welcome to The Wine Bar Welcome to The Wine Bar Happy Hour – Daily specials from 4-6pm 1/2 Off Wine Wednesday every week! Join us for a glass or choose a bottle to take home from our retail section. Choose from a small plate, charcuterie platter, or indulge in one of our decadent desserts. There is ALWAYS something happening at The Wine Bar! us for details. We would love to host your next event! Dates fill up quickly, so email For 2026, we are introducing our ! Join for exclusive access to Reserve Tier wines and monthly members-only events! Wine Club Find us in the Belle Hall Shopping Center: 664 Long Point Rd. Unit G Mount Pleasant, SC 29464 Discover The Wine Bar Check out what our favorite Charleston DJ, Brooke Ryan, had to say about The Wine Bar in her podcast about things she loves! Charleston friends, you can listen to Brooke on the Two Girls and a Guy show weekdays from 5am – 10am on Mix 95.9 · Two Girls and a Guy 2GG Podcast: 3 Things Brooke Loves 4 20 2023 Bites Bites CHARCUTERIE All selections are served with toasted baguette, honey, Dijon mustard, olives, cornichons, and assorted fruit and nuts. MEATS & CHEESES We offer a unique variety of 60 + artisan cheeses and charcuterie meats from around the world. HOUSE-MADE DIPS Choose from five different house-made dips, served with sliced, toasted baguette. Gluten free crackers also available. SMALL PLATES From Brie en Croute to Stuffed Mushrooms to Escargot, choose from seven different small plates to please every palate. FLATBREADS From our classic Quattro Formaggi to our decadent Prosciutto Flatbread, we’ve got something for vegetarians and meat-eaters alike. DESSERTS Try our delicious mousse flight or mini cheesecakes. Craving chocolate? We’ve got you covered with our fudge plate and homemade bark. Private Events Private Events We would love to host your next event: Holiday Parties Corporate Events Bridal Showers Birthdays We can host a special event for any occasion! us for details. Email Event Gallery The Wine Bar To Go! Hosting an event at your home? Let us do the work! We would love to provide a customized charcuterie tray and any other small plates that you require. We also have a large selection of wines for sale. Reviews of The Wine Bar “” Great place to enjoy both in or out of doors. ““ The presentation was beautiful and it was all delicious. We really enjoyed our visit to the Wine Bar and are looking forward to returning. – FinGin79 “” Loved it! “O“ ne of the most enjoyable meals we had this vacation long weekend! Service was friendly and relaxed. – JV G “” Don’t miss out!! ““ Cozy, relaxing and the food & wine are equally as amazing!! – Bridget B “Really Enjoyable!” “ Great atmosphere, extensive wine list, wonderful appetizers, charcuterie and cheeses and chocolates. “ – Jmsi1956 Read More Reviews Hours MON – SATURDAY 4:00pm – 12:00am Happy Hour 4-6 Daily Kitchen Open Until 11PM Nightly Great late-night option for food! CLOSED ON SUNDAY Drop Us A Line We would love to hear from you. Let us know if you have any questions! Contact Us Find Us",
      "hash": "c188e9322d09",
      "downloadedAt": "2026-01-18T16:57:52.058Z",
      "trimmedAt": "2026-01-18T17:11:21.740Z",
      "sizeReduction": "98.8%"
    },
    {
      "url": "https://www.thewinebarmtp.com/book-an-event/",
      "text": "Book An Event Please get in touch for a quote to host your next event! We would love to host your next event! Our space is perfect for birthday parties, company holiday parties, baby showers, happy hours, book launches, and more! Check out our event gallery . Dates fill up quickly, so email . us for details",
      "hash": "c72a8bd9a7aa",
      "downloadedAt": "2026-01-18T16:58:00.428Z",
      "trimmedAt": "2026-01-18T17:11:21.749Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "https://www.thewinebarmtp.com/craft-beers/",
      "text": "Craft Beers Pilsners RiverWalk Empire Pilsner – Charleston, SCMiller Lite – Milwaukee, WI Lagers – Charleston, SC – St. Louis, MO – Nava, Mexico Revelry Gold Standard Stella Artois Modelo Especial Wheat – Charleston, SC – Charleston, SC Westbrook White Thai Holy City Washout Wheat Ciders Doc’s Pear Cider – Warwick, NYOriginal Sin Black Widow – Lafayette, NYOriginal Sin Rose Cider – Lafayette, NY Stouts – Dublin, Ireland – Longmont, COMunkle Silver Shoes Stout – Charleston, SC Guinness (14.9oz) Left Hand Peanut Butter Milk Stout Porters Holy City Pluff Mud Porter – Charleston, SC – Durham, NC Fullsteam “Coffee is for Closers” Porter Ales Eagle Brewery Banana Bread Brown Ale- United KingdomRevelry Marsh Hen Cream Ale – Charleston, SCAvery Ellie’s Brown Ale – Boulder, CO Blond Ales Duvel Belgian Strong Blond – Breendonk-Puurs, Belgium – Charleston, SC – Charleston, SC Revelry Lazy Lover Edmund’s Oast Something Cold (16oz) Sours Edmund’s Oast Rotating Sour – Charleston, SCRevelry Drive by Fruiting – Charleston, SCAnderson Valley Framboise Rose Gose – Booneville, CA IPAs Edmunds Oast Bound By Time (16 oz) – Charleston, SCRevelry Never Sunny – Charleston, SC– Athens, GA Creature Comfort Tropicalia Non-Alcoholic – San Diego, CA – Dublin, Ireland Athletic Brewing Co. “Run Wild” IPA Guinness 0 All beer to take home is 20% off!",
      "hash": "cbf5df442cfb",
      "downloadedAt": "2026-01-18T16:57:58.204Z",
      "trimmedAt": "2026-01-18T17:11:21.761Z",
      "sizeReduction": "99.4%"
    },
    {
      "url": "https://www.thewinebarmtp.com/bites/",
      "text": "Bites Small Plates Fried Mozzarella – 3 large, hand-breaded mozzarella sticks, with marinara or ranch Goat Cheese & Peppers – Warm goat cheese, roasted red peppers and olives draped over caramelized onions, served with toasted baguette* Escargot – Helix snails baked with garlic-shallot butter, with toasted baguette* Brie en Croute – Triple-cream Brie wrapped in puff pastry, toasted, served with assorted jams, honey almonds, toasted baguette* Garlic Cheese Bread – Mozzarella cheese stuffed baguette, brushed with garlic butter Stuffed Mushrooms – mushrooms stuffed with herbed goat & triple-cream cheeses, topped with Port Derby cheese and baked French Onion Soup – house-made classic soup Flatbreads Truffled Woodsman – two truffled cheeses, sliced mushrooms, balsamic drizzle Quattro Formaggi – mozzarella, aged asiago, port derby cheeses, roasted garlic and olive oil base, topped with Parmesan cheese and balsamic drizzle Traditional Pepperoni – premium pepperoni, mozzarella, Parmesan, marinara base The Trilogy – pepperoni, tavern ham, bacon, fresh mozzarella on a marinara base Prosciutto Flatbread – Fig jam base, topped with sliced Prosciutto, caramelized onions, Gruyere, and goat cheeses House-Made Dips (Served with toasted baguette)* Olive Tapenade – traditional Italian spread Pimento Cheese – traditional spread with minced jalapeños, served with Ritz crackers Spinach Artichoke Dip – topped with Parmesan and baked, house-made Buffalo Chicken Dip – roasted chicken blended with cheeses, ranch, and hot sauce Oil & Balsamic Vinegar Plate – with black pepper and Parmesan cheese Desserts Mousse Flight – trio of homemade mousse with fresh whipped cream Fudge Plate – two chocolate & two white chocolate (walnuts & cranberries) Homemade – a la carte. Find our selections Bark here Mini Cheesecake – homemade with biscotti crust & fresh whipped cream * Gluten-free crackers available upon request at an additional charge",
      "hash": "d6532e2ca67d",
      "downloadedAt": "2026-01-18T16:57:57.014Z",
      "trimmedAt": "2026-01-18T17:11:21.770Z",
      "sizeReduction": "99.1%"
    }
  ],
  "sizeReduction": "99.2%"
}