{
  "venueId": "ChIJOSEYk9Fj_ogR6ePwYQ7294Y",
  "venueName": "Holiday Inn Express & Suites Charleston - Northwoods by IHG",
  "venueArea": "North Charleston",
  "website": "https://www.ihg.com/holidayinnexpress/hotels/us/en/north-charleston/chsnb/hoteldetail?cm_mmc=GoogleMaps-_-EX-_-US-_-CHSNB",
  "scrapedAt": "2026-01-18T17:04:25.729Z",
  "trimmedAt": "2026-01-18T17:07:15.199Z",
  "pages": [
    {
      "url": "https://www.ihg.com/holidayinnexpress/content/us/en/deals/hotel-offers",
      "text": "Skip To main content Book now Offers Holiday Inn Resort Samui Bophut Beach Pay for your stay with Points + Cash Stretch your points further when you book with Points + Cash. Use your existing points and purchase the remaining points required with cash to redeem your Reward Night. Learn more Buy points and get there faster With two ways to buy points, you can reach what you want faster. Buy points to stock up for future travel or add Elite Qualifying points to a booking. Learn More Find A Perfect Gift From gift cards to unique travel destinations, our new rewards catalog is full of ideas and experiences for you to enjoy. Shop Our Catalog Great rates are just a click away With IHG One Rewards, you can get access to our exclusive Member Rate. Book now Buy, gift, or transfer points Enjoy endless possibilities with Points Purchase. Buy points InterContinental ANA Manza Beach Resort Treat yourself to a Reward Night Redeem your IHG One Rewards points for a Reward Night at our 6,600+ hotels and resorts around the world, starting at just 10,000 points. Book now Rewards are just a tap away Download the IHG One Rewards app today. Enjoy fast booking and Rewards on the go – however and wherever you travel. Learn More Travel like you mean it Explore our collections to find the perfect spot for your next vacation, meeting or bucket-list escape. Discover more with our 20 brands and 6,600+ destinations. Explore Now Stay at IHG and earn towards flights IHG One Rewards Members can earn miles for their stays Learn More Earn and redeem points with our partners Maximize your membership with great travel deals on car rentals, restaurants, activities and more. View all partner offers It's better to be a member EARN POINTS TO USE FOR REWARD NIGHTS NO BLACKOUT DATES ACCESS TO MEMBER RATES & OFFERS FREE WIFI LATE CHECKOUT PLUS EVEN MORE PERKS WHEN YOU BECOME AN ELITE MEMBER JOIN FOR FREE Already a member? . Sign in",
      "hash": "99c3a0450348",
      "downloadedAt": "2026-01-18T16:59:25.245Z",
      "trimmedAt": "2026-01-18T17:07:15.098Z",
      "sizeReduction": "99.0%"
    },
    {
      "url": "https://www.ihg.com/holidayinnexpress/hotels/us/en/north-charleston/chsnb/hoteldetail?cm_mmc=GoogleMaps-_-EX-_-US-_-CHSNB",
      "text": "Skip To main content View prices View all Holiday Inn Express & Suites Charleston - Northwoods Important Announcements Explore Charleston, SC from our modern hotel Welcome to the Holiday Inn Express & Suites® Located minutes outside of historic Charleston, SC our hotel is situated off I-26 within five miles of the Charleston International Airport, Boeing, Bosch, Volvo and in the center of the state's largest retail district. Within walking distance there are over a dozen restaurants and the Northwoods Mall. Our contemporary hotel provides a name that you can trust when visiting the Lowcountry. Our Charleston - Ashley Phosphate hotel promises to exceed your expectations. We're ideally located so you and your family can enjoy the many nearby attractions including Carolina Ice Palace, Cypress Gardens, Patriots Point and plantations. If the beaches have drawn you to the area, you'll be glad to know that Isle of Palms is 16-miles and Folly Beach is just 20-miles away. Holiday Inn Express® Our hotel in North Charleston is near the Convention Center, the Air Force Base, Naval Weapons Station, Palmetto Commerce, Bushy Park and all major industry. Our hotel is an ideal place to stay for business travelers. Complimentary high-speed Internet access, a 24-hour Business Center, and a large meeting room make conducting business easy when staying with us. Unlike Other Charleston, SC hotels we offer an array of complimentary amenities to help make your stay fabulous including a hot breakfast, Manager's Reception, Fitness Center, and outdoor swimming pool that is open seasonally. See you soon! Kids eat free Free breakfast Limited housekeeping Fitness center On-site parking Pool Smoke-free hotel Wi-fi Cashless hotel Kids eat free Free breakfast Limited housekeeping Fitness center On-site parking Pool Smoke-free hotel Wi-fi Cashless hotel Explore all amenities Accommodations Standard Rooms Book Now Suite Book Now Standard Rooms Book Now Suite Book Now Reservations: Front desk: 1-843-5531600 Email: info@hiexpressnorthwoods.com 7670 Northwoods Blvd. North Charleston, South Carolina 29406 United States Parking and transportation details : 4:00 PM Check-in : 12:00 PM Check-out : 18 Minimum check-in age The highlights Dining Nearby Costa Bean-to-Cup Coffee - 24 hours a day Full Hot Breakfast Included with your stay Manager's Reception Tuesday and Wednesday Dining Nearby Plenty of dining options within a 5-minute walk out our front door. Amici's Italian Bistro, locally family owned and operated, Red Crab Juicy Seafood, Carraba's, Bahama Breeze, Olive Garden, Outback, Hooters, Waffle House, Wendy's and Taco Bell. Within a short drive you will find Cracker Barrel, Moe's Southwest Grille, Naan, Thai Elephant & more Costa Bean-to-Cup Coffee - 24 hours a day Savor the taste of freshly brewed coffee around the clock with our new bean-to-cup coffee machine, available 24/7 in the lobby. Elevate your stay with us and relish every sip of our exceptional coffee! Full Hot Breakfast Included with your stay We serve our full hot breakfast daily from 630am to 930am. Hot items include eggs, turkey and pork sausage, biscuits and gravy, our warm and World Famous Cinnamon Rolls, made to order pancakes, hot and cold cereals, yogurts, fruit, bread, muffins, bagels, coffee, teas, juices, milk and more. Great way to start your day! Manager's Reception Tuesday and Wednesday We host an evening reception Tuesday and Wednesday from 530pm to 7pm. Complimentary local craft beer, wines, sodas and snacks. Come relax, unwind and meet our management team. Explore Holiday Inn Express & Suites Charleston - Northwoods Sleep well, rest easy View rooms Elevate your experience View amenities See it to believe it View photos Sleep well, rest easy View rooms Elevate your experience View amenities See it to believe it View photos Hotel packages available Prices shown reflect an average per night stay from View all packages Offers View All Offers FAQs for Holiday Inn Express & Suites Charleston - Northwoods Does Holiday Inn Express & Suites Charleston - Northwoods have a pool? Yes, Holiday Inn Express & Suites Charleston - Northwoods has an outdoor pool. How much is parking at Holiday Inn Express & Suites Charleston - Northwoods? Complimentary parking is available at Holiday Inn Express & Suites Charleston - Northwoods for hotel guests. Can I bring my pet to Holiday Inn Express & Suites Charleston - Northwoods? No, pets are not allowed at Holiday Inn Express & Suites Charleston - Northwoods. Can I cancel my booking at Holiday Inn Express & Suites Charleston - Northwoods for a full refund? Always check the hotel's cancellation policy before booking a rate. Room cancellation is subject to rate booked at time of reservation and cancellation policy varies by rate. Does Holiday Inn Express & Suites Charleston - Northwoods have a restaurant on site? No, there is no on site restaurant at Holiday Inn Express & Suites Charleston - Northwoods. Is there free breakfast available at Holiday Inn Express & Suites Charleston - Northwoods? Breakfast is free with your stay at the Holiday Inn Express & Suites Charleston - Northwoods. When is breakfast at Holiday Inn Express & Suites Charleston - Northwoods? Breakfast at Holiday Inn Express & Suites Charleston - Northwoods is available from 6:30 AM to 9:30 AM.On weekends, breakfast is available from 6:30 AM to 9:30 AM. Is there a complimentary shuttle available at Holiday Inn Express & Suites Charleston - Northwoods? No, there is not a complimentary local area shuttle available at Holiday Inn Express & Suites Charleston - Northwoods. What are the check-in and check-out times for Holiday Inn Express & Suites Charleston - Northwoods? Check-in at Holiday Inn Express & Suites Charleston - Northwoods is from 4:00 PM, and check-out time is 12:00 PM. Contact the hotel directly for options available for early check-in or late check-out. Does Holiday Inn Express & Suites Charleston - Northwoods offer free Wi-Fi? Yes, the Holiday Inn Express & Suites Charleston - Northwoods offers free WiFi! Read more FAQs View in other languages English English (GB) 日本語 Deutsch 繁體中文 Español 中文 Français Español (España) Italiano Nederlands Русский Português 한국어 ไทย العربية Português (BR) Bahasa Indonesia Türkçe",
      "hash": "ade890c82f37",
      "downloadedAt": "2026-01-18T16:59:25.079Z",
      "trimmedAt": "2026-01-18T17:07:15.199Z",
      "sizeReduction": "97.4%"
    }
  ],
  "sizeReduction": "98.1%"
}