{
  "venueId": "ChIJx2URNgt5_ogR-MpZ88Jz8og",
  "venueName": "Bojangles",
  "venueArea": "James Island",
  "website": "https://locations.bojangles.com/sc/charleston/740-folly-road.html",
  "scrapedAt": "2026-01-19T02:19:38.645Z",
  "trimmedAt": "2026-01-19T02:27:46.041Z",
  "pages": [
    {
      "url": "https://locations.bojangles.com/index.html",
      "text": "[Page Title: All Bojangles Locations | Famous Chicken ‘n Biscuits]\n\nBojangles' Famous Chicken 'n Biscuits Locations\n\nWhen autocomplete results are available, use up and down arrows to review and enter to select.\nLocate me Geolocate. View Map toggle map Alabama Arizona Arkansas Colorado Florida Georgia Honduras Illinois Kentucky Louisiana Maryland Michigan Mississippi Nevada New Jersey New York North Carolina Ohio Oklahoma Pennsylvania South Carolina Tennessee Texas Virginia West Virginia",
      "hash": "ab9cbf576138",
      "downloadedAt": "2026-01-19T02:09:59.324Z",
      "trimmedAt": "2026-01-19T02:27:46.027Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "https://locations.bojangles.com/sc/charleston/740-folly-road.html",
      "text": "[Page Title: Bojangles at 740 Folly Road in Charleston, SC | Bojangles]\n\nBojangles Famous Chicken ‘n Biscuits\n\nCharleston\n740 Folly Road , Charleston , SC 29412 Get Directions Call Now Begin Your Order Delivery Options \nFeatured Menu Items\n\nBO'S CHICKEN SANDWICH\n\nOrder a Bo's Chicken Sandwich today and pair it with our Legendary Iced Tea!\n\nTHE BEST OF BOJANGLES\n\nThe menu features the best of Bojangles including our Legendary Iced Tea.\nSEE FULL MENU ORDER NOW \nGet Bojangles Catered!\n\nCelebrate any occasion with Bojangles Legendary Sweet Tea, made-from-scratch biscuits, and enough chicken to feed all your hungry guests!\nOrder Now \nPOSITIONS AVAILABLE!\n\nLooking for a job or a career with this location, which is independently owned and operated by a Bojangles' Franchisee? Click here to apply on their application webpage!\nJoin Now \nDOWNLOAD OUR APP\n\nWhen cravings call, make sure Bo’s on your phone.\nDownload the app for the Southern flavors you love, right when and\nwhere you want them. Because ordering chicken ‘n biscuits shouldn’t\never be a bother. It’s never been easier to make it Bo time.\nLearn More \nAbout Bojangles Charleston\n\nBojangles’ began in 1977 and saw an opportunity to develop a quick-service restaurant chain based on three attributes: a distinctive flavor profile; wholesome, high-quality products made from scratch; and a fun, festive restaurant design with fast, friendly service. Bojangles’ of Charleston’s core menu is: distinctive, flavorful chicken made with a special blend of seasonings and served with hot, fresh buttermilk biscuits and one-of-a-kind fixin’s like Bojangles’ Dirty Rice and Bojangles’ Cajun Pintos. Bojangles’ light, buttery, made-from-scratch biscuits serve as the basis for the best breakfast in the industry. From biscuit sandwiches filled with mouthwatering items like spicy chicken filets, seasoned sausage or steak, country ham, eggs and cheese, to sweet biscuits like our Bo-Berry Biscuits, no one does breakfast like Bojangles’ of Charleston. That’s why Bojangles’ serves breakfast all day, every day.\n\nFrequently Asked Questions\n\nDoes Bojangles 740 Folly Road have Online Ordering available?\n\nYou bet. Order ahead at Bojangles.com or in our app and get all your chicken, biscuits and fixins whenever you’re ready. Bojangles 740 Folly Road also offers curbside pickup and delivery, with additional delivery options through our local partners, DoorDash, Uber Eats, Postmates, Grub Hub and Google Ordering.\n\nCan I purchase a Gift Card at Bojangles 740 Folly Road?\n\nAlways. Just ask to purchase a gift card from one of our friendly team members next time you swing by Bojangles 740 Folly Road.\nShow More",
      "hash": "c251592c225e",
      "downloadedAt": "2026-01-19T02:09:59.102Z",
      "trimmedAt": "2026-01-19T02:27:46.041Z",
      "sizeReduction": "96.7%"
    }
  ],
  "sizeReduction": "99.3%"
}