{
  "venueId": "ChIJ0cFndVp6_ogRX5uDTThdD9I",
  "venueName": "Moe's Crosstown Tavern",
  "venueArea": "West Ashley",
  "website": "https://moescrosstowntavern.com/",
  "scrapedAt": "2026-01-19T02:19:30.543Z",
  "trimmedAt": "2026-01-19T02:19:52.053Z",
  "pages": [
    {
      "url": "https://moescrosstowntavern.com/our-menu/",
      "text": "[Page Title: Our Menu - Moe's Crosstown Tavern]\n\nOur Menu\nGift Cards Download Our Menu Here Beer List Check Out Our Daily Specials on Facebook Order Online ▲",
      "hash": "19f65c18cb3c",
      "downloadedAt": "2026-01-19T02:17:25.139Z",
      "trimmedAt": "2026-01-19T02:19:52.043Z",
      "sizeReduction": "99.7%"
    },
    {
      "url": "https://moescrosstowntavern.com/",
      "text": "[Page Title: Moe's Crosstown Tavern - Sports Bar and Grill Charleston, SC]\n\nHaving a Good Time on the Bad Side of Town\nOrder Pickup now! Call To Order Pickup \nCollege Football 🏈, Bowl Games 🏆, and the National Championship — Watch Every Game Live. Don’t miss a single play. Grab your seat today and enjoy all the action!\n\nSports Bar in Charleston, SC\n\nMoe’s Crosstown Tavern is a vintage pub, located in downtown Charleston near Hampton Park. We’re the local destination for excellent food, great drinks, and a welcoming atmosphere. Stop by one of the best restaurants around and have one of our delicious burgers and a tasty craft beer while you kick back and catch a ballgame!\nOur Menu Order Online \nJoin us for your favorite team’s game nights!\n\nThe Best Sports Bar and Grill Around!\n\nYou don’t have to wait for the weekend to head down to the pub—Moe’s Crosstown Tavern is open 7 days a week, serving up , and an all-around great time. Swing by and catch a ballgame on one of our big-screen TVs, rack up a game of pool with a few friends or spend your time eating your way through our amazing menu. We welcome regulars, locals and visitors to the city alike, and aim to create an atmosphere where you’ll love to spend time. Stop in and ask us about food and drink specials, and take advantage of our great happy hour deals!\n If you’re looking for a regular sports bar and grill in Charleston, SC, get ready to call Moe’s Crosstown Tavern home. We show just about every professional sport that’s televised and welcome fans from every team. With year-round sports on our screens, you won’t have to go far to find the game you want to watch. And, with some of the best appetizers and a huge selection of drinks, we’ll help you keep the party going whether your team is winning or losing. Stop in today, pull up a stool and see for yourself why we’re continually voted one of the best bars and pubs in the city!\ndelicious food great drinks \nBest Neighborhood Bar” 25+ years in a row and “Best Pub Food” 9 years in a row by the Charleston City Paper!\n\nWe welcome all sports fans with Fox soccer, NFL Sunday Ticket, NHL Center Ice, MLB packages, and your\n favorite college football games—all in HD!\n\nCome in and enjoy any of our numerous craft beers on tap. We also have happy hour drink specials from 4-7pm Monday through Friday.\n\nWe’ve been a local watering hole in the Charleston area for 25+ years, welcoming locals and visitors to the city alike!\n\nThe best in local bars for happy hour for residents of the following areas:\n\nCharleston, SC\n\nNorth Charleston, SC\n\nMt Pleasant, SC\n\nJames Island, SC\n\nDrum Island, SC\n\nSullivan’s Island, SC\n\nCharleston County, SC\n\nPull Up a Stool\n\nStop on by our local restaurant for a burger and a beer, and catch a ballgame while you’re with us! Moe’s Crosstown Pub welcomes you—we’ll keep a seat open for you. Contact us today for information.\nContact us",
      "hash": "4e8f8ce93624",
      "downloadedAt": "2026-01-19T02:17:24.795Z",
      "trimmedAt": "2026-01-19T02:19:52.049Z",
      "sizeReduction": "95.3%"
    },
    {
      "url": "https://moescrosstowntavern.com/drink/",
      "text": "[Page Title: Happy Hour in Charleston, SC - Moe's Crosstown Tavern]\n\nHappy Hour in Charleston, SC\n\nWhen you’re looking for a local watering hole, the number one expectation is a place that has a wide selection of drinks—along with all of the classic favorites. goes above and beyond to offer you a superior selection of drink options, whether you prefer an ice-cold beer or you need a stiff drink.\nMoe’s Crosstown Tavern Order Online \nTap beer selection\n\nIf you like your beers fresh off the tap, we’re ready to serve you up a cold one. Our draught beers include classic staples like Bud Light and PBR, as well as Guinness and Yuengling. We’ve even got some craft brew favorites like Lagunitas IPA and Fat Tire on tap! And, of course, we’re home to 6 rotating taps, ensuring something new and exciting is being tapped on our line each week.\n\nBloodies and mimosas\n\nNumerous bars and pubs in Charleston, Drum Island, Mt Pleasant, James Island, and North Charleston, SC serve up bloodied during their happy hour, but few are as delicious as the creations at Moe’s Crosstown Tavern! From our classic bloody and our Moe Hot Bloody Mary for those who crave a spicier option, we’ve got a few recipes that are bound to please.If you like your early-day liquor a little lighter, why not try one of our tasty mimosas? We have several kinds to choose from, from our glass or carafe options!",
      "hash": "dd52eae2232a",
      "downloadedAt": "2026-01-19T02:17:26.037Z",
      "trimmedAt": "2026-01-19T02:19:52.053Z",
      "sizeReduction": "97.6%"
    }
  ],
  "sizeReduction": "97.5%"
}