{
  "venueId": "ChIJY7-7lnJ6_ogR3eAkND6sK1k",
  "venueName": "Zero George",
  "venueArea": "Downtown Charleston",
  "website": "http://www.zerogeorge.com/",
  "scrapedAt": "2026-01-18T17:04:27.776Z",
  "trimmedAt": "2026-01-18T17:11:06.489Z",
  "pages": [
    {
      "url": "http://www.zerogeorge.com/",
      "text": "[Page Title: Vimeo] Vimeo Skip to content This website uses cookies. If that's okay with you, keep on browsing, or learn more about our . Privacy Policy Close Cookie Disclosure Notice Pause Background Video Charleston's charms, at your doorstep A sense of wander and wonder go hand in hand at Zero George, your sanctuary for exploring Charleston’s endless delights. Start Exploring Welcome to Zero George Where historic excellence meets sophisticated chic Fully Charleston, yet out of this world Zero George Hotel Zero George’s immaculately restored circa 1804 buildings and private courtyard are the ideal home-away-from-home while exploring Charleston’s allure. We aim to delight, spoil, and surprise as we serve up Old World authenticity with contemporary, upscale hospitality. Learn More 01 02 03 04 05 06 07 In the news Recent Press We are honored and proud to receive awards, recognition, and accolades from media outlets worldwide. We are pleased to share these achievements with you. View press page. November 12, 2025Food & Drink | A Taste of Excellence: MICHELIN Guide Announces Inaugural American South Selection The Restaurant at Zero George has been selected in the 2025 inaugural MICHELIN- Opens in a new tab Guide American South We are delighted to announce that The Restaurant at Zero George has been selected in the inaugural MICHELIN Guide American South. This recognition honors the skill,… Learn More December 13, 2024Press & Awards | Condé Nast Traveler: 2025 Gold List To the naked eye, the five beautifully restored 1804 residences and carriage homes at the corner of George Street and East Bay constitute just another pretty block in Charleston: warm brick, statuesque façades, breezy column-studded verandas, and flickering lanterns. But veteran hospitality duo Dean Porter Andrews and Lynn Easton knew better ... Learn More July 24, 2024Accommodations | Vogue’s Guide to Charleston, South Carolina: Where to Stay, Eat, and Shop Vogue featured two of EPG’s properties, Costa and Zero George Hotel, in a Charleston travel guide to experience the best of this quintessential Southern town. Originally built in 1804, the boutique hotel Zero George consists of a series of restored historic residences.... Learn More Refined dining for the discerning epicurean The Restaurant at Zero George Zero George will change the way you think about hotel restaurants. This tucked-away gem serves up some of Charleston’s biggest flavors and most dazzling dishes. Chef Vinson Petrillo is a master with seasonal local ingredients, elevating dining to a sublime art. Learn More 01 02 03 04 05 Give the Gift of Zero An epic treat for the discerning traveler or epicurean soul – surprise and delight with a gift card from Zero George. From booking a weekend getaway to dinner at The Restaurant at Zero George, or cocktails and caviar at The Caviar Bar, our gift cards can be used for all hotel, restaurant, and bar experiences. Purchase Your Gift Opens in a new window. Check Your Gift Card Balance Follow us on Instagram @zerogeorgest - Link opens in a new tab Let's get social.",
      "hash": "daa53f5d88db",
      "downloadedAt": "2026-01-18T16:55:10.766Z",
      "trimmedAt": "2026-01-18T17:11:06.489Z",
      "sizeReduction": "98.5%"
    }
  ],
  "sizeReduction": "98.5%"
}