{
  "venueId": "ChIJPcUPNxR8_ogRZzs-oDVBtu4",
  "venueName": "Holiday Inn Express Charleston US Hwy 17 & I-526 by IHG",
  "venueArea": "West Ashley",
  "website": "https://www.ihg.com/holidayinnexpress/hotels/us/en/charleston/chssh/hoteldetail?cm_mmc=GoogleMaps-_-EX-_-US-_-CHSSH",
  "scrapedAt": "2026-01-18T17:04:25.926Z",
  "trimmedAt": "2026-01-18T17:07:17.355Z",
  "pages": [
    {
      "url": "https://www.ihg.com/holidayinnexpress/hotels/us/en/charleston/chssh/hoteldetail/hotel-offers",
      "text": "Skip To main content View prices Holiday Inn Express Charleston US Hwy 17 & I-526 Offers Save on your hotel stay with these exclusive Holiday Inn Express Charleston US Hwy 17 & I-526 deals. Hotel packages available Prices shown reflect an average per night stay from VIEW ALL PACKAGES View in other languages English English (GB) 日本語 Deutsch 繁體中文 Español 中文 Français Español (España) Italiano Nederlands Русский Português 한국어 ไทย العربية Português (BR) Bahasa Indonesia Türkçe",
      "hash": "78f2a4cd8e8d",
      "downloadedAt": "2026-01-18T17:02:39.247Z",
      "trimmedAt": "2026-01-18T17:07:17.207Z",
      "sizeReduction": "99.6%"
    },
    {
      "url": "https://www.ihg.com/holidayinnexpress/content/us/en/deals/hotel-offers",
      "text": "Skip To main content Book now Offers Holiday Inn Resort Samui Bophut Beach Pay for your stay with Points + Cash Stretch your points further when you book with Points + Cash. Use your existing points and purchase the remaining points required with cash to redeem your Reward Night. Learn more Buy points and get there faster With two ways to buy points, you can reach what you want faster. Buy points to stock up for future travel or add Elite Qualifying points to a booking. Learn More Find A Perfect Gift From gift cards to unique travel destinations, our new rewards catalog is full of ideas and experiences for you to enjoy. Shop Our Catalog Great rates are just a click away With IHG One Rewards, you can get access to our exclusive Member Rate. Book now Buy, gift, or transfer points Enjoy endless possibilities with Points Purchase. Buy points InterContinental ANA Manza Beach Resort Treat yourself to a Reward Night Redeem your IHG One Rewards points for a Reward Night at our 6,600+ hotels and resorts around the world, starting at just 10,000 points. Book now Rewards are just a tap away Download the IHG One Rewards app today. Enjoy fast booking and Rewards on the go – however and wherever you travel. Learn More Travel like you mean it Explore our collections to find the perfect spot for your next vacation, meeting or bucket-list escape. Discover more with our 20 brands and 6,600+ destinations. Explore Now Stay at IHG and earn towards flights IHG One Rewards Members can earn miles for their stays Learn More Earn and redeem points with our partners Maximize your membership with great travel deals on car rentals, restaurants, activities and more. View all partner offers It's better to be a member EARN POINTS TO USE FOR REWARD NIGHTS NO BLACKOUT DATES ACCESS TO MEMBER RATES & OFFERS FREE WIFI LATE CHECKOUT PLUS EVEN MORE PERKS WHEN YOU BECOME AN ELITE MEMBER JOIN FOR FREE Already a member? . Sign in",
      "hash": "99c3a0450348",
      "downloadedAt": "2026-01-18T17:02:38.618Z",
      "trimmedAt": "2026-01-18T17:07:17.262Z",
      "sizeReduction": "99.0%"
    },
    {
      "url": "https://www.ihg.com/holidayinnexpress/hotels/us/en/charleston/chssh/hoteldetail?cm_mmc=GoogleMaps-_-EX-_-US-_-CHSSH",
      "text": "Skip To main content View prices View all Holiday Inn Express Charleston US Hwy 17 & I-526 Important Announcements Located minutes from Historic Downton Charleston as well as area beaches. Nestled just minutes from the cobblestone streets of historic downtown Charleston and the sun-kissed area beaches, Holiday Inn Express is your perfect launchpad for Lowcountry adventures. Begin your day with a hearty hot breakfast—fluffy eggs, sizzling sausage, golden waffles, and more—served fresh each morning to fuel your explorations. Our Costa Express Coffee Bar keeps you energized 24/7 with rich, aromatic blends at your fingertips. Stroll the iconic Battery, browse King Street’s boutiques and acclaimed restaurants, or venture to Patriots Point for a taste of Charleston’s maritime legacy. Whether you're here for business with Boeing or leisure at the South Carolina Aquarium, our inviting outdoor pool and well-equipped fitness center offer the perfect unwind. With comfort, convenience, and Southern hospitality at every turn, your Charleston story starts here. Free breakfast Limited housekeeping Fitness center On-site parking Pool Smoke-free hotel Wi-fi Free breakfast Limited housekeeping Fitness center On-site parking Pool Smoke-free hotel Wi-fi Explore all amenities Accommodations One Bedroom Suite Book Now Standard Rooms Book Now One Bedroom Suite Book Now Standard Rooms Book Now Reservations: Front desk: 1-843-4028300 Email: hiecgm@imagehotels.net 1943 Savannah Highway Charleston, South Carolina 29407 United States Parking and transportation details : 3:00 PM Check-in : 11:00 AM Check-out : 21 Minimum check-in age The highlights Strategic location for contractors & project work Close Proximity to Healthcare Facilities Close to Downtown Charleston and Area Beaches Hot Breakfast Now Available! Holiday Festival of Lights Strategic location for contractors & project work Our strategic location is a significant advantage for business travelers, particularly project managers and contractors. The hotel offers convenient access to a variety of job sites across the Charleston area, minimizing commute times, leading to smoother project logistics and better overall time management for a busy project manager. Call +1-912-2157709 Call +1-912-2157709 Close Proximity to Healthcare Facilities Our hotel is less than 3 miles to Bon Secours St. Francis Hospital and close to many other medical facilities. Special medical rates available, please call to inquire. Call +1-843-402-8300 Call +1-843-402-8300 Close to Downtown Charleston and Area Beaches Ideally located in West Ashley, you are only a few minutes away from Downtown Charleston, area beaches and other attractions. Hot Breakfast Now Available! Enjoy a Hot Breakfast or a Grab & Go Breakfast at our newly renovated breakfast bar, including eggs, bacon, sausage, biscuits & gravy, fruit cups, yogurt, pastries, cereal, oatmeal, milk, and juice. Call +1-843-4028300 Call +1-843-4028300 Holiday Festival of Lights A favorite holiday, the James Island Festival of Lights, will be happening from November to December 2021. This is a remarkable event that features almost two million sparkling lights. This is considered the most popular event in Charleston, open for nightly admission. Learn more Explore Holiday Inn Express Charleston US Hwy 17 & I-526 Sleep well, rest easy View rooms Elevate your experience View amenities See it to believe it View photos Sleep well, rest easy View rooms Elevate your experience View amenities See it to believe it View photos Hotel packages available Prices shown reflect an average per night stay from View all packages Offers View All Offers FAQs for Holiday Inn Express Charleston US Hwy 17 & I-526 Does Holiday Inn Express Charleston US Hwy 17 & I-526 have a pool? Yes, Holiday Inn Express Charleston US Hwy 17 & I-526 has an outdoor pool. How much is parking at Holiday Inn Express Charleston US Hwy 17 & I-526? Complimentary parking is available at Holiday Inn Express Charleston US Hwy 17 & I-526 for hotel guests. Can I bring my pet to Holiday Inn Express Charleston US Hwy 17 & I-526? No, pets are not allowed at Holiday Inn Express Charleston US Hwy 17 & I-526. Can I cancel my booking at Holiday Inn Express Charleston US Hwy 17 & I-526 for a full refund? Always check the hotel's cancellation policy before booking a rate. Room cancellation is subject to rate booked at time of reservation and cancellation policy varies by rate. Does Holiday Inn Express Charleston US Hwy 17 & I-526 have a restaurant on site? No, there is no on site restaurant at Holiday Inn Express Charleston US Hwy 17 & I-526. Is there free breakfast available at Holiday Inn Express Charleston US Hwy 17 & I-526? Breakfast is free with your stay at the Holiday Inn Express Charleston US Hwy 17 & I-526. When is breakfast at Holiday Inn Express Charleston US Hwy 17 & I-526? Breakfast at Holiday Inn Express Charleston US Hwy 17 & I-526 is available from 6:30 AM to 9:30 AM.On weekends, breakfast is available from 6:30 AM to 9:30 AM. Is there a complimentary shuttle available at Holiday Inn Express Charleston US Hwy 17 & I-526? No, there is not a complimentary local area shuttle available at Holiday Inn Express Charleston US Hwy 17 & I-526. What are the check-in and check-out times for Holiday Inn Express Charleston US Hwy 17 & I-526? Check-in at Holiday Inn Express Charleston US Hwy 17 & I-526 is from 3:00 PM, and check-out time is 11:00 AM. Contact the hotel directly for options available for early check-in or late check-out. Does Holiday Inn Express Charleston US Hwy 17 & I-526 offer free Wi-Fi? Yes, the Holiday Inn Express Charleston US Hwy 17 & I-526 offers free WiFi! Read more FAQs View in other languages English English (GB) 日本語 Deutsch 繁體中文 Español 中文 Français Español (España) Italiano Nederlands Русский Português 한국어 ไทย العربية Português (BR) Bahasa Indonesia Türkçe",
      "hash": "c1f8da3ca8b3",
      "downloadedAt": "2026-01-18T17:02:38.431Z",
      "trimmedAt": "2026-01-18T17:07:17.355Z",
      "sizeReduction": "97.4%"
    }
  ],
  "sizeReduction": "98.4%"
}