{
  "venueId": "ChIJf_cujqlz_ogRD9hFS7OJU04",
  "venueName": "Long Island Cafe",
  "venueArea": "Isle of Palms",
  "website": "http://www.longislandcafesc.com/",
  "scrapedAt": "2026-01-19T02:45:56.418Z",
  "trimmedAt": "2026-01-19T02:52:41.949Z",
  "pages": [
    {
      "url": "http://www.longislandcafesc.com/",
      "text": "[Page Title: The Long Island Cafe of SC - Fresh Seafood & American Fare]\n\nSkip to main content Skip to footer \nThe Long Island Cafe of SC\n\nest. 1986\n\nSince first opening its doors in 1986, Long Island Café has been a hidden gem for locals and tourists alike, tucked within a strip mall on the Isle of Palms. Over its decades-long history, this beloved restaurant has become a staple of the Charleston community.\n\nLocation\n1515 Palm Blvd.Isle of Palms, SC (843) 886-8809 \nHours of Operation\n\nLunch\n\nMonday — Saturday11:00am — 2:00pm\n\nBrunch\n\nSunday11:00am — 2:00pm\n\nDinner\n\nMonday — Sunday5:00pm — until\n\nIOP Raw\n\nMonday — Sunday4:30pm — until\n\nrESERVATIONS\n\nReservations are prioritized due to high demand, particularly on weekends.Fill out the form to secure your spot.\n\nMenus\n\nIn 2012, the café underwent a revitalization with new ownership, breathing new life into the restaurant and menu. In 2019, the vision for the island’s finest seafood expanded as a sister location, IOP Raw, was opened right next door. Both restaurants were sold to longtime friends and loyal patrons in 2022. Though the menu has evolved through all the transitions, classic dishes remain, with a continued emphasis on fresh, local seafood. New items and regularly changing specials keep the offerings vibrant.\n\nThis modern version of an island favorite has thrived, supporting local producers while serving up a diverse menu of seafood, pasta, American cuisine, and desserts. Sharing a kitchen allows guests to enjoy both menus in either dining room.\n\nLong Island Cafe Menu\nLunch Dinner Brunch Drinks Kid's Menu Steamers \nFAQs\n\nWhat are you known for?\n\nWe are known for our iconic fried seafood platters, fresh oysters, and our wildly popular Seafood Steamer Buckets. Guests love our coastal flavors, relaxed island atmosphere, and long-standing reputation as one of Isle of Palms’ favorite seafood destinations.\n\nWhat meals do you serve?\n\nWe serve lunch and dinner daily, as well as a beloved Sunday brunch featuring coastal classics and island-inspired favorites.\n\nDo you offer delivery or takeout?\n\nYes! We offer takeout and delivery, and highly recommend our Seafood Steamer Buckets for beach days, family gatherings, holidays, and at-home events.\n\nWhat areas do you serve?\n\nWe proudly serve Isle of Palms, South Carolina, along with nearby beach communities.\n\nAre reservations required?\n\nReservations are not required, but highly recommended, especially for weekends, holidays, and larger parties.\n\nIs there a dress code?\n\nNo—island casual attire is perfectly welcome. Come as you are and enjoy fresh, local seafood by the coast.\n\nNow offering LIC Steamers!\n\nMaking dinner as easy as 1-2-3 with L-I-C! Perfect for a solo feast, or a big celebration!\nOrder Online View Menu",
      "hash": "18ac52e8eaad",
      "downloadedAt": "2026-01-19T02:09:50.316Z",
      "trimmedAt": "2026-01-19T02:52:41.949Z",
      "sizeReduction": "97.3%"
    }
  ],
  "sizeReduction": "97.3%"
}