{
  "venueId": "ChIJ357Spvtv_ogR9_QeyMvy3Lk",
  "venueName": "Orlando's Brick Oven Pizza",
  "venueArea": "Daniel Island",
  "website": "http://orlandospizza.com/",
  "scrapedAt": "2026-01-18T17:04:23.430Z",
  "trimmedAt": "2026-01-18T17:04:53.332Z",
  "pages": [
    {
      "url": "http://orlandospizza.com/mount-pleasant-menu",
      "text": "SERVING THE LOWCOUNTRY SINCE 2004 Mount Pleasant Menu Appetizers Garlic Knots - 5/ 10 5.99 / 10.99 Baked with fresh garlic and olive oil. Garnished with Romano and served with a side of marinara Cheese Garlic Knots - 5/10 6.99 / 11.99 Garlic knots baked with mozzarella. Served with a side of marinara Burrata 13.99 Burrata, heirloom tomatoes, extra virgin olive oil, balsamic glaze, and sea salt. Served with house bread Meatballs 7.99 5 meatballs - add Ricotta cheese 1.50 Salads Add the following to any salad - Chicken - 5 - Prosciutto 6 Burrata Salad 14.99 Arugula, baby heirloom tomatoes, burrata cheese, prosciutto, roasted cipollini onions, sea salt, extra virgin olive oil and balsamic drizzle Caesar - Side/ Entrée 6.99 / 9.99 Romaine lettuce and seasoned croutons, topped with Romano cheese. Served with a side of Caesar dressing Garden - Side/ Entrée 6.99 / 9.99 Romaine lettuce, spinach, tomatoes, cucumbers, onions, mushrooms, green peppers, and sunflower seeds. Served with a side of balsamic vinaigrette Greek - Side/ Entrée 7.99 / 11.99 Romaine lettuce, spinach, black olives, cucumbers, tomatoes, onions, roasted red peppers, feta, mushrooms, banana peppers, served with Greek dressing Specialty Pizza - 10 inch / 18 inch *Slices are offered Monday - Friday from 11 am - 2:30 pm Orlando's Special 13.99 / 27.99 Tomato sauce, mozzarella, sliced sausage, caramelized onions, roasted red peppers, garnished with fresh basil and Romano cheese All Meat 13.99 / 27.99 Tomato sauce, pepperoni, ham, Italian Sausage, Bacon, cheese Bacon Gorgonzola 13.99 / 27.99 Tomato sauce, mozzarella, fresh garlic, red onions, smoked bacon, mushrooms, gorgonzola cheese BBQ Bacon Chicken 13.99 / 27.99 BBQ sauce, mozzarella, bacon, chicken, red onions and peppadews Buffalo Chicken 13.50 / 27.50 Buffalo sauce, mozzarella, chicken, red onions and gorgonzola. Garnished with fresh parsley Greek 13.99 / 27.99 Tomato sauce, mozzarella, mushrooms, black olives, spinach, roasted red peppers, & feta Hawaiian 12.99 / 26.99 Tomato sauce, mozzarella, smoked ham, pineapple tidbits Margherita 13.75 / 27.75 Tomato sauce, fresh mozzarella, and roma tomatoes. Garnished with basil, Romano cheese, and extra virgin olive oil Meatball Parmesan Pizza 13.75 / 27.75 Olive oil base, mozzarella, dollops of ricotta cheese and pizza sauce, fresh Italian parsley and Romano cheese Spinach and Artichoke 13.50 / 27.50 Creamy garlic sauce, mozzarella, spinach, artichoke hearts, sundried tomatoes, and Romano cheese Supreme 13.99 / 27.99 Tomato sauce, mozzarella, pepperoni, sausage, ham, mushrooms, bell peppers, and onions Veggie 13.99 / 27.99 Tomato sauce, mozzarella, roma tomatoes, onions, bell peppers, and mushrooms White 13.50 / 27.50 Garlic & extra virgin olive oil, mozzarella, spinach, roma tomatoes and ricotta Sandwiches Meatball Parmesan Sandwich 9.99 Meatballs with marinara, melted Provolone cheese served on an 8\" Amoroso roll, choice of side Desserts Cannoli 5 chocolate dipped shell, chocolate chip cream filling, dusted with powdered sugar Chocolate Mousse Cake 6.5 NY Cheesecake 7 berry drizzle Beer - Wine - Cocktails Fully Stocked Bar Enjoy a fully stocked bar, our Mount Pleasant location is equipped to serve you all of the Italian classic cocktails, top tier Italian wines and a variety of locally brewed craft beers. **All prices and menu items are subject to change. Please visit our online ordering page for up to date menu offerings. ORDER ONLINE - Mt PLEASANT View Daniel Island Menu Copyright © 2026 Orlandos Pizza - All Rights Reserved. Powered by Home About Daniel Island Mount Pleasant Rewards Mobile App Reviews Jobs",
      "hash": "2dddf810d6b3",
      "downloadedAt": "2026-01-18T16:08:03.702Z",
      "trimmedAt": "2026-01-18T17:04:53.240Z",
      "sizeReduction": "98.4%"
    },
    {
      "url": "http://orlandospizza.com/download-menus",
      "text": "SERVING THE LOWCOUNTRY SINCE 2004 Daniel Island Printable Menu Lunch Menu not listed. (pdf) Daniel Island Appetizers - Salad -Pasta Download (pdf) Daniel Island - Signature Pizza Download (pdf) Daniel Island - Build Your Own Pizza Download Mount Pleasant Printable Menu Lunch Menu not listed. (pdf) Mount Pleasant - Appetizers and Salad Download (pdf) Mount Pleasant - Signature Pizza Download (pdf) Mount Pleasant - Build Your Own Pizza Download Order Online Daniel Island Location Place Order Here Mount Pleasant Location Place Order Here Copyright © 2026 Orlandos Pizza - All Rights Reserved. Powered by Home About Daniel Island Mount Pleasant Rewards Mobile App Reviews Jobs",
      "hash": "54f4e3936dd4",
      "downloadedAt": "2026-01-18T16:08:04.302Z",
      "trimmedAt": "2026-01-18T17:04:53.255Z",
      "sizeReduction": "99.6%"
    },
    {
      "url": "http://orlandospizza.com/#",
      "text": "SERVING THE LOWCOUNTRY SINCE 2004 We're hiring! Join our team! Apply Here Download our App! See What They Are Saying! Pizza and a Show Anyone? Download Now! Click the icon above! Pizza and a Show Anyone? See What They Are Saying! Pizza and a Show Anyone? We are excited to return as the exclusive pizza option at Credit One Stadium! See What They Are Saying! See What They Are Saying! See What They Are Saying! Thank you to everyone who took the time to post a review! Click the image to see our 5 Star reviews! Deliciousness NY STYLE PIZZA AT IT'S BEST! Copyright © 2026 Orlandos Pizza - All Rights Reserved. Powered by Home About Daniel Island Mount Pleasant Rewards Mobile App Reviews Jobs",
      "hash": "899128f932a5",
      "downloadedAt": "2026-01-18T16:08:02.491Z",
      "trimmedAt": "2026-01-18T17:04:53.269Z",
      "sizeReduction": "99.6%"
    },
    {
      "url": "http://orlandospizza.com/daniel-island-menu",
      "text": "SERVING THE LOWCOUNTRY SINCE 2004 Daniel Island Menu Appetizers Garlic Bread Bites - 6/12 6.99/11.99 Baked dough balls tossed in garlic butter, herbs and olive oil. Topped with Romano cheese Served with a side of marinara Garlic Cheese Bread Bites - 6/12 7.99/12.99 Baked dough balls tossed in garlic butter, herbs and olive oil. Topped with Mozzarella Romano cheese Served with a side of marinara Meatballs 7.99 5 meatballs - add Ricotta cheese 1.50 Salads Add the following to any salad - Chicken - 5 - Prosciutto 6 Caesar - Side/ Entrée 6.99/9.99 Romaine lettuce and seasoned croutons, topped with Romano cheese. Served with a side of Caesar dressing Garden - Side/ Entrée 6.99/9.99 Romaine lettuce, spinach, tomatoes, cucumbers, onions, mushrooms, green peppers, and sunflower seeds. Served with a side of balsamic vinaigrette Greek - Side/ Entrée 7.99/11.99 Romaine lettuce, spinach, black olives, cucumbers, tomatoes, onions, roasted red peppers, feta, mushrooms, banana peppers, served with Greek dressing Specialty Pizza - 10 inch / 18 inch *Slices are offered Monday - Friday from 11 am - 2:30 pm Orlando's Special 13.99 / 27.99 Tomato sauce, mozzarella, sliced sausage, caramelized onions, roasted red peppers, garnished with fresh basil and Romano cheese All Meat 13.99 / 27.99 Tomato sauce, pepperoni, ham, Italian Sausage, Bacon, cheese Bacon Gorgonzola 13.99 / 27.99 Tomato sauce, mozzarella, fresh garlic, red onions, smoked bacon, mushrooms, gorgonzola cheese BBQ Bacon 13.99 / 27.99 BBQ sauce, mozzarella, bacon, chicken, red onions and peppadews Buffalo Chicken 13.50 / 27.50 Buffalo sauce, mozzarella, chicken, red onions and gorgonzola. Garnished with fresh parsley Greek 13.99 / 27.99 Tomato sauce, mozzarella, mushrooms, black olives, spinach, roasted red peppers, & feta Hawaiian 12.99 / 26.99 Tomato sauce, mozzarella, smoked ham, pineapple tidbits Margherita 13.75 / 27.50 Tomato sauce, fresh mozzarella, and roma tomatoes. Garnished with basil, Romano cheese, and extra virgin olive oil Meatball Parmesan Pizza 13.75 / 27.75 Olive oil base, mozzarella, dollops of ricotta cheese and pizza sauce, fresh Italian parsley and Romano cheese Supreme 1.99 / 27.99 Tomato sauce, mozzarella, pepperoni, sausage, ham, mushrooms, bell peppers, and onions Veggie 13.99 / 2.799 Tomato sauce, mozzarella, roma tomatoes, onions, bell peppers, and mushrooms White 13.5 / 27.50 Garlic & extra virgin olive oil, mozzarella, spinach, roma tomatoes and ricotta Calzones and Sandwiches Four Cheese Calzone 11.99 Mozzarella provolone blend, ricotta and romano cheese, served with a side of marinara Italian Car Bomb 13.99 Pepperoni, sausage, ham, roasted red peppers, caramelized onions, ricotta, mozzarella, served with a side of marinara Meatball Parmesan Sandwich 9.99 Meatballs with marinara, melted Provolone cheese served on an 8\" Amoroso roll, choice of side Pasta Spaghetti and Meatballs (3) or (4) meatballs 8.99/15.99 Spaghetti tossed with house made marinara sauce and meatballs Kids Spaghetti 5.00 served with olive oil or marinara sauce Desserts Cannoli 5.50 chocolate dipped shell, chocolate chip cream filling, dusted with powdered sugar Chocolate Mousse Cake 7.00 NY Cheesecake 7.50 berry drizzle Beer & Wine There is currently no liquor service at this location. Daniel Island Location Enjoy a variety of Beer and Wine selections. Including top tier Italian wines and locally brewed craft beers, great for pairing with your food order. **All prices and menu items are subject to change. Please visit our online ordering page for up to date menu offerings. ORDER ONLINE - DANIEL ISLAND View Mount Pleasant Menu Copyright © 2026 Orlandos Pizza - All Rights Reserved. Powered by Home About Daniel Island Mount Pleasant Rewards Mobile App Reviews Jobs",
      "hash": "98978ec77765",
      "downloadedAt": "2026-01-18T16:08:03.106Z",
      "trimmedAt": "2026-01-18T17:04:53.316Z",
      "sizeReduction": "98.3%"
    },
    {
      "url": "http://orlandospizza.com/",
      "text": "SERVING THE LOWCOUNTRY SINCE 2004 We're hiring! Join our team! Apply Here Download our App! See What They Are Saying! Pizza and a Show Anyone? Download Now! Click the icon above! Pizza and a Show Anyone? See What They Are Saying! Pizza and a Show Anyone? We are excited to return as the exclusive pizza option at Credit One Stadium! See What They Are Saying! See What They Are Saying! See What They Are Saying! Thank you to everyone who took the time to post a review! Click the image to see our 5 Star reviews! Deliciousness NY STYLE PIZZA AT IT'S BEST! Copyright © 2026 Orlandos Pizza - All Rights Reserved. Powered by Home About Daniel Island Mount Pleasant Rewards Mobile App Reviews Jobs",
      "hash": "e9345c076cf4",
      "downloadedAt": "2026-01-18T16:08:02.380Z",
      "trimmedAt": "2026-01-18T17:04:53.332Z",
      "sizeReduction": "99.6%"
    }
  ],
  "sizeReduction": "99.0%"
}