{
  "venueId": "ChIJZ21LMAx6_ogRO1cje2Ji56c",
  "venueName": "Amen Street Fish & Raw Bar",
  "venueArea": "Downtown Charleston",
  "website": "http://amenstreet.com/",
  "scrapedAt": "2026-01-18T17:04:27.846Z",
  "trimmedAt": "2026-01-18T17:11:08.175Z",
  "pages": [
    {
      "url": "http://amenstreet.com/charleston-east-bay-amen-street-happy-hours-specials",
      "text": "Specials Monday January 19th Mussel Mondays! $12 mussels all day 11:00 AM - 10:00 PM Happy Hour! 04:00 PM - 07:00 PM Tuesday January 20th Happy Hour! 04:00 PM - 07:00 PM Wednesday January 21st Happy Hour! 04:00 PM - 07:00 PM Thursday January 22nd Happy Hour! 04:00 PM - 07:00 PM Friday January 23rd Happy Hour! 04:00 PM - 07:00 PM",
      "hash": "3a8b6e973c75",
      "downloadedAt": "2026-01-18T16:52:04.952Z",
      "trimmedAt": "2026-01-18T17:11:08.131Z",
      "sizeReduction": "99.5%"
    },
    {
      "url": "http://amenstreet.com/charleston-east-bay-amen-street-drink-menu",
      "text": "Our Drinks Cocktails Beer Wine",
      "hash": "40223251818f",
      "downloadedAt": "2026-01-18T16:52:04.336Z",
      "trimmedAt": "2026-01-18T17:11:08.137Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://amenstreet.com/charleston-east-bay-amen-street-food-menu",
      "text": "Our Menu Lunch Dinner Happy Hour Bar Bites Fresh Catch and Daily Oyster List Kid's Menu",
      "hash": "66dfec8562ea",
      "downloadedAt": "2026-01-18T16:52:03.692Z",
      "trimmedAt": "2026-01-18T17:11:08.145Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "http://amenstreet.com/",
      "text": "Our menu Sustainably sourced seafood, expertly crafted for an unforgettable meal. menu slideshow start stop playing Slide 1 content Slide 2 content previous slide next slide Our Menu menu Reserve Your Spot for a Memorable Culinary Journey reserve Reservations Secure Your Seafood Experience Today Planning a visit? Ensure your spot at Amen Street with our easy reservation system. Whether for lunch, dinner, or a special occasion, our team is ready to welcome you with open arms. Book your table now! Reserve About us Welcome to Amen Street, a cherished dining destination set in the heart of Charleston's historic district, at 205 East Bay Street. Our location is a gateway to Charleston's storied past, just steps away from the historic Market and the scenic Charleston Harbor. Read more about us WE ARE HIRING! Join Our Culinary Family Are you passionate about exceptional seafood and outstanding service? Become part of our team and contribute to creating memorable dining experiences. Explore our career opportunities and apply today to start your journey with us! learn more & APPly for a job Specials ALL SPECIALS Skip Photo Gallery Reviews Start stop reviews carousel Review by - Google Megan M: five star review by My boyfriend was determined to have fresh raw oysters. This was a great find, near the downtown and market - with great service, yummy food and delicious drinks. We had the sampler and fried green tomatoes with drinks. Worth it! Review by - Google Natalie P: five star review by Some of the best food I've had in Charleston! Our server was incredibly knowledgeable of the menu and had perfect recommendations for wine and oysters. Review by - Google Kadee S: five star review by We had reservations at 6:00, but were able to walk in and get a seat at 5:30. Our waitress was amazing! And our food was so good. We got the bistro steak & fresh catch of the day. Highly recommend Review by - Google LuAnn H: five star review by What a fun place to have lunch with my friends. The food was terrific and the service was great! Review by - Google Dai Z: five star review by This is a kinda cozy restaurant with delicious food. I tell you...this was an amazing, juicy burger made with the finest seasonings. And the fries! The chef used a special seasoning that offered a cinnamon flavor. Oh my! The restaurant is in the thick of downtown where everything happens. Please visit Amen Street. You will love it! Newsletter Location 205 E Bay St Charleston, SC 29401 Visit our sister restaurants Hours Fri, Sat 11:00 AM - 10:30 PM Sun, Mon, Tue, Wed, Thur 11:00 AM - 10:00 PM Find us on... Google page Contact us (843)-853-8600 Call us at info@amenstreet.com Write us at Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "7c6c5f4a7105",
      "downloadedAt": "2026-01-18T16:52:03.597Z",
      "trimmedAt": "2026-01-18T17:11:08.175Z",
      "sizeReduction": "97.9%"
    }
  ],
  "sizeReduction": "99.3%"
}