{
  "venueId": "ChIJTyZnXL5l_ogRhLTnbBO1suw",
  "venueName": "Jackrabbit Filly",
  "venueArea": "North Charleston",
  "website": "http://www.jackrabbitfilly.com/",
  "scrapedAt": "2026-01-18T17:04:26.698Z",
  "trimmedAt": "2026-01-18T17:08:03.697Z",
  "pages": [
    {
      "url": "http://www.jackrabbitfilly.com/large-partiesevents",
      "text": "0 Who likes to party?Answer: We Like to party! Jackrabbit Filly can now accommodate up to ten guests through our normal online reservations at Open Table. Huzzah! GOOD NEWS! For sake of easiness and all our servers mental well-being we add 20% gratuity to any table 8+. large party reservation Parties of 11+ require all guests to participate in a prefix, pre-selectable menu. All food is served family style (shared) and each plate typically contains 4 to 5 servings. We cannot accommodate individual platings.The prefix menu does not include tax, tip, or beverages. The allotted time frame for the meal is two hours. GROUPS OF 11+ Depending on the evening and the number in your party, your group will either be sat in the main dining room or in the private dining room. As this is not considered a \"buy out\" and there is no minimum fee included, we will be seating guests before and after your party. If you would like to stay for longer than the allotted two hours, an additional fee of $100 per fifteen minutes may be added to your check. If you would like a more leisurely dinner, ask us about buying out our private dining room. And again, for sake of easiness and all our servers mental well-being we add 20% gratuity to any table 8+. PRIVATE EVENTS For groups larger than 16 a buy out is required along with food and beverage minimums. Please give us a little more information about your party and we’ll get the ball rolling. Our private dining room — the Red Room — holds up to 40 people. GROUPS LARGER THAN 16 To make your reservation we require a $100 deposit. This comes off your final check and is refundable up to three days prior to your reservation. The deposit is non-refundable less than 72 hours prior to your reservation. DEPOSITS Thank you so much for choosing to have your special meal with us. We can't wait to host y'all. customer service please! Want to talk to a real live human? Call us at 843-460-0037 or email events@jackrabbitfilly.com and we’ll get right back to you. your special event begins now…",
      "hash": "0ca466a785e5",
      "downloadedAt": "2026-01-18T16:59:57.408Z",
      "trimmedAt": "2026-01-18T17:08:03.683Z",
      "sizeReduction": "99.5%"
    },
    {
      "url": "http://www.jackrabbitfilly.com/menu",
      "text": "0 lunch Menu Dinner Menu drinks menu golden hour menu As we change from our lunch menu to our dinner menu, our Gold Hour menu offers a small selection of snacks and drink specials available at the bar only. All menues are seasonal and subject to change. At this time, we can no longer accomodate severe allergies. The potential cross contamination during prep makes it impossible. We greatly apologize for the inconvenience.",
      "hash": "1675e09e8be3",
      "downloadedAt": "2026-01-18T16:59:56.644Z",
      "trimmedAt": "2026-01-18T17:08:03.691Z",
      "sizeReduction": "99.7%"
    },
    {
      "url": "http://www.jackrabbitfilly.com/",
      "text": "0 Heritage Driven New Chinese American Now proudly located at 1083 East Montague Avenue, North Charleston, SC Scenes from our sister restaurant, King BBQ.",
      "hash": "737a972f6c2f",
      "downloadedAt": "2026-01-18T16:59:56.301Z",
      "trimmedAt": "2026-01-18T17:08:03.697Z",
      "sizeReduction": "99.9%"
    }
  ],
  "sizeReduction": "99.6%"
}