{
  "venueId": "ChIJ3WUQImp6_ogR-qg2rgyiwuU",
  "venueName": "Vintage Lounge",
  "venueArea": "Mount Pleasant",
  "website": "http://vintagechs.com/",
  "scrapedAt": "2026-01-19T02:19:30.973Z",
  "trimmedAt": "2026-01-19T02:19:59.639Z",
  "pages": [
    {
      "url": "http://vintagechs.com/private-events",
      "text": "[Page Title: Private Events — Vintage Lounge - Charleston, SC - Fine Wine | Cocktails | Cheese & Charcuterie]\n\nprivate events\n\nNo matter the occasion, groups large and small, let us help you plan your next celebration in our beautiful space. Let’s make it the party everyone is talking about!\n\nvenue rental options\n\nelevated patio\n\nSemi-private space perfect for smaller gatherings of up to 35 guests\n\nCombination of high-top tables and bar seating for up to 19 guests with additional room for standing\n\nPrivate access to full-service patio bar\n\nOpen-air space draped in Boxwood greenery and market lighting\n\nFans / Heaters included\n\nHouse music played through speakers\n\nLower patio\n\nSemi-private or Private space ideal for gatherings of up to 50 people*\n\nCombination of lounge tables and bar seating for up to 35 guests with additional standing room\n\nPrivate access to patio bar\n\nSpace is entirely covered\n\nBuilt-in fans / heaters included\n\nHouse music played through speakers\n* Outside Rentals may be required for some events and will be provided by Vintage \nfull patio\n\nFully private space for gatherings up to 100 guests*\n\nCombination of lounge, bar, and high-top seating for up to 50 guests with additional room for standing\n\nDouble-sided access to patio bar for the exclusive use of your guests\n\n70/30 covered / open-air space\n\nBuilt-in fans / heaters included\n\nAbility to play house music or your own playlist with guest-provided device\n*Outside Rentals may be required for some events and will be provided by Vintage \nentire venue\n\nPerfect for large gatherings of up to 180 people*\n\nExclusive use of our award-winning designed space with full access to both the interior and patio areas\n\nInterior\n\n40’ Carrara Marble bar\n\nAlcove, booth, banquette, bar, and bistro seating for up to 90 guests\n\nStage for live music to be played through our custom hi-fidelity audio system, with an option to play a separate input to the patio\n\nExterior described above under\nFull Patio \n*\nEntire restaurant buyout required. Outside Rentals may be required and will be provided by Vintage. All outside catering selections must be approved by Vintage \nBOOK YOUR NEXT EVENT AT VINTAGE LOUNGE\n\nWe understand that every celebration is unique and requires attention to detail to make it successful. Provide us with some general information below and let us create a tailored proposal suited to your vision.",
      "hash": "20d43e6910fd",
      "downloadedAt": "2026-01-19T02:13:23.077Z",
      "trimmedAt": "2026-01-19T02:19:59.602Z",
      "sizeReduction": "98.7%"
    },
    {
      "url": "http://vintagechs.com/menu",
      "text": "[Page Title: Menu — Vintage Lounge - Charleston, SC - Fine Wine | Cocktails | Cheese & Charcuterie]\n\nMenu\nBeverage Menu \nBrowse our current Cocktail List, Wines By The Glass, Local Beer Offerings, and Porrons.\nBottle List \nOur full bottle list focuses on small family producers that we feel are making the most exciting wines typical of their place. Explore our expansive offering before your next visit. You can also order online for local pick-up or have it shipped to your door.\nOrder Bottles for Pick-up or Delivery (Coming Soon!) \nCheese & Charcuterie\n\nOur cheese and charcuterie options are always changing. Please visit us for our current selection.",
      "hash": "8644ec089c7c",
      "downloadedAt": "2026-01-19T02:13:22.303Z",
      "trimmedAt": "2026-01-19T02:19:59.615Z",
      "sizeReduction": "99.6%"
    },
    {
      "url": "http://vintagechs.com/shop/wine-club",
      "text": "[Page Title: Wine Club — Shop — Vintage Lounge - Charleston, SC - Fine Wine | Cocktails | Cheese & Charcuterie]\n\nVintage Store\n\nWine Club\nCategories: All Gift Cards Wine Club Retail Wine \nWine Club\n\nWine Club Membership\n\n$100.00",
      "hash": "cf3143741e01",
      "downloadedAt": "2026-01-19T02:13:23.785Z",
      "trimmedAt": "2026-01-19T02:19:59.622Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "http://vintagechs.com/",
      "text": "[Page Title: Vintage Lounge - Charleston, SC - Fine Wine | Cocktails | Cheese & Charcuterie]\n\nTHE MOST BEAUTIFULLY DESIGNED BAR IN SOUTH CAROLINA\n\n-\nArchitectural Digest \nA DESTINATION\n\nNamed “The Most Beautifully Designed Bar in South Carolina” by, Vintage Lounge is an upscale Charleston bar offering the finest selection of drinks. We feature more than twenty wines by-the-glass and a bottle list with over 200 selections, sure to satisfy any palate. Our offerings focus on small production wines typical of place and varietal character, and feature producers who believe in a hands-off approach to making wine. Many of our wines are certified organic or practice viticulture organically, biodynamically, or in a natural and respectful way.\nArchitectural Digest \nIn addition to our expansive wine selection, we pride ourselves in offering proper cocktails - both classic and original creations - and a small selection of local craft beer in can form. Our beverage offerings are the perfect compliment to our curated selection of specialty cheeses and charcuterie to complete Charleston, SC’s most intimate night out!\n\nVintage Lounge is located on Upper King Street in a beautifully renovated historic building. In addition to our award winning interiors, we feature a spacious outdoor patio and bar so that you and your guests can take in all that Charleston has to offer. Vintage Lounge is without question Charleston’s best upscale bar for both date night & group outings!\n\nRecently featured in the likes of the , , , and .\nArchitectural Digest Conde Nast The Wall Street Journal Hospitality Design Magazine \nFollow our Story\n\nCome drink an ESPRESSO MARTINI tonight✨\n\n#espressomartini #drinkoftheday #instacocktails #cocktailbars #chs #secondstatecoffee #localdrinks #shakennotstirred #charleston #localfirst #fall22 #october2022 #chstoday #explorecharleston\n\nWho else needs a snack like this one in their life today?\n\n#charleston #cheeseplatter #cheeseboard #cheeseandwine #wineaddict #winetravel #travelsc #chstoday #chseatslocal #realcheese #southerncharm #cocktailbars #eatercarolinas #postandcourier #tuesdayfun\n\nWe are looking for a couple of people to join our team! \n\nDo you enjoy high volume, fast-paced work in an upscale environment? \n\nWhether you are a seasoned veteran or a newcomer to the industry, we want to talk to you! \n\nPlease send your resume to info@vintagechs.com and let us know why you think Vintage Lounge is the right place for you.\n\nOPENING AS SOON AS WE GET THE POWER BACK ON⚡️🥂🍷\n\nOPEN TONIGHT⚡️☔️🥂\n\nRain or shine we are open this weekend ☔️\n\nThe French 75\n\nThe drink dates to World War I, and an early form was created in 1915 at the New York Bar in Paris—later Harry's New York Bar—by barman Harry MacElhone. The combination was said to have such a kick that it felt like being shelled with the powerful French 75mm field gun.\n\n#hattrickgin #payitfoward #chs #chsdrinks #eatercarolinas #beefeatergin #gin #shakennotstirred #charleston #fall22 #weddingweekend #chswedding #bartenderstyle #sundaybest\n\nTwo amazing events happening tonight. We hope to see you at both! \n\nSicilian wine tasting with @olivermccrumwinesandspirits + @mccarusbeverage (6pm - 8pm at Vintage Lounge) Flight of three wines. *complimentary to all Gold Card members. $15 for non members. \n\nWe are partnering with @billy_reid for their Young Professionals Happy Hour Event. Shopping and cocktails at their King St location (6pm - 8pm)\n\nHappy Monday ☕️\n\n#charleston #chs #chsdrinks #coffeeroasters #secondstatecoffee #cocktailbars #winetravel #travelsc #southerncharm #charlestondaily #explorecharleston\n\nCocktail Hour✨",
      "hash": "d24c5a414b7c",
      "downloadedAt": "2026-01-19T02:13:22.149Z",
      "trimmedAt": "2026-01-19T02:19:59.639Z",
      "sizeReduction": "97.9%"
    }
  ],
  "sizeReduction": "99.0%"
}