{
  "venueId": "ChIJz9tebJJx_ogR91jjOg3jXqE",
  "venueName": "King Street Grille",
  "venueArea": "Mount Pleasant",
  "website": "https://pleasant.thekingstreetgrille.com/",
  "scrapedAt": "2026-01-18T17:04:32.166Z",
  "trimmedAt": "2026-01-18T17:13:07.033Z",
  "pages": [
    {
      "url": "https://pleasant.thekingstreetgrille.com/mt-pleasant-myrtle-beach-king-street-grille-mt-pleasant-happy-hours-specials",
      "text": "Copy and paste the following Specials Monday January 19th Happy Hour EVERY DAY from 4-7pm! 50% off drinks and select food specials when you sit at the bar, bar area/rail and side patio ONLY! Enjoy that fresh air! 04:00 PM - 07:00 PM Tuesday January 20th Tuesday 1/2 Price Salad Day! Half Price on any Build Your Own Salad! Dine In Only 11:00 AM - 10:00 PM Wednesday January 21st Half priced burger Wednesday! From 11am-10pm, get 50% off a burger with the purchase of a beverage (excluding water). Dine in only! 11:00 AM - 10:00 PM Join us for Happy Hour EVERYDAY from 4-7pm, get here early so you can get a seat! Happy Hour is valid in the bar and bar area, patio only. 04:00 PM - 07:00 PM Thursday January 22nd Happy Hour EVERYDAY from 4-7pm! 50% Off All Beer, Wine & House Liquor and discounts on select appetizers. Happy Hour prices only available at the bar or bar area and patio. *Excludes Signature Cocktails, Wine Bottles & Liquor over $14 04:00 PM - 07:00 PM Friday January 23rd Check out our new King Street's Kids Zone - bring the kiddos for lunch & meet your friends and family in our newly renovated kid-friendly patio. 11:00 AM - 08:00 PM Happy Hour EVERYDAY from 4-7pm! 50% Off All Beer, Wine & House Liquor.*Excludes Signature Cocktails, Wine Bottles & Liquor over $14 04:00 PM - 07:00 PM 1/2 Price Wing Night! 50% off our signature Wings after 8pm! 08:00 PM - 10:00 PM",
      "hash": "1e67564baf59",
      "downloadedAt": "2026-01-18T16:56:30.475Z",
      "trimmedAt": "2026-01-18T17:13:06.956Z",
      "sizeReduction": "98.2%"
    },
    {
      "url": "https://pleasant.thekingstreetgrille.com/mt-pleasant-myrtle-beach-king-street-grille-mt-pleasant-food-menu",
      "text": "Copy and paste the following Our Menu Appetizers For All Create Your Own Chopped Salads King Sized Sandwiches House Made Burgers Scratch Made Entrees Sides & Subs Decadent Desserts Catering Menu KIDS MENU Special Features Menu",
      "hash": "3ec397839bd9",
      "downloadedAt": "2026-01-18T16:56:28.708Z",
      "trimmedAt": "2026-01-18T17:13:06.965Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "https://pleasant.thekingstreetgrille.com/mt-pleasant-myrtle-beach-king-street-grille-mt-pleasant-drink-menu",
      "text": "Copy and paste the following Our Drinks Soft Drinks Cocktails Beer",
      "hash": "8c40b718c9ac",
      "downloadedAt": "2026-01-18T16:56:29.296Z",
      "trimmedAt": "2026-01-18T17:13:06.969Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "https://pleasant.thekingstreetgrille.com/mt-pleasant-myrtle-beach-king-street-grille-mt-pleasant-food-menu#",
      "text": "Copy and paste the following Our Menu Appetizers For All Create Your Own Chopped Salads King Sized Sandwiches House Made Burgers Scratch Made Entrees Sides & Subs Decadent Desserts Catering Menu KIDS MENU Special Features Menu",
      "hash": "94266a8b5c80",
      "downloadedAt": "2026-01-18T16:56:31.075Z",
      "trimmedAt": "2026-01-18T17:13:06.978Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "https://pleasant.thekingstreetgrille.com/mt-pleasant-myrtle-beach-king-street-grille-mt-pleasant-events",
      "text": "Copy and paste the following Events Valentine's Day Saturday February 14th Join us on Valentine's Day for the perfect romantic evening! 11:00 AM - 11:00 PM 2026-02-14 11:00:00 2026-02-14 23:00:00 America/New_York Valentine's Day Join us on Valentine's Day for the perfect romantic evening! King Street Grille - Mt. Pleasant King Street Grille - Mt. Pleasant KSGmarketingSC@gmail.com Mardi Gras Tuesday February 17th Come celebrate Mardi Gras with us. 11:00 AM - 11:00 PM 2026-02-17 11:00:00 2026-02-17 23:00:00 America/New_York Mardi Gras Come celebrate Mardi Gras with us. King Street Grille - Mt. Pleasant King Street Grille - Mt. Pleasant KSGmarketingSC@gmail.com National Margarita Day Sunday February 22nd Come celebrate National Margarita day with us on February 22nd. 11:00 AM - 11:00 PM 2026-02-22 11:00:00 2026-02-22 23:00:00 America/New_York National Margarita Day Come celebrate National Margarita day with us on February 22nd. King Street Grille - Mt. Pleasant King Street Grille - Mt. Pleasant KSGmarketingSC@gmail.com International Women's Day Sunday March 8th Come celebrate International Women's Day with us - March 8th 11:00 AM - 11:00 PM 2026-03-08 11:00:00 2026-03-08 23:00:00 America/New_York International Women's Day Come celebrate International Women's Day with us - March 8th King Street Grille - Mt. Pleasant King Street Grille - Mt. Pleasant KSGmarketingSC@gmail.com St. Patrick's Day Tuesday March 17th Grab your best green garb and join us for St. Patrick's Day! 11:00 AM - 11:00 PM 2026-03-17 11:00:00 2026-03-17 23:00:00 America/New_York St. Patrick's Day Grab your best green garb and join us for St. Patrick's Day! King Street Grille - Mt. Pleasant King Street Grille - Mt. Pleasant KSGmarketingSC@gmail.com Easter Sunday April 5th Come celebrate Easter with us! 11:00 AM - 11:00 PM 2026-04-05 11:00:00 2026-04-05 23:00:00 America/New_York Easter Come celebrate Easter with us! King Street Grille - Mt. Pleasant King Street Grille - Mt. Pleasant KSGmarketingSC@gmail.com",
      "hash": "bd7a3012bc1d",
      "downloadedAt": "2026-01-18T16:56:29.884Z",
      "trimmedAt": "2026-01-18T17:13:06.988Z",
      "sizeReduction": "97.6%"
    },
    {
      "url": "https://pleasant.thekingstreetgrille.com/",
      "text": "Copy and paste the following × We've got Game. All of them! Come watch the NFL Playoffs with us! Upcoming Events × Did you know we do catering? Whatever your occasion, however big or small, we have the perfect options to choose from. Cater your birthday party, holiday party, corporate events, wedding festivities and more! Call to Inquire × Order your favorite dishes in seconds! Order Online Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! Job Listings Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! 1136 Hungryneck Blvd, Mt. Pleasant, SC 29464 map marker pin About us Located just minutes from the Isle of Palms, KSG Mount Pleasant is an upscale sports bar with a delicious menu that offers something for everyone. We offer a family-friendly Kids Zone Play Area patio, so you can sit outside watch your games while the kiddos are entertained. If you're visiting the Charleston area, we're close to many of the hotels off IOP Connector and offer ample parking. Food delivery available via UberEats. Follow us on Facebook, Instagram, Tiktok and more! Read more about us Our Menus Appetizers For All Create Your Own Chopped Salads King Sized Sandwiches House Made Burgers Scratch Made Entrees Sides & Subs Decadent Desserts Catering Menu Soft Drinks Cocktails Beer KIDS MENU Special Features Menu Specials Check them out Reviews review by - Yelp Opal D: They answered their phone and it was easy to place a pick-up order. The order was executed correctly, it was easy to get a bartenders' attention when I arrived, and the food was ready when they said it would be. Easy parking. The build-your-own salad is a great idea. My husband enjoyed his entree. We will get food from them again soon! review by - Yelp Makenzie L: King Street Grill is always our go to for Sunday football! We're falcons fans and often don't get the game at home, so King Street is one of the only places we've found with enough TVs to satisfy everyone's football needs. We normally sit at the bar and the service is always top notch. The bartenders immediately greet you and continuously check on you to make sure you have everything you need... review by - Yelp Realty Pros K: Wow! This bar and grill has AMAZING food and service! We came in last night for some wings and burgers. Talk about elevating bar and pub food- wowza! The wings were some of the best that we have ever had anywhere- perfectly crispy, tender and steaming hot...This little neighborhood joint gets our highest possible recommendation. review by - Yelp Madison K: Me and my family enjoyed dinner at the Grille. The place was kept very clean and all workers were wearing masks and gloves when handling our food/dishes and drinks. The food itself was amazing! They had a range of options and even had great options for kids. I had the chicken Cesar side salad and wrap! Amazing! review by - Yelp Jennifer F: The food was delicious. We sat outside, they had a covered area set up with a fan it was quite toasty but it didn't take away from the experience. They did have inside seats but we opted to eat outside. The waitress was professional and kind. She was wearing a mask. She checked on us quite a bit even though we sat outside. Stop reviews carousel Play reviews carousel Newsletter Location Open daily in Mount Pleasant King Street Grille 1136 Hungryneck Blvd , Mt. Pleasant SC 29464 Check out our sister location King Street Grille Myrtle Beach Hours Open Daily Kitchen Hours 11am-10pm Bar Hours 11am-11pm Happy Hour 4-7pm Weekdays Outdoor Play Area for Kids Take Out Available /Delivery Via UberEats Find us on... Instagram page Facebook page Twitter page Contact us (843)-216-7272 KSGmarketingSC@gmail.com Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "e050cabe65fc",
      "downloadedAt": "2026-01-18T16:56:28.593Z",
      "trimmedAt": "2026-01-18T17:13:07.033Z",
      "sizeReduction": "98.1%"
    }
  ],
  "sizeReduction": "99.0%"
}