{
  "venueId": "ChIJl9kcHnlx_ogRp4_EfP8icGs",
  "venueName": "The Longboard",
  "venueArea": "Sullivan's Island",
  "website": "https://www.thelongboardsullivans.com/",
  "scrapedAt": "2026-01-18T17:04:29.107Z",
  "trimmedAt": "2026-01-18T17:11:38.705Z",
  "pages": [
    {
      "url": "https://www.thelongboardsullivans.com/",
      "text": "Home Main content starts here, tab to start navigating Slide 1 of 9 Slide 2 of 9 Slide 3 of 9 Slide 4 of 9 Slide 5 of 9 Slide 6 of 9 Slide 7 of 9 Slide 8 of 9 Slide 9 of 9 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Our Story The Longboard – Sullivan’s Island is the second iteration of The Longboard concept, originally born on St. John, USVI. The flagship location opened May 1, 2015 in the heart of Cruz Bay, St. John, offering light & healthy fares and creative cocktails inspired by coastal regions around the globe. Learn More Merchandise Longboard gear looks good on you. Hats + koozies + oyster knives + face buffs + more . . . Available exclusively at The Longboard! Give the gift of The Longboard Give the gift of good eats & delicious drinks with a Longboard e-gift card. Purchase an E-gift Card Call (843) 868-8161 Reservations Email Signup Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location The Longboard | Seafood Restaurant in Sullivan's Island, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "2f0503697b87",
      "downloadedAt": "2026-01-18T17:01:51.346Z",
      "trimmedAt": "2026-01-18T17:11:38.585Z",
      "sizeReduction": "95.9%"
    },
    {
      "url": "https://www.thelongboardsullivans.com/location/the-longboard/",
      "text": "Main content starts here, tab to start navigating Hours & Location 2213-B Middle Street, Sullivan's Island, SC 29482 (843) 868-8161 Open Monday - Sunday WEEKDAYS [Mon - Fri]: Lunch: 11 AM - 5 PMOyster Happy Hour: 11 AM - 5 PMDinner: 5 PM - 10 PMBar: 11 AM - 11 PM WEEKENDS [Sat & Sun]: Brunch: 10 AM - 3 PM *Oyster Happy Hour: 3 PM - 5 PM Dinner: 5 PM - 10 PMBar: 11 AM - 11 PM *Please note: The only food menu available between 3-5 PM on weekends is our Oyster Happy Hour Menu. Brunch menu ends at 3 PM on weekends; Full Dinner Menu begins daily at 5 PM. Get Directions Call (843) 868-8161 Reservations Email Signup Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location The Longboard | Seafood Restaurant in Sullivan's Island, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "869e25a84d16",
      "downloadedAt": "2026-01-18T17:01:52.460Z",
      "trimmedAt": "2026-01-18T17:11:38.590Z",
      "sizeReduction": "95.5%"
    },
    {
      "url": "https://www.thelongboardsullivans.com/menu/",
      "text": "Main content starts here, tab to start navigating Menu Slide 1 of 8 Slide 2 of 8 Slide 3 of 8 Slide 4 of 8 Slide 5 of 8 Slide 6 of 8 Slide 7 of 8 Slide 8 of 8 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Lunch Brunch Dinner Dessert Raw Bar Oyster Hour Kids Menus Brunch - Cocktails Dinner - Cocktails Beer & Etc. Wine Non-Alcoholic Bevs Coffee & Espresso Available weekdays from 11 AM - 5 PM Share Plates Street Corn Salad* Grilled corn, arugula, cilantro, cotija, chiles, citrus vinaigrette 15 $ Sticky Ribs* Hoisin, peanuts, Fresno chiles, mixed herbs 16 $ Spreads Whipped feta, sikil pak, seasonal veggies, naan 18 $ Crispy Brussels Sumac yogurt, sweet chili garlic, mixed herbs 14 $ Local Catch Sliders (4)* Panko coconut crust, pico, avocado relish, cheddar, lemon aioli 22 $ Crispy Calamari* Yuzu aioli, crispy lemon, sriracha, mixed herbs 16 $ Summer Roll* Chilled local shrimp, Napa cabbage, carrot, basil, mint, mango, hoisin 14 $ Mussels* Tom Kha broth, Fresno chiles, chili crunch, mixed herbs, sourdough 19 $ Fried Rice* Sushi rice, crispy maple glazed pork belly, scallion, sunnyside egg, miso sauce, sriracha 22 $ Add a wood-grilled protein: Shrimp* +8 - Salmon* +9 - Tuna* +11 - Chicken* +7 Salads Local Greens* Local bibb mix, crispy chickpeas, roasted red pepper, feta, cucumber, cured egg, honey-sriracha vinaigrette 15 $ Caribbean Salad Local bibb mix, arugula, grilled pineapple, cotija, radish, pepitas, citrus vinaigrette 14 $ Wood Fired Romaine* Grilled romaine hearts, Bayley Hazen blue cheese, heirloom tomatoes, lardons, cured egg, pepitas, herb dressing 16 $ Hand Helds Torta Burger* 6 oz. beef patty, sour cream, lemon aioli, souscaille, cotija, havarti, avocado slaw, side of fries 22 $ Add an egg 2 $ Shrimp Roll* Chilled grilled local shrimp, sambal aioli, peppers, simple salad, side of fries 20 $ Local Catch Sammy* Local fresh catch, nuoc chom aioli, Napa cabbage, carrot, arugula, side fries 23 $ Micro green simple salad, teriyaki & miso sauce Sushi Wraps Sullivan's* Tuna, cucumber, mango, avocado, sambal, sesame 19 $ Isle of Palms* Salmon, cucumber, avocado, crispy shallot, cream cheese 20 $ Folly* Shrimp, mango, pineapple, cilantro stems 18 $ Add a Protein: Tuna* +11 - Salmon* +9 - Hamachi* +12 - Chilled Shrimp* +8 Poke Bowls Aloha* Sushi rice, cucumber, avocado, radish, hemp seed, Aleppo pepper, soy, sambal aioli 16 $ Tropical* Sushi rice, mango, pineapple, cucumber, radish, scallion, pineapple-soy, sesame, passion fruit aioli 18 $ Isla Verde Local greens, cucumber, edamame, avocado, scallion, pepitas, soy, furikake 17 $ Vietnamese Rice noodles, mint, cilantro, Thai basil, avocado, chili lime cashews, nuoc chom 19 $ Priced by the each, served on hand pressed white corn tortillas Tacos Al Pastor Pineapple salsa, micro greens 6 $ Fresh Catch* Citrus slaw, pickled red onion, chipotle aioli, micro greens 7 $ Barbacoa Pickled red onion, cotija, cilantro, Aleppo pepper 7 $ Shrimp* Arugula, cotija, pickled red onion, lemon aioli 6 $ Veggie Cauliflower, arugula, souscaille 5 $ Toast Avocado Toast Rustic sourdough, avocado, roasted cherry tomatoes, radish, sunflower seeds, cotija cheese, pickled red onion, simple salad 14 $ Add a Local Farm Egg* 4 $ Lox Toast Rustic sourdough, whipped dill cream cheese, salmon sashimi, red onion, crispy capers, lemon zest, simple salad 17 $ Ricotta Toast Rustic sourdough, whipped zested ricotta, seasonal fruit, honey drizzle, granola, mint 15 $ Healthy & Lean Tropical Acai Bowl Acai blend, banana, strawberry, toasted coconut, honey, granola 18 $ Caribbean Salad Local bibb mix, arugula, grilled pineapple, cotija, radish, pepitas, citrus vinaigrette 14 $ Vegetable Hash* Roasted sweet potatoes, yukon potatoes, Brussels sprouts, roasted tomatoes, arugula, Harissa yogurt, aji verde, two local farm eggs 20 $ Fruit Platter Chef's selection of seasonal fruit, mango yogurt, granola 20 $ On The Sweeter Side Blueberry Waffle Lemon curd, blueberry compote, coconut whipped cream, maple syrup 15 $ Baked French Toast Painkiller custard, fresh pineapple, toasted coconut, powdered sugar 15 $ Brunch Plates Shrimp & Grits* Anson Mills pencil cob grits, ancho rubbed shrimp, chorizo, roasted cherry tomato, cream sauce, scallion 24 $ Wood Grilled Avocado Bowl* Crisp smashed potatoes, two local farm eggs, tomatillo salsa verde, roasted cherry tomato, cotija cheese 21 $ Breakfast Fried Rice* Sushi rice, crispy maple glazed pork belly, scallion, sunnyside egg, miso sauce, sriracha 22 $ Shakshuka* Spiced tomato marinara, chickpeas, sunnyside egg, feta cheese, aji verde, focaccia, simple salad 18 $ Torta Burger* 6 oz. beef patty, sour cream, lemon aioli, souscaille, cotija, havarti, avocado slaw, side of fries 22 $ Add an egg 2 $ Steak & Eggs* Wood fired sirloin filet, two local farm eggs, crisp smashed potatoes, salsa matcha negra 29 $ Mainlander* Crispy pork belly, pecan-smoked bacon, Anson Mills pencil cob grits, two eggs your way, seasonal fruit 21 $ Shrimp Roll* Chilled grilled local shrimp, sambal aioli, peppers, simple salad, side of fries 20 $ A La Carte Rustic Sourdough 5 $ Pecan Smoked Bacon 6 $ Crisp Smashed Potatoes 6 $ Two Local Farm Eggs (any way) 8 $ Anson Mills Pencil Cob Grits 6 $ Wood Grilled Avocado 6 $ 1/2 Grapefruit 5 $ Berry Bowl 8 $ Tropical Fruit Bowl 8 $ Share Plates Spreads Whipped feta, sikil pak, seasonal veggies, naan 18 $ Crispy Brussels Sumac yogurt, sweet chili garlic, mixed herbs 14 $ Street Corn Salad* Grilled corn, arugula, cilantro, cotija, chiles, citrus vinaigrette 15 $ Crispy Calamari* Yuzu aioli, crispy lemon, sriracha, mixed herbs 16 $ Mussels* Tom Kha broth, Fresno chiles, chili crunch, mixed herbs, sourdough 19 $ Grilled Pork Ribs* Miso, black vinegar, Anson Mills benne seeds, herbs 16 $ Garlic Butter Shrimp* Sriracha, lemon, white wine, fresh cilantro, grilled foccacia 18 $ Mojo Pork Flatbread Shakshuka, fontina, pineapple salsa, pickled red onions, sambal, arugula salad 19 $ Burrata Toast Butternut squash puree, lardons, roasted tomato bruschetta, arugula, balsamic vinaigrette 18 $ Add a wood-grilled protein: Shrimp* +8 - Salmon* +9 - Tuna* +11 - Chicken* +7 Salads Caribbean Salad Local bibb mix, arugula, grilled pineapple, cotija, radish, pepitas, citrus vinaigrette 14 $ Local Greens* Local bibb mix, crispy chickpeas, roasted red pepper, feta, cucumber, cured egg, honey-sriracha vinaigrette 15 $ Wood Fired Romaine* Grilled romaine hearts, Bayley Hazen blue cheese, heirloom tomatoes, lardons, cured egg, pepitas, herb dressing 16 $ Micro green simple salad, teriyaki & miso sauce Sushi Wraps Sullivan's* Tuna, cucumber, mango, avocado, sambal, sesame 19 $ Isle of Palms* Salmon, cucumber, avocado, crispy shallot, cream cheese 20 $ Folly* Shrimp, mango, pineapple, cilantro stems 18 $ Add a protein: Tuna* +11 - Salmon* +9 - Hamachi* +12 - Chilled Shrimp* +8 Poke Aloha* Sushi rice, cucumber, avocado, radish, hemp seed, Aleppo pepper, soy, sambal aioli 16 $ Tropical* Sushi rice, mango, pineapple, cucumber, radish, scallion, pineapple-soy, sesame, passion fruit aioli 18 $ Isla Verde Local greens, cucumber, edamame, avocado, scallion, pepitas, soy, furikake 17 $ Vietnamese Rice noodles, mint, cilantro, Thai basil, avocado, chili lime cashews, nuoc chom 19 $ Shellfish + Fish Offshore Pan Seared Scallops* Cauliflower puree, kale, Raven Farms mushrooms, lardons, sunflower seeds, hot honey, sage 38 $ Grilled Salmon* Wood-grilled salmon, vermicelli, Napa cabbage, Raven Farms mushrooms, radish, chili crunch 32 $ Seared Yellowfin Tuna* Thai coconut broth, apricot, couscous, carmelized onions, lemon, Fresno oil 31 $ Wood Grilled Octopus* Crispy smashed potatoes, broccolini red pepper romesco, pickled peppers, capers, lemon oil 30 $ Dayboat* Chef's market selection and daily inspiration MP Whole Fish* Chef's market selection and daily inspiration MP Poultry + Meats Onshore Chicken Pad Thai* Vermicelli, Napa cabbage, bell pepper, carrot, scallion, peanut tamarind glaze 28 $ Add Shrimp* 10 $ Berkwood Farms Bone-In Pork Chop* Miso glazed crispy Brussels sprouts, benne seed, parsnip puree, maple apple glaze 35 $ Surf & Turf* 6 oz. tenderloin, sautéed shrimp, grilled broccolini, butterbean puree, pepper chimichurri 45 $ New York Strip* 12 oz. NY Strip, butternut puree, herb roasted carrots, smashed crispy potatoes, pepper agrodolce 55 $ Sides Fried Smashed Fingerlings 9 $ Brussels Sprouts 9 $ Broccolini 9 $ Herb Roasted Carrots 9 $ Caribbean Salad 6 $ Sushi Rice 5 $ Dessert Coconut Crème Brûlée Creamy coconut custard, brûléed sugar, fresh strawberries, toasted coconut 12 $ Guave Cheesecake Delicate graham cracker crust, whipped guava cheesecake filling, gauva & coconut gel topping 14 $ S'mores Cookie Skillet Gooey chocolate chip cookie, scoop of homemade toasted marshmallow ice cream, chocolate drizzle, graham cracker 14 $ House Made Ice Cream & Sorbet Vanilla, coconut, toasted marshmallow, rotating seasonal ice cream, acai sorbet 8 $ Add chocolate sauce, toasted coconut, pecans, fresh berries + 1 $ Dessert Cocktails Frozen Painkiller Dark rum, pineapple, coconut cream, orange juice, nutmeg 13 $ Pusser's Rum Floater 3 $ Espresso Martini Espresso infused vodka, cold brew coffee, espresso liqueur 13 $ Affogato Choice of ice cream topped with a shot of hot espresso 10 $ Add house bourbon, rum or Irish cream + 5 $ Served with mignonette, citrus, house cocktail, house hot sauce Raw Oysters Canada Medium, Medium Salinity 1/2 Doz. 18 $ Dozen 36 $ Northeast US Medium, High Salinity 1/2 Doz. 18 $ Dozen 36 $ Southeast US Medium, Medium Salinity 1/2 Doz. 18 $ Dozen 36 $ South Carolina (local) Medium, Medium Salinity 1/2 Doz. 18 $ Dozen 36 $ Served with mignonette, citrus, yuzu aioli, house hot sauce, Caribbean crisps Raw Platters Shortboard Tuna poke, daily ceviche, 1/2 lb. peel & eat shrimp, 1/2 doz. daily raw oyster 75 $ Longboard Tuna poke, daily ceviche, smoked fish spread, 1 lb. peel & eat shrimp, 1 doz. daily raw oyster 105 $ Oysters & Others Oyster Shooter* Raw oyster, salt rim, house cocktail per each 8 $ Dressed Oyster* Seasonal ingredients per each 5 $ Peel & Eat Shrimp 1/2 lb. shrimp, yuzu aioli, house cocktail, lemon 18 $ Grilled Oysters Rotating preparation 1/2 Doz. 24 $ Dozen 48 $ Smoked Fish Spread Radish, tajin, dill, chives, Caribbean crisps 16 $ Jumbo Lump Crab Salad Citrus aioli, arugula, avocado, Caribbean crisps 23 $ Fresh Catch Ceviche* Pineapple aguachile, mango, red bell pepper, onion, cilantro, coconut cream, Caribbean crisps 19 $ Weekends 3 PM - 5 PM *Rotating oyster selection Salad Caribbean Salad Local bibb mix, arugula, grilled pineapple, cotija, radish, pepitas, citrus vinaigrette 14 $ Local Greens* Local bibb mix, crispy chickpeas, roasted red pepper, feta, cucumber, cured egg, honey-sriracha vinaigrette 15 $ Wood Fired Romaine* Grilled romaine hearts, Bayley Hazen blue cheese, heirloom tomatoes, lardons, cured egg, pepitas, herb dressing 16 $ Teriyaki & miso sauce Sushi Wraps Sullivan's* Tuna, cucumber, mango, avocado, sambal, sesame 19 $ Isle of Palms* Salmon, cucumber, avocado, crispy shallot, cream cheese 20 $ Folly* Shrimp, mango, pineapple, cilantro stems 18 $ Poke Aloha* Sushi rice, cucumber, avocado, radish, hemp seed, Aleppo pepper, soy, sambal aioli 16 $ Tropical* Sushi rice, mango, pineapple, cucumber, radish, scallion, pineapple-soy, sesame, passion fruit aioli 18 $ Isla Verde Local greens, cucumber, edamame, avocado, scallion, pepitas, soy, furikake 17 $ Vietnamese Rice noodles, mint, cilantro, Thai basil, avocado, chili lime cashews, nuoc chom 19 $ Served with mignonette, citrus, house cocktail, house hot sauce, yuzu aioli, Caribbean crisps Raw Seafood Platters Shortboard Tuna poke, daily ceviche, 1/2 lb. peel & eat shrimp, 1/2 doz. daily raw oyster 75 $ Longboard Tuna poke, daily ceviche, smoked fish spread, 1 lb. peel & eat shrimp, 1 doz. daily raw oyster 105 $ Raw Bar & Etc. Raw Oysters* Served with mignonette, citrus, house cocktail, house hot sauce 1/2 Dozen 12 $ 1 Dozen 24 $ Grilled Oysters 1/2 Dozen 12 $ 1 Dozen 24 $ Oyster Shooter* Raw oyster, salt rim, house cocktail per ea. 8 $ Dressed Oyster* Raw oyster, seasonal ingredients per ea. 5 $ Peel & Eat Shrimp 1/2 lb. shrimp, yuzu aioli, house cocktail, lemon 18 $ Fresh Catch Ceviche* Pineapple aguachile, mango, red bell pepper, onion, cilantro, coconut cream, Caribbean crisps 19 $ Smoked Fish Spread Radish, tajin, dill, chives, Caribbean crisps 16 $ Jumbo Lump Crab Salad Citrus aioli, arugula, avocado, Caribbean crisps 23 $ Beverage Specials Craft Cocktails LowCountry Creations & Longboard Legends 10 $ Frozen Cocktails 10 $ Draft Wine Glass 6 $ Carafe 20 $ Wine Bottle By the Glass Selections 1/2 off Local Beer Draft or Can 5 $ Miller High Life Pony 2 $ Well Liquors $2 off For our younger guests, ages 12 & under only. Available Saturday & Sunday, 10am - 3 pm Kids Brunch Scrambled Eggs & Bacon served with mixed fruit 10 $ Simple Avocado Toast 10 $ Waffle served with butter, syrup 8 $ Chicken Tenders & Fries 12 $ Fruit Bowl 6 $ Fries 4 $ Available weekdays 11am - 10pm, and weekends 3pm - 10pm. Kids Dinner Chicken Tenders & Fries 12 $ Grilled Steak & Fries 12 $ Quesadilla & Fries 10 $ Fruit Bowl 6 $ Fries 4 $ Frozen Legends Frozen Painkiller Dark rum, pineapple, coconut cream, orange juice, nutmeg 13 $ Add a Pusser's Rum Floater 3 $ Wadma-Law-Breaker Tequila, watermelon agua fresca, lime, basil agave, orange liqueur 15 $ Add a Tequila Floater 3 $ USUAL SUSPECTS Espresso Martini Espresso infused vodka, cold brew coffee, espresso liqueur 13 $ House Bloody Bloody Mary mix, choice of house liquor 12 $ House Mimosa Cava, choice of juice 12 $ Brunch Bubbles Bottle of Cava & choice of one juice carafe [Orange, Grapefruit, Cranberry, or Pineapple] 35 $ Additional Juices 5 $ DAYBREAK COCKTAILS Caffiend Vodka, brown sugar shaken espresso, vanilla liqueur, Irish cream 14 $ Cape Horn Reposado tequila, blood orange, lime, grand marnier, prosecco 14 $ Not So Jaded Light and coconut rum, matcha tea, falernum, vanilla foam 13 $ Kale Yeah Reposado tequila, ginger liqueur, kale, celery, cucumber, apple, lemon, pineapple, agave 14 $ Surf Diet House-made Bloody Mary mix, choice of house liquor, bacon, shrimp, olives, cheese, dill, celery 18 $ Pretty in Pink Gin, maraschino liqueur, cranberry, mint, grapefruit soda 14 $ Sullivan's 1040 Lavender infused gin, italicus, lemon, mint, cava 14 $ Sunshower Grilled lemon infused vodka, elderflower liqueur, cucumber-basil lemonade, celery bitters 13 $ Pear Pressure Pear-infused vodka, amaretto, lemon, honey 13 $ Chai Tide Dark rum, pomegranate liqueur, orange, lime, chai 13 $ FROZEN LEGENDS Frozen Painkiller Dark rum, pineapple, coconut cream, orange juice, nutmeg 13 $ Pusser's Rum Floater 3 $ Wadma-Law-Breaker Tequila, watermelon agua fresca, lime, basil agave, orange liqueur 15 $ Add a Tequila Floater 3 $ LONGBOARD LEGENDS Heart & Sol Grilled pineapple-serrano infused reposado tequila, grand marnier, pineapple, lime, honey 14 $ Sunshower Grilled lemon infused vodka, St. Germain, cucumber-basil lemonade, celery bitters 13 $ Smoke Signal Bourbon, lemon, mezcal, spiced honey, walnut bitters 14 $ Mi Boy Lilikoi Reposado tequila, mezcal, habanero, lime, passion fruit foam, chili-lime salt 14 $ Mellow Mule Vodka or bourbon, elder f lower liqueur, lemon grass ginger beer, lime, aromatic bitters 13 $ Sullivan's 1040 Lavender infused gin, italicus, lemon, mint, cava 14 $ False Horizon Tequila, blood orange, aperol, lime, mezcal, sage agave 14 $ LOWCOUNTRY CREATIONS Pretty in Pink Gin, maraschino liqueur, cranberry, mint, grapefruit soda 14 $ Apple a Day Reposado tequila, apple cider, allspice liqueur, apple brandy, lime, honey 14 $ Chai Tide Dark rum, pomegranate liqueur, orange, lime, chai 13 $ Pear Pressure Pear-infused vodka, amaretto, lemon, honey 13 $ Smashing Pumpkins Rye whiskey, pumpkin, spices, lemon, maple, pie crust rim 14 $ Longboard Shooters Frozen Painkiller Shot Mini frozen painkiller, Pusser's Navy Rum floater 7 $ Wadma-Law-Breaker Mini wadma-law-breaker, tequila floater 7 $ Oyster Shooter Vodka, Tequila or Mezcal 8 $ ON TAP The Tourist Rotating Non-Local Brew MKT 32°50° Kolsch Coast, Kolsch 7 $ White Thai Westbrook, Witbier 8 $ Park Circle Pale Ale Commonhouse, Pale Ale 8 $ 25 Island Wide Estuary Brewing, Hazy IPA 8 $ Coastal Lager Island, Lager 6 $ Rotational Sour Rotating Local Brew, Sour/Berliner 8 $ Sungazer Charles Towne Fermentor y, Haz y IPA 8 $ Rotating Quencher Low Tide, Seltzer 7 $ Lazy Lover Revelry, Blonde Ale 7 $ BY THE CAN Rotating Cider Rotating Brewery, Cider 7 $ Island Active Island, Light Lager 6 $ Munk Pils Munkle, Pilsner 7 $ Something Cold Edmund's Oast, Blonde Alve 16 oz. 8 $ Amber Ale Palmetto, American Amber Ale 7 $ Hive Another Indigo Reef, Honey Ale 7 $ NON ALCOHOLIC BEER & ETC. Upside Dawn Athletic Brewing, Golden Ale 7 $ Run Wild Athletic Brewing, IPA 7 $ Cerveza Athletica Athletic Brewing, Mexican Lager 7 $ Free Wave Athletic Brewing, Hazy IPA 7 $ Kombucha Dalai Sofia, Local, Canned Salty Ginger, Bucci Mane, Blue Magic, This Lil Peach, Jala Berry 7 $ ALTERNATIVE SELTZERS CBD Seltzer High Rise Bev Co. - Grapefruit or Lime 10 $ D9 Seltzer High Rise Bev Co., Mango, Blueberry, or Grapefruit 10 $ Please view our current wine list [glass and bottle pour options] in the document below. Download PDF NO ID NEEDED [no a.b.v.] I'm Driving Cucumber-basil lemonade, grapefruit soda 10 $ Anonymous Unanimous Lemon, spiced honey, lemongrass, ginger beer 10 $ You Have No Proof Blood orange, sage agave, lime, mint, soda 10 $ For All Ages Lemongrass Ginger-Beer House Made 6 $ Seasonal Soda House Made 6 $ Lemonade House Made 5 $ Coconut Water 5 $ All served with house made biscotti COFFEE & ESPRESSO Cold Brew 6 $ Drip Coffee 5 $ Espresso 5 $ Double Espresso 7 $ Americano 6 $ Cortado 6 $ Latte 7 $ Hot Tea International Breakfast [Black Tea], Jade Cloud [Green Tea], Tropical Coconut [Oolong], Peppermint Rooibos 5 $ Call (843) 868-8161 Reservations Email Signup Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location The Longboard | Seafood Restaurant in Sullivan's Island, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "be8753c8fce8",
      "downloadedAt": "2026-01-18T17:01:51.931Z",
      "trimmedAt": "2026-01-18T17:11:38.691Z",
      "sizeReduction": "91.9%"
    },
    {
      "url": "https://www.thelongboardsullivans.com/private-events/",
      "text": "Main content starts here, tab to start navigating Private Events Book an Event We love to celebrate! Whether you’re looking to host a large group, welcome party, rehearsal dinner, birthday party, engagement party, corporate event, or soiree... we can help! Private (full restaurant) or Semi-Private (porch only) parties are available with a minimum spend guarantee. For more information on pricing, or to discuss your event needs in detail, please contact our Event Manager using the form below - we’ll be in touch soon. Inquire Now Private | Full Buyout Reserve the entire restaurant for your private event![ Indoor + Outdoor + Bar ] All event pricing is based on a minimum spend guarantee + required minimum 20% gratuity. 125 Capacity: Semi-Private | Porch Buyout Reserve our outdoor covered patio for your event! The interior of the restaurant will be open to the public. All event pricing is based on a minimum spend guarantee + required minimum 20% gratuity. 25 Capacity: Inquire Now Call (843) 868-8161 Reservations Email Signup Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location The Longboard | Seafood Restaurant in Sullivan's Island, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Contact Us About Your Private Event Please, enter a valid email Email - Required Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid desired space/venue Desired Space/Venue - Required Desired Space/Venue Private | Full Buyout Semi-Private | Porch Buyout Company - Optional Please, enter a valid phone number Phone Number - Required Event Date - Required Please, enter a valid start time Start Time - Required Start Time 11:30 PM 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM 6:30 AM 6:00 AM 5:30 AM 5:00 AM 4:30 AM 4:00 AM 3:30 AM 3:00 AM 2:30 AM 2:00 AM 1:30 AM 1:00 AM 12:30 AM 12:00 AM Please, enter a valid end time End Time - Required End Time 11:30 PM 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM 6:30 AM 6:00 AM 5:30 AM 5:00 AM 4:30 AM 4:00 AM 3:30 AM 3:00 AM 2:30 AM 2:00 AM 1:30 AM 1:00 AM 12:30 AM 12:00 AM Please, enter a valid type of event Type of Event - Required Type of Event Alumni Bachelor / Bachelorette Birthday Cocktail Reception Corporate Lunch Engagement Fundraiser Graduation Holiday Meeting / Presentation Photo / Film Shoot Private Dinner Rehearsal Dinner Shower Sporting Event Wedding Other Please, enter a valid number of people Number of People - Required Additional Information - Optional Submit Please check errors in the form above Thank you for your inquiry. We’ll be in touch shortly. Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "f2d83391f847",
      "downloadedAt": "2026-01-18T17:01:51.387Z",
      "trimmedAt": "2026-01-18T17:11:38.705Z",
      "sizeReduction": "93.4%"
    }
  ],
  "sizeReduction": "93.0%"
}