{
  "venueId": "ChIJCxfWo0Rj_ogR9VxZgJqte6w",
  "venueName": "Sportsbook Cheesesteaks & Wings",
  "venueArea": "North Charleston",
  "website": "https://www.sportsbookofcharleston.com/",
  "scrapedAt": "2026-01-18T17:04:24.317Z",
  "trimmedAt": "2026-01-18T17:05:19.802Z",
  "pages": [
    {
      "url": "https://www.sportsbookofcharleston.com/drink-menu",
      "text": "× Are you sure you want to apply for a job at Sportsbook Cheesesteaks & Wings / Locations: Nexton & Tanger Yes No × Are you sure you want to apply for a job at Southern Roots Smokehouse / Locations: West Ashley & Park Circle Yes No Our Drinks We are updating our menu Please stay tuned",
      "hash": "2cecc26750d0",
      "downloadedAt": "2026-01-18T17:01:21.239Z",
      "trimmedAt": "2026-01-18T17:05:19.763Z",
      "sizeReduction": "99.6%"
    },
    {
      "url": "https://www.sportsbookofcharleston.com/food-menu",
      "text": "× Are you sure you want to apply for a job at Sportsbook Cheesesteaks & Wings / Locations: Nexton & Tanger Yes No × Are you sure you want to apply for a job at Southern Roots Smokehouse / Locations: West Ashley & Park Circle Yes No Our Menu Sportsbook Cheesesteaks & Wings Catering Menu Nexton Drink Menu Tanger Drink Menu",
      "hash": "6899b75ae9a1",
      "downloadedAt": "2026-01-18T17:01:20.601Z",
      "trimmedAt": "2026-01-18T17:05:19.769Z",
      "sizeReduction": "99.8%"
    },
    {
      "url": "https://www.sportsbookofcharleston.com/specials",
      "text": "× Are you sure you want to apply for a job at Sportsbook Cheesesteaks & Wings / Locations: Nexton & Tanger Yes No × Are you sure you want to apply for a job at Southern Roots Smokehouse / Locations: West Ashley & Park Circle Yes No Specials Tuesday January 20th Two for Tuesday! Two Cheesesteak Tacos for $6 & $6 Margaritas. 11:00 AM - 09:00 PM Wednesday January 21st Wicked Wing Wednesday! Half-priced bone-in wings & $6 Wicked Weed Pints. 11:00 AM - 09:00 PM",
      "hash": "c72750be88c4",
      "downloadedAt": "2026-01-18T17:01:21.895Z",
      "trimmedAt": "2026-01-18T17:05:19.772Z",
      "sizeReduction": "99.4%"
    },
    {
      "url": "https://www.sportsbookofcharleston.com/",
      "text": "× Are you sure you want to apply for a job at Sportsbook Cheesesteaks & Wings / Locations: Nexton & Tanger Yes No × Are you sure you want to apply for a job at Southern Roots Smokehouse / Locations: West Ashley & Park Circle Yes No × Order your favorite dishes in seconds! Order Online Catering - Cater your birthday party, holiday party, corporate events, wedding festivities and more! Catering Packages Catering - Cater your birthday party, holiday party, corporate events, wedding festivities and more! Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! Job Listings Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! NFL Playoffs - Come watch the NFL Playoffs with us! Upcoming Events NFL Playoffs - Come watch the NFL Playoffs with us! ABOUT US Welcome to SportsBook of Charleston SportsBook of Charleston has a Vegas-style viewing experience with top-quality food & drinks. check our menu slideshow start stop playing Slide 1 content Slide 2 content Slide 3 content Slide 4 content previous slide next slide Plates, Pints & Playmakers Big flavors. Cold drinks. No bad plays. Our Menu Great deals, cold drinks & big flavor all specials There's always something happening here events Fast, fresh, and ready when you are Nexton order from Tanger order from Catering with a Kick Let Us Handle The Food—You Focus On The Fun Want Something Custom? We cater to your needs. Book a catering with us and make sure people talk about your event for a long time! Catering ORDER ONLINE Pick up or get Delivered Some of the specialties to be enjoyed - Cheesesteaks & Hoagies, Chicken Wings, Hamburgers, and Local Beverages. Order online now! NEXTON order from TANGER order from Bring the Crew Your Favorite Bar, Your Favorite People Looking for the ultimate spot to host your next party? We have the space, the screens, and the snacks to keep your crew happy from kickoff to last call. book a party RESERVATIONS Walk-Ins Welcome, But Reservations Recommended Big group? Special occasion? Just want to skip the wait? Make a reservation and we'll have your table ready. book a table Skip Photo Gallery Reviews Start stop reviews carousel Review by - Google Matthew A: five star review by Big Money Maker with fries and beer was an excellent choice for dinner. Bartender was attentive, food was excellent, beer was cold and ambiance was laid back with plenty of screens to watch. Always my go to place when I'm in North Charleston. Review by - Google JR D: five star review by Absolutely a sweet place to dine! Our waitress was friendly and informative. We had salad (huge) and wings. Wings were the real deal. Try something besides a chain! Review by - Google Crystal S: five star review by Great spot! After 10, they close the grill and only have fried food. Wings are awesome! Review by - Google Ha D: five star review by Good food, good price and good drink. Good place to hang out and watch sports. Staff are friendly. Newsletter Location Tanger: 4950 Centre Pointe Drive. North Charleston, SC 29418 | Phone (843) 745-9555 Nexton: 600 Nexton Square Dr 300, Summerville, SC 29486 | Phone (843) 419-6648 Find us on Facebook page Instagram page Google page Hours Sun, Mon, Tue, Wed, Thur, Fri, Sat : 11:00 AM - 2:00 AM Contact us (843)-745-9555 Call us at travis@lucky17restaurants.com Write us at Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "d6bd38194117",
      "downloadedAt": "2026-01-18T17:01:20.412Z",
      "trimmedAt": "2026-01-18T17:05:19.798Z",
      "sizeReduction": "98.3%"
    },
    {
      "url": "https://www.sportsbookofcharleston.com/events",
      "text": "× Are you sure you want to apply for a job at Sportsbook Cheesesteaks & Wings / Locations: Nexton & Tanger Yes No × Are you sure you want to apply for a job at Southern Roots Smokehouse / Locations: West Ashley & Park Circle Yes No Events We are updating our events Please stay tuned",
      "hash": "dd9ca8741aa0",
      "downloadedAt": "2026-01-18T17:01:22.550Z",
      "trimmedAt": "2026-01-18T17:05:19.802Z",
      "sizeReduction": "99.6%"
    }
  ],
  "sizeReduction": "99.2%"
}