{
  "venueId": "ChIJUSR9bC17_ogRGmCNmINXPn8",
  "venueName": "PC Caribbean Delight",
  "venueArea": "North Charleston",
  "website": "http://pccaribbeandelight.com/",
  "scrapedAt": "2026-01-18T17:04:26.720Z",
  "trimmedAt": "2026-01-18T17:08:03.870Z",
  "pages": [
    {
      "url": "http://pccaribbeandelight.com/specials",
      "text": "Specials Tuesday January 20th kids eat free! 04:00 PM - 06:00 PM",
      "hash": "05f737073cca",
      "downloadedAt": "2026-01-18T17:00:20.035Z",
      "trimmedAt": "2026-01-18T17:08:03.844Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "http://pccaribbeandelight.com/food-menu",
      "text": "Our Menu Main Menu Lunch & Dinner Specials",
      "hash": "0cc385623ffd",
      "downloadedAt": "2026-01-18T17:00:18.741Z",
      "trimmedAt": "2026-01-18T17:08:03.848Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://pccaribbeandelight.com/drink-menu",
      "text": "Our Drinks We are updating our menu Please stay tuned",
      "hash": "17d2aaf9d828",
      "downloadedAt": "2026-01-18T17:00:19.379Z",
      "trimmedAt": "2026-01-18T17:08:03.850Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "http://pccaribbeandelight.com/",
      "text": "× Did you know we do catering? Whatever your occasion, however big or small, we have the perfect options to choose from. Cater your birthday party, holiday party, corporate events, wedding festivities and more! Catering Packages × Order your favorite dishes in seconds! Order Online × Turn moments into memories! Choose us for your next special occasion or get-together. Got a birthday party, rehearsal dinner, corporate or other event coming up? We're a great option for your gathering! Inquire today and let us know how we can make your special occasion perfect! Book your party PC Caribbean Delight - North Charleston, SC Order online Your favorite dishes, just a click away Browse our menu, customize your order, and enjoy fresh flavors delivered straight to your door - or ready for quick pickup. DoorDash Uber Eats groups & parties Celebrate together with great food From birthdays and anniversaries to family gatherings and casual get-togethers, our space is designed to bring people together. We offer flexible seating arrangements, group-friendly menus, and a welcoming atmosphere that makes every occasion feel special. parties catering Fresh flavors for every occasion From intimate gatherings to large celebrations, our catering services bring the taste of our kitchen straight to your event. We offer a variety of menu options that can be customized to suit your guests' preferences, dietary needs, and the style of your occasion. Our team handles the details. catering Specials ALL SPECIALS slideshow start stop playing Slide 1 content Slide 2 content previous slide next slide Celebrate together with great food! parties Fresh flavors for every occasion! catering Skip Photo Gallery Reviews Start stop reviews carousel Review by - Google james: five star review by This food right here is top tier! I've never had ox tails until tonight and I wasn't sure what to expect but trust me they didn't disappoint. I even danced while I ate! Review by - Google Marica -: five star review by In the Charleston area, and looking for authentic Caribbean food comes to Caribbean Delight. Some of the best oxtail I have tasted in a long time, the rice and peas cooked to perfection. The curry goat was tender, and plantains were delicious. The staff was friendly and the food was ready quickly. Review by - Google jason: five star review by Had a taste for oxtails for so long I had to make the 1.5 hour drive. I ordered the large oxtail plate with cabbage, rice and peas. All of it was so delicious. I was full as a tick when I was done. I 100% recommend and will be back soon. Review by - Google That W: five star review by Stopped by here about a month ago with a friend and at first I was skeptical but let me tell you the food was delicious. Customer service was good as well. I've been back twice since then....try the jerk chicken. Review by - Google Edward S: five star review by Small place but big food favors and excellent service and everything was great enjoyed my food only regret that I didn't get a extra to go. Newsletter Location 3309 Rivers Ave North Charleston, SC 29405 Hours Mon, Tue, Wed, Thur, Fri, Sat 11:00 AM - 8:00 PM Find us on... Facebook page Instagram page Google page Contact us (843)-974-4825 Call us at melodeendavis@gmail.com Write us at Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "76328b1b7d0f",
      "downloadedAt": "2026-01-18T17:00:18.618Z",
      "trimmedAt": "2026-01-18T17:08:03.868Z",
      "sizeReduction": "97.8%"
    },
    {
      "url": "http://pccaribbeandelight.com/events",
      "text": "Events We are updating our events Please stay tuned ×",
      "hash": "a95d36e09f49",
      "downloadedAt": "2026-01-18T17:00:20.679Z",
      "trimmedAt": "2026-01-18T17:08:03.870Z",
      "sizeReduction": "99.9%"
    }
  ],
  "sizeReduction": "99.3%"
}