{
  "venueId": "ChIJGfGOI1R-_ogRKTMTZ2FVgOs",
  "venueName": "Seanachai Whiskey & Cocktail Bar",
  "venueArea": "West Ashley",
  "website": "http://www.seanachaiwhiskeyandcocktailbar.com/",
  "scrapedAt": "2026-01-19T03:25:40.039Z",
  "trimmedAt": "2026-01-19T03:26:46.403Z",
  "pages": [
    {
      "url": "http://www.seanachaiwhiskeyandcocktailbar.com/",
      "text": "[Page Title: Home - SeanachaiComments Box SVG icons]\n\nWE'RE GLAD YOU'RE HERE A Traditional Pub with a Twist on Johns Island ABOUT \nSeanachai\n\nWhiskey & Cocktail Bar\n\nTraditional pub setting with Charleston’s largest selection of fine whiskeys, creative cocktails, friendly staff, delicious food, plenty of beers on tap, and great conversation. No TVs here, folks. Big patio out back with darts, our living herb garden, plenty of tables and a cozy firepit for those chilly nights. Brunch on Sundays! Live music on select dates [usually Saturday evenings]. Check out our for our music schedule, and follow us on Instagram for daily specials, musicians, and local happenings.\nevents \nWe're Glad You're Here!\nDELICIOUS \nFood & Drinks\n\nPub fare that’s anything but ordinary\nWe’ve got everything from your favorite Irish Classics to our award-winning classic “Best Burger in Charleston.” We source as much as we can from local farmers, purveyors, and artisans to create one of the most unique, chef-driven Pub menus around. Whether you’ve got the urge for a basket of Fish and Chips (or tots), one of our local Oyster Mushroom Flatbreads, or a juicy burger to go along with your Mule, Dram, or Pint – we’ve got you covered. Check our social media for the most current menus, food and drink specials, and more! Menus facebook Instagram MUSIC & EVENTS \nLive Music\n\nDon't miss these upcoming events!\n\nWe’ve got local artists some Mondays and most Wednesdays, Fridays and Saturdays. We’ve got local legends and up-and-coming artists alike. Check out our music schedule and come support some amazing local talent at Seanachai.\nComments Box SVG icons Used for the like, share, comment, and reaction icons \nProblem displaying Facebook posts. Backup cache in use.\nThis message is only visible to admins. \n(#200) Provide valid app ID\n OAuthException\nError: Type: \nNo upcoming events\nVIEW ALL EVENTS \nJoin the Seanachai Whiskey Club Email List",
      "hash": "cf43c4d98320",
      "downloadedAt": "2026-01-19T02:17:41.576Z",
      "trimmedAt": "2026-01-19T03:26:46.403Z",
      "sizeReduction": "98.7%"
    }
  ],
  "sizeReduction": "98.7%"
}