{
  "venueId": "ChIJ00017lZj_ogRP3gQTdUsxEA",
  "venueName": "Waffle House",
  "venueArea": "North Charleston",
  "website": "https://locations.wafflehouse.com/northcharleston-sc-440",
  "scrapedAt": "2026-01-19T02:19:30.448Z",
  "trimmedAt": "2026-01-19T02:19:50.422Z",
  "pages": [
    {
      "url": "https://locations.wafflehouse.com/northcharleston-sc-440",
      "text": "[Page Title: Waffle House #440<!-- --> - <!-- -->NORTH CHARLESTON<!-- -->, <!-- -->SC]\n\nBACK TO LIST\n\nWaffle House #440\n\n4755 SAUL WHITE BLVD,\n\nNORTH CHARLESTON, SC 29418\n(843) 744-1814 \nMonday - Sunday\n\n24 hours\n\nGet directions\n\nOrder now\n\nOnline Ordering\n\nOrder from a location near you!\n\nOrder now\n\nWaffle House Gifts & Merchandise\n\nOfficial Waffle House branded apparel and products including; Waffle House t-shirts, sweatshirts, sunglasses, masks, Coffee, Waffle mix, and more!\n\nShop now\n\nBecome A Waffle House Regular\n\nAre you a Waffle House Regular? Make it official by joining our e-mail club to get coupons, news and other fun stuff in your inbox!\n\nJoin now\n\nOur Story\n\nHeadquartered in Norcross, GA, Waffle House restaurants have been serving Good Food Fast® since 1955. Today the Waffle House system operates more than 1,900 restaurants in 25 states and is the world's leading server of waffles, t-bone steaks, hashbrowns, cheese 'n eggs, country ham, pork chops and grits.\n\nWaffle House Catering\n\nThe Waffle House Catering Team can Scatter, Smother & Cover® your school function, birthday party, wedding, corporate gathering or any other event you can dream up! We have a variety of options available for you to get a real Waffle House Experience! These could include food items delivered directly to you; on-site food stations that serve waffles, hashbrowns and/or other delicious items; or even a visit by the Waffle House food truck (Food Truck only serves the greater Atlanta area). We are happy to work with you to deliver a unique experience for your guests. Capabilities and menus may vary by market.\n\nRequest catering form\n\nContact Us\n\nHow can we serve you today?\n\nCONTACT US\n\nOperated by: WAFFLE HOUSE, INC",
      "hash": "e562038ce533",
      "downloadedAt": "2026-01-19T02:16:10.629Z",
      "trimmedAt": "2026-01-19T02:19:50.422Z",
      "sizeReduction": "98.6%"
    }
  ],
  "sizeReduction": "98.6%"
}