{
  "venueId": "ChIJgzTeIedj_ogRKSClP0RCWUQ",
  "venueName": "Topgolf Charleston",
  "venueArea": "North Charleston",
  "website": "https://topgolf.com/us/charleston/",
  "scrapedAt": "2026-01-19T02:19:36.549Z",
  "trimmedAt": "2026-01-19T02:26:05.311Z",
  "pages": [
    {
      "url": "https://topgolf.com/us/charleston/",
      "text": "[Page Title: Golf, Party Venue, Sports Bar & Restaurant | Topgolf CharlestonTopgolf Logo ShieldTopgolf Logo Horizontal]\n\nSkip to Content View Gallery Virtual Tour \nCharleston\nTopgolf Favorite Plan a Visit Pricing Promotions \nGet exclusive offers and info! Sign up for Topgolf Charleston .\nemail and text updates \nTopgolf\n\nPhone\n(854) 895-4034 \nAddress\n\n,\n5000 Topgolf Way North Charleston SC 29418 Directions \nHours\nMon-Thurs: 9AM - 11PM Fri-Sat: 9AM - 1AM Sun: 9AM - 12AM \nSpecial Hours\n\nJan 25: 9AM - 5PM\nPopular Times Toggle \nAnyone under 16 must be supervised by a Guest 21+ at all times. Anyone under 18 must be supervised by a Guest 21+ after 9PM.\nAGE POLICY: \nFeatures & Amenities\nTopgolf 2 floors 70+ all-weather bays Toptracer games 28-foot video wall and 200+ HDTVs Free Wi-Fi Rooftop terrace with fire pits Private event spaces Bar & restaurant 9-hole mini golf course Golf Lessons View Virtual Tour \nAbout Topgolf Charleston\n\nWelcome to Topgolf Charleston, the premier entertainment destination in North Charleston, SC. Enjoy year-round comfort in our hitting bays with cooling fans in the summer and heated bays in the winter, all with HDTVs in every bay and throughout our . Using our complimentary clubs or your own, take aim at the giant outfield targets and our high-tech balls will score themselves.\nsports bar and restaurant Read More Change Day to \nSunday\nPricing Per Bay at Topgolf Charleston \nWhat is a bay?\n\nPrices are per hour, per hitting bay. Each bay can fit up to 6 players,\nso bring your friends and split the cost 6 ways! \nPrices do not include sales tax.\n$6 one-time member fee required for new players. \nFind your way to play\nPlan a Visit How to Play \nPromotions & News\nat Topgolf Charleston \nWinter Play Days\n\nPlay anytime Monday - Thursday and enjoy a locked-in low hourly price per bay!\n\nSunday Funday\n\nSkip the chores and come by for some high-scoring fun $40/hr all day every Sunday.\n\nTopgolf Nights\n\nWhen we drop prizes, beats and the price, a night out at Topgolf might cost less than ordering takeout!\nView All Promos \nMake Your Event\nMore Eventful \nRain or shine, day or night, make your next party or group event more eventful at Topgolf Charleston. We offer versatile event catering packages perfect for your next birthday party, company event or social get-together!\nParties & Events Chat",
      "hash": "155fc41d4b7b",
      "downloadedAt": "2026-01-19T02:16:10.352Z",
      "trimmedAt": "2026-01-19T02:26:05.133Z",
      "sizeReduction": "97.0%"
    },
    {
      "url": "https://topgolf.com/us/locations/",
      "text": "[Page Title: US Locations | TopgolfTopgolf Logo ShieldTopgolf Logo Horizontal]\n\nSkip to Content Search For Venue Search \nSelect Venue\nChange Location Choose Venue AL - Birmingham AL - Huntsville AL - Mobile AR - Little Rock AR - Northwest Arkansas - Rogers AZ - Phoenix - Gilbert AZ - Phoenix - Glendale AZ - Phoenix - Scottsdale AZ - Tucson - Marana CA - Los Angeles - El Segundo CA - Los Angeles - Montebello CA - Los Angeles - Ontario CA - Sacramento - Roseville CA - San Francisco - Burlingame CA - San Jose CO - Colorado Springs CO - Denver - Centennial CO - Denver - Thornton FL - Fort Myers FL - Jacksonville FL - Lake Mary FL - Miami - Doral FL - Miami Gardens FL - Orlando FL - Panama City Beach FL - Pompano Beach FL - St. Petersburg FL - Tampa GA - Atlanta - Alpharetta GA - Atlanta - Buford GA - Atlanta - Midtown GA - Augusta IA - Des Moines ID - Boise IL - Chicago - Naperville IL - Chicago - Schaumburg IN - Indianapolis - Fishers KS - Kansas City - Overland Park KS - Wichita KY - Louisville LA - Baton Rouge LA - Lafayette MA - Boston - Canton MD - Baltimore MD - D.C. - Germantown MD - D.C. - National Harbor MI - Detroit - Auburn Hills MN - Minneapolis - Brooklyn Center MN - Minneapolis - Woodbury MO - St. Louis - Chesterfield MO - St. Louis - Midtown MS - Ridgeland NC - Charlotte - Southwest NC - Charlotte - University NC - Durham NC - Greensboro NE - Omaha NJ - Edison NJ - Mount Laurel NM - Albuquerque NV - Las Vegas NY - Long Island - Holtsville OH - Akron OH - Avon OH - Cincinnati - West Chester OH - Cleveland OH - Columbus OK - Oklahoma City OR - Portland - Hillsboro PA - King of Prussia PA - Philadelphia PA - Pittsburgh RI - Rhode Island SC - Charleston SC - Greenville SC - Myrtle Beach TN - Chattanooga TN - Knoxville TN - Memphis TN - Nashville TX - Austin TX - Bryan TX - DFW - Allen TX - DFW - Dallas TX - DFW - Fort Worth TX - DFW - Grand Prairie TX - DFW - The Colony TX - El Paso TX - Houston - Katy TX - Houston - Spring TX - Houston - Webster TX - McAllen - Pharr TX - New Braunfels TX - San Antonio TX - Waco UT - Salt Lake City UT - Vineyard VA - D.C. - Loudoun VA - Richmond VA - Virginia Beach WA - Seattle - Renton Go View all Locations \nTopgolf Locations\nnearest to you \nLoading\nChat",
      "hash": "74f73b021519",
      "downloadedAt": "2026-01-19T02:16:13.301Z",
      "trimmedAt": "2026-01-19T02:26:05.194Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "https://topgolf.com/us/charleston/menu/",
      "text": "[Page Title: Food and Drink Menu & Nutritional Info | Topgolf CharlestonTopgolf Logo ShieldTopgolf Logo Horizontal]\n\nSkip to Content \nTopgolf Menu\n\nFuel Your Play.\n\nWe put a lot of work into the food and drinks you enjoy between swings at Topgolf. Our chefs spend their days and nights dishing out everything from delicious classics to unique treats you can only find here, so be sure to come hungry.\nSelect your venue to view complete menu and pricing Choose Location Choose Venue AL - Birmingham AL - Huntsville AL - Mobile AR - Little Rock AR - Northwest Arkansas - Rogers AZ - Phoenix - Gilbert AZ - Phoenix - Glendale AZ - Phoenix - Scottsdale AZ - Tucson - Marana CA - Los Angeles - El Segundo CA - Los Angeles - Montebello CA - Los Angeles - Ontario CA - Sacramento - Roseville CA - San Francisco - Burlingame CA - San Jose CO - Colorado Springs CO - Denver - Centennial CO - Denver - Thornton FL - Fort Myers FL - Jacksonville FL - Lake Mary FL - Miami - Doral FL - Miami Gardens FL - Orlando FL - Panama City Beach FL - Pompano Beach FL - St. Petersburg FL - Tampa GA - Atlanta - Alpharetta GA - Atlanta - Buford GA - Atlanta - Midtown GA - Augusta IA - Des Moines ID - Boise IL - Chicago - Naperville IL - Chicago - Schaumburg IN - Indianapolis - Fishers KS - Kansas City - Overland Park KS - Wichita KY - Louisville LA - Baton Rouge LA - Lafayette MA - Boston - Canton MD - Baltimore MD - D.C. - Germantown MD - D.C. - National Harbor MI - Detroit - Auburn Hills MN - Minneapolis - Brooklyn Center MN - Minneapolis - Woodbury MO - St. Louis - Chesterfield MO - St. Louis - Midtown MS - Ridgeland NC - Charlotte - Southwest NC - Charlotte - University NC - Durham NC - Greensboro NE - Omaha NJ - Edison NJ - Mount Laurel NM - Albuquerque NV - Las Vegas NY - Long Island - Holtsville OH - Akron OH - Avon OH - Cincinnati - West Chester OH - Cleveland OH - Columbus OK - Oklahoma City OR - Portland - Hillsboro PA - King of Prussia PA - Philadelphia PA - Pittsburgh RI - Rhode Island SC - Charleston SC - Greenville SC - Myrtle Beach TN - Chattanooga TN - Knoxville TN - Memphis TN - Nashville TX - Austin TX - Bryan TX - DFW - Allen TX - DFW - Dallas TX - DFW - Fort Worth TX - DFW - Grand Prairie TX - DFW - The Colony TX - El Paso TX - Houston - Katy TX - Houston - Spring TX - Houston - Webster TX - McAllen - Pharr TX - New Braunfels TX - San Antonio TX - Waco UT - Salt Lake City UT - Vineyard VA - D.C. - Loudoun VA - Richmond VA - Virginia Beach WA - Seattle - Renton Go \nExplore Some of Topgolf’s\nBest Food \nOur menu has pages of delicious food and drinks, and some of our favorites are below. From vegetarian and gluten-free options to donut holes, our menu caters to almost every taste. Treat yourself to something new or get a shareable for your whole crew. Then, top it off with one of our specialty drinks and keep on playing.\n\nLimited Time\n\nFan Zone Faves\nLearn More \nFried Chicken Heat-wich\n\nWinter Flavorland\nLearn More \nTopgolf Donut Holes-In-One\n\nMenu selections are subject to availability and may vary by venue.\n\nFrequently Asked\nQuestions \nDo you have any vegetarian options?\n\nYes, several items on our menu are vegetarian or can be modified to be vegetarian:\n\nCheesy Macaroni Bites without sauce\n\nWarm Pretzel Bites\n\nQueso Blanco & Chips\n\nFiesta Nachos\n\nMediterranean Trio\n\nCheese Flatbread\n\nFarmhouse Flatbread\n\nFrench Fries\n\nTater Tots\n\nTopgolf Donut Hole-In-Ones\n\nCookie Crumble Sundae\n\nKids Grilled Cheese\n\nSub a Black Bean Patty on any of our burgers.\nModifications: \nDo you have any gluten-friendly options?\n\nItems that are or can be modified to be gluten-friendly:\n\nQueso Blanco & Chips\n\nBuffalo Chicken Dip without Cheddar Jack Topping\n\nAny flatbread with Sub a Gluten-Friendly Crust\n\nTres Tacos (Mushroom, Chicken, Shrimp, Steak)\n\nAll-American and Smokehouse Burgers with Gluten-Friendly Bun\n\nGrilled Chicken Sandwich with Gluten-Friendly Bun\n\nCobb Salad\n\nCheese Fries\n\nFrench Fries\n\nTater Tots\n\nDo you have any vegan options?\n\nYes, we have items on our menu that are vegan or can be modified to be vegan.\n\nCan I bring in my own food?\n\nWe do not permit outside food or beverage to be brought in due to health and safety practices. The only exception is for store bought cakes for birthdays or other celebrations.\n\nPLEASE NOTE: Products containing allergens and gluten are stored in this kitchen. Please be aware that there may be a chance of cross-contact so we cannot guarantee these products for those with a food allergy or celiac disease. Guests are advised to consider this information as it relates to their individual dietary needs and requirements. Before placing your order, please inform your server if a person in your party has a food allergy.Topgolf is committed to continuing toward our goal of sourcing 100% cage-free, whole-shell eggs for all locations by the end of 2026.\n\nMake Your Event\nMore Eventful \nRain or shine, day or night, make your next party or group event more eventful at Topgolf undefined. We offer versatile event catering packages perfect for your next birthday party, company event, fundraiser or social get-together!\nParties & Events Chat",
      "hash": "8abb1d116101",
      "downloadedAt": "2026-01-19T02:16:10.644Z",
      "trimmedAt": "2026-01-19T02:26:05.214Z",
      "sizeReduction": "98.2%"
    },
    {
      "url": "https://topgolf.com/us/charleston/#promos",
      "text": "[Page Title: Golf, Party Venue, Sports Bar & Restaurant | Topgolf CharlestonTopgolf Logo ShieldTopgolf Logo Horizontal]\n\nSkip to Content View Gallery Virtual Tour \nCharleston\nTopgolf Favorite Plan a Visit Pricing Promotions \nGet exclusive offers and info! Sign up for Topgolf Charleston .\nemail and text updates \nTopgolf\n\nPhone\n(854) 895-4034 \nAddress\n\n,\n5000 Topgolf Way North Charleston SC 29418 Directions \nHours\nMon-Thurs: 9AM - 11PM Fri-Sat: 9AM - 1AM Sun: 9AM - 12AM \nSpecial Hours\n\nJan 25: 9AM - 5PM\nPopular Times Toggle \nAnyone under 16 must be supervised by a Guest 21+ at all times. Anyone under 18 must be supervised by a Guest 21+ after 9PM.\nAGE POLICY: \nFeatures & Amenities\nTopgolf 2 floors 70+ all-weather bays Toptracer games 28-foot video wall and 200+ HDTVs Free Wi-Fi Rooftop terrace with fire pits Private event spaces Bar & restaurant 9-hole mini golf course Golf Lessons View Virtual Tour \nAbout Topgolf Charleston\n\nWelcome to Topgolf Charleston, the premier entertainment destination in North Charleston, SC. Enjoy year-round comfort in our hitting bays with cooling fans in the summer and heated bays in the winter, all with HDTVs in every bay and throughout our . Using our complimentary clubs or your own, take aim at the giant outfield targets and our high-tech balls will score themselves.\nsports bar and restaurant Read More Change Day to \nSunday\nPricing Per Bay at Topgolf Charleston \nWhat is a bay?\n\nPrices are per hour, per hitting bay. Each bay can fit up to 6 players,\nso bring your friends and split the cost 6 ways! \nPrices do not include sales tax.\n$6 one-time member fee required for new players. \nFind your way to play\nPlan a Visit How to Play \nPromotions & News\nat Topgolf Charleston \nWinter Play Days\n\nPlay anytime Monday - Thursday and enjoy a locked-in low hourly price per bay!\n\nSunday Funday\n\nSkip the chores and come by for some high-scoring fun $40/hr all day every Sunday.\n\nTopgolf Nights\n\nWhen we drop prizes, beats and the price, a night out at Topgolf might cost less than ordering takeout!\nView All Promos \nMake Your Event\nMore Eventful \nRain or shine, day or night, make your next party or group event more eventful at Topgolf Charleston. We offer versatile event catering packages perfect for your next birthday party, company event or social get-together!\nParties & Events Chat",
      "hash": "b4576f8dfd88",
      "downloadedAt": "2026-01-19T02:16:11.179Z",
      "trimmedAt": "2026-01-19T02:26:05.228Z",
      "sizeReduction": "97.0%"
    },
    {
      "url": "https://topgolf.com/us/charleston/promo/",
      "text": "[Page Title: Current Promotions, Events and Offers | Topgolf CharlestonTopgolf Logo ShieldTopgolf Logo Horizontal]\n\nSkip to Content \nCurrent Promotions at\nTopgolf Charleston \nWhat’s Happening\nChange Location \nWinter Play Days\n\nPlay anytime Monday - Thursday and enjoy a locked-in low hourly price per bay!\n\nSunday Funday\n\nSkip the chores and come by for some high-scoring fun $40/hr all day every Sunday.\n\nTopgolf Nights\n\nWhen we drop prizes, beats and the price, a night out at Topgolf might cost less than ordering takeout!\n\nFree Pepsi Drinks in January\n\nMembers get FREE unlimited Pepsi drinks for their bay every visit all month! That's on top of the free appetizer every visit AND a monthly hour of free game play.\n\nWeekday Mornings\n\n$15 Unlimited Play Weekday Mornings\n\nStart your day off right with unlimited Topgolf game play when you choose to pay per person, instead of by bay.\n\nWinter Leagues\n\nCome join the fun at Winter Leagues! Register your team or sign up as an individual before January 26.\n\nLesson and Game Play Packages\n\nCombine practice and play with a Topgolf Coach lesson package. Includes two one-hour lessons and two free hours of game play for one incredible price!\n\nHeroes Program\n\nWe are proud to offer military (active duty and veterans), police, fire and EMS personnel, healthcare workers, and teachers 10% off Topgolf game play plus additional benefits.\n\nPremium Golf Club Upgrade\n\nOn your next visit to Topgolf, ask about upgrading to the latest Callaway golf clubs!\n\nRefer a Friend\n\nInvite friends to download the Topgolf App and become a Member - and you both get $15. See terms for full details.\n\nLimited Time Only\n\nWinter Flavorland\n\nFrom warm drinks to shareable appetizers, there's a ton of tasty new menu items to try while you play, but only for a limited time.\n\nSwing our New Golf Club\n\nThe Sure Thing club has everything you’d ever need to make hitting the ball easier. Exclusively at Topgolf.\n\nPlay the Sonic the Hedgehog Game\n\nEveryone's favorite hedgehog is at a Topgolf near you! All ages and skill levels are welcome in this new Sonic the Hedgehog game.\n\nExperience Football Our Way\n\nGear up and game on, here, game day goes way beyond your screen. REP your team, FEAST on fan-favorite eats and take a few swings — we’re bringing PLAY to game days in a big way.\n\nLimited Time Only\n\nFan-Zone Faves\n\nMake your picks and build your game day lineup this fall with our delicious food and drink options!\n\nCash App Card Cardholder Benefits at Topgolf\n\nCash App has partnered with Visa and Topgolf to offer exclusive benefits to Cash App Card cardholders from the moment you book to the moment you pay!\nChat",
      "hash": "ba72fad50b54",
      "downloadedAt": "2026-01-19T02:16:11.817Z",
      "trimmedAt": "2026-01-19T02:26:05.246Z",
      "sizeReduction": "99.1%"
    },
    {
      "url": "https://topgolf.com/us/charleston/plan-an-event/",
      "text": "[Page Title: Parties and Events Made Easy | Topgolf CharlestonTopgolf Logo ShieldTopgolf Logo Horizontal]\n\nSkip to Content Parties Topgolf undefined & Events \nWe can host it all, and it’ll be way cooler than boring restaurants or conference rooms that are always too cold. From throwing parties for friends and family to hosting corporate events with your team, Topgolf is the perfect place to get everyone together.\nWhat can we plan with you? Book Online Work with a planner \nSelect a venue to start planning:\nChoose Location Choose Venue AL - Birmingham AL - Huntsville AL - Mobile AR - Little Rock AR - Northwest Arkansas - Rogers AZ - Phoenix - Gilbert AZ - Phoenix - Glendale AZ - Phoenix - Scottsdale AZ - Tucson - Marana CA - Los Angeles - El Segundo CA - Los Angeles - Montebello CA - Los Angeles - Ontario CA - Sacramento - Roseville CA - San Francisco - Burlingame CA - San Jose CO - Colorado Springs CO - Denver - Centennial CO - Denver - Thornton FL - Fort Myers FL - Jacksonville FL - Lake Mary FL - Miami - Doral FL - Miami Gardens FL - Orlando FL - Panama City Beach FL - Pompano Beach FL - St. Petersburg FL - Tampa GA - Atlanta - Alpharetta GA - Atlanta - Buford GA - Atlanta - Midtown GA - Augusta IA - Des Moines ID - Boise IL - Chicago - Naperville IL - Chicago - Schaumburg IN - Indianapolis - Fishers KS - Kansas City - Overland Park KS - Wichita KY - Louisville LA - Baton Rouge LA - Lafayette MA - Boston - Canton MD - Baltimore MD - D.C. - Germantown MD - D.C. - National Harbor MI - Detroit - Auburn Hills MN - Minneapolis - Brooklyn Center MN - Minneapolis - Woodbury MO - St. Louis - Chesterfield MO - St. Louis - Midtown MS - Ridgeland NC - Charlotte - Southwest NC - Charlotte - University NC - Durham NC - Greensboro NE - Omaha NJ - Edison NJ - Mount Laurel NM - Albuquerque NV - Las Vegas NY - Long Island - Holtsville OH - Akron OH - Avon OH - Cincinnati - West Chester OH - Cleveland OH - Columbus OK - Oklahoma City OR - Portland - Hillsboro PA - King of Prussia PA - Philadelphia PA - Pittsburgh RI - Rhode Island SC - Charleston SC - Greenville SC - Myrtle Beach TN - Chattanooga TN - Knoxville TN - Memphis TN - Nashville TX - Austin TX - Bryan TX - DFW - Allen TX - DFW - Dallas TX - DFW - Fort Worth TX - DFW - Grand Prairie TX - DFW - The Colony TX - El Paso TX - Houston - Katy TX - Houston - Spring TX - Houston - Webster TX - McAllen - Pharr TX - New Braunfels TX - San Antonio TX - Waco UT - Salt Lake City UT - Vineyard VA - D.C. - Loudoun VA - Richmond VA - Virginia Beach WA - Seattle - Renton Go \nThere’s Nowhere Like Topgolf\n\nIt all starts with our Events Team, willing to work through every single detail to make your event epic. We host so we’ve seen it all. We can help steer you in the right direction, pick food and drink menus sure to please and ensure everything goes off without a hitch.\nthousands of big and small parties & events every year, \nAt Topgolf, you also get the fun of outside, without worrying about the elements throwing off your plans. From the middle of summer to the dead of winter, our will keep everyone comfortable as they play our fun-for-all games.\nfans, heaters and covered bays \nDifference\nThe Topgolf \nFood and drinks as tasty as your favorite restaurant, plus spaces as productive as the best conference centers, and we haven’t even talked about the golf yet.\n\nFun for all Skill Levels\n\nTrust us, we know golf can be hard, but it’s always a good time! We take the classic game to new levels with one-of-a-kind games like and , plus a custom golf club called made to help get the ball in the air, regardless of your skill level.\nBlock Party Angry Birds The Sure Thing \nChef-Crafted Menu\n\nOur mouthwatering catering packages are perfect for any event. We can satisfy diets of all kinds, with a variety of fresh tasty eats and refreshing drinks to fuel your play or keep hunger at bay during your next meeting.\nView Nutritional Information \nFlexible All-Weather Venue\n\nWe’ve got you covered, no matter what Mother Nature has up her sleeve. Our bays are covered, with fans to keep you cool and heaters to keep you toasty. Plus we can accommodate groups of just a few all the way up to thousands of guests.\n\nUnique Event Upgrades\n\nPlus up your event with exclusive extras like to track who’s on top, a Topgolf Coach to offer tips on the fly to your guests, or unique Topgolf apparel and gifts you can send everyone home with. We even have custom invitations you can share. Talk to the Events Team for details!\nLive Leaderboards Evite \nFrequently Asked Questions\n\nWill my bays be side-by-side?\n\nYes, if you book 2 bays with game play + food and beverage online or through our sales team, you will be in the best available side-by-side bays.\n\nDo I have to be good at golf to have fun?\n\nHeck no! Topgolf is a game that anyone can play and enjoy, even if you’re getting more hole-in-nones than hole-in-ones. Our games are fun for every skill level, or swing for a little extra help.\nThe Sure Thing \nCan I bring my own clubs?\n\nIf you’re more comfortable playing with your own clubs, we have designated areas within our bays to store them. We will also store your clubs in our club room if your event hasn’t started yet so that you can enjoy our venue without lugging them around.\n\nCan I bring a cake?\n\nIf that will make your experience sweeter, then heck yeah! We require that all cakes be store-bought with clearly-labeled ingredients in case of allergies because we care about the safety and well-being of all our Guests. Please note we cannot store your cake - the only exception is ice cream cake which we can store temporarily in our freezer as long as it is in a covered/sealed container.\n\nCan I use a gift card to pay for my event?\n\nUnfortunately, gift cards cannot be used towards payments for events.\n\nIs Topgolf wheelchair and ADA accessible?\n\nYes! You can also ask your Bayhost to get you an ADA hitting mat and tee. Elevators are available in multi-level venues, and our hitting bays are large enough to allow you to play in a wheelchair comfortably.\n\nMore questions? or just .\nCheck out our full FAQs contact a Topgolf event planner Chat",
      "hash": "de16cdba46c2",
      "downloadedAt": "2026-01-19T02:16:12.619Z",
      "trimmedAt": "2026-01-19T02:26:05.311Z",
      "sizeReduction": "99.6%"
    }
  ],
  "sizeReduction": "99.5%"
}