{
  "venueId": "ChIJ239ewlZj_ogRfZn-LbHxhtg",
  "venueName": "Holiday Inn Express & Suites Charleston Arpt-Conv Ctr Area by IHG",
  "venueArea": "North Charleston",
  "website": "https://www.ihg.com/holidayinnexpress/hotels/us/en/north-charleston/chscc/hoteldetail?cm_mmc=GoogleMaps-_-EX-_-US-_-CHSCC",
  "scrapedAt": "2026-01-18T17:04:23.132Z",
  "trimmedAt": "2026-01-18T17:04:46.986Z",
  "pages": [
    {
      "url": "https://www.ihg.com/holidayinnexpress/hotels/us/en/north-charleston/chscc/hoteldetail?cm_mmc=GoogleMaps-_-EX-_-US-_-CHSCC",
      "text": "Skip To main content View prices View all Holiday Inn Express & Suites Charleston Arpt-Conv Ctr Area Important Announcements Welcome to Our North Charleston, SC Hotel! Welcome to our hotel near Park Circle in North Charleston, SC. We offer 24-hour shuttle service to Charleston International Airport. Enjoy free parking and shuttle access to the Charleston Area Convention Center and North Charleston Coliseum. We’re less than a mile from the convention center and coliseum and just a short drive to Park Circle, Tanger Outlets, and Topgolf. Enjoy a hot Express Start® Breakfast with eggs, sausage, and made-to-order pancakes. Relax onsite with an indoor pool, hot tub, fitness center, and patio. For business, use our 24-hour business center or meeting space for up to 45 guests. After a full day, unwind in your room with plush bedding, a microwave, and a mini-fridge. We’re here to make your North Charleston stay great. Kids eat free Airport shuttle Free breakfast Limited housekeeping Fitness center On-site parking Pool Smoke-free hotel Wi-fi Area shuttle Kids eat free Airport shuttle Free breakfast Limited housekeeping Fitness center On-site parking Pool Smoke-free hotel Wi-fi Area shuttle Explore all amenities Accommodations Standard Rooms Book Now Suite Book Now Standard Rooms Book Now Suite Book Now Reservations: Front desk: 1-843-5542100 Email: swilson@lowcountryhotels.com 3025 W. Montague Ave. North Charleston, South Carolina 29418 United States Parking and transportation details : 3:00 PM Check-in : 11:00 AM Check-out : 21 Minimum check-in age The highlights Meetings & Events Hassle-Free-Free Parking Indoor Pool, Hot Tub, & Outdoor Patio Free Breakfast Buffet Prime Location Meetings & Events Our 725-square-foot Dreamliner Suite is the perfect venue to connect, collaborate, and celebrate with up to 45 guests. Near Charleston International Airport and with our convenient free airport shuttle, we are the ideal location. You are welcome to bring in outside catering; we also provide recommendations for local catering options if needed. Learn more Hassle-Free-Free Parking Enjoy the convenience of hassle-free parking at our hotel with complimentary guest parking. Stay with us and don’t worry about driving around to find a parking space or incurring high parking fees. Simply park your car and relax, knowing it's easily accessible throughout your stay. Learn more Indoor Pool, Hot Tub, & Outdoor Patio Take a dip in our inviting indoor heated pool from 6:00 AM – 10:00 PM daily. With natural lighting and lounge chairs, our pool area is the perfect place to relax, swim laps, and make a splash. Unwind with a soothing soak in our hot tub, or soak in the sun on our connecting outdoor patio. Learn more Free Breakfast Buffet Fuel your day with our complimentary Express Start™ Breakfast buffet from 6:00 AM – 10:00 AM. Enjoy hot and cold selections like classic scrambled eggs and bacon, pancakes, signature cinnamon rolls, cereal, yogurt, and fruit. Complement the most important meal of the day with a freshly brewed cup of coffee. Learn more Prime Location Our prime location offers unparalleled convenience. Enjoy free shuttle to local attractions like the North Charleston Coliseum & Performing Arts Center. Shop at the Tanger Outlets, experience the fun at Top Golf within walking distance, & enjoy the vibrant dining scene of Park Circle. Our central location puts you near the best of North Charleston. Learn more Explore Holiday Inn Express & Suites Charleston Arpt-Conv Ctr Area Sleep well, rest easy View rooms Elevate your experience View amenities See it to believe it View photos Sleep well, rest easy View rooms Elevate your experience View amenities See it to believe it View photos Hotel packages available Prices shown reflect an average per night stay from View all packages Offers View All Offers FAQs for Holiday Inn Express & Suites Charleston Arpt-Conv Ctr Area Does Holiday Inn Express & Suites Charleston Arpt-Conv Ctr Area have a pool? Yes, Holiday Inn Express & Suites Charleston Arpt-Conv Ctr Area has an indoor pool. How much is parking at Holiday Inn Express & Suites Charleston Arpt-Conv Ctr Area? Complimentary parking is available at Holiday Inn Express & Suites Charleston Arpt-Conv Ctr Area for hotel guests. Can I bring my pet to Holiday Inn Express & Suites Charleston Arpt-Conv Ctr Area? No, pets are not allowed at Holiday Inn Express & Suites Charleston Arpt-Conv Ctr Area. Does Holiday Inn Express & Suites Charleston Arpt-Conv Ctr Area offer free airport shuttle service? Holiday Inn Express & Suites Charleston Arpt-Conv Ctr Area offers free shuttle service from Charleston International Airport (CHS). Exit baggage claim, cross to the center median, turn right and walk past the final crosswalk. How far is Holiday Inn Express & Suites Charleston Arpt-Conv Ctr Area from the airport? Holiday Inn Express & Suites Charleston Arpt-Conv Ctr Area is 2 mi from Charleston International Airport (CHS) and is 19 mi from Charleston Executive Airport (JZI). Can I cancel my booking at Holiday Inn Express & Suites Charleston Arpt-Conv Ctr Area for a full refund? Always check the hotel's cancellation policy before booking a rate. Room cancellation is subject to rate booked at time of reservation and cancellation policy varies by rate. Does Holiday Inn Express & Suites Charleston Arpt-Conv Ctr Area have a restaurant on site? No, there is no on site restaurant at Holiday Inn Express & Suites Charleston Arpt-Conv Ctr Area. Is there free breakfast available at Holiday Inn Express & Suites Charleston Arpt-Conv Ctr Area? Breakfast is free with your stay at the Holiday Inn Express & Suites Charleston Arpt-Conv Ctr Area. When is breakfast at Holiday Inn Express & Suites Charleston Arpt-Conv Ctr Area? Breakfast at Holiday Inn Express & Suites Charleston Arpt-Conv Ctr Area is available from 6:00 AM to 10:00 AM. Is there a complimentary shuttle available at Holiday Inn Express & Suites Charleston Arpt-Conv Ctr Area? Yes, Holiday Inn Express & Suites Charleston Arpt-Conv Ctr Area offers a complimentary local area shuttle. Check our for more details. Transportation page What are the check-in and check-out times for Holiday Inn Express & Suites Charleston Arpt-Conv Ctr Area? Check-in at Holiday Inn Express & Suites Charleston Arpt-Conv Ctr Area is from 3:00 PM, and check-out time is 11:00 AM. Contact the hotel directly for options available for early check-in or late check-out. Does Holiday Inn Express & Suites Charleston Arpt-Conv Ctr Area offer free Wi-Fi? Yes, the Holiday Inn Express & Suites Charleston Arpt-Conv Ctr Area offers free WiFi! Read more FAQs View in other languages English English (GB) 日本語 Deutsch 繁體中文 Español 中文 Français Español (España) Italiano Nederlands Русский Português 한국어 ไทย العربية Português (BR) Bahasa Indonesia Türkçe",
      "hash": "7c6e37cac5ed",
      "downloadedAt": "2026-01-18T16:59:25.109Z",
      "trimmedAt": "2026-01-18T17:04:46.888Z",
      "sizeReduction": "97.5%"
    },
    {
      "url": "https://www.ihg.com/holidayinnexpress/content/us/en/deals/hotel-offers",
      "text": "Skip To main content Book now Offers Holiday Inn Resort Samui Bophut Beach Pay for your stay with Points + Cash Stretch your points further when you book with Points + Cash. Use your existing points and purchase the remaining points required with cash to redeem your Reward Night. Learn more Buy points and get there faster With two ways to buy points, you can reach what you want faster. Buy points to stock up for future travel or add Elite Qualifying points to a booking. Learn More Find A Perfect Gift From gift cards to unique travel destinations, our new rewards catalog is full of ideas and experiences for you to enjoy. Shop Our Catalog Great rates are just a click away With IHG One Rewards, you can get access to our exclusive Member Rate. Book now Buy, gift, or transfer points Enjoy endless possibilities with Points Purchase. Buy points InterContinental ANA Manza Beach Resort Treat yourself to a Reward Night Redeem your IHG One Rewards points for a Reward Night at our 6,600+ hotels and resorts around the world, starting at just 10,000 points. Book now Rewards are just a tap away Download the IHG One Rewards app today. Enjoy fast booking and Rewards on the go – however and wherever you travel. Learn More Travel like you mean it Explore our collections to find the perfect spot for your next vacation, meeting or bucket-list escape. Discover more with our 20 brands and 6,600+ destinations. Explore Now Stay at IHG and earn towards flights IHG One Rewards Members can earn miles for their stays Learn More Earn and redeem points with our partners Maximize your membership with great travel deals on car rentals, restaurants, activities and more. View all partner offers It's better to be a member EARN POINTS TO USE FOR REWARD NIGHTS NO BLACKOUT DATES ACCESS TO MEMBER RATES & OFFERS FREE WIFI LATE CHECKOUT PLUS EVEN MORE PERKS WHEN YOU BECOME AN ELITE MEMBER JOIN FOR FREE Already a member? . Sign in",
      "hash": "99c3a0450348",
      "downloadedAt": "2026-01-18T16:59:25.243Z",
      "trimmedAt": "2026-01-18T17:04:46.941Z",
      "sizeReduction": "99.0%"
    },
    {
      "url": "https://www.ihg.com/holidayinnexpress/hotels/us/en/north-charleston/chscc/hoteldetail/hotel-offers",
      "text": "Skip To main content View prices Holiday Inn Express & Suites Charleston Arpt-Conv Ctr Area Offers Save on your hotel stay with these exclusive Holiday Inn Express & Suites Charleston Arpt-Conv Ctr Area deals. Hotel packages available Prices shown reflect an average per night stay from VIEW ALL PACKAGES View in other languages English English (GB) 日本語 Deutsch 繁體中文 Español 中文 Français Español (España) Italiano Nederlands Русский Português 한국어 ไทย العربية Português (BR) Bahasa Indonesia Türkçe",
      "hash": "bf14d8cd1c8e",
      "downloadedAt": "2026-01-18T16:59:25.827Z",
      "trimmedAt": "2026-01-18T17:04:46.960Z",
      "sizeReduction": "99.6%"
    },
    {
      "url": "https://www.ihg.com/holidayinnexpress/hotels/us/en/north-charleston/chscc/hoteldetail/events-facilities",
      "text": "Skip To main content View prices View all Holiday Inn Express & Suites Charleston Arpt-Conv Ctr Area Meetings & events Connect and collaborate at our venue in Charleston, SC, ideal for meetings, workshops, and small gatherings of up to 45 guests. With 725 sq ft of space and outside catering welcome, we'll help turn your ideas into unforgettable experiences. Download brochure Download catering menu Request a proposal Dreamliner Suite The 725-square-foot Dreamliner Suite is a flexible, open space with two floor-to-ceiling windows with blackout capabilities. Outside food and beverages are allowed at no additional charge. AV equipment is available to rent from the hotel. Ground Floor 45 Guests We've got you covered Fax services Printer Dry cleaning pickup or laundry valet Same-day dry cleaning Wi-Fi throughout hotel Event Offers Have more questions? Contact us View in other languages English English (GB) 日本語 Deutsch 繁體中文 Español 中文 Français Español (España) Italiano Nederlands Русский Português 한국어 ไทย العربية Português (BR) Bahasa Indonesia Türkçe",
      "hash": "e125260840ac",
      "downloadedAt": "2026-01-18T16:59:26.444Z",
      "trimmedAt": "2026-01-18T17:04:46.986Z",
      "sizeReduction": "99.2%"
    }
  ],
  "sizeReduction": "98.5%"
}