{
  "venueId": "ChIJ9UT3zCdvK4cRCqn_lMj_Fxk",
  "venueName": "Jim 'N Nick's Bar-B-Q",
  "venueArea": "North Charleston",
  "website": "https://www.jimnnicks.com/locations/sc/north-charleston/4964-center-pointe-dr?utm_source=google&utm_medium=Yext",
  "scrapedAt": "2026-01-18T17:04:23.874Z",
  "trimmedAt": "2026-01-18T17:05:05.504Z",
  "pages": [
    {
      "url": "https://www.jimnnicks.com/menu/",
      "text": "Our Menu Jim ’N Nick’s is Open for Dine In, To Go, Drive Thru & Catering Prices and menu items may vary by location Visiting our Niceville, FL location? Download Niceville Menu SALADS, POTATOES & SOUPS Ranch • Bar-B-Q Ranch • Vinaigrette • Honey Mustard • Blue Cheese Dressings Bar-B-Q Salad** Bacon, cheddar cheese, cucumbers, tomatoes, almonds and homemade croutons, topped with smoked pulled pork or chickenOption: Substitute beef brisket Chopped Southern Salad** Smoked chicken, smoked onions and sweet corn, cheddar cheese, bacon, cucumber, tomatoes, almonds and homemade croutons, tossed in house-made vinaigrette Not-So-Naked Potato (GF) A large baked potato topped with bacon, cheddar cheese, butter, sour cream and scallions Loaded Bar-B-Q Baker (GF) A huge baked potato topped with your choice of smoked meat, bacon, cheddar cheese, scallions, butter, sour cream and barbecue sauce Our Famous Brisket Chili (GF) Homemade chili made with our smoked brisket • Cup Bowl Soup and Salad A cup of our famous Brisket Chili with a House Salad** Trimmings Baked Beans GFPotato Salad GFColeslaw GF Mac & CheeseBar-B-Q Corn on the Cob GFCollard Greens GFFrench FriesFresh Fruit GF Substitute Not-So-Naked Potato GFOnion RingsBrisket Chili GFHouse Salad** Starters Onion Rings Hand-breaded and crispy Small Basket Large Basket to share Loaded queso White queso with pico de gallo and jalapeno cheddar sausage. Served with fresh tortilla chips Pitmaster Nacho Platter White queso and shredded cheddar topped with pico de gallo and chipotle crema. Choice of jalapeno cheddar sausage, pulled pork, or chicken Smoked Wings Your choice of Buffalo, Honey Habanero BBQ, Morgan Co. White, or Carolina Mustard sauce and served with carrots and celery 6 Wings | 12 Wings | 18 Wings Deviled Eggs Four halves of our Southern-style stuffed eggs Brisket Mac & Cheese Bombs Slow smoked brisket with creamy mac and cheese, breaded and deep fried to golden perfection NEW SOUThern trio Chips & queso, small onion ring, and 6 jumbo smoked wings JNN Classics Served with 2 trimmings* Classic Pulled Pork* (GF) Our one-of-a-kind, slow-smoked pork served with Original BBQ Sauce Carolina-Style Pork* (GF) Chopped pork tossed in vinegar-based Carolina sauce, or pulled pork with Carolina Mustard sauce on the side Beef Brisket* (GF) Your choice of rich marbled or lean brisket, smoked for 12 hours and served sliced (available chopped upon request) Bar-B-Q Chicken* (GF) Served with your choice of Original BBQ or Morgan Co. White sauce Half Chicken Quarter: Leg & Thigh Mr. Jim’s Combo Plate* Choose 2 or 3 smoked meats. • 2 Meats 3 Meats Smoked Turkey Breast* (GF) Lean, smokey goodness served with Original BBQ or Morgan Co. White sauce Chicken Tenders Basket: 3 hand-breaded tenders with fries Chicken Tenders Dinner*: 4 hand-breaded tenders served with 2 trimmings Honey Mustard • Ranch • Buffalo Dipping sauces: Karl’s Fried Catfish Plate* Southern-fried, U.S. farm-raised catfish fillets with tartar sauce • 1 Fillet 2 Fillets Loaded Mac & Cheese Our famous mac & cheese topped with barbecue pork and scallions. Great as a meal or as a side dish to share! (this item does not come with two trimmings) Option: Substitute beef brisket JNN Ribs Classic Spare Ribs (GF) Served with 2 trimmings1 LB. | 2 LBS. | 3 LBS. JNN Sandwiches Served with 1 trimming on a Martin's Potato BunOption: Add a second trimming Pulled Pork Sandwich Our classic pulled pork Carolina-style Pork Chopped pork tossed in vinegar-based Carolina sauce, or pulled pork with Carolina Mustard sauce on the side. Served with coleslaw on the side Bar-B-Q Chicken Slow-smoked pulled chicken served with Morgan Co. White sauce Joe’s Original Turkey Sandwich Hickory-smoked turkey breast with lettuce, tomato and honey mustard Smoked Turkey Breast Lean, smoky goodness served with Morgan Co. White Sauce Beef Brisket Our rich, marbled brisket, smoked for 12 hours and served sliced (available chopped upon request) Karl’s Catfish Sandwich Southern-fried, U.S. farm-raised catfish fillet with lettuce, tomato and tartar sauce JNN Burgers Served with 1 trimming on a Martin's Potato Bun JNN Original Burger Melted American cheese, onions, lettuce, tomato, pickles, ketchup, mustard and mayo (1/4 pound patty) (Two 1/4 pound patties)Option: Add bacon Single Double Southern Burger Smothered in barbecue sauce and topped with bacon, cheddar cheese, pickles and a crispy onion ring (1/4 pound patty) (Two 1/4 pound patties) Single Double Desserts Banana Pudding Mable’s Homemade Pies Lemon Ice Box • Chocolate Cream • Seasonal SliceWhole Pie *CONSUMING RAW OR UNDERCOOKED MEATS, POULTRY, SEAFOOD, SHELLFISH, OR EGGS MAY INCREASE YOUR RISK OF FOODBORNE ILLNESS, ESPECIALLY IF YOU HAVE CERTAIN MEDICAL CONDITIONS. GF – Gluten Free ** Includes almonds value feast Menu Serves 4 People Served with 3 pint-sized trimmings and 4 buns and 1/2 dozen cheese biscuits OR 1 dozen cheese biscuits Bar-B-Q-Dinner Choose Pork, Whole Chicken or Sliced Turkey Sliced Beef Brisket Dinner Served Chopped Upon Request Spare Rib Dinner Looking for Catering? Tell us how many and we'll bring the food. Order Catering",
      "hash": "1643dc6ea8a1",
      "downloadedAt": "2026-01-18T16:59:56.111Z",
      "trimmedAt": "2026-01-18T17:05:05.484Z",
      "sizeReduction": "94.8%"
    },
    {
      "url": "https://www.jimnnicks.com/locations/",
      "text": "All Locations 61 locations Alabama (19) Florida (3) Georgia (22) North Carolina (3) South Carolina (4) Tennessee (10) Search for a Jim 'N Nick's",
      "hash": "61b9e16010c6",
      "downloadedAt": "2026-01-18T16:59:56.689Z",
      "trimmedAt": "2026-01-18T17:05:05.488Z",
      "sizeReduction": "99.8%"
    },
    {
      "url": "https://www.jimnnicks.com/locations/sc/north-charleston/4964-center-pointe-dr?utm_source=google&utm_medium=Yext",
      "text": "> Locations SC North Charleston Jim 'N Nick's 4964 Center Pointe Dr.North Charleston, SC 29406 Directions View Menu Order To Go / Delivery Order Catering Hours - Monday 11:00 AM 9:00 PM - Tuesday 11:00 AM 9:00 PM - Wednesday 11:00 AM 9:00 PM - Thursday 11:00 AM 9:00 PM - Friday 11:00 AM 10:00 PM - Saturday 11:00 AM 10:00 PM - Sunday 11:00 AM 9:00 PM Phone 843-747-3800 Catering Phone 843-619-0070 At Jim 'N Nick's, we're about people Want to join the JNN Team in North Charleston? We're always looking for great talent to join the JNN team. Browse available positions from Servers and Kitchen Staff to Hosts and Managers. We're excited to hear from you. Browse Jobs What does community mean to us? Everything. Hey, we love barbecue. We love preparing it, we love serving it, and we really love eating it. But most of all, we love the way it brings people together. Our Community Search for a Jim 'N Nick's",
      "hash": "c704fa4f2014",
      "downloadedAt": "2026-01-18T16:59:56.025Z",
      "trimmedAt": "2026-01-18T17:05:05.501Z",
      "sizeReduction": "98.9%"
    },
    {
      "url": "https://www.jimnnicks.com/locations/sc/",
      "text": "> All Locations SC 4 locations in South Carolina Bluffton Indian Land / Charlotte North Charleston Spartanburg Search for a Jim 'N Nick's",
      "hash": "e99201e58816",
      "downloadedAt": "2026-01-18T16:59:57.257Z",
      "trimmedAt": "2026-01-18T17:05:05.504Z",
      "sizeReduction": "99.8%"
    }
  ],
  "sizeReduction": "98.0%"
}