{
  "venueId": "ChIJ-dlsdttj_ogRnGhYxRex3vs",
  "venueName": "Light Of Tokyo Rivers Ave",
  "venueArea": "North Charleston",
  "website": "https://www.lightoftokyo.com/",
  "scrapedAt": "2026-01-18T17:04:22.859Z",
  "trimmedAt": "2026-01-18T17:04:41.796Z",
  "pages": [
    {
      "url": "https://www.lightoftokyo.com/menu/japanese",
      "text": "Skip to main content Discover our delicious selection of sushi at . Rivers Ave Order online for delicious Japanese cuisine today. Order Delivery Order Pickup 7620 Rivers Ave Suite 330 North Charleston, SC 29406 843-572-2818 Business Hours Sunday: Closed Monday: - 11:00 AM 10:00 PM Tuesday: - 11:00 AM 10:00 PM Wednesday: - 11:00 AM 10:00 PM Thursday: - 11:00 AM 10:00 PM Friday: - 11:00 AM 10:00 PM Saturday: - 11:00 AM 10:00 PM Start an order Frequently Asked Questions Do you offer catering services? Yes, we provide full catering services for events of all sizes. Our catering menu features our most popular dishes and can be customized to meet your specific needs. Contact us to discuss your event requirements. What are your hours of operation? We're open Tuesday through Sunday from 11:00 AM to 10:00 PM. We're closed on Mondays for kitchen prep and staff training. Holiday hours may vary - please call ahead to confirm.",
      "hash": "12ebdf2dac4d",
      "downloadedAt": "2026-01-18T17:00:05.278Z",
      "trimmedAt": "2026-01-18T17:04:41.684Z",
      "sizeReduction": "98.1%"
    },
    {
      "url": "https://www.lightoftokyo.com/menu/tuna-lover",
      "text": "Skip to main content Discover our delicious Tuna Lover roll, a must-try in your favorite sushi spot in town. Order online for the best Tuna Lover today! Order Delivery Order Pickup Super Crab Roll(8ps) DEEP fried crab meat cream cheese inside.top crab meat salad Add Item Fire Fire crab(8ps) imitation crab deep fried with cream cheese top spicy crab and tempura flakes spicy mayo Add Item Tuna lover(8ps) spicy tuna avocao in top Tuna .Wasabi mayo spicy mayo Add Item Dragon Roll (8ps) EEl Cucumber, topped with avocado fish egg Add Item TNT Roll(10ps) Imitation crab mayo, avocado, Shrimp tempura cream cheese, sesame seeds soy paper, spicy mayo, eel sauce, sriracha. Add Item YUMMY YUMMY ROLL(8PS) Fried salmon spicy carb cream cheese avocado with soy paper Spicy mayo eel sauce wasabi mayo on top Add Item Fantastic Roll(8ps) Shrimp tempura cream cheese, topped crab meat avocado eel sauce and spicy mayo. Add Item Orange Dragon Roll(8ps) Spicy crab, cucumber, topped with salmon, Fish eggs, Imitation crab, mayo, Avocado spicy mayo Add Item Rainbow Roll(8ps) Avocado, cucumber, imitation crab topped with assorted fish & avocado. Add Item Deluxe Dragon(8ps) Shrimp tempura, Cucumber, topped with eel, avocado, eel sauce Add Item 7620 Rivers Ave Suite 330 North Charleston, SC 29406 843-572-2818 Business Hours Sunday: Closed Monday: - 11:00 AM 10:00 PM Tuesday: - 11:00 AM 10:00 PM Wednesday: - 11:00 AM 10:00 PM Thursday: - 11:00 AM 10:00 PM Friday: - 11:00 AM 10:00 PM Saturday: - 11:00 AM 10:00 PM Start an order Frequently Asked Questions Do you offer catering services? Yes, we provide full catering services for events of all sizes. Our catering menu features our most popular dishes and can be customized to meet your specific needs. Contact us to discuss your event requirements. What are your hours of operation? We're open Tuesday through Sunday from 11:00 AM to 10:00 PM. We're closed on Mondays for kitchen prep and staff training. Holiday hours may vary - please call ahead to confirm.",
      "hash": "174cdbfcda13",
      "downloadedAt": "2026-01-18T17:00:10.295Z",
      "trimmedAt": "2026-01-18T17:04:41.693Z",
      "sizeReduction": "96.6%"
    },
    {
      "url": "https://www.lightoftokyo.com/menu",
      "text": "Skip to main content Order Online Now! LG Teriyaki Chicken Bowl Add Item MED Teriyaki Chicken Bowl Add Item LG Pepper Chicken Bowl Add Item MED Super Bowl Steak Shrimp Add Item LG Super Bowl Chicken Shrimp Add Item MED Orange Chicken Bowl Add Item MED Super Yakiniku Bowl Add Item LG Super Bowl Steak Chicken Add Item MED Steak Bowl Add Item MED Pepper Chicken Bowl Add Item Hibachi Steak Add Item Hibachi Chicken Add Item Hibachi Tofu Steak Add Item Hibachi Steak Chicken Add Item Hibachi Shrimp Chicken Add Item Hibachi Vegetables Add Item Orange Chicken Plate Add Item Pepper Chicken Plate Add Item 3 Combo Plate Add Item Hibachi Steak Shrimp Add Item Rib Eye Steak Add Item Hibachi Chicken Yakisoba Add Item Hibachi Steak Soba Add Item Hibachi salmon Add Item Filet Mignon Steak chicken Add Item Filet Mignon Steak Add Item Hibachi Shrimp Soba Add Item Rib Eye Steak Chicken Add Item Rib Eye Steak Shrimp Add Item Hibachi Chicken Breast Add Item Tokyo Bento Shrimp Add Item Tokyo sushi Bento Add Item Tokyo Bento Steak Add Item Rainbow Roll(8ps) Avocado, cucumber, imitation crab topped with assorted fish & avocado. Add Item Tuna lover(8ps) spicy tuna avocao in top Tuna .Wasabi mayo spicy mayo Add Item Fantastic Roll(8ps) Shrimp tempura cream cheese, topped crab meat avocado eel sauce and spicy mayo. Add Item Orange Dragon Roll(8ps) Spicy crab, cucumber, topped with salmon, Fish eggs, Imitation crab, mayo, Avocado spicy mayo Add Item Fire Fire crab(8ps) imitation crab deep fried with cream cheese top spicy crab and tempura flakes spicy mayo Add Item YUMMY YUMMY ROLL(8PS) Fried salmon spicy carb cream cheese avocado with soy paper Spicy mayo eel sauce wasabi mayo on top Add Item Super Crab Roll(8ps) DEEP fried crab meat cream cheese inside.top crab meat salad Add Item Deluxe Dragon(8ps) Shrimp tempura, Cucumber, topped with eel, avocado, eel sauce Add Item TNT Roll(10ps) Imitation crab mayo, avocado, Shrimp tempura cream cheese, sesame seeds soy paper, spicy mayo, eel sauce, sriracha. Add Item Dragon Roll (8ps) EEl Cucumber, topped with avocado fish egg Add Item Vegetable Roll Add Item Spicy crab roll Add Item Crunch roll Add Item Cucumber Roll Add Item *Salmon Roll Add Item Spicy California Spicy crabmeat cucumber avocado and spicy mayo Add Item chicken Tempura ro l l Deep fried chicken cucumber Eel sauce sesame seeds Add Item Salmon Tempura roll Add Item California Roll Add Item sweet potato roll Add Item Fireworks Roll ( Raw) 5ps Spicy tuna,cream cheese ,avocado,imitation crab with mayonnaise inside.deep fried top with spicy mayo,eel sauce,wasabi mayo and sweet chili sauce and tempura flakes Add Item Golden Bomb Roll（8ps） Teriyaki shrimp, imitation snow crab cream cheese, soy paper, eel sauce, spicy mayo. deep-fried with panko Add Item Golden Bomb Roll（5pc） Teriyaki shrimp, imitation snow crab cream cheese, soy paper, eel sauce, spicy mayo. deep-fried with panko Add Item New Old Bay（8ps） Teriyaki shrimp, cream cheese, imitation crab, Avocado eel sauce, spicy mayo, Old Bay seasoning. deep-fried with panko Add Item Monster Roll（5ps）（RAW） Salmon, Tuna cream cheese, avocado, deep-fried with panko, sweet chili sauce, fried onions. Add Item EEL(unagi) Sashimi Add Item Salmon（sake）Sushi Add Item Fish egg（masago）Sashimi Add Item Smoked Salmon Sashimi Add Item Smoked Salmon Sushi Add Item Crabmeat (kani) Sushi Add Item Tuna (maguro）Sashimi Add Item Salmon（sake）Sashimi Add Item Tuna (maguro）Sushi Add Item EEL(unagi) Sushi Add Item LG Bacon Fried rice Add Item LG Fried rice Add Item Side Mix Vegetables Add Item Side Broccoli Add Item Side White Rice Add Item Side Bacon Fried Rice Add Item Side Onions & Zucchini Add Item Side Hibachi Shrimp Add Item Beef Dumplings（5pcs） Add Item Side mushroom Add Item Green tea Add Item Can soda Add Item Japanese Soda Add Item Os Bubbles tea Add Item Bottled water Add Item Fried Cheese Cake Add Item Teriyaki chicken salad Add Item Shrimp tempura salad Add Item Seaweed Salad Add Item Spicy kani salad Add Item Avocado salad Add Item Teriyaki shrimp salad Add Item",
      "hash": "50b33f795a56",
      "downloadedAt": "2026-01-18T17:00:04.642Z",
      "trimmedAt": "2026-01-18T17:04:41.724Z",
      "sizeReduction": "97.0%"
    },
    {
      "url": "https://www.lightoftokyo.com/menu/dragon-roll",
      "text": "Skip to main content Indulge in our famous right here in . Dragon Roll Rivers Ave Order your delicious online today! Dragon Roll Order Delivery Order Pickup Pick 2 SP/D.F roll Add Item 7620 Rivers Ave Suite 330 North Charleston, SC 29406 843-572-2818 Business Hours Sunday: Closed Monday: - 11:00 AM 10:00 PM Tuesday: - 11:00 AM 10:00 PM Wednesday: - 11:00 AM 10:00 PM Thursday: - 11:00 AM 10:00 PM Friday: - 11:00 AM 10:00 PM Saturday: - 11:00 AM 10:00 PM Start an order Frequently Asked Questions Do you offer catering services? Yes, we provide full catering services for events of all sizes. Our catering menu features our most popular dishes and can be customized to meet your specific needs. Contact us to discuss your event requirements. What are your hours of operation? We're open Tuesday through Sunday from 11:00 AM to 10:00 PM. We're closed on Mondays for kitchen prep and staff training. Holiday hours may vary - please call ahead to confirm.",
      "hash": "7356d0ea4b77",
      "downloadedAt": "2026-01-18T17:00:09.021Z",
      "trimmedAt": "2026-01-18T17:04:41.731Z",
      "sizeReduction": "98.1%"
    },
    {
      "url": "https://www.lightoftokyo.com/menu/lg-pepper-chicken-bowl",
      "text": "Skip to main content Indulge in our delicious LG Pepper Chicken Bowl right here in the heart of /location/rivers-ave. Order the delicious LG Pepper Chicken Bowl online now. Order Delivery Order Pickup Pepper Chicken Plate Add Item Hibachi Steak Add Item Orange Chicken Plate Add Item Hibachi Steak Chicken Add Item Hibachi Steak Shrimp Add Item Hibachi Shrimp Add Item Hibachi Vegetables Add Item 3 Combo Plate Add Item Hibachi Shrimp Chicken Add Item Hibachi Chicken Add Item 7620 Rivers Ave Suite 330 North Charleston, SC 29406 843-572-2818 Business Hours Sunday: Closed Monday: - 11:00 AM 10:00 PM Tuesday: - 11:00 AM 10:00 PM Wednesday: - 11:00 AM 10:00 PM Thursday: - 11:00 AM 10:00 PM Friday: - 11:00 AM 10:00 PM Saturday: - 11:00 AM 10:00 PM Start an order Frequently Asked Questions Do you offer catering services? Yes, we provide full catering services for events of all sizes. Our catering menu features our most popular dishes and can be customized to meet your specific needs. Contact us to discuss your event requirements. What are your hours of operation? We're open Tuesday through Sunday from 11:00 AM to 10:00 PM. We're closed on Mondays for kitchen prep and staff training. Holiday hours may vary - please call ahead to confirm.",
      "hash": "792189dd56ec",
      "downloadedAt": "2026-01-18T17:00:06.537Z",
      "trimmedAt": "2026-01-18T17:04:41.739Z",
      "sizeReduction": "97.8%"
    },
    {
      "url": "https://www.lightoftokyo.com/menu/shrimp-tempura-roll",
      "text": "Skip to main content Indulge in our delicious shrimp tempura roll, a highlight of the menu located in Rivers Ave. Order your delicious Shrimp Tempura Roll online today. Order Delivery Order Pickup Pick 2 SP/D.F roll Add Item 7620 Rivers Ave Suite 330 North Charleston, SC 29406 843-572-2818 Business Hours Sunday: Closed Monday: - 11:00 AM 10:00 PM Tuesday: - 11:00 AM 10:00 PM Wednesday: - 11:00 AM 10:00 PM Thursday: - 11:00 AM 10:00 PM Friday: - 11:00 AM 10:00 PM Saturday: - 11:00 AM 10:00 PM Start an order Frequently Asked Questions Do you offer catering services? Yes, we provide full catering services for events of all sizes. Our catering menu features our most popular dishes and can be customized to meet your specific needs. Contact us to discuss your event requirements. What are your hours of operation? We're open Tuesday through Sunday from 11:00 AM to 10:00 PM. We're closed on Mondays for kitchen prep and staff training. Holiday hours may vary - please call ahead to confirm.",
      "hash": "7c84793b7d79",
      "downloadedAt": "2026-01-18T17:00:07.778Z",
      "trimmedAt": "2026-01-18T17:04:41.746Z",
      "sizeReduction": "98.0%"
    },
    {
      "url": "https://www.lightoftokyo.com/menu/tokyo-bento-steak",
      "text": "Skip to main content Experience our signature at our restaurant located on Rivers Ave. Tokyo Bento Steak Order online for our delicious Tokyo Bento Steak. Order Delivery Order Pickup Tokyo sushi Bento Add Item Tokyo Bento Shrimp Add Item Tokyo Bento Steak Add Item 7620 Rivers Ave Suite 330 North Charleston, SC 29406 843-572-2818 Business Hours Sunday: Closed Monday: - 11:00 AM 10:00 PM Tuesday: - 11:00 AM 10:00 PM Wednesday: - 11:00 AM 10:00 PM Thursday: - 11:00 AM 10:00 PM Friday: - 11:00 AM 10:00 PM Saturday: - 11:00 AM 10:00 PM Start an order Frequently Asked Questions Do you offer catering services? Yes, we provide full catering services for events of all sizes. Our catering menu features our most popular dishes and can be customized to meet your specific needs. Contact us to discuss your event requirements. What are your hours of operation? We're open Tuesday through Sunday from 11:00 AM to 10:00 PM. We're closed on Mondays for kitchen prep and staff training. Holiday hours may vary - please call ahead to confirm.",
      "hash": "7eed5f152ab2",
      "downloadedAt": "2026-01-18T17:00:07.158Z",
      "trimmedAt": "2026-01-18T17:04:41.755Z",
      "sizeReduction": "98.0%"
    },
    {
      "url": "https://www.lightoftokyo.com/menu/spicy-salmon-roll",
      "text": "Skip to main content Indulge in our delicious at our restaurant located in . Spicy Salmon Roll Rivers Ave Order your delicious Spicy Salmon Roll online now. Order Delivery Order Pickup Super Crab Roll(8ps) DEEP fried crab meat cream cheese inside.top crab meat salad Add Item Orange Dragon Roll(8ps) Spicy crab, cucumber, topped with salmon, Fish eggs, Imitation crab, mayo, Avocado spicy mayo Add Item TNT Roll(10ps) Imitation crab mayo, avocado, Shrimp tempura cream cheese, sesame seeds soy paper, spicy mayo, eel sauce, sriracha. Add Item Fire Fire crab(8ps) imitation crab deep fried with cream cheese top spicy crab and tempura flakes spicy mayo Add Item Tuna lover(8ps) spicy tuna avocao in top Tuna .Wasabi mayo spicy mayo Add Item Rainbow Roll(8ps) Avocado, cucumber, imitation crab topped with assorted fish & avocado. Add Item Dragon Roll (8ps) EEl Cucumber, topped with avocado fish egg Add Item Fantastic Roll(8ps) Shrimp tempura cream cheese, topped crab meat avocado eel sauce and spicy mayo. Add Item YUMMY YUMMY ROLL(8PS) Fried salmon spicy carb cream cheese avocado with soy paper Spicy mayo eel sauce wasabi mayo on top Add Item Deluxe Dragon(8ps) Shrimp tempura, Cucumber, topped with eel, avocado, eel sauce Add Item 7620 Rivers Ave Suite 330 North Charleston, SC 29406 843-572-2818 Business Hours Sunday: Closed Monday: - 11:00 AM 10:00 PM Tuesday: - 11:00 AM 10:00 PM Wednesday: - 11:00 AM 10:00 PM Thursday: - 11:00 AM 10:00 PM Friday: - 11:00 AM 10:00 PM Saturday: - 11:00 AM 10:00 PM Start an order Frequently Asked Questions Do you offer catering services? Yes, we provide full catering services for events of all sizes. Our catering menu features our most popular dishes and can be customized to meet your specific needs. Contact us to discuss your event requirements. What are your hours of operation? We're open Tuesday through Sunday from 11:00 AM to 10:00 PM. We're closed on Mondays for kitchen prep and staff training. Holiday hours may vary - please call ahead to confirm.",
      "hash": "cc6fce436ced",
      "downloadedAt": "2026-01-18T17:00:08.409Z",
      "trimmedAt": "2026-01-18T17:04:41.764Z",
      "sizeReduction": "96.6%"
    },
    {
      "url": "https://www.lightoftokyo.com/menu/super-crab-roll",
      "text": "Skip to main content Savor our exquisite in the vibrant atmosphere of . Super Crab Roll Rivers Ave Order our Super Crab Roll online now! Order Delivery Order Pickup Deluxe Dragon(8ps) Shrimp tempura, Cucumber, topped with eel, avocado, eel sauce Add Item Dragon Roll (8ps) EEl Cucumber, topped with avocado fish egg Add Item Rainbow Roll(8ps) Avocado, cucumber, imitation crab topped with assorted fish & avocado. Add Item Tuna lover(8ps) spicy tuna avocao in top Tuna .Wasabi mayo spicy mayo Add Item Fire Fire crab(8ps) imitation crab deep fried with cream cheese top spicy crab and tempura flakes spicy mayo Add Item TNT Roll(10ps) Imitation crab mayo, avocado, Shrimp tempura cream cheese, sesame seeds soy paper, spicy mayo, eel sauce, sriracha. Add Item YUMMY YUMMY ROLL(8PS) Fried salmon spicy carb cream cheese avocado with soy paper Spicy mayo eel sauce wasabi mayo on top Add Item Fantastic Roll(8ps) Shrimp tempura cream cheese, topped crab meat avocado eel sauce and spicy mayo. Add Item Super Crab Roll(8ps) DEEP fried crab meat cream cheese inside.top crab meat salad Add Item Orange Dragon Roll(8ps) Spicy crab, cucumber, topped with salmon, Fish eggs, Imitation crab, mayo, Avocado spicy mayo Add Item 7620 Rivers Ave Suite 330 North Charleston, SC 29406 843-572-2818 Business Hours Sunday: Closed Monday: - 11:00 AM 10:00 PM Tuesday: - 11:00 AM 10:00 PM Wednesday: - 11:00 AM 10:00 PM Thursday: - 11:00 AM 10:00 PM Friday: - 11:00 AM 10:00 PM Saturday: - 11:00 AM 10:00 PM Start an order Frequently Asked Questions Do you offer catering services? Yes, we provide full catering services for events of all sizes. Our catering menu features our most popular dishes and can be customized to meet your specific needs. Contact us to discuss your event requirements. What are your hours of operation? We're open Tuesday through Sunday from 11:00 AM to 10:00 PM. We're closed on Mondays for kitchen prep and staff training. Holiday hours may vary - please call ahead to confirm.",
      "hash": "e35331d5069b",
      "downloadedAt": "2026-01-18T17:00:09.672Z",
      "trimmedAt": "2026-01-18T17:04:41.772Z",
      "sizeReduction": "96.6%"
    },
    {
      "url": "https://www.lightoftokyo.com/",
      "text": "Skip to main content Order Online Now! Your favorite sushi spot in North Charleston. Order Now Hibachi Tofu Steak Add Item Hibachi Shrimp Chicken Add Item California Roll Add Item Tokyo sushi Bento Add Item Super Crab Roll(8ps) DEEP fried crab meat cream cheese inside.top crab meat salad Add Item MED Teriyaki Shrimp Bowl Add Item Filet Mignon Steak Shrimp Add Item Teriyaki chicken salad Add Item Authentic Japanese Cuisine at Rivers Avenue Welcome to Light Of Tokyo Rivers Ave, your go-to destination for authentic Japanese cuisine in North Charleston. Enjoy our exquisite sushi, hibachi, and dine-in atmosphere, or opt for convenient takeout and delivery services. Order Now Order Your Favorite Sushi Online in Charleston At Light Of Tokyo Rivers Ave, savor authentic Japanese cuisine with the convenience of online ordering. Enjoy seamless delivery or takeout right here in North Charleston, allowing you to relish our delicious dishes from the comfort of your home. Order Now LaSandra Jennings This is the best place to eat, the chicken is delicious and seasoned wonderfully. 🥰❣️🥰The sauces are awesome!! ⭐⭐⭐⭐⭐I love the spicy white sauce, and the ginger for my vegetable. They do have the regular white sauce but I fell in love with the spicy one. 🥰❤️🥰 This is a great option for affordable, delicious eating!! Kwazy k Staff was very friendly good food too we got the wrong order and they made us a whole new one for free. Frequently Asked Questions What are your hours of operation? Light of Tokyo Rivers Ave is open Monday through Saturday from 11:00 AM to 10:00 PM. We're closed on Sundays. What type of food do you serve? We specialize in cuisine with popular dishes like , , , and our . japanese med steak bowl lg pepper chicken bowl tokyo bento steak shrimp tempura roll spicy salmon roll What are your most popular dishes? Our customers love our , , , and . Dragon Roll Super Crab Roll Tuna lover Salmon Avocado Roll Beef Dumplings What areas do you service? We service +, , and surrounding areas. 7620 Rivers Ave Suite 330 North Charleston, SC 29406 deer park pepperhill windsor hill 7620 Rivers Ave Suite 330 North Charleston, SC 29406 843-572-2818 Business Hours Sunday: Closed Monday: - 11:00 AM 10:00 PM Tuesday: - 11:00 AM 10:00 PM Wednesday: - 11:00 AM 10:00 PM Thursday: - 11:00 AM 10:00 PM Friday: - 11:00 AM 10:00 PM Saturday: - 11:00 AM 10:00 PM Start an order",
      "hash": "f22668d19667",
      "downloadedAt": "2026-01-18T17:00:04.260Z",
      "trimmedAt": "2026-01-18T17:04:41.785Z",
      "sizeReduction": "96.4%"
    },
    {
      "url": "https://www.lightoftokyo.com/menu/med-steak-bowl",
      "text": "Skip to main content Savor our delicious MED Steak Bowl at . Rivers Ave Order online for our delicious MED Steak Bowl. Order Delivery Order Pickup Pepper Chicken Plate Add Item Orange Chicken Plate Add Item Hibachi Chicken Add Item Hibachi Steak Shrimp Add Item 3 Combo Plate Add Item Hibachi Vegetables Add Item Hibachi Shrimp Add Item Hibachi Tofu Steak Add Item Hibachi Steak Chicken Add Item Hibachi Steak Add Item 7620 Rivers Ave Suite 330 North Charleston, SC 29406 843-572-2818 Business Hours Sunday: Closed Monday: - 11:00 AM 10:00 PM Tuesday: - 11:00 AM 10:00 PM Wednesday: - 11:00 AM 10:00 PM Thursday: - 11:00 AM 10:00 PM Friday: - 11:00 AM 10:00 PM Saturday: - 11:00 AM 10:00 PM Start an order Frequently Asked Questions Do you offer catering services? Yes, we provide full catering services for events of all sizes. Our catering menu features our most popular dishes and can be customized to meet your specific needs. Contact us to discuss your event requirements. What are your hours of operation? We're open Tuesday through Sunday from 11:00 AM to 10:00 PM. We're closed on Mondays for kitchen prep and staff training. Holiday hours may vary - please call ahead to confirm.",
      "hash": "f3a6a9205d0f",
      "downloadedAt": "2026-01-18T17:00:05.912Z",
      "trimmedAt": "2026-01-18T17:04:41.796Z",
      "sizeReduction": "97.9%"
    }
  ],
  "sizeReduction": "97.3%"
}