{
  "venueId": "ChIJZd3SAWp8_ogRwQFNTc0v-Jo",
  "venueName": "Sarku Japan",
  "venueArea": "West Ashley",
  "website": "https://www.sarkujapan.com/",
  "scrapedAt": "2026-01-18T17:04:27.947Z",
  "trimmedAt": "2026-01-18T17:11:13.131Z",
  "pages": [
    {
      "url": "https://www.sarkujapan.com/locations/",
      "text": "Find a Sarku Japan To order, please pick a location and choose \"Order Online & Pickup In-store\" Zip, City, Address Choose Radius, miles 5 miles 5 miles 10 miles 20 miles 30 miles 50 miles Reset 21st Street 33-10 21st StreetLong Island City, NY, 11106 Alderwood Mall 3000 184th Street SW Space #854Lynnwood, WA, 98037 Altamonte Mall 451 East Altamonte Dr. Space #FS04Altamonte Springs, FL, 32701 Arbor Place 6700 Douglas Blvd., Sp. FC-03Douglasville, GA, 30135 Arena North Lauderdale Shoppes 7974 W McNab Road,North Lauderdale, FL, 33068 Aspen Hill Shopping Center 13509 Connecticut AvenueSilver Spring, MD, 20906 Augusta Mall 3450 Wrightsboro Rd., Space #2395Augusta, GA, 30909 Aurora Mall 14200 East Alameda Ave., Space #2064AAurora, CO, 80012 Barton Creek Square 2901 Capital of Texas Hwy., Sp. #VC-03Austin, TX, 78746 Baybrook Mall 500 Baybrook Mall Dr., Unit 002Friendswood, TX, 77546 Boynton Beach Mall 801 N. Congress Ave., #661Boynton Beach, FL, 33426 Brookfield Plaza 7000A Brookfield PlazaSpringfield, VA, 22150 Cape Cod Mall Sp. F107, Route 132Hyannis, MA, 02601 Carolina Place 11025 Carolina Place Pkwy., Sp. #FC-04Pineville, NC, 28134 Chambers St 77 Chambers StNew York, NY, 10007 Charleston Town Center 3023 Charleston Town Ctr.Charleston, WV, 25389 Chicago Ridge Mall 444 Chicago Ridge Mall, Space FC 15Chicago Ridge, IL, 60415 Citadel Mall 2070 Sam Rittenberg Blvd., FC-3Charleston, SC, 29407 Clear Creek Shopping Center at Fort Cavazos Main Exchange, Bldg. 4250 Clear Creek Blvd., (Suite Number 216)Fort Cavazos, TX, 76544 Coastland Center Mall 1858 Tamiami Trail North, Unit FC-5ANaples, FL, 34102 Columbiana Centre 100 Columbiana Cr., #1264Columbia, SC, 29212 Coral Ridge Mall 1451 Coral Ridge Avenue, Space 616Coralville, IA, 52241 Coral Square Shopping Center 9417 West Atlantic Blvd.Coral Springs, FL, 33071 Cordova Mall 5100 N. 9th Avenue, Sp. #J936Pensacola, FL, 32504 Corner Mall 417-435 Washington St.Boston, MA, 02108 Countryside Mall 27001 US Hwy 19 N., Sp. 2087Clearwater, FL, 33761 Coventry Plaza 7732 Old Branch AvenueClinton, MD, 20735 Crabtree Valley Mall 4325 Glenwood Avenue, Space 2056Raleigh, NC, 27612 Cross County Shopping Center 8000 Mall Walk, Sp. 3090 and 3020AYonkers, NY, 10704 Cross Creek Mall 419 Cross Creek Mall, Space #FC-8Fayetteville, NC, 28303 Deerbrook Mall 20131 Highway 59 North, Sp#2136Humble, TX, 77338 Del Amo Fashion Center 3525 W. Carson Street, Space VC09Torrance, CA, 90503 Dover Mall 1365 N. Dupont Hwy., Unit 3072Dover, DE, 19901 Dulles Landing Shopping Center 24555 Dulles Landing Dr., Ste. 100Arcola, VA, 20166 Dulles Town Center 21100 Dulles Town Circle, Suite #238Dulles, VA, 20166 East Towne Mall 237 East Towne Mall, FC-12Madison, WI, 53704 Elizabeth 176A Elmora AvenueElizabeth, NJ, 07202 Essex St 340 Essex StreetLodi, NJ, 07644 Fashion Centre at Pentagon City 1100 S. Hayes Street, Space #VC06Arlington, VA, 22202 Fashion Fair Mall 521 East Shaw Avenue, Space #FC04 (Suite 104)Fresno, CA, 93710 Fayette Mall 3401 Nicholasville Road, Sp. #FC-5Lexington, KY, 40503-3693 First Colony Mall 16535 Southwest Freeway, Space 427Sugar Land, TX, 77479 Flatiron Crossing Mall 1 West Flatiron Crossing Drive, Unit FF-224Broomfield, CO, 80021 Fort Campbell Exchange 2840 Bastogne Avenue, Suite #D0009Fort Campbell, KY, 42223 Fort Sam Houston Main Exchange 2500 Funston Road, Building B-2542, Space #D0004San Antonio, TX, 78234 Fort Sill Exchange PXTRA, 1712 Macomb Rd., Space 203Fort Sill, OK, 73503 Foundry Row 10132 Reisterstown Road, Suite 10Owings Mills, MD, 21117 Fox River Mall 4301 W. Wisconsin Ave., Sp. 618Appleton, WI, 54913 Fox Run Mall 50 Fox Run Mall, Suite 72Newington, NH, 03801 Freedom Crossing at Fort Bliss 1613 Pleasanton, Suite B-125El Paso, TX, 79906 Glenbrook Square 4201 Coldwater Rd., Sp. FC-5Fort Wayne, IN, 46805 Governor's Square Mall 1500 Apalachee Parkway, Space #1065Tallahassee, FL, 32301 Great Mall 614 Great Mall Drive, Space #FC14Milpitas, CA, 95035 Great Northern Plazas 25853 Great Northern Shop CenterNorth Olmsted, OH, 44070 Green Acres Mall 2020 Green Acres Mall, Unit 210Valley Stream, NY, 11581 Greenbrier Mall 1401 Greenbrier Pkwy South, Space 2009Chesapeake, VA, 23320 Greenwood Park Mall 1251 US 31 North, VC-05Greenwood, IN, 46142 Hamilton Place 2100 Hamilton Place Blvd. Sp. 310Chattanooga, TN, 37421 Hanes Mall 3320 Silas Creek Parkway, Unit FC-8Winston-Salem, NC, 27103 Haywood Mall 700 Haywood Rd., Box 525, Sp. 2109Greenville, SC, 29607 Hillsdale Shopping Center 80 Hillsdale MallSan Mateo, CA, 94403 Ingram Park Mall 6301 NW Loop 410, Space #VC-3San Antonio, TX, 78238 Interstate Shopping Center 1255 Route 17 South, Suite #2Ramsey, NJ, 07446 Jamaica Avenue 155-33 Jamaica AveJamaica, NY, 11432 Jesse Jewell Parkway 1235 Jesse Jewell ParkwayGainesville, GA, 30501 Joint Base Lewis-McChord 5280 Pendleton Ave.JBLM, WA, 98433 Junction Boulevard 37-21 Junction BlvdCorona, NY, 11368 Kearny Plaza 190 Passaic Ave., Unit #101Kearny, NJ, 07032 Kings Crossing Shopping Center 6309 Richmond HighwayAlexandria, VA, 22306 La Palmera Mall 5488 S. Padre Island Dr., Space #1008Corpus Christi, TX, 78411 Lenox Square 3393 Peachtree Road NE., Space #1013Atlanta, GA, 30326 Los Cerritos Center 125 Los Cerritos Center, Space# FC-11Cerritos, CA, 90703 Lynnhaven Mall 701 Lynnhaven Pkwy., Space #FC-25Virginia Beach, VA, 23452 Maine Mall 364 Maine Mall Rd., Sp. F109South Portland, ME, 04106 Market Place Shopping Center 2000 N. Neil St., Sp. 710Champaign, IL, 61820 Memorial City Mall 303 Memorial City, Space #395FHouston, TX, 77024 Menlo Park Mall 55 Parsonage Road, Unit FS04Edison, NJ, 08837 Monroeville Mall Route 22 & Mall Dr., Unit A21Monroeville, PA, 15146 Montgomery Mall 7101 Democracy Blvd. Space #FC 3Bethesda, MD, 20817 Natick Mall 1245 Worcester St., #2014Natick, MA, 01760-1553 Nellis Air Force Base Exchange 5691 Rickenbacker Road, Space #FDD08Nellis AFB, NV, 89191 Newport Centre 30 Mall Drive W., 3rd Floor, Sp. 16Jersey City, NJ, 07310 North Park Center 8687 North Central Expressway, Space #2J2-2392Dallas, TX, 75225 North Riverside Park Mall 7501 W. Cermak Road, Space #VC4North Riverside, IL, 60546 Northpoint Mall 1000 Northpoint Cr.Alpharetta, GA, 30022 Northridge Mall 1586 Northridge Mall, Space #FC-04Salinas, CA, 93906 Oak Park Mall 11521 West 95th Street, Sp.#FC-GOverland Park, KS, 66214 Oak View Mall 3001 South 144th Street, Space #VC-7Omaha, NE, 68144 Oglethorpe Mall 7804 Abercorn St., Sp. #FC-10Savannah, GA, 31406 Orange Park Mall 1910 Wells Rd., Sp. VC-16Orange Park, FL, 32073 Orlando International Premium Outlets 4969 International Drive, Space #FC-2Orlando, FL, 32819 Orlando Vineland Premium Outlets 8200 Vineland Avenue, Space #1204Orlando, FL, 32821 Pacific View Mall 3301 East Main Street, Sp. 2531Ventura, CA, 93003 Park Place Mall 5870 E. Broadway Blvd., Sp. 556Tucson, AZ, 85711 Peachtree Mall 3131 Manchester Expressway, Suite 9FColumbus, GA, 31909 Penn Square Mall 1901 NW Expressway, Suite #2055 A,Oklahoma City, OK, 73118 Perimeter Mall 4400 Ashford Dunwoody Rd.Atlanta, GA, 30346 Pheasant Lane Mall 310 Daniel Webster Hwy, Ste. 155Nashua, NH, 03060 Potomac Mills 2700 Potomac Mills Circle, Suite 473 (Space # F013)Woodbridge, VA, 22192 Quaker Bridge Mall 150 Quaker Bridge Mall Road, Space #FC03Lawrenceville, NJ, 08648 Queens Center 90-15 Queens Blvd., Space #FC-10Elmhurst, NY, 11373 Ridge Park Square Shopping Center 4742 Ridge RoadBrooklyn, OH, 44144 Rockaway Town Square 301 Mount Hope Ave., Suite 2102,Rockaway, NJ, 07866 Roosevelt Field Mall 630 Old Country Rd., FB-12Garden City, NY, 11530 Rosspark Mall 1000 Rosspark Mall Dr., VC3Pittsburgh, PA, 15237 Security Square Mall 6901 Security Blvd., Unit 10Baltimore, MD, 21244 Shoppes at North Brunswick 530 Shoppes Blvd.North Brunswick, NJ, 08902 Solomon Pond Mall 601 Donald Lynch Blvd.Marlborough, MA, 01752 South County Center 85 South County Centerway, Unit FC-9St. Louis, MO, 63129 South Shore Mall 1701 Sunrise Hwy, FC-1Bayshore, NY, 11706 South Shore Plaza 250 Granite St., Upper Level, Sp. 2103Braintree, MA, 02184 SouthPark Mall (NC) 4400 Sharon Road, Space #VC07Charlotte, NC, 28211 SouthPark Mall (OH) 500 SouthPark Center, FC-5Strongsville, OH, 44136 Springfield Ave. Marketplace 210 Springfield Avenue Space #B-104Newark, NJ, 07103 St. Clair Square 134 St. Clair Square, Space #282Fairview Heights, IL, 62208 Starrett City Pathmark Shopping Center 11114A Flatlands AvenueBrooklyn, NY, 11207 Staten Island Mall 2655 Richmond Ave. Space FC-05Staten Island, NY, 10314 Steeplechase 95 9141 Alaking Court Ste #110Capitol Heights, MD, 20743 Stonebriar Centre 2601 Preston Road, Space #2044Frisco, TX, 75034 Summerhill Square 623 Route 18 SouthEast Brunswick, NJ, 08816 Superstition Springs Center 6555 E. Southern Ave., Space H10Mesa, AZ, 85206 Tacoma Mall 4502 S. Steele St., Store VC-08Tacoma, WA, 98409 Teterboro Landing 8 Teterboro Landing Drive, Suite A-6Teterboro, NJ, 07608 The Avenue Shoppes 7599 Mentor AvenueMentor, OH, 44060 The Avenues 10300 Southside Blvd., Space 3130Jacksonville, FL, 32256 The Crossing 197 East 22nd StreetBayonne, NJ, 07002 The Mall at Bay Plaza 200 Baychester Avenue, Space #FF-10Bronx, NY, 10475 The Mall in Columbia 10300 Little Patuxent Pkwy.,Sp. 1350Columbia, MD, 21044-3341 The Mall of New Hampshire 1500 S. Willow St., Sp. F-105Manchester, NH, 03103 The Oaks Mall 382 W. Hillcrest Dr., Space #FC03Thousand Oaks, CA, 91360 The Parks at Arlington 3811 South Cooper Street, Space #2146Arlington, TX, 76015 The Shoppes at Nottingham Square I 5272 Campbell BlvdBaltimore, MD, 21236 The Shops at Mission Viejo 555 The Shops at Mission Viejo, VC-02Mission Viejo, CA, 92691 The Shops at Tanforan 1150 El Camino Real, Suite 184San Bruno, CA, 94066 The Village at Bridgewater Commons 640 Commons Way, Space 4260Bridgewater, NJ, 08807 The Village at College Park 10280 Baltimore Ave., Suite ACollege Park, MD, 20740 The Woodlands Mall 1201 Lake Woodlands Drive, Space #2152The Woodlands, TX, 77380 Throgs Neck Shopping Center 815 Hutchinson River Parkway, Space #B-135Bronx, NY, 10465 Towne Centre at Laurel 14720 Baltimore Ave., Space #107Laurel, MD, 20707 Towson Town Center 825 Dulaney Valley Road, Space 3310Towson, MD, 21204 Trumbull Shopping Park 5065 Main St., Sp.#FC-3Trumbull, CT, 06611 Turnpike Shopping Center 9508 Main StreetFairfax, VA, 22031 Valley Fair Mall 2855 Stevens Creek Blvd., FC-4/Ste. 2457Santa Clara, CA, 95050 Valley Plaza Mall 2701 Ming Avenue, Sp. F-8Bakersfield, CA, 93304 Valley River Center 293 Valley River Center, Unit G-13Eugene, OR, 97401 Visalia Mall 2231 South Mooney Blvd.Visalia, CA, 93277 Washington Square 9625 SW Washington Square RoadTigard, OR, 97223 West County Center 168 West County Center, Unit FC-3Des Peres, MO, 63131 West Oaks Mall 9401 W. Colonial Dr., Ste. 252Ocoee, FL, 34761 West Sunrise Highway 129 W. Sunrise HighwayFreeport, NY, 11520 West Town Mall (TN) 7600 Kingston PikeKnoxville, TN, 37919 West Towne Mall (WI) 111 West Towne Mall, FC-57Madison, WI, 53719 Westfield Brandon 459 Brandon Town Center Drive, Space #FC3Brandon, FL, 33511 Westfield Broward 8000 West Broward Blvd., Sp. #FC09Plantation, FL, 33388 Westfield Citrus Park Mall 8017 Citrus Park Town Ctr,Tampa, FL, 33625 Westfield Culver City 6000 Sepulveda Blvd., Suite 3248Culver City, CA, 90230 Westfield Oakridge Mall 925 Blossom Hill Road, Suite 1609San Jose, CA, 95123 Westfield Plaza Bonita 3030 Plaza Bonita Road, Suite FC8National City, CA, 91950 Westfield Southcenter 2600 Southcenter Mall, FC #3Tukwila, WA, 98188 Westfield Wheaton 11160 Veirs Mill Rd., Space P208Wheaton, MD, 20902 Westgate Mall 200 Westgate Drive, Suite# E109Brockton, MA, 02301 White Marsh Mall 8200 Perry Hall Blvd. Sp. 2465Baltimore, MD, 21236-4901 White Marsh Mall - Sushi Bar 8200 Perry Hall Blvd, Sp. 2465Baltimore, MD, 21236-4901 White Oak Shopping Center 11201 New Hampshire AvenueSilver Spring, MD, 20904 Whitestone Expressway 133-38 Whitestone ExpyFlushing, NY, 11354 Willowbrook Mall (NJ) 1145 Willowbrook MallWayne, NJ, 07470 Willowbrook Mall (TX) 2000 Willowbrook Mall, Space #1193Houston, TX, 77070 Windward Shopping Center 5304 Windward Parkway, Suite A-102Milton, GA, 30004 Wolfchase Galleria 2760 N. Germantown Parkway, Suite #254Memphis, TN, 38133 Yorktown Shopping Center 203 Yorktown Shopping Center, FC-3Lombard, IL, 60148 Find a Sarku Japan Near You Looking for fresh, made-to-order Japanese food nearby? Use our Sarku Japan store locator to find the closest restaurant to you. With more than 170 locations across 34 states, plus over 30 in Colombia, Sarku Japan has become the go-to spot for quick, fresh and flavorful meals prepared right in front of our guests. Whether you’re searching “Sarku Japan near me” or planning a visit to a mall or shopping center, chances are there’s a location not too far away. Each restaurant offers our signature Chicken Teriyaki, cooked hot off the grill with fresh vegetables, rice or noodle, and our famous Teriyaki sauce. We also offer Beef and Shrimp Teriyaki, Sushi and Bento Boxes. From busy food courts in California and Florida to standalone street locations in New York and Cleveland and military bases across the U.S., our stores are designed to bring the energy and flavor of teppanyaki cooking to your neighborhood. Finding a Sarku Japan address is simple. Just enter your city, ZIP code, or address in the search box above and browse through available options. The locator makes it easy to discover exact store details, from street addresses to operating hours, so you can pick the most convenient restaurant for dine-in, takeout, or online ordering. Since opening the very first store in Boston back in 1987, Sarku Japan has continued to grow while staying true to its Kaizen philosophy of continuous improvement. No matter which location you visit, you can expect the same dedication to quality ingredients, freshly grilled meals, and friendly service that has made us a favorite for millions of customers.",
      "hash": "1cf49cb3230d",
      "downloadedAt": "2026-01-18T17:03:14.286Z",
      "trimmedAt": "2026-01-18T17:11:13.079Z",
      "sizeReduction": "89.5%"
    },
    {
      "url": "https://www.sarkujapan.com/product-category/teriyaki/",
      "text": "Chicken Teriyaki What we’re famous for! Our tender chicken is marinated in-house daily, then cooked to order on the griddle, topped with our signature teriyaki sauce and served with rice and a medley of vegetables. 640 Calories 24g Fat 870mg Sodium 28g Protein 79g Carbs Beef Teriyaki Tender all American beef cooked on the griddle to order, topped with our signature teriyaki sauce and served with rice and a medley of vegetables. 580 Calories 16g Fat 1220mg Sodium 30g Protein 80g Carbs Shrimp Teriyaki Succulent shrimp cooked to order on the griddle, topped with our signature teriyaki sauce and served with rice and a medley of vegetables. 530 Calories 12g Fat 1200mg Sodium 27g Protein 80g Carbs Chicken & Shrimp Teriyaki Can’t decide? Get a mixture of our most popular chicken and shrimp mixed with a medley of vegetables and our signature teriyaki sauce. 750 Calories 29g Fat 1450mg Sodium 40g Protein 85g Carbs Beef & Shrimp Teriyaki The best of both worlds! Our beef and shrimp teriyaki with a medley of vegetables, served over rice with our famous teriyaki sauce . 690 Calories 21g Fat 1800mg Sodium 41g Protein 85g Carbs Chicken Teriyaki Bowl A smaller portion of our signature Chicken Teriyaki served in a bowl over rice and a medley of vegetables. 430 Calories 16g Fat 580mg Sodium 19g Protein 53g Carbs Chicken Teriyaki Beef Teriyaki ShrimpTeriyaki Chicken & ShrimpTeriyaki Beef & ShrimpTeriyaki Chicken Teriyaki Bowl Pricing may vary by location, to find your nearest location and place an order. All menu items contain soy and may contain other . click here allergens * Raw Fish: Consuming raw or undercooked meats, poultry, seafood, shellfish, or eggs may increase your risk of foodborne illness especially if you have certain medical conditions. Teriyaki Bento Sushi Sides Beverages",
      "hash": "38a18fe286b0",
      "downloadedAt": "2026-01-18T17:03:15.974Z",
      "trimmedAt": "2026-01-18T17:11:13.098Z",
      "sizeReduction": "97.7%"
    },
    {
      "url": "https://www.sarkujapan.com/menus/",
      "text": "Chicken Teriyaki What we’re famous for! Our tender chicken is marinated in-house daily, then cooked to order on the griddle, topped with our signature teriyaki sauce and served with rice and a medley of vegetables. 640 Calories 24g Fat 870mg Sodium 28g Protein 79g Carbs Beef Teriyaki Tender all American beef cooked on the griddle to order, topped with our signature teriyaki sauce and served with rice and a medley of vegetables. 580 Calories 16g Fat 1220mg Sodium 30g Protein 80g Carbs Shrimp Teriyaki Succulent shrimp cooked to order on the griddle, topped with our signature teriyaki sauce and served with rice and a medley of vegetables. 530 Calories 12g Fat 1200mg Sodium 27g Protein 80g Carbs Chicken & Shrimp Teriyaki Can’t decide? Get a mixture of our most popular chicken and shrimp mixed with a medley of vegetables and our signature teriyaki sauce. 750 Calories 29g Fat 1450mg Sodium 40g Protein 85g Carbs Beef & Shrimp Teriyaki The best of both worlds! Our beef and shrimp teriyaki with a medley of vegetables, served over rice with our famous teriyaki sauce . 690 Calories 21g Fat 1800mg Sodium 41g Protein 85g Carbs Chicken Teriyaki Bowl A smaller portion of our signature Chicken Teriyaki served in a bowl over rice and a medley of vegetables. 430 Calories 16g Fat 580mg Sodium 19g Protein 53g Carbs Chicken Teriyaki Beef Teriyaki ShrimpTeriyaki Chicken & ShrimpTeriyaki Beef & ShrimpTeriyaki Chicken Teriyaki Bowl Pricing may vary by location, to find your nearest location and place an order. All menu items contain soy and may contain other . click here allergens * Raw Fish: Consuming raw or undercooked meats, poultry, seafood, shellfish, or eggs may increase your risk of foodborne illness especially if you have certain medical conditions. Teriyaki Bento Sushi Sides Beverages",
      "hash": "73a29760c5d5",
      "downloadedAt": "2026-01-18T17:03:15.240Z",
      "trimmedAt": "2026-01-18T17:11:13.113Z",
      "sizeReduction": "97.7%"
    },
    {
      "url": "https://www.sarkujapan.com/",
      "text": "HAPPENS HERE FRESH Explore Menu Our Menu Enjoy our World Famous Teriyaki meals today Teriyaki Entrées Bento Box Sushi Rolls Side Orders Teriyaki Entrées Bento Box Sushi Rolls Side Orders Become a Rewards Member Get $5 off your first order Earn points on every purchase Earn rewards and receive exclusive offers and discounts Skip the line by ordering ahead Learn More Download Our App for $5 Off Order ahead, skip the line and be the first to hear about upcoming specials when you download the Sarku Japan app. Get $5 off App Order Your 1st Fresh Happens Here! Click below to visit our official Facebook and Instagram account Follow Lightbox link for post with description Exclusive Member Limited Time Offer! Every... Exclusive Member Limited Time Offer! Every Thursday for the rest of January, double down on amazing flavor with our BOGO $2.99 Chicken Teriyaki Entrée Special! It doesn't matter if you’re sharing with a friend or enjoying two times the teriyaki for yourself; make sure you don't miss ... out on this delicious deal. This promotion is only on the Sarku Japan App and Online Ordering. How to get yours? 1. Open the Sarku Japan App and login to your account 2. Navigate to our menu 3. Select 'Specials' in our Exclusive Members' menu 4. Add the BOGO $2.99 Chicken Teriyaki to your cart (You will have to add the first one to the cart, then a prompt will appear for the second Chicken Teriyaki for $2.99) *Must purchase a regular-priced Chicken Teriyaki Entrée to redeem the second Chicken Teriyaki Entrée for $2.99 (+ tax). Available ONLY on Sarku Japan App and Online Ordering at participating locations. Add-ons available at an additional cost. Valid only on Jan 8, 15, 22, and 29, 2026. Not valid in-store or on 3rd-party delivery. 34 4 Share 104532512695000_750096598146626 Follow Lightbox link for post with description Shoutout to one of our National Chicken Teriyaki... Shoutout to one of our National Chicken Teriyaki Day winners! That thumbs up says it all. Did you get your FREE Chicken Teriyaki for a Year win too? Tag us so we can celebrate with you. (＾▽＾) 📷: Joseph Taylor 13 2 Share 104532512695000_749326221556997 Follow Lightbox link for post with description Cravings don’t wait and neither should you.... Cravings don’t wait and neither should you. Order online and skip straight to the good part! sarkujapan.com/locations 26 4 Share 104532512695000_748661714956781 Follow Lightbox link for post with description Rolled fresh. Served fresh. Loved instantly.... Rolled fresh. Served fresh. Loved instantly. (๑˘︶˘๑) Sushi that hits just right! 15 1 Share 104532512695000_746649525158000",
      "hash": "f79ec8f5f895",
      "downloadedAt": "2026-01-18T17:03:13.952Z",
      "trimmedAt": "2026-01-18T17:11:13.131Z",
      "sizeReduction": "97.6%"
    }
  ],
  "sizeReduction": "95.0%"
}