{
  "venueId": "ChIJQw1cZe9v_ogRcvBdGFJHNv0",
  "venueName": "Wasabi of Daniel Island",
  "venueArea": "Daniel Island",
  "website": "http://danielisland.wasabirestaurantgroup.com/",
  "scrapedAt": "2026-01-18T16:25:30.870Z",
  "trimmedAt": "2026-01-18T16:25:31.848Z",
  "pages": [
    {
      "url": "http://danielisland.wasabirestaurantgroup.com/charleston-daniel-island-wasabi-of-daniel-island-events",
      "text": "Events Valentine's Day Saturday February 14th Join us on Valentine's Day for the perfect romantic evening! 11:00 AM - 09:45 PM 2026-02-14 11:00:00 2026-02-14 21:45:00 America/New_York Valentine's Day Join us on Valentine's Day for the perfect romantic evening! Wasabi of Daniel Island Wasabi of Daniel Island info@wasabi-di.com Mardi Gras Tuesday February 17th Come celebrate Mardi Gras with us. 11:00 AM - 09:45 PM 2026-02-17 11:00:00 2026-02-17 21:45:00 America/New_York Mardi Gras Come celebrate Mardi Gras with us. Wasabi of Daniel Island Wasabi of Daniel Island info@wasabi-di.com National Margarita Day Sunday February 22nd Come celebrate National Margarita day with us on February 22nd. 11:00 AM - 11:59 PM 2026-02-22 11:00:00 2026-02-22 23:59:00 America/New_York National Margarita Day Come celebrate National Margarita day with us on February 22nd. Wasabi of Daniel Island Wasabi of Daniel Island info@wasabi-di.com International Women's Day Sunday March 8th Come celebrate International Women's Day with us - March 8th 11:00 AM - 11:59 PM 2026-03-08 11:00:00 2026-03-08 23:59:00 America/New_York International Women's Day Come celebrate International Women's Day with us - March 8th Wasabi of Daniel Island Wasabi of Daniel Island info@wasabi-di.com St. Patrick's Day Tuesday March 17th Grab your best green garb and join us for St. Patrick's Day! 11:00 AM - 09:45 PM 2026-03-17 11:00:00 2026-03-17 21:45:00 America/New_York St. Patrick's Day Grab your best green garb and join us for St. Patrick's Day! Wasabi of Daniel Island Wasabi of Daniel Island info@wasabi-di.com",
      "hash": "134f582a52d3",
      "downloadedAt": "2026-01-18T16:08:12.567Z",
      "trimmedAt": "2026-01-18T16:25:31.813Z",
      "sizeReduction": "97.7%"
    },
    {
      "url": "http://danielisland.wasabirestaurantgroup.com/charleston-daniel-island-wasabi-of-daniel-island-food-menu",
      "text": "Our Menu Lunch Menu Dinner Menu Sushi Bar Wasabi Happy Hour",
      "hash": "8c802d903420",
      "downloadedAt": "2026-01-18T16:08:10.670Z",
      "trimmedAt": "2026-01-18T16:25:31.821Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://danielisland.wasabirestaurantgroup.com/charleston-daniel-island-wasabi-of-daniel-island-happy-hours-specials",
      "text": "Specials Saturday January 17th Happy Hour! 4:30-7:00pm 04:30 PM - 07:00 PM Daily Specials! Discounted Bottles of Wine up to 1/2 Off 04:30 PM - 09:45 PM Monday January 19th Happy Hour! 4:30-7:00pm 04:30 PM - 07:00 PM Daily Specials! 20% Off For All Military, Health Care, Firefighters, Policeman And Teachers 04:30 PM - 09:45 PM Tuesday January 20th Daily Specials! Titos Tuesday 04:30 PM - 09:45 PM Happy Hour! 4:30-7:00pm 04:30 PM - 07:00 PM Wednesday January 21st Daily Specials! Ladies Night: Discounted Bottles of Wine up to 1/2 Off 04:30 PM - 09:45 PM Happy Hour! 4:30-7:00pm 04:30 PM - 07:00 PM Thursday January 22nd Daily Specials! $3 Asian Bottled Beers * Sapporo 22oz cans for $5.50 04:30 PM - 09:45 PM Half off Hot Sake! ANY size, ANY flavor, EVERY Thursday! 04:30 PM - 09:45 PM Happy Hour! 4:30-7:00pm 04:30 PM - 07:00 PM Friday January 23rd Happy Hour! 4:30-7:00pm 04:30 PM - 07:00 PM",
      "hash": "c054e752b7c0",
      "downloadedAt": "2026-01-18T16:08:11.953Z",
      "trimmedAt": "2026-01-18T16:25:31.825Z",
      "sizeReduction": "98.6%"
    },
    {
      "url": "http://danielisland.wasabirestaurantgroup.com/charleston-daniel-island-wasabi-of-daniel-island-drink-menu",
      "text": "Our Drinks Beer Wine Sake Signature Drinks",
      "hash": "d00fc3c930f4",
      "downloadedAt": "2026-01-18T16:08:11.314Z",
      "trimmedAt": "2026-01-18T16:25:31.828Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "http://danielisland.wasabirestaurantgroup.com/",
      "text": "× We offer Gift Cards! The perfect holiday present Give the gift of delicious food and drink! Purchase gift cards for your friends and family today! Gift Cards × We are taking online reservations! Let’s ensure you get a great table: Book today! We recommend making a reservation ahead of time. Book your table today! Book Table × Order your favorite dishes in seconds! Order Online × We're hiring! Call, email, or submit an inquiry today to learn more! Job Listings 194 Seven Farms Drive, Charleston, SC 29492 map marker pin About us Welcome to Wasabi DI Wasabi of Daniel Island provides the exquisitely balanced Japanese Fusion between the traditional Japanese cooking techniques and our own modern touch. Read more about us Parties Book your next party with us! Come to celebrate your special event or - give us the opportunity to make your event memorable. We look forward to serving and seeing you soon! Parties book now Order online Pick Up Your Favorite Food Don't feel like cooking today? We got you covered - order now! Order Welcome to Wasabi DI Our Menu Full Bar is Available Drinks GREAT OUTDOOR PATIO Reservations Authentic JAPANESE Food Order Host your next party with us Parties Packed With Lots Of Flavor Catering CHECK OUT OUR SPECIALS Specials Dot slide navigation number 1 Dot slide navigation number 2 Dot slide navigation number 3 Dot slide navigation number 4 Dot slide navigation number 5 Dot slide navigation number 6 Dot slide navigation number 7 Dot slide navigation number 8 Dot slide navigation number 9 Dot slide navigation number 10 Dot slide navigation number 11 Dot slide navigation number 12 Dot slide navigation number 13 slideshow start stop playing Reservations Book your table online Make sure your table is ready. Make an online reservation. Reservations Reviews review by - Yelp Mary D: First time, I really wanted avocado roll and it went in from there. From Uber eats delivery was on time and food was hot. The food was really good! The rice was tasty. The calamari was delicious. Tempura shrimp...there wasn't enough! So good. Gyoza- dumplings looked so good and nicely brown. All in all the food was really good and we will be ordering again. review by - Yelp Jessica B: Took my friends visiting town and we had a great experience! Service was fast, and every server was nice and attentive - we agreed they were our best servers since the pandemic began. We got the salmon hibachi dinner, NY strip hibachi dinner, shrimp yaki udon, and the crunchy crab maki roll. One of my friends asked for the miso soup instead of the house soup, but we all liked the house soup better. review by - Yelp Nick D: I go to Wasabi at least twice a week for lunch and their dinner is always fantastic also. I've tried numerous items on the menu and no matter what I get, it's always hot, well cooked, and tastes amazing! Love it here. review by - Yelp Annamaria B: How I've not been here I just don't know. My fiancé and I had some time to grab some dinner before a concert and this seemed like the perfect spot to fill our recent cravings for some sushi. They have an awesome happy hour menu that goes until 7pm. Such a good selection of apps and rolls. We tried three, the California, spicy shrimp and crunchy crab. They were so good... review by - Yelp Leisa R: This is my grandson's and my favorite eatery! We love coming here for sushi and the quiet, peaceful atmosphere. Awesome! Our only wish is that it was open for lunch on Saturday's. But, work our plans around that. Highly recommend Wasabi of Daniel Island. Stop reviews carousel Play reviews carousel Newsletter Location 194 Seven Farms Drive Charleston, SC 29492 Hours Monday-Friday 11:30am-2:30pm, 4:30pm-9:30pm Saturday 4:30pm-9:30pm Sunday CLOSED Find us on... Twitter page Facebook page Instagram page Yelp page Contact us (843)-388-8828 info@wasabi-di.com Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "f6b1b33d790f",
      "downloadedAt": "2026-01-18T16:08:10.489Z",
      "trimmedAt": "2026-01-18T16:25:31.848Z",
      "sizeReduction": "97.4%"
    }
  ],
  "sizeReduction": "98.8%"
}