{
  "venueId": "ChIJ898DAQ16_ogRDxtyLVEPpOI",
  "venueName": "Big John's Tavern",
  "venueArea": "Downtown Charleston",
  "website": "http://www.ilovebjs.com/",
  "scrapedAt": "2026-01-18T17:04:23.804Z",
  "trimmedAt": "2026-01-18T17:05:04.827Z",
  "pages": [
    {
      "url": "http://www.ilovebjs.com/charleston-market-street-area-big-john-s-happy-hours-specials",
      "text": "Specials Sunday January 18th Football Specials- $25 Select Domestic Buckets $5 Shots 11:00 AM - 02:00 AM Two For One Martinis 11:00 AM - 02:00 AM Monday January 19th Football Specials- $25 Select Domestic Buckets $5 Shots 04:00 PM - 02:00 AM Two For One Martinis 04:00 PM - 02:00 AM Beat the Clock!!! All OTH Drafts start at $4.00 @ 4 PM and increase by $1 until 7 PM 04:00 PM - 07:00 PM Tuesday January 20th Burger Night and Karaoke! $12 Big Johns Double Bacon Cheeseburger or East Bay Burger with Fries Karaoke 9pm-Close Beat the Clock!!! All OTH Drafts start at $4.00 @ 4 PM and increase by $1 until 7 PM 04:00 PM - 02:00 AM Two For One Martinis 04:00 PM - 02:00 AM Wednesday January 21st Beat the Clock!!! All OTH Drafts start at $4.00 @ 4 PM and increase by $1 until 7 PM 04:00 PM - 07:00 PM Two For One Martinis 04:00 PM - 02:00 AM Thursday January 22nd Two For One Martinis 11:00 AM - 02:00 AM Beat the Clock!!! All OTH Drafts start at $4.00 @ 4 PM and increase by $1 until 7 PM 04:00 PM - 07:00 PM Friday January 23rd Two For One Martinis 11:00 AM - 02:00 AM Beat the Clock!!! All OTH Drafts start at $4.00 @ 4 PM and increase by $1 until 7 PM 04:00 PM - 07:00 PM Saturday January 24th Football Specials- $25 Select Domestic Buckets $5 Shots 11:00 AM - 02:00 AM Two For One Martinis 11:00 AM - 02:00 AM",
      "hash": "0a6a9d03325b",
      "downloadedAt": "2026-01-18T16:52:11.342Z",
      "trimmedAt": "2026-01-18T17:05:04.785Z",
      "sizeReduction": "98.2%"
    },
    {
      "url": "http://www.ilovebjs.com/menu",
      "text": "Our Menu Tavern Menu Draft List RTD - Ready To Drink Cans Wine Cocktails Game Day Drink Specials Canned Beers $5 SHOT MENU (5 FOR $20) Tinis For Two",
      "hash": "2a97ba30ddb0",
      "downloadedAt": "2026-01-18T16:52:10.717Z",
      "trimmedAt": "2026-01-18T17:05:04.791Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "http://www.ilovebjs.com/menu#",
      "text": "Our Menu Tavern Menu Draft List RTD - Ready To Drink Cans Wine Cocktails Game Day Drink Specials Canned Beers $5 SHOT MENU (5 FOR $20) Tinis For Two",
      "hash": "6a7a0274b72b",
      "downloadedAt": "2026-01-18T16:52:12.608Z",
      "trimmedAt": "2026-01-18T17:05:04.799Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "http://www.ilovebjs.com/",
      "text": "× Inquire for your Private Party! Host your next party or get together! Book your party Reservations - We recommend making a reservation ahead of time. Book your table today! Book Table Reservations - We recommend making a reservation ahead of time. Book your table today! Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! Job Listings Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! 251 East Bay St., Charleston, SC 29401 map marker pin Reservations Join us today Call us at (843) 641-7269 or book a table through Resy reservations: Reserve Private Parties Book your next party with us! Need the space for your event? Search no more, we have the perfect place for you! Parties book now Drinks For the best time around Come in for a good time, stay for a long time. Drinks drinks Our menu Unapologetically delicious Enjoy the best in homestyle cooking our menu food We Specialize In Good Times Drinks Enjoy A TasteOf Home our menu The Party Is Here! parties Rustic Bar IsFull Of History Read More about us Dot slide navigation number 1 Dot slide navigation number 2 Dot slide navigation number 3 Dot slide navigation number 4 Dot slide navigation number 5 slideshow start stop playing Jobs Send us your resume! We are hiring and want to hear from you. Apply Now jobs Our history All your friends are here Big John’s Tavern is Charleston’s oldest tavern in one of America’s oldest towns. This rustic bar is full of history and has seen more than its fair share of lore that has grown over the years. If walls could talk there would be no shortage of stories. Some fact and some fiction, and some aged like a fine bourbon that gets better with time. Ask us about Big John Cannady, who played for the New York Giants from 1947-1954, before opening Big John's Tavern in 1955, in his hometown of Charleston, SC. Read more about us Reviews review by - Yelp Martha N: best service! great food! fun people! local! A must for locals and visitors!please leave a space for me review by - Yelp Leigh B: Stopped in for a glass of wine and decided to order a turkey burger. It was THE BEST turkey burger I have ever had - and I have had a lot of turkey burgers!Nice,local neighborhood spot. Recommend and I look forward to coming back for the turkey burger. review by - Yelp Samantha M: Will and andres provided the best service in Charleston! So welcoming and the craft cocktails are so unique. Big John's is a must and make sure to check out the speak easy!! review by - Yelp Amber M: This place is great. Live music, red leather bar stools, friendly bartenders. What else could you ask for? review by - Yelp Michael R: Great bar with incredible selections. Don't sleep on the food. Everything was fantastic, but I specifically loved the steak tartare. Stop reviews carousel Play reviews carousel Newsletter Location 251 East Bay St. Charleston, SC 29401 Hours Mon-Wed: 4pm-2am Thurs-Sun: 11am-2am Find us on... Facebook page Instagram page Yelp page Contact us (843)-641-7269 info@ilovebjs.com Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "7fd5abf8266b",
      "downloadedAt": "2026-01-18T16:52:10.597Z",
      "trimmedAt": "2026-01-18T17:05:04.824Z",
      "sizeReduction": "98.2%"
    },
    {
      "url": "http://www.ilovebjs.com/charleston-market-street-area-big-john-s-events",
      "text": "Events We are updating our events Please stay tuned",
      "hash": "c109a035fae2",
      "downloadedAt": "2026-01-18T16:52:11.973Z",
      "trimmedAt": "2026-01-18T17:05:04.827Z",
      "sizeReduction": "99.9%"
    }
  ],
  "sizeReduction": "99.2%"
}