{
  "venueId": "ChIJCWc4JAx6_ogR3_pC_CJK8G4",
  "venueName": "New York City Pizza",
  "venueArea": "Downtown Charleston",
  "website": "https://www.newyorkcitypizza.com/",
  "scrapedAt": "2026-01-18T17:04:24.293Z",
  "trimmedAt": "2026-01-18T17:05:19.446Z",
  "pages": [
    {
      "url": "https://www.newyorkcitypizza.com/menu/catering-menu/",
      "text": "Main content starts here, tab to start navigating Catering Menu All of our products are all-natural, housemade, and no preservatives Half trays feed 8-10Full trays feed 16-20 Inquire Now Appetizers Buffalo Wings Served with Celery and your Choice of Ranch or Blue Cheese Dressing 50 pcs 70 $ 100 pcs 140 $ Chicken Fingers Served with Celery and your Choice of Ranch or Blue Cheese Dressing 50 pcs 60 $ 100 pcs 120 $ Flavors Mild, Medium, Hot, Jack Daniel's BBQ, Calypso, Lemon Pepper, Garlic Parmesan Zucchini Sticks Served with our housemade Sugo 25 Psc 35 $ 50 Psc 70 $ Meatballs 25 Psc 85 $ 50 Psc 170 $ Mozzarella Sticks Served with our housemade Sugo 25 Pcs 50 $ 50 Psc 100 $ Antipasto Half Tray 60 $ Full Tray 120 $ Choice of 2 Dressings: House balsamic Vinaigrette, Ranch, Blue cheese, Honey Mustard, Parmesan Peppercorn, Mediterranean Vinaigrette, Caesar Salads Side Salad Half Tray 34 $ Full Tray 68 $ House Salad Half Tray 40 $ Full Tray 80 $ Caesar Salad Served with Caesar dressing Half Tray 40 $ Full Tray 80 $ Greek Salad Served with Mediterranean Vinaigrette Half Tray 45 $ Full Tray 90 $ Insalata Caprese Half Tray 50 $ Full Tray 100 $ Chopped Salad Half Tray 45 $ Full Tray 90 $ Desserts Cannoli Half Tray 30 $ Full Tray 60 $ Cheesecake Half Tray 35 $ Full Tray 70 $ Entrees Spaghetti and Meatballs Half Tray 60 $ Full Tray 120 $ Penne Bolognese Half Tray 65 $ Full Tray 130 $ Fettuccine Alfredo Half Tray 65 $ Full Tray 130 $ - 50 Add Chicken 25 $ $ Penne alla Vodka Half Tray 65 $ Full Tray 130 $ Baked Ziti Half Tray 60 $ Full Tray 120 $ Chicken Parmigiana Half Tray 70 $ Full Tray 140 $ Chicken Marsala Half Tray 80 $ Full Tray 160 $ Eggplant Parmigiana Half Tray 65 $ Full Tray 130 $ Linguine and Clams Half Tray 75 $ Full Tray 150 $ Heroes The Italian Half Tray 75 $ Full Tray 150 $ Ham and Cheese Half Tray 70 $ Full Tray 140 $ Turkey and Cheese Half Tray 70 $ Full Tray 140 $ Mulberry Prosciutto, fresh Mozzarella and roasted Tomatoes Half Tray 75 $ Full Tray 150 $ Meatball Parmigiana Half Tray 70 $ Full Tray 140 $ Eggplant Parmigiana Half Tray 70 $ Full Tray 140 $ Chicken Parmigiana Half Tray 70 $ Full Tray 140 $ Philly Cheesesteak Half Tray 80 $ Full Tray 160 $ Philly Chicken Cheesesteak Half Tray 70 $ Full Tray 140 $ Buffalo Chicken Half Tray 65 $ Full Tray 130 $ Email Signup Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "08bd0c862473",
      "downloadedAt": "2026-01-18T16:54:34.486Z",
      "trimmedAt": "2026-01-18T17:05:19.380Z",
      "sizeReduction": "96.2%"
    },
    {
      "url": "https://www.newyorkcitypizza.com/private-events/",
      "text": "Main content starts here, tab to start navigating Private Events Scroll Down to Content Book an Event Whether it be a birthday party, special occasion, family get together or business meeting, we have the ability to accommodate up to 200 people at one of our locations. Let us cater a custom menu to meet your event needs. For all inquiries, please fill out the form below and we’ll be in touch soon. Inquire Now Private Events Inquire Now Email Signup Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Contact Us About Your Private Event Please, enter a valid email Email - Required Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid phone number Phone Number - Required Please, enter a valid company Company - Required Event Date - Required Please, enter a valid start time Start Time - Required Start Time 11:30 PM 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM 6:30 AM 6:00 AM 5:30 AM 5:00 AM 4:30 AM 4:00 AM 3:30 AM 3:00 AM 2:30 AM 2:00 AM 1:30 AM 1:00 AM 12:30 AM 12:00 AM Please, enter a valid end time End Time - Required End Time 11:30 PM 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM 6:30 AM 6:00 AM 5:30 AM 5:00 AM 4:30 AM 4:00 AM 3:30 AM 3:00 AM 2:30 AM 2:00 AM 1:30 AM 1:00 AM 12:30 AM 12:00 AM Please, enter a valid type of event Type of Event - Required Type of Event Alumni Bachelor / Bachelorette Birthday Cocktail Reception Corporate Lunch Engagement Fundraiser Graduation Holiday Meeting / Presentation Photo / Film Shoot Private Dinner Rehearsal Dinner Shower Sporting Event Wedding Other Please, enter a valid number of people Number of People - Required Additional Information - Optional Submit Please check errors in the form above Thank you for your inquiry. We’ll be in touch shortly. Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "1881b29a0558",
      "downloadedAt": "2026-01-18T16:54:35.010Z",
      "trimmedAt": "2026-01-18T17:05:19.392Z",
      "sizeReduction": "95.2%"
    },
    {
      "url": "https://www.newyorkcitypizza.com/location/belfair-towne-village-bluffton/",
      "text": "Main content starts here, tab to start navigating Belfair Towne Village (Bluffton) 107 Towne Drive, Bluffton, SC 29910 843 757 9500 Order Now Sunday - Thursday 11:00 AM – 9:00 PMFriday - Saturday 11:00 AM – 10:00 PM Whether you’re craving a New York-style slice between meetings, or a relaxing bite to eat, NYCP has you covered. Our Belfair Towne Village pizzeria has delivery and Takeout options, allowing you to enjoy our delicious pizza in the comfort of your own home. With space for up to 70 guests, choose NYCP for your next birthday party or social gathering. 100% All-Natural Ingredients ● Prepared Fresh No Reservations Needed ● Space For Events Recently Renovated Location ● Welcoming Staff Online Delivery ● Takeout Child-Friendly Atmosphere Service Dogs Allowed Large Pet-friendly Outdoor Dining Area Parking ● Free Wi-fi Join our Loyalty Program Get Directions Email Signup Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "319e52257823",
      "downloadedAt": "2026-01-18T16:54:31.847Z",
      "trimmedAt": "2026-01-18T17:05:19.395Z",
      "sizeReduction": "96.1%"
    },
    {
      "url": "https://www.newyorkcitypizza.com/location/festival-centre-north-end/",
      "text": "Main content starts here, tab to start navigating Festival Centre (North End) 45 Pembroke Drive Ste 105, Hilton Head Island, SC 29926 843 689 2229 Order Now Monday - Thursday 11:00 AM – 9:00 PMFriday - Sunday 11:00 AM – 10:00 PM Next time you find yourself at the Festival Centre, why not drop by NYCP on the North End and try our fresh New York-style pizza for yourself? Made with the highest quality ingredients cooked fresh every day, our menu offers a glimpse of truly authentic Italian cuisine. Enjoy a delicious slice of pizza to-go, or sit at our beautiful outdoor bar to get a taste of the best Italian food the town has to offer. Don’t miss out on our Happy Hour, complete with our special Happy Hour Menu! With space to house 150 diners, NYCP Festival Centre is an easy choice for group dinners, birthdays, or other social events. 100% All-Natural Ingredients ● Prepared Fresh No Reservations Needed ● Space For Events Online Delivery ● Takeout Child-Friendly Atmosphere Happy Hour Menu ● Welcoming Staff Service Dogs Allowed ● Pet-friendly Outdoor Dining Area Ample Parking Available ● Free Wi-Fi Join our Loyalty Program Get Directions Email Signup Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "560b8d60b443",
      "downloadedAt": "2026-01-18T16:54:32.897Z",
      "trimmedAt": "2026-01-18T17:05:19.398Z",
      "sizeReduction": "95.3%"
    },
    {
      "url": "https://www.newyorkcitypizza.com/location/buckwalter-place-bluffton/",
      "text": "Main content starts here, tab to start navigating Buckwalter Place (Bluffton) 103 Buckwalter Place Blvd, Unit 108, Bluffton, SC 29910 (843) 837-4800 Order Now Sunday - Thursday 11:00 AM – 9:00 PMFriday - Saturday 11:00 AM – 10:00 PM Pizza lovers of Bluffton rejoice, we have opened a second NYCP restaurant in the neighborhood! Stop by our new Buckwalter Place location to satisfy those cravings. Whether it's a slice to-go, a pie for yourself, or a family meal, we’ve got you covered. Our authentic Italian dishes are made with fresh, high-quality ingredients so you can get the taste of Italy, right here in Bluffton. With space for 75 guests, NYCP Buckwalter Place can host any event you want. This new location is truly the ideal setting for your next social gathering. 100% All-Natural Ingredients ● Prepared Fresh No Reservations Needed ● Space For Events Online Delivery ● Takeout Child-Friendly Atmosphere ● Welcoming Staff Service Dogs Allowed Ample Parking Available ● Free Wi-Fi Join our Loyalty Program Get Directions Email Signup Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "7e3fca200e75",
      "downloadedAt": "2026-01-18T16:54:33.427Z",
      "trimmedAt": "2026-01-18T17:05:19.402Z",
      "sizeReduction": "95.7%"
    },
    {
      "url": "https://www.newyorkcitypizza.com/menus/",
      "text": "Main content starts here, tab to start navigating Menu Scroll Down to Content Ask about our catering menu! Menu Appetizers Fried Calamari Served with our tomato sauce 12.95 $ Italian Fries Our fabulous fries topped with special seasonings 7.95 $ Buffalo Wings plain, mild, hot, garlic parmesan, calypso or Jack Daniels BBQ sauce 16.95 $ Chicken Fingers lightly breaded breast strips... plain, mild, hot, garlic parmesan, calypso, or Jack Daniels BBQ sauce 14.95 $ Mamma's Housemade Meatballs 2 meatballs in our tomato sauce 9.95 $ Garlic Bread Sticks Freshly baked bread sticks, smothered in fresh garlic and parmesan , served with our tomato sauce 6 pieces 7.50 $ 12 pieces 10.50 $ Insalata Caprese Fresh mozzarella, roasted tomato and basil, drizzled with extra virgin olive oil 13.95 $ Classic Antipasto (Serves 2) Sliced prosciutto di Parma, fresh mozzarella, genoa salami, kalamata olives and seasoned artichoke hearts 21.95 $ House Specialties Fried Zucchini Sticks (5) Fried fresh local zucchini, served with our tomato sauce 9.50 $ Mozzarella Sticks (5) Served with our tomato sauce 10.50 $ Garlic Bread Italian bread with fresh garlic and Romano cheese 8.50 $ Add Mozzarella Cheese 1.50 $ Soups Pasta Fagioli Classic Italian cannelloni bean stew with ditalini pasta 7.95 $ NYCP'S Wedding Soup Chicken, meatball and escarole soup with ditalini pasta 7.95 $ Add Chicken Breast to any Salad for $7 Salads House Salad Mixed greens, bell pepper, crouton, sliced mushroom, onion, diced tomato, tossed with your choice of dressing 10.45 $ Side Salad Mixed lettuce greens and tomato 6.45 $ Chopped Salad Mixed greens, kalamata olives, onion, tomato, bell pepper and tomato, chopped and tossed in our housemade ranch dressing, topped with our housemade croutons 11.45 $ Caesar Salad Romaine lettuce, grated Romano, croutons and our Classic Caesar dressing 10.45 $ Greek Salad Iceberg with feta cheese, diced tomato, bell pepper, kalamata olives, artichoke, drizzled with our housemade Mediterranean dressing 11.45 $ House Made Dressings House Vinaigrette, Caesar, Ranch, Blue Cheese, Peppery Parmesan, Honey Mustard, Mediterranean and Oil & Vinegar Topping $2.75 | Specialty Topping $3.75 Calzone & Stromboli Calzone Pizza turnover filled with ricotta and mozzarella cheese Small 18 $ Large 20 $ Stromboli Stuffed bread with mozzarella cheese Small 18 $ Large 20 $ Pizza New York Classic New York style thin crust Medium 14\" 20 $ Large 16\" 22 $ Deep Dish Pan Thick crust pan pizza Medium 14\" 22 $ Large 16\" 24 $ Sicilian Square deep dish 27 $ Slice (New York Only) 4 $ Topping (Each) 1.75 $ Specialty Topping (Each) 1.95 $ Toppings Bell Pepper | Onion | Extra Cheese | Ricotta | Feta | Pineapple | Tomato | Broccoli | Jalapeño | Banana Peppers | Green Olive | Mushroom | Spinach | Fresh Garlic 3.50 $ Fresh Mozzarella | Pepperoni | Artichoke | Salami | Anchovy | Sausage | Ground Beef | Ham | Eggplant | Kalamata Olive 4.95 $ Prosciutto | Meatball | Chicken | Bacon 6 $ Served with all natural kettle chips/ sub french fries 2.50 Heroes The Italian Ham, salami, pepperoni and provolone, with shaved lettuce, sliced onion and tomato, oil and vinegar 16.95 $ Ham or Turkey And Provolone With shaved lettuce, sliced onion, and tomato, oil and vinegar 15.95 $ Eggplant Parmigiana Slices of fried eggplant, breaded in-house with our tomato sauce and melted mozzarella cheese, baked in the oven 14.95 $ Chicken Parmigiana Breaded chicken cutlet covered in our tomato sauce and mozzarella cheese, baked in the oven 15.95 $ Meatball Parmigiana Meatballs covered in our tomato sauce and mozzarella cheese, baked in the oven 15.95 $ Philly Cheesesteak Shaved top sirloin with onion, bell pepper, and mushroom, sauteed on the flat top, topped with melted white American cheese 16.95 $ Philly Chicken Cheesesteak Shaved top sirloin sautéed with onion, bell pepper, and mushroom, topped with white American cheese 16.95 $ Buffalo Chicken Boneless breaded chicken breast fried and dipped in Buffalo wing sauce, with romaine lettuce and our blue cheese dressing 14.95 $ Served with all natural Kettle chips / sub French Fries for $2.50 Smash Burger NYCP Smash Burger Two patties smashed to order served with shredded lettuce, roma tomato, sliced onion with house seasoning and sauce, topped with white cheddar cheese. 13.95 $ Pasta and Entrees Spaghetti With Meatballs Meatballs in our tomato sauce and tossed with spaghetti 17.50 $ Penne Bolognese Meat sauce of beef, stewed in our tomato sauce and a touch of cream 17.95 $ Fettuccine Alfredo Cream sauce with parmesan and romano cheese tossed with fettuccine 18.95 $ Add Chicken Breast 7.95 $ Penne Alla Vodka Minced prosciutto, onions, peas, sauteed and finished with vodka in our tomato sauce with a touch of cream 18.95 $ Spaghetti and Red Clam Sauce Sautéed baby clams, garlic and marinara, tossed with linguine 20.95 $ Housemade Baked Ziti Ricotta and mozzarella cheese with ziti pasta, topped with our tomato sauce and more melted mozzarella 14.50 $ Add Meat Sauce 6 $ Parmigiana Choice of Chicken ($19.95) or Eggplant ($17.95) covered in our tomato sauce and mozzarella cheese served with penne pasta Chicken Marsala Tender breaded chicken cutlet sautéed with mushrooms in our Sicilian Marsala sauce, served with penne pasta 20.95 $ Prices for NY style | Add 3.00 for Pan and 4.00 for Sicilian Specialty Pizza NYCP Special Pepperoni, sausage, bell pepper, onion and mushroom Medium 14\" 28.50 $ Large 16\" 31.50 $ Vegetarian Mushroom, bell pepper, onion, tomato and artichoke Medium 14\" 25.50 $ Large 16\" 28.50 $ Meat Lovers Pepperoni, sausage, meatball, ham and bacon Medium 14\" 30 $ Large 16\" 33 $ BBQ Chicken Pizza Housemade Jack Daniels BBQ sauce, BBQ fried chicken, bacon, mozzarella and cheddar cheeses Medium 14\" 28 $ Large 16\" 31 $ White Pizza Ricotta white sauce, mozzarella and romano cheese Medium 14\" 24 $ Large 16\" 27 $ Hawaiian Housemade tomato sauce, mozzarella, ham and pineapple Medium 14\" 24 $ Large 16\" 27 $ Margherita Our fresh tomato sauce, fresh housemade mozzarella, extra virgin olive oil, fresh basil and garlic Medium 14\" 25 $ Large 16\" 28 $ Buffalo Chicken Pizza Housemade buffalo ranch sauce, buffalo fried chicken, mozzarella and cheddar cheese with buffalo wing sauce Medium 14\" 27 $ Large 16\" 30 $ Desserts Housemade Plain Cannoli 6.95 $ Housemade Plain Cheesecake 7.95 $ We offer Gluten Free Pizza and Gluten Free pasta upon request Email Signup Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "a62d3cb2b61a",
      "downloadedAt": "2026-01-18T16:54:33.960Z",
      "trimmedAt": "2026-01-18T17:05:19.434Z",
      "sizeReduction": "92.4%"
    },
    {
      "url": "https://www.newyorkcitypizza.com/location/downtown/",
      "text": "Main content starts here, tab to start navigating Downtown (Charleston) 190 E Bay St #102, Charleston, SC 29401 843 805 5933 Order Now Sunday - Thursday 11:00 AM – 9:00 PMFriday - Saturday 11:00 AM – 10:00 PM Ever find yourself wandering around downtown Charlestown with a rumbling stomach? Satisfy those hunger pangs with our fresh New York-style pizza, made with the highest quality ingredients. Situated near the French Quarter and open-air market, our pizzeria has indoor and outdoor dining options. Come and taste authentic Italian dishes made to order with select ingredients. You can also opt for Takeout if you want to enjoy our pizza in the comfort of your own home. With space for 75 guests, we have more than enough room for everyone. Be sure to drop by during Happy Hour! 100% All-Natural Ingredients ● Prepared Fresh No Reservations Needed ● Welcoming Staff Online Ordering ● Takeout Child-Friendly Atmosphere Service Dogs Allowed Free Wi-Fi Join our Loyalty Program Get Directions Email Signup Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "a67b6ef0279f",
      "downloadedAt": "2026-01-18T16:54:32.371Z",
      "trimmedAt": "2026-01-18T17:05:19.438Z",
      "sizeReduction": "95.8%"
    },
    {
      "url": "https://www.newyorkcitypizza.com/location/heritage-plaza-south-end/",
      "text": "Main content starts here, tab to start navigating Heritage Plaza (South End) 81 Pope Avenue, Hilton Head Island, SC 29928 843 842 2227 Order Now Sunday - Thursday 11:00 AM – 9:00 PMFriday - Saturday 11:00 AM – 10:00 PM Located just a stone’s throw from Coligny Beach, customers are welcomed to Heritage Plaza by the pleasant scent of our New York-style pizza. Enjoy authentic, home-cooked Italian cuisine and refreshing drinks at our South End restaurant. With space for 100 guests, we are fully equipped to host parties, work gatherings, or social events, all in the child-friendly, welcoming atmosphere created by our outstanding staff. In a hurry? You can grab a slice to go! Or put your feet up and order NYCP to be delivered right to your door. 100% All-Natural Ingredients ● Prepared Fresh No Reservations Needed ● Space For Events Online Delivery ● Takeout ● Welcoming Staff ● Child-Friendly Atmosphere ● Service Dogs Allowed Street Parking ● Free Wi-Fi Join our Loyalty Program Get Directions Email Signup Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "c50f0e23a02b",
      "downloadedAt": "2026-01-18T16:54:31.323Z",
      "trimmedAt": "2026-01-18T17:05:19.443Z",
      "sizeReduction": "95.8%"
    },
    {
      "url": "https://www.newyorkcitypizza.com/",
      "text": "Home Main content starts here, tab to start navigating Order Online Today All Natural No Preservatives Scroll Down to Content Every location is open and serving only the best ingredients! With 100% All Natural Ingredients, there is nothing better than the ultimate slice of pizza! Email Signup Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "d6bc3ebdb761",
      "downloadedAt": "2026-01-18T16:54:31.291Z",
      "trimmedAt": "2026-01-18T17:05:19.446Z",
      "sizeReduction": "98.2%"
    }
  ],
  "sizeReduction": "95.2%"
}