{
  "venueId": "ChIJzbtemuNv_ogRA0hjXzMuy2w",
  "venueName": "Ali Baba Deli & Catering",
  "venueArea": "Daniel Island",
  "website": "http://alibabacharleston.com/",
  "scrapedAt": "2026-01-18T16:25:31.122Z",
  "trimmedAt": "2026-01-18T16:25:40.051Z",
  "pages": [
    {
      "url": "http://alibabacharleston.com/charleston-daniel-island-ali-baba-deli-and-catering-happy-hours-specials",
      "text": "Specials Sunday January 18th Mediterranean Sandwich and a side with a drink for special price 11:00 AM - 09:00 PM",
      "hash": "49cafea92f94",
      "downloadedAt": "2026-01-18T16:08:03.822Z",
      "trimmedAt": "2026-01-18T16:25:40.023Z",
      "sizeReduction": "99.8%"
    },
    {
      "url": "http://alibabacharleston.com/",
      "text": "× Did you know we do catering? Whatever your occasion, however big or small, we have the perfect options to choose from. Cater your birthday party, holiday party, corporate events, wedding festivities and more! Catering Packages × We're hiring! Call, email or submit an inquiry today to learn more! Job Listings × Let us host your special event! Whether a birthday party, office function or any other special occasion - we take care of all the fine details, bringing your event to life, just as you imagined. Host your next party or get together Book your party 186 Seven Farms Dr Ste 500, Charleston, SC 29492 map marker pin CATERING Have an event coming up? We have catering options for all occasions! catering About us Our mission is to create a wonderful and memorable dining experience. Our menus burst with crisp freshness and surprising flavors. our menu Order online Pick Up Your Favorite Food Don't feel like cooking today? We got you covered - order now! Pickup GrubHub DoorDash Uber Eats Private Parties Book your next party with us! Need the space for your event? Search no more we have a perfect place for you! Parties Authentic Mediterranean cuisine Our Menu Let us handle the catering Catering We welcome every type of private event Parties Stunning Deli and Bakery Our menu Dot slide navigation number 1 Dot slide navigation number 2 Dot slide navigation number 3 Dot slide navigation number 4 slideshow start stop playing We are hiring! We are looking for great people to join our amazing team! Check out our current job openings and apply with just a few clicks! Apply for a job Reviews Review by - Yelp Umut E.: Their selection is one of a kind. Unreal amount of sides and everything is authentic. I am from Turkey and this is the closest I have gotten to our food. The Mediterranean Pizza is very very good, I highly recommend it. I have been to plenty of places that has Mediterranean food but by Far Samir offers the most options and variety. Don't think about it, just go here ASAP. The atmosphere is very authentic too. I love it here. I also had some stuff catered for an event and Wow! Amazing! Review by - Yelp Ash J.: I go here for lunch at least 1-2 times a month, would prob go more if I lived closer!! Their food is always fresh and flavorful!! Even my coworker that is picky is obsessed with this place! So many vegan options! I am vegan, so I only took pics of the vegan options on the bar, but there's so much more! Review by - Yelp Hale P.: I love some authentic Greek food! I'm so happy I found this little gem. Veggie gyro was delicious and the spinach & cabbage salad was perfectly marinated. Stop reviews carousel Play reviews carousel Newsletter Location 186 Seven Farms Dr Ste 500 Charleston, SC 29492 Hours Sun, Mon, Tue, Wed, Thur, Fri, Sat 11:00 AM - 9:00 PM Find us on... Facebook page Instagram page Yelp page Contact us (843)-377-8666 info@alibabacharleston.com Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "538b5fa00b1c",
      "downloadedAt": "2026-01-18T16:08:02.388Z",
      "trimmedAt": "2026-01-18T16:25:40.038Z",
      "sizeReduction": "97.9%"
    },
    {
      "url": "http://alibabacharleston.com/charleston-daniel-island-ali-baba-deli-and-catering-food-menu",
      "text": "Our Menu Menu Catering",
      "hash": "6d12655594dc",
      "downloadedAt": "2026-01-18T16:08:02.538Z",
      "trimmedAt": "2026-01-18T16:25:40.046Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://alibabacharleston.com/charleston-daniel-island-ali-baba-deli-and-catering-drink-menu",
      "text": "Our Drinks We are updating our menu Please stay tuned",
      "hash": "a00e8f42a545",
      "downloadedAt": "2026-01-18T16:08:03.170Z",
      "trimmedAt": "2026-01-18T16:25:40.048Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "http://alibabacharleston.com/charleston-daniel-island-ali-baba-deli-and-catering-events",
      "text": "Events We are updating our events Please stay tuned",
      "hash": "abb6a342ae22",
      "downloadedAt": "2026-01-18T16:08:04.445Z",
      "trimmedAt": "2026-01-18T16:25:40.051Z",
      "sizeReduction": "99.9%"
    }
  ],
  "sizeReduction": "99.4%"
}