{
  "venueId": "ChIJ05JEGPB9_ogRNhpXuooSPvw",
  "venueName": "Eggs Up Grill",
  "venueArea": "West Ashley",
  "website": "https://locations.eggsupgrill.com/sc/charleston/35/",
  "scrapedAt": "2026-01-18T17:04:22.944Z",
  "trimmedAt": "2026-01-18T17:04:44.567Z",
  "pages": [
    {
      "url": "https://locations.eggsupgrill.com/sc/charleston/35/",
      "text": "Charleston, SC General Information Eggs Up Grill 3875 West Ashley Circle, Charleston, SC 29414 +1 843-212-5255 Amenities Dog Friendly Patio Dining Mimosas Hours of Operation Order Now Order Catering Get Directions Eggs Up Grill 3875 West Ashley Circle, Charleston, SC 29414 +1 843-212-5255 Amenities Patio Dining Mimosas Hours of Operation Order Now Order Catering Charleston Menu Neighborhood Faves Eggs Up Classics Egg-Centric Hot Off The Griddle Bowls & Bennies Burgers, Melts & Sandwiches Salads Kids Meal Family Bundles Drinks A la Carte Previous Next Neighborhood Faves Blueberry Muffin $5.39 A large muffin filled with blueberries, sliced in half and grilled to a golden-brown perfection. Order Now The Classic $10.99 Two eggs, three slices of bacon or pieces of sausage, with home fries or grits and toast. Order Now Avocado Toast & Eggs $11.49 Toasted Tuscan bread, smashed avocado and fresh picante salsa served with two eggs. Order Now Pick 3 Omelet $11.49 Combine 3 of your favorites into this Omelet. Additional items are also available. Served with toast and home fries or grits. Order Now Honey Berry Yogurt Crunch $10.39 Fresh strawberries and blueberries, low-fat vanilla yogurt and honey granola crunch. Order Now Little Waffle in the Hen House $10.99 Half waffle topped with powdered sugar and served with two eggs and bacon or sausage. Order Now Oatmeal & Fruit $8.49 A bowl of oatmeal with strawberries, blueberries and bananas. Order Now Muffin & Eggs $10.39 Two eggs, blueberry muffin and fresh fruit. Order Now Avocado Toast $6.29 Toasted Tuscan bread, smashed avocado and fresh picante salsa. Order Now Eggs Up Classics The Classic $10.99 Two eggs, three slices of bacon or pieces of sausage, with home fries or grits and toast. Order Now The Grand Classic $13.99 Three eggs, three slices of bacon, three pieces of sausage, home fries, grits and toast. Substitute country ham for an upcharge. Order Now Homestead Platter $13.99 Two eggs, four slices of bacon, four pieces of sausage and a biscuit with a side of sausage gravy. Order Now Biscuit & Gravy Breakfast $10.99 Two buttermilk biscuits topped with sausage gravy. Served with two eggs. Order Now Steak & Eggs $16.49 Two eggs, 6 oz. sirloin steak, grilled tomato and garlic toast, with choice of home fries or grits. Order Now Southern Staples $11.49 Two eggs, two sausage patties, and buttermilk biscuit topped with sausage gravy. Served with home fries or grits. Order Now Founder's Hash & Eggs $13.99 Eggs* and founder’s recipe hash, with choice of home fries or grits and toast. Order Now Egg-Centric Greek Scrambler $11.99 Eggs scrambled with Cheddar cheese and topped with grilled mushrooms, tomatoes, spinach, feta, black olives, and creamy hollandaise. Served with toast and home fries or grits. Order Now Chorizo Scrambler $12.99 Eggs scrambled with Cheddar cheese and topped with chorizo sausage, fresh tomatoes, avocado, and Chile-lime crema. Served with toast and home fries or grits. Order Now Crab-ocado Scrambler $13.99 Eggs scrambles with Cheddar cheese and topped with crabcakes, and fresh avocado, bacon, spinach, caramelized red onion, and creamy hollandaise. Served with toast and home fries or grits. Order Now Texas Farm House Omelet $13.99 A four-egg omelet with bacon, andouille sausage, mushrooms, home fries, pepper jack cheese, and pickled jalapenos. Topped with sausage gravy and green chilis. Served with toast and home fries or grits. Order Now Baja Chicken Omelet $13.99 A four-egg omelet with grilled chicken and pepper jack cheese. Topped with fresh avocado, salsa and citrus chili crema sauce. Served with toast, and home fries or grits. Order Now Pick 3 Omelet $11.49 Combine 3 of your favorites into this Omelet. Additional items are also available. Served with toast and home fries or grits. Order Now Philly Cheese Steak Omelet $12.99 Thinly sliced steak with American cheese, onions and peppers. Served with toast and home fries or grits. Order Now Goodness Gracious $12.49 Egg white omelet with spinach, onions, mushrooms and feta cheese topped with sliced tomatoes. Served with toast and home fries or grits. Order Now Hot Off The Griddle Caramel Apple Crisp Pancakes $11.99 Two buttermilk pancakes with crispy apple pie crumble, topped with caramelized Fuji apples, caramel sauce and powdered sugar. Served with bacon or sausage. Order Now Three Little Deuces $11.99 Two buttermilk pancakes topped with powdered sugar and served with two eggs and bacon or sausage. Order Now Strawberries & Cream Pancakes $11.99 Two fluffy buttermilk pancakes layered with house-made vanilla custard and topped with fresh strawberries. Served with bacon or sausage. Order Now Churro Crunch French Toast $12.99 Two Slices of Cinnamon swirl bread dipped in custard, cooked golden brown & dusted with cinnamon sugar. Served with house-made dulce de leche sauce & fresh strawberries. Choice of bacon or sausage. Order Now Red, White & Blue Waffle $11.99 Belgian waffle topped with strawberries, bananas and blueberries, powdered sugar and whipped cream. Served with bacon or sausage. Order Now Little Waffle In The Hen House $10.99 Half waffle topped with powdered sugar and served with two eggs and bacon or sausage. Order Now Belgian Waffle $10.99 Topped with powdered sugar. Add chocolate chips, praline pecans or granola for an additional charge. Served with bacon or sausage. Order Now Creme Brulee French Toast $11.99 Two pieces of custard dipped Texas toast layered with vanilla cream and topped with a caramelized brown sugar crunch and sweet caramel drizzle. Served with bacon or sausage. Order Now Buttermilk Pancakes $10.99 Two buttermilk pancakes topped with powdered sugar. Add chocolate chips, blueberries, bananas, praline pecans or granola for an additional charge. Served with bacon or sausage. Order Now Cinnamon Swirl French Toast $11.99 Two slices topped with powdered sugar. Served with bacon or sausage. Order Now Slices, Strips & Spuds $11.99 Two slices of cinnamon swirl French toast, topped with powdered sugar and served with a side of bacon and home fries. Order Now Bowls & Bennies Classic Benny $12.99 Canadian bacon on a toasted English muffin, with two poached eggs and hollandaise sauce. Served with home fries or grits. Order Now Loaded Homefry Bowl $12.49 Home fries topped with onions, peppers, cheddar cheese, two eggs and your choice of bacon or sausage. Order Now Shrimp & Grits Bowl $15.99 Shrimp, andouille sausage, green peppers, and onions served over creamy roasted garlic and cheddar grits topped with hollandaise sauce, diced tomatoes and and two eggs. Served with garlic toast and a charred lemon. Order Now Coastal Crab Cake Benny $16.49 Two crab cakes stacked on toasted garlic bread with poached eggs, Hollandaise sauce, and a dash of our signature home fry spice. Served with home fries, grits, or fresh fruit. Order Now Texican Bowl $12.49 Home fries topped with crumbled chorizo sausage, jalapenos, onions, peppers, pepper jack cheese, and two eggs with a side of salsa and sour cream. Order Now Hashed Benny $14.39 Founder’s recipe corned beef hash made with potatoes, onions and special spices on a toasted English muffin, topped with two poached eggs and hollandaise sauce. Order Now Burgers, Melts & Sandwiches Egg Bomb BLT $9.99 One fried egg, two slices of bacon, lettuce, tomato, mayo on a grilled brioche bun. Add home fries or grits for an additional charge. Order Now Eggs Up BLT $10.99 Five strips of bacon, lettuce, tomato and mayo on grilled Tuscan bread. Order Now Brunch Burger $14.49 A double steak burger with American cheese, maple caramelized onions, bacon, and egg on a grilled brioche bun Order Now Cheesesteak Melt $11.99 Thinly-sliced steak sautéed with onions and mushrooms, American and Swiss cheese, and mayo on grilled Texas toast. Order Now Carne Asada Breakfast Burrito $10.99 Eggs, thinly-sliced steak, peppers and onions, pepper jack cheese, citrus chili crema and diced tomatoes. Add home fries or grits for an additional charge. Order Now Great American Cheeseburger $12.49 A double steak burger with American cheese, lettuce, tomato, red onions, mustard, ketchup and dill pickles on a grilled brioche bun. Order Now Chorizo Quesadilla $11.99 Pepper jack crusted flour tortilla stuffed with scrambled eggs, crumbled chorizo sausage, grilled peppers and onions, Cheddar cheese, and chile-lime crema. Order Now Patty Melt $11.99 Two steak burgers topped with melted American and Swiss cheeses, smothered in caramelized onions. Served hot and fresh on buttered Texas Toast. Order Now Waffle Sandwich $9.99 Half waffle with an egg, crispy bacon, American cheese, and a side of syrup. Order Now Turkey Avo Club $13.49 Sliced turkey, bacon, Swiss cheese, lettuce, tomato, avocado and mayo on grilled Tuscan bread. Order Now Build-Your-Own Sandwich $9.99 Combine all your favorites! MEATS: bacon, ham or sausage CHEESE: American, cheddar, feta, pepper jack, Swiss and Two Eggs TOAST: brioche bun, biscuit, toast, bagel, wrap Add home fries or grits for an additional charge. Order Now Melty Cristo $14.99 Ham, turkey, and egg*, topped with melted Swiss cheese. Served on Texas-toast French toast with a side of spicy honey drizzle. Order Now The Grilled Chick $12.49 Seasoned and grilled chicken breast topped with tomato, lettuce and our house-made sauce served on a grilled brioche bun. Order Now Salads Southwest Salad $11.29 Avocado, pepper jack cheese, and tomatoes served over fresh mixed greens tossed in chile-lime crema. Topped with with your choice of grilled chicken or crispy chicken (Where available) Order Now Berry Balsamic Salad $11.99 Strawberries, praline pecans, and fetaserved over fresh mixed greens tossed in balsamic vinaigrette. Topped with your choice of grilled chicken or crispy chicken (where available) Order Now Signature Cobb Salad $12.99 Mixed greens, bacon, avocado, red onions, tomato, hard-boiled egg, cheddar cheese and choice of grilled chicken or crispy chicken (where available) Order Now Kids Meal Kids Meal $6.49 Please choose 3 food options and 1 beverage. Order Now Kids Meal - Cheeseburger Meal $6.49 No description added. Order Now Family Bundles Family Bundle (4) $38.99 No description added. Order Now Family Bundle (6) $49.99 No description added. Order Now Drinks Coffee No description added. Order Now Juice No description added. Order Now Tea No description added. Order Now Soft Drinks No description added. Order Now Hot Tea $4.29 House, Earl Grey, Green, Decaf Order Now Milk No description added. Order Now Hot Cocoa $3.29 No description added. Order Now Water No description added. Order Now House Blend Cold Brew $5.39 No description added. Order Now Mocha Cold Brew $5.39 Our House Blend with a chocolatey twist Order Now Sweet Cream Vanilla Cold Brew $5.39 Our House Blend with a creamy vanilla twist Order Now Caramel Cinnamon Smile $5.39 Freshly Brewed with milk, cinnamon bun syrup and topped with whipped cream and caramel drizzle. Prepared Hot or Iced Order Now Cafe Mocha $4.99 Freshly brewed with milk & chocolate sauce topped with whipped cream. Prepared Hot or Iced Order Now House Latte Freshly brewed with steamed milk. Prepared Hot or Iced Order Now Dreamsicle Mocktail $4.49 A fizzy, creamy blend of orange citrus and French vanilla. Topped with sweet whipped cream. Order Now Good Morning Sunrise $4.79 Orange juice, club soda, and grenadine. Order Now Peachy Palmer $4.79 Lemonade and freshly brewed iced tea with a sweet peachy flavor. Order Now Sparkling Strawberry Lemonade $4.79 Lemonade, Sprite, grenadine, and strawberries Order Now A la Carte Side Egg $1.99 No description added. Order Now Side Home Fries $3.79 No description added. Order Now Side Grits $3.49 No description added. Order Now Side Biscuit $1.99 No description added. Order Now Side Sausage Link $5.19 No description added. Order Now Side Chips $0.99 No description added. Order Now Side Regular Bacon $5.19 No description added. Order Now Pancake $3.19 No description added. Order Now Waffle $6.99 No description added. Order Now Side English Muffin $1.99 No description added. Order Now Side Bagel $1.99 No description added. Order Now Side Hollandaise $2.59 No description added. Order Now Side Potato Salad $2.99 No description added. Order Now Side Gravy $3.29 No description added. Order Now Side Turkey Bacon $5.19 No description added. Order Now Side Canadian Bacon $5.19 No description added. Order Now Side Sausage Patty $5.19 No description added. Order Now Side Corned Beef Hash $5.99 No description added. Order Now Side Country Ham $5.99 No description added. Order Now French Toast $3.99 No description added. Order Now Sliced Avocado $2.93 No description added. Order Now Fresh Fruit Bowl $7.99 No description added. Order Now Fresh Fruit Cup $4.99 No description added. Order Now Side Sugar-Cured Ham $5.99 No description added. Order Now Let Us Cater Your Next Event From customized box lunches to full spreads, we’ll take care of the details. Eggs Up Grill catering makes it easy and delicious. Call now to place your catering order! Phone +1 843-212-5255 Order Catering Click Here E Gift Cards Sign Up Now! About Us I am Kevin Arnold. My wife and I work hard to build a strong connection with the local community here in West Ashley. At Eggs Up Grill, guests will always experience genuine hospitality from people who live in their community and who they come to know and trust — truly neighbors serving neighbors. Our restaurants are happy places for every occasion, where all feel welcome. Eggs Up Grill is a place to come to by yourself, with family, friends, neighbors, or coworkers. Our door is always open to all.We look forward to seeing you in our restaurant. If there is anything we can do for you or our community, please let us know.",
      "hash": "291e536c246f",
      "downloadedAt": "2026-01-18T17:02:23.779Z",
      "trimmedAt": "2026-01-18T17:04:44.567Z",
      "sizeReduction": "94.1%"
    }
  ],
  "sizeReduction": "94.1%"
}