{
  "venueId": "ChIJTzREvBF6_ogRgN_VGQg5-bI",
  "venueName": "The Elliott House Inn",
  "venueArea": "Downtown Charleston",
  "website": "https://www.elliotthouseinn.com/?utm_source=google&utm_medium=organic&utm_campaign=business_listing",
  "scrapedAt": "2026-01-19T03:25:42.247Z",
  "trimmedAt": "2026-01-19T03:29:13.763Z",
  "pages": [
    {
      "url": "https://www.elliotthouseinn.com/?utm_source=google&utm_medium=organic&utm_campaign=business_listing",
      "text": "[Page Title: Elliott House Inn | Charleston SC Hotels | Official Websitelogo-newCH-Logo-Tag-FINAL (1)]\n\nSKIP TO CONTENT Your browser does not support the video tag. \nCharleston's Most\nCharming Historic Inn \nWelcome to the Elliott House Inn\nIntimate. Romantic. Indulgent. \nWith its tranquil cobblestoned courtyard, original hardwood floors and breezy piazzas, the Elliott House Inn invites a fresh, yet historically rich, Charleston experience. Once a private residence, our Queen Street inn effortlessly pairs the comfort and intimacy of an inn with the chic style and contemporary services of a boutique hotel, delighting first-time visitors and charming returning friends.\n\nBook direct and enjoy late check out of 12pm\nCheck Availability \nFeatured offers\n\n10% OFF + Bubbly\nWe’re proud to be recognized among Charleston’s best by Condé Nast Traveler. Join us in raising a glass to this exciting honor! \n10% Off\nAccommodations \nBottle of Bubbly\nLearn More \nFeatured offers\n\nUp To 25% Off\nBook early and save! Enjoy up to 25% off your stay when you book your stay in advance. \nBook 30+ Days in Advance & Receive 20% Off\nBook 61+ Days in Advance & Receive 25% Off Non-Refundable Learn More \nFeatured offers\n\nRosé + Holy City Keepsakes\nEnjoy intimate accommodations and Charleston favorites while staying at our beloved inn. Don't forget to pack your keepsakes to bring a little Southern charm home with you! Benne Wafers Bottle of Rosé 2 Wine Tumblers Custom Postcard Candle in scent Southern Magnolia Learn More \nFeatured offers\n\n$75 Dining Credit, Sweet Treats + More\n\nOur Romance Package includes a bottle of sparkling wine, a chocolate treat, a $75 dining certificate, and late checkout*.\nDeluxe accommodations A Bottle Of Sparkling Wine Sweet Chocolate Treat \nRestaurants\n$75 Dining Certificate To One Of Our Preferred Late Checkout Depending On Availability Learn More \nFeatured offers\n\n10% OFF\n\nAre you a AAA Member? Receive 10% OFF your stay when you book this offer.\n\n10% off accommodations\nLearn More \nTop reasons for staying\n\nComplimentary Bicycles\n\nExplore downtown Charleston's historic streets on two wheels with our complimentary beach cruisers.\nMore about the inn \nTop reasons for staying\n\nLate checkout at 12PM\n\nMake the most of your time in Charleston with Late Checkout at 12PM.\nMore about the inn \nTop reasons for staying\n\nQuiet Courtyard Moments\n\nOur tranquil interior courtyard is a hidden gem, perfect for enjoying a few moments of solitude, reading the newspaper, or enjoying breakfast.\nMore about the inn \nTop reasons for staying\n\nWine & Cheese Reception\n\nAfter sightseeing around Charleston, wind down with fellow guests at our complimentary Wine & Cheese reception every evening of the week.\nMore about the inn \nTraveler Rating\n\n0.2\n\nBased on reviews inthe last 90 days\n\n\"Glorious Getaway\"\n\nThe staff and service at Elliot House was incredible - the perfect combination of historic and local, paired with updated rooms and thoughtful touches. The location of this inn is perfect for someone wanting to explore Charleston. You can hop on a set of their complimentary bikes if you want to go a little further on your adventure.\n- Jessica H. \n\"First Visit to Charleston\"\n\nPerfect location, very friendly staff and so charming. Happy hour wine and cheese bar and a fire going in the courtyard– what a beautiful way to start the evening. We will definitely go back and stay there again.\n- Lauren W. \n\"Wonderful Place to Stay\"\n\nI like the way this Inn feels and how everything is situated. The courtyard area is a very good communal area to hang out, with a fireplace and plenty of tables and chairs for everyone to fit comfortably.\n- EvanGuthrie \n\"Great Small Hotel in the Historic District\"\n\nThis was a fine place with great staff who were helpful and friendly. Enjoyed the wine and cheese in the courtyard each afternoon. In the middle of the historic downtown, surrounded by great restaurants. Rooms were clean and comfortable.\n- WeddingRingStaysOn \nCharleston, SC\n\nFor eight years in a row, this genteel city has reigned as #1 in the U.S. [Travel + Leisure World’s Best Awards] thanks to an unmatched combination of history, hospitality, architecture, culture, and cuisine.\nExplore Map \nThe Battery\n\n14 Min - 0.8 Miles\n\n6 Min - 0.8 Miles\nExplore Map \nRainbow Row\n\n10 Min - 0.5 Miles\n\n4 Min - 0.5 Miles\nExplore Map \nWaterfront Park\n\n9 Min - 0.4 Miles\n\n3 Min - 0.4 Miles\nExplore Map \nCharleston City Market\n\n9 Min - 0.5 Miles\n\n3 Min - 0.5 Miles\nExplore Map",
      "hash": "6763a085541f",
      "downloadedAt": "2026-01-19T02:09:28.137Z",
      "trimmedAt": "2026-01-19T03:29:13.754Z",
      "sizeReduction": "94.9%"
    },
    {
      "url": "https://www.elliotthouseinn.com/offers",
      "text": "[Page Title: Charleston Vacation Packages | Offers | Elliott House Innlogo-newCH-Logo-Tag-FINAL (1)]\n\nSKIP TO CONTENT \nCharleston Hotel Specials\nSip & Celebrate 10% OFF + Bubbly We’re proud to be recognized among Charleston’s best by Condé Nast Traveler. Join us in raising a glass to this exciting honor! \n10% Off\nAccommodations \nBottle of Bubbly\nCheck Availability Read More Advanced Purchase Up To 25% Off \nBook 30+ Days in Advance & Receive 20% Off\nBook 61+ Days in Advance & Receive 25% Off Non-Refundable BOOK NOW Read More Charleston Charms Rosé + Holy City Keepsakes Benne Wafers Bottle of Rosé 2 Wine Tumblers Custom Postcard Candle in scent Southern Magnolia BOOK NOW Read More Romantic Retreat $75 Dining Credit, Sweet Treats + More Deluxe accommodations A Bottle Of Sparkling Wine Sweet Chocolate Treat \nRestaurants\n$75 Dining Certificate To One Of Our Preferred Late Checkout Depending On Availability BOOK NOW Read More AAA Members 10% OFF \n10% off accommodations\nBOOK NOW Read More \nTop Reasons to Stay\n\nQuiet Courtyard Moments\n\nOur tranquil interior courtyard is a hidden gem, perfect for enjoying a few moments of solitude, reading the newspaper, or enjoying breakfast.\n\nLate Checkout at 12PM\n\nMake the most of your time in Charleston with Late Checkout at 12PM.\n\nComplimentary Bicycles\n\nExplore downtown Charleston's historic streets on two wheels with our complimentary beach cruisers.\n\nWine & Cheese Reception\nAfter sightseeing around Charleston, wind down with fellow guests at our complimentary Wine & Cheese reception every evening of the week.",
      "hash": "8324ba1a2e71",
      "downloadedAt": "2026-01-19T02:09:28.438Z",
      "trimmedAt": "2026-01-19T03:29:13.763Z",
      "sizeReduction": "97.8%"
    }
  ],
  "sizeReduction": "96.2%"
}