{
  "venueId": "ChIJH90cEDZ6_ogRwC3_IU0wiS0",
  "venueName": "Holiday Inn Express & Suites Charleston Dwtn - Westedge by IHG",
  "venueArea": "Downtown Charleston",
  "website": "https://www.ihg.com/holidayinnexpress/hotels/us/en/charleston/chsld/hoteldetail?cm_mmc=GoogleMaps-_-EX-_-US-_-CHSLD",
  "scrapedAt": "2026-01-18T17:04:24.805Z",
  "trimmedAt": "2026-01-18T17:05:31.126Z",
  "pages": [
    {
      "url": "https://www.ihg.com/holidayinnexpress/hotels/us/en/charleston/chsld/hoteldetail?cm_mmc=GoogleMaps-_-EX-_-US-_-CHSLD",
      "text": "Skip To main content View prices View all Holiday Inn Express & Suites Charleston Dwtn - WestEdge Important Announcements Conveniently located near Downtown Charleston Experience true Southern hospitality at Holiday Inn Express & Suites Charleston Downtown-WestEdge. Conveniently located just minutes from Charleston’s historic district, our hotel is the perfect home base for exploring the charm and beauty of the Lowcountry. Enjoy easy access to the vibrant WestEdge Retail Center, Joe Riley Baseball Field—home of the Charleston Riverdogs—and top institutions like The Citadel, College of Charleston, and The Medical University of South Carolina (MUSC). Plus, we're centrally located near Charleston’s historic plantations, scenic golf courses, and pristine beaches. If you’d rather relax at the hotel, we offer a complimentary Express Start® hot breakfast buffet, a beautiful outdoor saltwater pool, and a spacious lobby lounge. Unwind on our open patio terrace while taking in the city views, or enjoy the comfort of our modern and well-appointed guest rooms. At Holiday Inn Express & Suites Charleston Downtown-WestEdge, you’ll find exceptional service, modern amenities, and a welcoming atmosphere that makes every stay memorable. Kids eat free Free breakfast Fitness center On-site parking Pet-Friendly Pool Smoke-free hotel Wi-fi Cashless hotel Kids eat free Free breakfast Fitness center On-site parking Pet-Friendly Pool Smoke-free hotel Wi-fi Cashless hotel Explore all amenities Accommodations Standard Rooms Book Now Suite Book Now Standard Rooms Book Now Suite Book Now Reservations: Front desk: 1-843-7224000 Email: CHSLDGeneralManger@northph.com 250 Spring Street Charleston, South Carolina 29403 United States Parking and transportation details : 4:00 PM Check-in : 11:00 AM Check-out : 21 Minimum check-in age The highlights Steps to MUSC Complimentary Hot Breakfast Bar Parking Made Easy We Love Pets Your Charleston Adventure Awaits Steps to MUSC Holiday Inn Express & Suites Charleston Dwtn – WestEdge puts you right by the Medical University of South Carolina, Roper St. Francis Hospital and the surrounding medical district- ideal for patient visits, appointments, rotations, and campus tours. Our WestEdge location makes getting to MUSC simple and stress-free. Call +1-843-7224000 Call +1-843-7224000 Complimentary Hot Breakfast Bar To start your day off right, we offer a hot, delicious full breakfast bar with fresh pastries, bagels, sausage, bacon, eggs, \"make our own pancakes\", and of course, our famous cinnamon rolls! If you're looking for healthier options, we also offer fresh fruit, yogurt, hard-boiled eggs, juice, oatmeal and cereals. Call +1-843-7224000 Call +1-843-7224000 Parking Made Easy The hotel offers limited on-site parking for guests at an additional cost. If on-site parking is full there is overflow parking in the parking garage across from the hotel at the same cost. This garage is located across Horizon St. and is shared with the Publix supermarket. Oversized vehicles please call for parking information. Call +1-843-7224000 Call +1-843-7224000 We Love Pets Bring your four-legged family member with you while you travel and explore beautiful downtown Historic Charleston. We do accept pets up to 75lbs with a maximum of 2 pets per room. The pet fee is $50 per night per pet. Call +1-843-7224000 Call +1-843-7224000 Your Charleston Adventure Awaits We are located just minutes away from Charleston’s historic district, giving guests the perfect place to stay for all their Lowcountry adventures. We are approximately 1.4 miles from the Charleston City Market, where most of your sightseeing adventures await. Call +1-843-7224000 Call +1-843-7224000 Explore Holiday Inn Express & Suites Charleston Dwtn - WestEdge Sleep well, rest easy View rooms Elevate your experience View amenities See it to believe it View photos Sleep well, rest easy View rooms Elevate your experience View amenities See it to believe it View photos Hotel packages available Prices shown reflect an average per night stay from View all packages Offers View All Offers FAQs for Holiday Inn Express & Suites Charleston Dwtn - WestEdge Does Holiday Inn Express & Suites Charleston Dwtn - WestEdge have a pool? Yes, Holiday Inn Express & Suites Charleston Dwtn - WestEdge has an outdoor pool. How much is parking at Holiday Inn Express & Suites Charleston Dwtn - WestEdge? At Holiday Inn Express & Suites Charleston Dwtn - WestEdge, self-parking is available for a daily rate of 15 USD . Can I bring my pet to Holiday Inn Express & Suites Charleston Dwtn - WestEdge? Pets are welcome at Holiday Inn Express & Suites Charleston Dwtn - WestEdge. Our Pet Policy: 2 pets max per room. Fifty Dollars per pet, per day. Pets must not be left alone in rooms. Dogs and cats only. Some breed restrictions. Can I cancel my booking at Holiday Inn Express & Suites Charleston Dwtn - WestEdge for a full refund? Always check the hotel's cancellation policy before booking a rate. Room cancellation is subject to rate booked at time of reservation and cancellation policy varies by rate. Does Holiday Inn Express & Suites Charleston Dwtn - WestEdge have a restaurant on site? No, there is no on site restaurant at Holiday Inn Express & Suites Charleston Dwtn - WestEdge. Is there free breakfast available at Holiday Inn Express & Suites Charleston Dwtn - WestEdge? Breakfast is free with your stay at the Holiday Inn Express & Suites Charleston Dwtn - WestEdge. When is breakfast at Holiday Inn Express & Suites Charleston Dwtn - WestEdge? Breakfast at Holiday Inn Express & Suites Charleston Dwtn - WestEdge is available from 6:30 AM to 9:30 AM. Is there a complimentary shuttle available at Holiday Inn Express & Suites Charleston Dwtn - WestEdge? No, there is not a complimentary local area shuttle available at Holiday Inn Express & Suites Charleston Dwtn - WestEdge. What are the check-in and check-out times for Holiday Inn Express & Suites Charleston Dwtn - WestEdge? Check-in at Holiday Inn Express & Suites Charleston Dwtn - WestEdge is from 4:00 PM, and check-out time is 11:00 AM. Contact the hotel directly for options available for early check-in or late check-out. Does Holiday Inn Express & Suites Charleston Dwtn - WestEdge offer free Wi-Fi? Yes, the Holiday Inn Express & Suites Charleston Dwtn - WestEdge offers free WiFi! Read more FAQs View in other languages English English (GB) 日本語 Deutsch 繁體中文 Español 中文 Français Español (España) Italiano Nederlands Русский Português 한국어 ไทย العربية Português (BR) Bahasa Indonesia Türkçe",
      "hash": "1fc7416e7c56",
      "downloadedAt": "2026-01-18T16:54:14.393Z",
      "trimmedAt": "2026-01-18T17:05:31.038Z",
      "sizeReduction": "97.1%"
    },
    {
      "url": "https://www.ihg.com/holidayinnexpress/hotels/us/en/charleston/chsld/hoteldetail/events-facilities",
      "text": "Skip To main content View prices Holiday Inn Express & Suites Charleston Dwtn - WestEdge Meetings & events Request a proposal We've got you covered Scanner Fax services Printer Wi-Fi throughout hotel Event Offers Have more questions? Contact us View in other languages English English (GB) 日本語 Deutsch 繁體中文 Español 中文 Français Italiano Nederlands Русский 한국어 ไทย العربية Português (BR) Bahasa Indonesia Türkçe",
      "hash": "8ad7a2755c9d",
      "downloadedAt": "2026-01-18T16:54:30.277Z",
      "trimmedAt": "2026-01-18T17:05:31.065Z",
      "sizeReduction": "99.7%"
    },
    {
      "url": "https://www.ihg.com/holidayinnexpress/content/us/en/deals/hotel-offers",
      "text": "Skip To main content Book now Offers Holiday Inn Resort Samui Bophut Beach Pay for your stay with Points + Cash Stretch your points further when you book with Points + Cash. Use your existing points and purchase the remaining points required with cash to redeem your Reward Night. Learn more Buy points and get there faster With two ways to buy points, you can reach what you want faster. Buy points to stock up for future travel or add Elite Qualifying points to a booking. Learn More Find A Perfect Gift From gift cards to unique travel destinations, our new rewards catalog is full of ideas and experiences for you to enjoy. Shop Our Catalog Great rates are just a click away With IHG One Rewards, you can get access to our exclusive Member Rate. Book now Buy, gift, or transfer points Enjoy endless possibilities with Points Purchase. Buy points InterContinental ANA Manza Beach Resort Treat yourself to a Reward Night Redeem your IHG One Rewards points for a Reward Night at our 6,600+ hotels and resorts around the world, starting at just 10,000 points. Book now Rewards are just a tap away Download the IHG One Rewards app today. Enjoy fast booking and Rewards on the go – however and wherever you travel. Learn More Travel like you mean it Explore our collections to find the perfect spot for your next vacation, meeting or bucket-list escape. Discover more with our 20 brands and 6,600+ destinations. Explore Now Stay at IHG and earn towards flights IHG One Rewards Members can earn miles for their stays Learn More Earn and redeem points with our partners Maximize your membership with great travel deals on car rentals, restaurants, activities and more. View all partner offers It's better to be a member EARN POINTS TO USE FOR REWARD NIGHTS NO BLACKOUT DATES ACCESS TO MEMBER RATES & OFFERS FREE WIFI LATE CHECKOUT PLUS EVEN MORE PERKS WHEN YOU BECOME AN ELITE MEMBER JOIN FOR FREE Already a member? . Sign in",
      "hash": "99c3a0450348",
      "downloadedAt": "2026-01-18T16:54:14.624Z",
      "trimmedAt": "2026-01-18T17:05:31.126Z",
      "sizeReduction": "99.0%"
    }
  ],
  "sizeReduction": "98.3%"
}