{
  "venueId": "ChIJlz71QOp5_ogRw_ckDu5k1j0",
  "venueName": "Grumpy Goat Seafood Cantina",
  "venueArea": "James Island",
  "website": "http://grumpygoatcantina.com/",
  "scrapedAt": "2026-01-18T17:04:29.183Z",
  "trimmedAt": "2026-01-18T17:11:39.524Z",
  "pages": [
    {
      "url": "http://grumpygoatcantina.com/charleston-grumpy-goat-seafood-cantina-food-menu",
      "text": "Our Menu Order Online Dinner Menu Kids Menu",
      "hash": "1a87b57d48d9",
      "downloadedAt": "2026-01-18T16:55:33.118Z",
      "trimmedAt": "2026-01-18T17:11:39.495Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://grumpygoatcantina.com/charleston-grumpy-goat-seafood-cantina-drink-menu",
      "text": "Our Drinks Beer Wine Cocktails",
      "hash": "1ea5d68f72ad",
      "downloadedAt": "2026-01-18T16:55:33.747Z",
      "trimmedAt": "2026-01-18T17:11:39.500Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://grumpygoatcantina.com/",
      "text": "Parties & Groups - Host your next party or get together Book your party Parties & Groups - Host your next party or get together navigation logo 1023 Harbor View Road, Charleston, SC 29412 map marker pin Order Now Pick Up Order Online About us Seafood Fare with a tex-mex flair A Seafood Cantina located on the sunny isle of James Island, South Carolina, Grumpy Goat specializes in light seafood fare with a Tex-Mex flare. Read more about us Parties Book your next party with us! Grumpy Goat would be honored to provide our services for your next event. Each event is bespoke to your tastes and needs, to provide the best experience possible for you and your guests. Parties book now Specials All specials Events Valentine's Day Saturday February 14th Join us on Valentine's Day for the perfect romantic evening! National Margarita Day Sunday February 22nd Come celebrate National Margarita day with us on February 22nd. St. Patrick's Day Tuesday March 17th Grab your best green garb and join us for St. Patrick's Day! Stop events carousel Play events carousel Great Food Made With Quality Ingredients OUR MENU Host your next party with us PARTIES Fantastic Selection of Dishes RESERVE Dot slide navigation number 1 Dot slide navigation number 2 Dot slide navigation number 3 slideshow start stop playing Reviews review by - Yelp Kay J: Stopped in twice with no disappointments ! Good cocktails and excellent food ! Prices are reasonable and it's sort of a place for locals. Very relaxed atmosphere with a outside patio... review by - Yelp Treva J: Our first visit and we were thrilled! Staff was polite and engaging, the decor was fabulous and the food, Out of the world! So glad we found this gem! We will be back many, many times... review by - Yelp Maria V: Possibly the best shrimp and grits I have ever had!!!! I loved the twist they put on it. If we are ever back in Charleston this place is a must!!! Small place and easy to pass up..... but you need to stop in here! review by - Yelp Greg B: One of our local favorites! Sat out back on a beautiful night! It was also margarita Monday! Can't beat it! Good food and great service! review by - Yelp Bralyn S: This is one of my favorites on James Island. I eat there now after the first time probably three times a week. Stephanie and John O are the best. The best food and best service on the island... Stop reviews carousel Play reviews carousel Newsletter Location 1023 Harbor View Road Charleston, SC 29412 Hours Sun, Mon, Tue, Wed 4:00 PM - 9:30 PM Thur 4:00 PM - 10:00 PM Fri, Sat 4:00 PM - 10:30 PM We are closed on Christmas Eve and Christmas Day Find us on... Facebook page Instagram page Yelp page Contact us (843)-872-6521 grumpygoatcantina@yahoo.com Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "332e66a4cba7",
      "downloadedAt": "2026-01-18T16:55:32.990Z",
      "trimmedAt": "2026-01-18T17:11:39.516Z",
      "sizeReduction": "97.8%"
    },
    {
      "url": "http://grumpygoatcantina.com/charleston-grumpy-goat-seafood-cantina-happy-hours-specials",
      "text": "Specials Monday January 19th Margarita Monday 04:00 PM - 06:00 PM Happy Hour 04:00 PM - 07:00 PM Tuesday January 20th Happy Hour 04:00 PM - 07:00 PM Wednesday January 21st Happy Hour 04:00 PM - 07:00 PM Thursday January 22nd Happy Hour 04:00 PM - 07:00 PM Friday January 23rd Happy Hour 04:00 PM - 07:00 PM",
      "hash": "3a39f83279c7",
      "downloadedAt": "2026-01-18T16:55:34.363Z",
      "trimmedAt": "2026-01-18T17:11:39.519Z",
      "sizeReduction": "99.5%"
    },
    {
      "url": "http://grumpygoatcantina.com/charleston-grumpy-goat-seafood-cantina-events",
      "text": "Events Valentine's Day Saturday February 14th Join us on Valentine's Day for the perfect romantic evening! 11:00 AM - 10:30 PM 2026-02-14 11:00:00 2026-02-14 22:30:00 America/New_York Valentine's Day Join us on Valentine's Day for the perfect romantic evening! Grumpy Goat Seafood Cantina Grumpy Goat Seafood Cantina grumpygoatcantina@yahoo.com National Margarita Day Sunday February 22nd Come celebrate National Margarita day with us on February 22nd. 11:00 AM - 09:30 PM 2026-02-22 11:00:00 2026-02-22 21:30:00 America/New_York National Margarita Day Come celebrate National Margarita day with us on February 22nd. Grumpy Goat Seafood Cantina Grumpy Goat Seafood Cantina grumpygoatcantina@yahoo.com St. Patrick's Day Tuesday March 17th Grab your best green garb and join us for St. Patrick's Day! 11:00 AM - 09:30 PM 2026-03-17 11:00:00 2026-03-17 21:30:00 America/New_York St. Patrick's Day Grab your best green garb and join us for St. Patrick's Day! Grumpy Goat Seafood Cantina Grumpy Goat Seafood Cantina grumpygoatcantina@yahoo.com",
      "hash": "d89d276ac119",
      "downloadedAt": "2026-01-18T16:55:34.999Z",
      "trimmedAt": "2026-01-18T17:11:39.524Z",
      "sizeReduction": "98.4%"
    }
  ],
  "sizeReduction": "99.0%"
}