{
  "venueId": "ChIJjRBLatt7_ogR8G5Tq2QX43o",
  "venueName": "Citrus Club",
  "venueArea": "Downtown Charleston",
  "website": "https://www.thedewberrycharleston.com/drinks-dining",
  "scrapedAt": "2026-01-18T17:04:28.923Z",
  "trimmedAt": "2026-01-18T17:11:33.539Z",
  "pages": [
    {
      "url": "https://www.thedewberrycharleston.com/cc-menu",
      "text": "Beer & Soft Drinks Beer & Cider Lager Charleston Fermentory, \"Yacht Party,\" West Ashley, South Carolina, 4.2% abv 10 Jasmine Pilsner Japas, \"Matsurika,\" Brazil, 5% abv 10 Blueberry Wheat Lo-Fi, Charleston, South Carolina, 5.2% abv 10 Hazy IPA Westbrook, \"Waves,\" Mount Pleasant, South Carolina, 7% abv 10 Rosé Cider Wölffer Estates, \"No. 139,\" New York, 6.9% abv 10 Soft Drinks Coca-Cola, Diet Coke, Sprite, Ginger Ale 5 Wine Sparkling Prosecco FUSO, \"Col di Luna,\" Veneto, Italy, NV 18 Glass 72 Sparking Rosé Lise et Bertrand Jousset, \"xilé,\" Loire, France, NV É 22 Glass 88 Champagne Claude Beaufort \"Les Clos\" Grand Cru, Ambonnay Montagne de Riems, France, NV 28 Glass 112 Champagne A. Bergére, “Origine,” Vallée du Petit Morin, France, NV 168 Bottle White Sauvignon Blanc Lieu Dit, Santa Ynez, California, '23 20 Glass 80 Grüner Veltliner “Cuvée Blanc,” Niederösterreich, Austria, ‘23 18 Glass 72 Chardonnay Latta Wines, “Kind Stranger” Columbia Valley, Washington, ‘22 20 Glass 80 PINOT BLANC Day Wines, Vin de Days Blanc, Willamette, Oregon, '23 18 Glass 72 Pink & Orange Trebbiano Cirelli, Orange, Abruzzo, Italy, '23 18 Glass 72 Grenache, Syrah, & Cinsault Ch âteau Coussin, Rosé, \"Sainte Victoire,\" Provence, France, '24 18 Glass 72 Red Pinot Noir Division, \"Un,\" Willamette, Oregon, '23 20 Glass 80 Cabernet Sauvignon Land of Saints, Santa Ynez, California, '23 20 Glass 80 Etna Rosso Tornatore, Sicily, Italy, '20 18 Glass 72 Sangiovese Union Sacre, Carbonic, Paso Robles, California, '24 18 Glass 72 Merlot & Cab Franc Domaine de la Grande Courraye, Bordeaux, France, '19 20 Glass 80 Cocktails Cocktails WHITE ALBUM Honey-Distilled Gin, Spiced Lemon, Italian Honey Liqueur, Coconut 20 PARAKEET Blanco Tequila, Bay Leaf, Peppercorn, Alpine Aperitifs, Lime 20 ORANGUTAN Pisco, Salted Orange & Mint Cordial, Italian Aperitivo, Lemon 20 TROPICAL ITCH Bourbon, Overproof Rum, Passionfruit, Yuzu, Chamomile, Backscratcher 20 DEWBERRY DAQUIRI Pineapple & Fiji Rums, Demerara, Fino Sherry, Lime 20 MAI TAI Rhum Agricole, Guava, Orange, Lime, Orgeat* *contains almond 20 CALYPSO ROMEO Indonesian & Jamaican Rums, Pineapple, Housemade Falernum, Hellfire, Lime 20 FRUITCAKE ESPRESSO MARTINI Early Bird Cold-Brew Vodka, Espresso, Spiced Fruitcake Cordial, Almond Cookie 20 COLA-CABANA Cabernet Sauvignon, French Brandy, Pineapple, Cola Spices (served warm) 20 HOT COCOA INFERNO Mezcal, Cacao Inferno, Coconut, Coconut Whipped Cream (served warm) 20 LYCHEE-TINI Japanese Vodka, Lychee, Apple, Lemon, Vanilla 20 PINEAPPLE OLD FASHIONED Beyond Bourbon, Volcanique, Pineapple-Jerk, Tiki Bitters 20 SPICED LIME ROYAL Prosecco, Spiced Lime, Banana, Tonic Cordial, Mole Bitters 20 COCONUT MARGARITA Blanco Tequila, Coconut Cream, Lime, Daysie Madagascar Vanilla, Red Clay Spicy Salt 20 Spirit-Free DEWBERRY TEA SPRITZ Proprietary Tea Blend, Lemon, Sparkling Mineral Water, Agave 10 UNTITLED ART Indian Style Pils, Wisconsin, 0% abv 10 ODDBIRD Blanc de Blancs, Zero Proof 20 Glass 80 Parakeet “Margarita” Seedlip Garden 108, Lime, Bayleaf & Peppercorn \"Parakeet\" Cordial 10 Food Food SALMON BELLY TACOS Taro Root, Habanero, Dehydrated Pineapple, Avocado Mousse 18 SELECTION OF OYSTERS Yuzu Champagne Mignonette 24 Half Dz CEVICHE TACOS Local Fish and Shrimp, Taro Root, Gooseberries, Hazelnut, Salsa Verde 19 WOOD ROASTED MUSHROOMS Mango, Urfa Chili Crisp, Fried Peanuts, Lettuce Cups 27 SMASH BURGER Cooper Sharp American, Poblano Special Sauce, Caramelized Onions, Pickled Green Tomato, Fries 23 FRIED SWORDFISH SANDWICH Hushpuppy Battered, Chow Chow, Shredded Lettuce, Fries 21 GRILLED SEASONAL VEGETABLES Cave Aged Cheddar, Mustard, Chive 17 MISS PAULA GRILLED SHRIMP Carolina Mustard Sauce, Toasted Baguette 23 MASALA CHICKEN WINGS Dry Rub, Butter Masala, Cilantro 17 CALAMARI Cornmeal Crusted, Lemon Beurre Blanc, Pickled Local Peppers 25 SNAPPER CRUDO Carolina Gold Rice, YumYum Sauce, Puffed Sorghum 25 SMOKED FISH DIP Hamachi Collar, Shoyu, Plantain Chips 18 CITRUS CLUB SALAD Blackened Tuna, Gem Lettuce, Radish, Avocado, Guava Vinaigrette 31 SWEET TREATS BANANA FOSTER SUNDAE Vanilla Ice Cream, Brown Butter Blondie 12 COCONUT SEMIFREDDO White Chocolate, Macadamia Nut 12 @thedewberrycharleston Image about Image about Image about Image about Image about",
      "hash": "16b30e2db218",
      "downloadedAt": "2026-01-18T16:52:24.966Z",
      "trimmedAt": "2026-01-18T17:11:33.389Z",
      "sizeReduction": "95.9%"
    },
    {
      "url": "https://www.thedewberrycharleston.com/drinks-dining",
      "text": "DINING Charleston’s Award-Winning Hotel Dining Outlets Dine & imbibe over high-quality, ingredient-driven dishes and handcrafted cocktails at our outlets The Living Room and Citrus Club. The Living Room Hours of Operation: Sunday - Thursday | 7 AM – 11 PMFriday - Saturday | 7 AM – 12 AM Seating is first come, first served. Menu 843-872-9063 Experience the gracious hospitality and effortless style of a true Charleston living room. Outfitted with mid-century furnishings, a curated reading library and a showstopping brass bar, our Living Room is a warm and welcoming destination for morning coffee, afternoon cocktails or an evening aperitif. Every detail--right down to the wooden bowls hand-crafted by local artist Hugh Jeffers from the knots of a 150-year-old white oak tree that once stood nearby--echoes The Dewberry's rich history. To view our policies click . here Citrus Club Sunday - Wednesday: 12pm-8pm Thursday - Saturday: 12pm-10pm Menu The crown jewel in a city known for its steepled skyline and sea-skimming views, The Dewberry’s 8th floor terrace features the highest rooftop in Charleston. Home to our whimsical rooftop cocktail bar, Citrus Club, features citrus-inspired cocktails, and fresh lite bites. Seating is first come, first served. To view our policies click . here LARGE PARTY INQUIRIES Learn More To inquire about accommodating a large party exceeding 10 guests, please complete the form below. We will get back to you within 72 hours. Close LARGE PARTY INQUIRIES Please note that a food and beverage minimum will apply to any large parties booked. Full Name * Email Address * Phone Number * Occasion * Reservation Date * Preferred Venue * Citrus Club The Living Room Number Of Guests * 8 9 10 11 12 13 14 Number Of Guests * 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 Start Time * End Time I have read and agree to the . Privacy Policy Yes, I would like to receive emails with exclusive specials and offers. Submit @thedewberrycharleston Image about Image about Image about Image about Image about",
      "hash": "6cc0a471a2fb",
      "downloadedAt": "2026-01-18T16:52:19.286Z",
      "trimmedAt": "2026-01-18T17:11:33.405Z",
      "sizeReduction": "97.6%"
    },
    {
      "url": "https://www.thedewberrycharleston.com/meetings-and-events",
      "text": "MEETINGS & EVENTS Memorable Events In Charleston Echoing Charleston’s historic charm and architectural grace, The Dewberry has become a sought-after event setting for those who appreciate timeless elegance, historic preservation and artistic collaboration. As with every experience at our Charleston hotel, the venues for meetings and special events are the city’s best in class, acknowledged for both flawless service and unerring decorative style. You’ll feel it the moment your eyes meet the cast brass and crystal palmetto chandelier in the Ballroom or step into our intimate ivy-covered Charleston Walled Garden. This is subtle Charleston glamour at its best. Wedding Guide Meeting Guide Ballroom & Walled Garden Highlights include: Ballroom: 1,710 sq ft. Walled Garden: 2,400 sq ft. Accommodates up to 200 guests Ballroom & Walled Garden 1,710 SQ FT. 36 x 47.5 FT. CEILING HEIGHT: 15’ Meeting Room Setups 85 guests Classroom 42 guests U Shaped 220 guests Theatre Banquet Setups 160 guests Ceremony 175 guests Reception 150 guests Rounds Start Planning Learn More A modern setting of remarkable warmth and elegance, our Ballroom evokes old Charleston in attitude and aesthetic. A Viennese cast- brass palmetto chandelier and oversized gilded antique mirrors set the mood in this stylish 1,750-square-foot space accommodating up to 150 guests. White Oak parquet floors reminiscent of Versailles, as well as works by Charleston artist Douglas Balentine, specially commissioned for The Dewberry, add to the room’s opulent atmosphere. Just beyond the Ballroom lies our traditional Charleston Walled Garden, featuring live oaks, historic brick walls draped by English ivy, bluestone walkways, and a raised garden. Rivers Room & NORTH TERRACE Highlights include: Rivers Room: 1,400 sq ft. Accommodates up to 150 guests Rivers Room & NORTH TERRACE Rivers Room 1,400 SQ FT. Start Planning Learn More Located on the hotel’s 8floor, the Rivers Room is a one-of-kind space not to be found anywhere else in Charleston. With indoor and outdoor capabilities, the space boasts sweeping views of the Charleston Harbor and Arthur Ravenel Jr. Bridge to the east and unparalleled views of Marion Square and the steepled skyline of the Holy City to the west. With 15 foot ceilings, this space provides beautiful natural lighting. Access the north outdoor terrace, and soak in the 360 degree views of the Charleston harbor and steepled skyline. th HOSPITALITY SUITE Highlights include: 511 sq ft. Accommodates up to 12 guests HOSPITALITY SUITE 511 SQ FT Start Planning Learn More Situated on the second floor, the Hospitality Suite is an intimate private space perfectly suited to host a business meeting, small corporate event, or staging site for an event such as a wedding. @thedewberrycharleston Image about Image about Image about Image about Image about",
      "hash": "898f78b9ed82",
      "downloadedAt": "2026-01-18T16:52:22.037Z",
      "trimmedAt": "2026-01-18T17:11:33.414Z",
      "sizeReduction": "94.9%"
    },
    {
      "url": "https://www.thedewberrycharleston.com/drinks-dining#post-33226",
      "text": "DINING Charleston’s Award-Winning Hotel Dining Outlets Dine & imbibe over high-quality, ingredient-driven dishes and handcrafted cocktails at our outlets The Living Room and Citrus Club. The Living Room Hours of Operation: Sunday - Thursday | 7 AM – 11 PMFriday - Saturday | 7 AM – 12 AM Seating is first come, first served. Menu 843-872-9063 Experience the gracious hospitality and effortless style of a true Charleston living room. Outfitted with mid-century furnishings, a curated reading library and a showstopping brass bar, our Living Room is a warm and welcoming destination for morning coffee, afternoon cocktails or an evening aperitif. Every detail--right down to the wooden bowls hand-crafted by local artist Hugh Jeffers from the knots of a 150-year-old white oak tree that once stood nearby--echoes The Dewberry's rich history. To view our policies click . here Citrus Club Sunday - Wednesday: 12pm-8pm Thursday - Saturday: 12pm-10pm Menu The crown jewel in a city known for its steepled skyline and sea-skimming views, The Dewberry’s 8th floor terrace features the highest rooftop in Charleston. Home to our whimsical rooftop cocktail bar, Citrus Club, features citrus-inspired cocktails, and fresh lite bites. Seating is first come, first served. To view our policies click . here LARGE PARTY INQUIRIES Learn More To inquire about accommodating a large party exceeding 10 guests, please complete the form below. We will get back to you within 72 hours. Close LARGE PARTY INQUIRIES Please note that a food and beverage minimum will apply to any large parties booked. Full Name * Email Address * Phone Number * Occasion * Reservation Date * Preferred Venue * Citrus Club The Living Room Number Of Guests * 8 9 10 11 12 13 14 Number Of Guests * 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 Start Time * End Time I have read and agree to the . Privacy Policy Yes, I would like to receive emails with exclusive specials and offers. Submit @thedewberrycharleston Image about Image about Image about Image about Image about",
      "hash": "9aab1d266c4b",
      "downloadedAt": "2026-01-18T16:52:20.727Z",
      "trimmedAt": "2026-01-18T17:11:33.425Z",
      "sizeReduction": "97.6%"
    },
    {
      "url": "https://www.thedewberrycharleston.com/things-to-do-in-charleston/Happenings",
      "text": "Happenings Private Mixology Class . from classic cocktails to spirit-free refreshments. Join our nationally recognized team for a private lesson in mastering mixology Learn the art of imbibing—from crafting the classics to decanting the perfect vintage to the particulars of bourbon—all while taking a peek at how the magic happens. Tailored to specific preferences and interests, in the class you will learn how to craft and enjoy three cocktails, accompanied by lite bites. Exclusively for hotel guests, pricing is tailored to the type of lesson and length of class. Classes are subject to availability and are made on a first come, first serve basis with a cancellation policy. Reserve Learn More WELLNESS WITH A VIEW . Join us every Saturday for a mat pilates class with a view, in partnership with The Longevity Club. Water, towels, and mats are provided. Space is limited—reserve your spot below. Walk-ins welcome upon availability. Book Now Learn More Sewe Artist in Residence: Thomas Swanston . We are thrilled to welcome back artist and conservationist Thomas Swanston in The Living Room and watch him create stunning depictions of sandhill cranes using his signature gilding techniques and ethereal color to celebrate migratory journeys and nature. His permanent \"Migration Series\" is located in The Swanston Room outside of the ballroom. This 22-panel installation of cranes gilded in silver, pewter, and 22-carat gold was created in collaboration with John Dewberry. Friday 2/13 - Sunday 2/15 Learn More DESTINATION: CHARLESTON Bordering Marion Square, The Dewberry is a local landmark, as well as a marquee destination for residents and visitors alike. See Full Map @thedewberrycharleston Image about Image about Image about Image about Image about",
      "hash": "a34d7fcd2012",
      "downloadedAt": "2026-01-18T16:52:19.422Z",
      "trimmedAt": "2026-01-18T17:11:33.430Z",
      "sizeReduction": "96.1%"
    },
    {
      "url": "https://www.thedewberrycharleston.com/meetings-and-events/request-for-proposal",
      "text": "Let's Start Planning Ready to begin planning your wedding or special occasion? We’re here to help. First, tell us a little bit about yourself and your event by completing the form below. Request for Proposal Private Event Software powered by Tripleseat @thedewberrycharleston Image about Image about Image about Image about Image about",
      "hash": "b289be749b08",
      "downloadedAt": "2026-01-18T16:52:22.888Z",
      "trimmedAt": "2026-01-18T17:11:33.432Z",
      "sizeReduction": "99.1%"
    },
    {
      "url": "https://www.thedewberrycharleston.com/lr-menu",
      "text": "Beer, Beverages & Coffee Beer Pilsner Munkle, Charleston, South Carolina, 5.1% abv 10 Hefeweizen Weihenstephaner, Munich, Germany, 5.4% abv 10 India Pale Ale Edmund’s Oast, “Bound by Time”, Charleston, South Carolina, 7% abv 10 Trappist Brown ALE Chimay Grande Réserve, Belgium, 9% abv 16 CIDER Aval, “Gold,” Brittany, France, 6% abv 10 N/A Untitled Art, Italian Style Pils, Wisconsin, 0% abv 10 Coffee FRESH BREWED COFFEE 4 ESPRESSO 4 CAPPUCCINO 5 LATTE 5 Tea EARL GREY 5 CHAMOMILE 5 ENGLISH BREAKFAST 5 GREEN 5 THE DEWBERRY SIGNATURE BLEND 5 Cocktails Signature 20 THE DEWBERRY OLD-FASHIONED Bourbon, Demerara, Aromatic, Orange Bitters PANIC BUTTON Bourbon, Averna Amaro, Cherry Heering, Campari, Lemon THE DEWBERRY SPICY MARGARITA Tequila, Velvet Falernum, Lime, Agave, Habanero Shrub, Citrus-Cumin Salt Rim THE DEWBERRY DAIQUIRI Pineapple Rum, Lime, Fino Sherry CLAY POT-AGED BOULEVARDIER Bourbon, Rosso Vermouth, Campari Stirred 20 DIRTY GREEN MARTINI Hat Trick Gin, Lillet Blanc, House-made Green Brine AM GOLD Orange Blossom Gin, Bergamot, Pineapple, Brine, Caperberry WHITE NEGRONI Gin, Bitter Bianco, Chamomile, Yuzu AGAVE OLD FASHIONED Aged Tequila, Habanero Stout Reduction, Mole Bitters AN HISTORIC Rye, Apples, Cynar, Amaro, Montenegro LEATHER-BOUND FIRST EDITION Black Forest Brandy, Indian Single Malt, Charleston Madeira, Vanilla, Maraschino, Smoke ONE HAND CLAPPING Americano Single Malt, Plum, Nori, Wildflower Honey, Chocolate Bitters, Rice-Stirred Shaken 20 PACHINKO SPRITZ Sparkling Rose, Plum, Apricot, Club Soda TIGERS & THE STRAWBERRY Japanese Vodka, Aquavit, Strawberry, Coconut, Lemon HOLY BASIL COLLINS Tulsi Gin, Basil, Lime, Vanilla, Club Soda A POSTCARD FROM THE VOLCANO Tquila & Mezcal, Red Pepper, Cacao Inferno, Habanero, Citrus Spicy Optional HUMMINGBIRD TATTOO Caribbean Rum, Hibiscus, Allspice, Lime PISTACHIO ESPRESSO MARTINI Espresso, Pistachio, Vodka, Vanilla, Pistachio Cookie *Contains Nuts THE DEWBERRY GARDEN JULEP Bourbon, Dewberry Garden Herbs, Hickory, Lime SPANISH BEE'S KNEES Gin, Golden Raisin, Saffron, Smoked Paprika, Honey, Lemon Zero Proof 14 THE DEWBERRY SPRITZ Signature Dewberry Tea, Lemon,Club Soda ODDBIRD MIMOSA Citrus, Wildflower Honey, Oddbird N/A Blanc de Blancs SEEDLIP GARDEN COLLINS Seedlip Garden 108, Basil, Vanilla & Lime Cordial, Club Soda HICKORY SWITCH Spirit-Free Whiskey, Herb-Infused Hickory, Lime The Brass List The Brass List THE LAST WORD Mezcal, Green Chartreuse, Luxardo Maraschino 28 SPANISH GIN & TONIC Monkey 47 Gin, Jack Rudy Tonic, The Rare Wine Co. Charleston Madeira, Garnish from The Dewberry Garden 38 SAZERAC Pierre Ferrand Renegade Barrel, Willett Rye, Absinthe Rinse 48 AÑEJO OLD FASHIONED Don Julio 1942, Organic Blue Agave, Cinnamon Stick 64 FRENCH 75 Hennessy X0, Charles Heidsieck Champagne, Lemon 75 Wine Sparkling & Champagne GRÜNER VELTLINER Szigeti, Burgenland, Austria, NV 20 Glass 80 Bottle SPARKLING ROSÉ Clos Hirissou, Gaillac, France, NV 18 Glass 72 Bottle SPARKLING RED Terrevive, “No Autoclave,” Lambrusco, Emilia-Romagna, Italy, '22 18 Glass 72 Bottle CHAMPAGNE Claude Beaufort, “Les Clos,” Grand Cru, Ambonnay, Montagnes de Reims, France, NV 28 Glass 112 Bottle N/A BLANC DE BLANCS Oddbird, Languedoc, France, NV 20 Glass 80 Bottle CHARDONNAY Perrier-Jouet, Blanc de Blancs, Épernay, France, NV 204 CHARDONNAY & PINOT NOIR Nominé-Renard, Special Club, Côte des Blancs, France, 2015 300 CHARDONNAY, PINOT NOIR & MEUNIER A. Bergère, Valée du Petit Morin, France, NV 168 PINOT NOIR & CHARDONNAY Claude Beaufort, “Les Clos,” Grand Cru, Ambonnay, Montagnes de Reims, France, NV 122 PINOT NOIR & CHARDONNAY Dom Pérignon, France, 2015 710 PINOT NOIR & CHARDONNAY Pol Roger, “Cuvée Sir Winston Churchill,” Épernay, France, 2013 900 ROSÉ CHAMPAGNE Aubry, Premier Cru, à Jouy-les-Reims, France, NV 195 ROSÉ CHAMPAGNE Billecart-Salmon, Mareuil-sur-Ay, France, NV 185 White SAUVIGNON BLANC Domaine Pellé, Menetou-Salon, Loire, France, ‘23 22 Glass 88 Bottle ALBARIÑO Zarate, Rias Baixas, Gallicia, Spain, ‘24 18 Glass 72 Bottle PINOT GRIGIO Bruno Verdi, Italy, ‘24 20 Glass 80 Bottle RHÔNE BLEND Tablas Creek, Patelin de Tablas Blanc, Central Coast, California, ‘24 20 Glass 80 Bottle CHARDONNAY Alta Orsa, Sonoma, California, ‘23 22 Glass 88 Bottle ALSACE BLEND Robert Sinskey, “Abraxas,” Los Carneros, California, 2018 100 CHARDONNAY Bonneau du Martray, Corton-Charlemagne, Grand Cru, Burgundy, France, 2015 620 CHARDONNAY Charles Père et Fille, Hautes Bourgogne Blanc, Burgundy, France, 2022 92 CHARDONNAY Louis Jadot, “Beauroy,” Premier Cru, Chablis, Burgundy, France, 2020 140 CHARDONNAY Paul Nicolle, “Mont de Milieu,” Premier Cru, Chablis, Burgundy, France, 2023 132 CHARDONNAY Semper, Ulises Vineyard, Sonoma, California, 2016 180 CHARDONNAY Shafer, Red Shoulder Ranch, Napa, California, 2022 200 CHARDONNAY & AUXERROIS Zind-Humbrecht, “Zind,” Alsace, France 2022 140 GEWÜRZTRAMINER Zind-Humbrecht, “Calcaire,” Alsace, France, 2022 88 GIRÓ ROS Ca’n Verdura, “Ca ses Rosetes,” Mallorca, Spain, 2021 78 HONDARRABI ZURI Señorio Otxaran, OTX, Txakolina, Basque, Spain, 2021 70 PINOT GRIS Zind-Humbrecht, Alsace, France, 2022 88 PINOT GRIS Zind-Humbrecht, “Clos Jebsal,” Vieille Vignes, Alsace, France, 2017 152 RIESLING Max Ferdinand Richter, Mosel, Germany, 2023 80 RIESLING Trefethen, Napa, California 2021 72 RIESLING Zind Humbrecht, Turckheim, Alsace, France, 2020 80 RIESLING Chappellet, Napa, California, 2022 76 SAUVIGNON BLANC Frederic Champault, Sancerre, Loire, France, 2024 104 VIOGNIER Darioush, Napa, California, 2021 140 Rosé Grenache Château des Annibals, Provence, France, 2024 20 Glass 80 Bottle Red PINOT NOIR Sass, Willamette Valley, Oregon, 23 22 Glass 88 Bottle Nebbiolo Ca del Baio, Barbaresco, Piedmont, Italy, 22 24 Glass 96 Bottle Tempranillo Sierra de Toloño, Rioja, Spain, ‘23 18 Glass 72 Bottle Grenache Usseglio & Fils, “Cuvée Girard,” Châteauneuf-du-Pape, Rhône, France, 21 35 Glass 140 Bottle CABERNET SAUVIGNON Grounded Wine Co., Columbia Valley, Washington, 20 20 Glass 80 Bottle BORDEAUX BLEND Château St. Jean, “Cinq Cepages,” Sonoma, California, 2017 200 BORDEAUX BLEND Concha y Torro, “Heritage,” Casa Concha, Maipo Valley, Chile, 2020 140 BORDEAUX BLEND Rauzan-Ségla, Margaux, Bordeaux, France, 2015 250 CABERNET SAUVIGNON Bonterra, “The McNabb,” Mendocino, California, 2020 120 CABERNET SAUVIGNON Darioush, Napa, California, 2019 248 CABERNET SAUVIGNON Faust, “The Pact,” Coombsville, Napa, 2020 206 CABERNET SAUVIGNON Fisher Vineyards, “Coach Insignia,” Napa, California, 2016 380 CABERNET SAUVIGNON Hardin, Napa, California 2020 128 CABERNET SAUVIGNON Merus Estate, St. Helena, Napa, California, 2017 360 CABERNET SAUVIGNON Silver Oak, Alexander Vineyard, Napa, California, 2019 280 GAMAY Anne-Sophie Dubois, Fleurie, Beaujolais, France, 2022 78 GRENACHE BLEND Domaine du Vieux Télégraphe, Châteauneuf-du-Pape, Rhône, France, 2021 360 NEBBIOLO Fratelli Grasso, “San Stunet,” Barbaresco, Piedmont, Italy 2019 190 PINOT NOIR Bergström, Willamette, Oregon, 2020 140 PINOT NOIR Domaine de la Côte, Santa Rita Hills, California, 2013 360 PINOT NOIR Concha y Torro, “Amelia,” Chile, 2021 168 PINOT NOIR Luli, Santa Rita Hills, California, 2022 104 PINOT NOIR TROUSSEAU Meunier, Eyrie, “Trifolium,” Dundee Hills, Willamette, Oregon, 2020 120 RHÔNE BLEND Bonterra, “The Butler,” Mendocino, California, 2021 128 SANGIOVESE Greppone Mazzi, Brunello di Montalcino, Tuscany, Italy, 2015 240 SYRAH Domaine de la Terre Rouge, “Les Côtes de l’Oeust, Sierra Foothills, California, 2018 72 SYRAH Vignoles Levet, “Les Journaires,” Côte-Rôtie, Rhône, France, 2019 250 Magnums BORDEAUX BLEND Cade, Howell Mountain Vineyard, Napa, California, 2018 400 Brunch Mains GRANOLA PARFAIT (GF) Greek Yogurt, Fresh Berries, Local Honey 16 FRUIT PLATE (GF) Seasonal Selection 16 STEEL CUT OATMEAL BOWL Seasonal Fruit Compote, Nuts 15 AVOCADO TOAST Sourdough, Soft Boiled Egg*, Fresno, Sunflower Seeds 21 SEASONAL SALAD Pickled Onions, Piave, Breadcrumbs, Lemon Citronette Add Chicken $7, Salmon $15, Lobster $21, Shrimp $15, Beef Tenderloin $30 15 SALMON AVOCADO SALAD Seasonal Greens, Edamame, Buckwheat, Citrus Vinaigrette 30 AMERICAN BREAKFAST 2 Eggs Any Style, Chili Crisp Potatoes, Bacon or Sausage 21 CLASSIC EGG SANDWICH English Muffin, Egg*, Sausage or Bacon, Cooper Sharp American 19 SHRIMP AND GRITS Smoked Serrano, Benton’s Ham, Poached Egg* 29 FRIED CHICKEN SANDWICH Country Ham, House Ricotta, Arugula 21 SMASH BURGER Cooper Sharp American, Poblano Special Sauce, Caramelized Onions, Pickled Green Tomato 23 CAVIAR SERVICE* Creme Fraiche, House Butter Crackers 110 1 oz SIDES Nueske’s Bacon, Breakfast Sausage, Chicken Apple Sausage, Crispy Potatoes, Jimmy Red Grits, French Fries, Side Salad 9 LOCAL VEGETABLE GALETTE Basil Sabayon, Poached Egg, Fine Herbs 17 CROQUE MADAME Mortadella, Gruyère, Pistachio, House Focaccia, Fried Egg* 19 CRÈME BRÛLÉE FRENCH TOAST Brioche, Marscapone, Orange 17 FROM THE BAKERY - 7 EACH | 3 FOR 18 STICKY BUN Caramel Pecans, Crème Fraiche Glaze FRESH BAKED MUFFIN Seasonal Selection CROISSANT Traditional Buttered BLUEBERRY GINGER SCONE Blueberries, Crystallized Ginger NUTELLA BABKA Chocolate Streusel CHEDDAR BISCUIT Hot Honey, Whipped Butter SOUR CREAM CRUMB CAKE New York Style ZUCCHINI BREAD Oats, Cranberries, Sunflower Seeds, Pecans, Whipped Honey Cream Cheese BRULEED HALF GRAPEFRUIT Vanilla Sugar, Thyme Beverages Fresh Juices - 5 ORANGE GRAPEFRUIT CRANBERRY APPLE PINEAPPLE TOMATO Tea Selections - 6 EARL GREY CHAMOMILE ENGLISH BREAKFAST GREEN PEPPERMINT THE DEWBERRY SIGNATURE BLEND Breakfast Cocktails (Available after 10am) BLOODY MARY.............................16 MIMOSA...............................16 Second State Coffee SIGNATURE BLEND.............................5 MORNING DEW ESPRESSO...............................4 DOUBLE ESPRESSO ................................... 6 CAPPUCCINO...................................6 LATTE ...............................6 *Consuming raw or undercooked food items may increase your risk of foodborne illness. Dinner MAINS CHARCUTERIE Chef Selection of Premium Cured Meats, Housemade Accompaniments 36 SELECTION OF OYSTERS Champagne Mignonette, Cocktail Sauce 4 Each SHRIMP COCKTAIL Miss Paula Shrimp, Cocktail Sauce 24 MEATBALLS Fire Roasted Local Eggplant, House Shabazi, Fried Bread 17 HAM CROQUETTES Mixed Charcuterie, Bechamel, Black Garlic Aioli 13 CHEESE PLATE Curated Assortment of Artisanal Cheeses, Housemade Accompaniments 32 CHEESE & CHARCUTERIE Chef Selection of Artisanal Cheese and Cured Meats, Housemade Accompaniments 48 CRUDITÉ Seasonal Vegetables, Chive Florette Accoutrement 16 SEASONAL SALAD Pickled Onion, Piave, Breadcrumbs, Lemon Citronette Add Chicken $7, Salmon $15, Lobster $21, Shrimp $15, Beef Tenderloin $30 15 FRIED CHICKEN SLIDERS Parker House Roll, Urfa Spice, House Pickles 23 SALMON AVOCADO SALAD Seasonal Greens, Edamame, Buckwheat, Lemon Citronette 30 SMASH BURGER Cooper Sharp American, Poblano Special Sauce, Caramelized Onions, Pickled Green Tomato 23 CAULIFLOWER CONFIT Curry, Pickled Grapes, Almonds 27 CAVIAR SERVICE Chicken Cracklings, Jimmy Red Grit Blini, Chive Florette 110 1 oz Dessert $15 COOKIES AND MILK Pastry Chef Jenn’s Chocolate Chip Cookies Baked Fresh To Order CHOCOLATE SIX-LAYER CAKE Chocolate Flourless Cake, Chocolate Chantilly, Dark Chocolate Glaze, Extra Virgin Olive Oil Ice Cream, Orange Zest, Cocoa Nibs, Sea Salt BASQUE CHEESECAKE “Burnt” Cheesecake, Lemon Curd, Berry Compote, Thyme BLACKBERRY TARTE TATIN Black Sugar, Cinnamon, Nutmeg, Puff Pastry, Lemon Thyme Ice Cream CROISSANT BOSTOCK Pistachio-Almond Cream, Stone Fruit, Whipped Goat Cheese, Granola BLUEBERRY PEACH BAVARIAN CREAM Almond Cake, Lemon Cream Cheese Glaze *Consuming raw or undercooked food items may increase your risk of foodborne illness.*A gratuity of 20% may be added to parties of six or more. Checks may be split equally on up to four transactions. @thedewberrycharleston Image about Image about Image about Image about Image about",
      "hash": "bbe078d1c8d6",
      "downloadedAt": "2026-01-18T16:52:24.143Z",
      "trimmedAt": "2026-01-18T17:11:33.521Z",
      "sizeReduction": "94.5%"
    },
    {
      "url": "https://www.thedewberrycharleston.com/offers",
      "text": "Special Offers & packages FALL INTO WINTER Embrace Charleston’s quieter season this winter. Stay two or three nights between December 1, 2025, and March 6, 2026, and enjoy 15% savings. Wake to serene mornings at The Dewberry and wander historic streets just beyond our doors—your winter escape awaits. book Now Offer details 15% savings on 2-3 night stays Blackout dates may apply All room types Discount: Restrictions: Applicable Rooms: Complimentary Fourth Night Make the most of your time in Charleston with our Fourth Night Complimentary offer. Reserve a three-night stay at The Dewberry and enjoy a fourth night with our compliments—giving you more time to unwind, explore, and experience all that our award-winning property and city have to offer. Offer valid through September 30, 2026. book Now Offer details Offer stay dates: June 3, 2025 - September 30, 2026 Offer booking dates: June 3, 2025 - September 30, 2026 Discount: Stay 3 nights and receive your fourth night complimentary Restrictions: lackout dates may apply. B Deposit and cancellation policies: 72 hours Applicable rooms: All room types PERKS OF PLANNING Experience Southern Reimagined™: take in the sunset from Citrus Club’s terrace, enjoy brunch on the patio before a bike ride through historic Charleston, or explore the Lowcountry with our Volvo Drive Program. However you plan to enjoy the city, receive 10% savings when you book 21 days in advance. After all, there are perks to planning. book Now Offer details 10% off when booked 21 days prior to arrival The offer requires a two-night minimum stay and is fully pre-paid at the time of booking. It is non-refundable and cannot be changed or canceled. The promotion is subject to availability, and blackout dates may apply. It is valid for new reservations only and cannot be applied to group bookings or combined with other offers. Taxes and gratuities are not included. All room types Discount: Restrictions: Applicable Rooms: Unwind Midweek Escape to Charleston and unwind midweek with 15% off your stay, plus a complimentary welcome amenity. Book a two-night or longer stay with arrivals Sunday through Wednesday, now through February 28, 2026. book Now Offer details Offer stay dates: May 23, 2025 - February 28, 2026 Offer booking dates: May 23, 2025 - February 28, 2026 Discount: 15% Off + Complimentary Welcome Amenity Restrictions: A minimum stay of 2 nights is required for arrivals Sunday through Wednesday, with blackout dates applying. Deposit and cancellation policies: 72 hours Applicable rooms: All room types Complimentary Parking Prepay for your stay and enjoy the added perk of complimentary valet parking. Please note, reservations are non-refundable and must be prepaid at the time of booking to redeem this offer. book Now Offer details Discount: Receive complimentary Valet Parking when you pre-pay. Restrictions: This rate is non-commissionable Deposit and cancellation policies: non-refundable Applicable rooms: All, Blackout dates may apply @thedewberrycharleston Image about Image about Image about Image about Image about",
      "hash": "dd4960be607d",
      "downloadedAt": "2026-01-18T16:52:23.537Z",
      "trimmedAt": "2026-01-18T17:11:33.530Z",
      "sizeReduction": "94.1%"
    },
    {
      "url": "https://www.thedewberrycharleston.com/drinks-dining#post-33225",
      "text": "DINING Charleston’s Award-Winning Hotel Dining Outlets Dine & imbibe over high-quality, ingredient-driven dishes and handcrafted cocktails at our outlets The Living Room and Citrus Club. The Living Room Hours of Operation: Sunday - Thursday | 7 AM – 11 PMFriday - Saturday | 7 AM – 12 AM Seating is first come, first served. Menu 843-872-9063 Experience the gracious hospitality and effortless style of a true Charleston living room. Outfitted with mid-century furnishings, a curated reading library and a showstopping brass bar, our Living Room is a warm and welcoming destination for morning coffee, afternoon cocktails or an evening aperitif. Every detail--right down to the wooden bowls hand-crafted by local artist Hugh Jeffers from the knots of a 150-year-old white oak tree that once stood nearby--echoes The Dewberry's rich history. To view our policies click . here Citrus Club Sunday - Wednesday: 12pm-8pm Thursday - Saturday: 12pm-10pm Menu The crown jewel in a city known for its steepled skyline and sea-skimming views, The Dewberry’s 8th floor terrace features the highest rooftop in Charleston. Home to our whimsical rooftop cocktail bar, Citrus Club, features citrus-inspired cocktails, and fresh lite bites. Seating is first come, first served. To view our policies click . here LARGE PARTY INQUIRIES Learn More To inquire about accommodating a large party exceeding 10 guests, please complete the form below. We will get back to you within 72 hours. Close LARGE PARTY INQUIRIES Please note that a food and beverage minimum will apply to any large parties booked. Full Name * Email Address * Phone Number * Occasion * Reservation Date * Preferred Venue * Citrus Club The Living Room Number Of Guests * 8 9 10 11 12 13 14 Number Of Guests * 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 Start Time * End Time I have read and agree to the . Privacy Policy Yes, I would like to receive emails with exclusive specials and offers. Submit @thedewberrycharleston Image about Image about Image about Image about Image about",
      "hash": "f56283953759",
      "downloadedAt": "2026-01-18T16:52:20.099Z",
      "trimmedAt": "2026-01-18T17:11:33.539Z",
      "sizeReduction": "97.6%"
    }
  ],
  "sizeReduction": "96.0%"
}