{
  "venueId": "ChIJRfLSxeRw_ogRCmr28dA1R9Q",
  "venueName": "Saltwater Cowboys",
  "venueArea": "Mount Pleasant",
  "website": "https://www.saltwater-cowboys.com/",
  "scrapedAt": "2026-01-18T17:04:26.266Z",
  "trimmedAt": "2026-01-18T17:07:24.148Z",
  "pages": [
    {
      "url": "https://www.saltwater-cowboys.com/calendar",
      "text": "Back Main Menu Drink Menu Brunch Menu Dog Treat Menu Gazebo Bar Menu To-Go Wagon Menu Back Plan Your Event Event Spaces Event Menus Event Request Form Back Merch + Sauces Gift Cards Back History The Wagon",
      "hash": "18b1642c7a14",
      "downloadedAt": "2026-01-18T16:57:06.559Z",
      "trimmedAt": "2026-01-18T17:07:23.975Z",
      "sizeReduction": "99.8%"
    },
    {
      "url": "https://www.saltwater-cowboys.com/to-go",
      "text": "Back Main Menu Drink Menu Brunch Menu Dog Treat Menu Gazebo Bar Menu To-Go Wagon Menu Back Plan Your Event Event Spaces Event Menus Event Request Form Back Merch + Sauces Gift Cards Back History The Wagon The WAGON : SWC TO-GO PLACE TO-GO ORDER A NEW CREEKSIDE EXPERIENCE IS HERE! WELCOME TO THE WAGON! Saltwater Cowboys is bringing the flavor outside with , our new to-go food trailer parked right in our lot on Shem Creek, Mount Pleasant, SC. This isn’t your typical Charleston food truck. The Wagon is a permanent extension of our kitchen, serving up your SWC favorites in a relaxed, grab-and-go setting. The Wagon Roll up in your golf cart from nearby neighborhoods, swing by on your way home and pick up a meal for the entire family or stop by in your car and enjoy sandwiches, tacos, wings, and more - quick, fresh Charleston takeout favorites prepared with “to-go” in mind. If you want to hang around and enjoy the SWC vibes, grab a seat on Shem Creek in Mount Pleasant. We’ll have a few picnic tables and plenty of fresh air. It’s the perfect spot to kick back creekside without missing a bite. Meet us at The Wagon! PLACE TO-GO ORDER",
      "hash": "1f3e4bd6399f",
      "downloadedAt": "2026-01-18T16:57:09.855Z",
      "trimmedAt": "2026-01-18T17:07:23.984Z",
      "sizeReduction": "99.2%"
    },
    {
      "url": "https://www.saltwater-cowboys.com/drink-menu",
      "text": "Back Main Menu Drink Menu Brunch Menu Dog Treat Menu Gazebo Bar Menu To-Go Wagon Menu Back Plan Your Event Event Spaces Event Menus Event Request Form Back Merch + Sauces Gift Cards Back History The Wagon Drink Menu Raise a glass on Shem Creek with the Saltwater Cowboys drink menu, featuring handcrafted cocktails, frozen drinks, wines, and local beers. From our signature Dockside Lemonade and craft cocktails to regional wines and coastal-inspired favorites, our Mount Pleasant bar is the perfect spot to enjoy waterfront drinks in Charleston. Whether you’re looking for Shem Creek bars with frozen cocktails, local brews, or sunset spritzers, Saltwater Cowboys delivers the ultimate creekside experience. Come sip your favorite drink by the water and see why Saltwater Cowboys is one of the top Shem Creek bars in Mount Pleasant, SC! Spritz Cocktails – $14Parrot Bay Strawberry Rum, strawberry purée, lemon juice, sparkling wine, soda, splash of ginger ale Strawberry A sweet and tart refreshing spritz – $14Grey Goose Essences Watermelon Basil Vodka, pomegranate liqueur, simple syrup, lemon juice, sparkling wine, soda, basil leaf Watermelon Basil Smooth, herbal, yet bitter spritz – $14St. Germain, lemon juice, simple syrup, sparkling wine, soda, mint Hugo A refreshing and floral spritz accented with mint and lemon – $14Aperol, sparkling wine, soda, orange Aperol A classic, bittersweet floral spritz – $14Ketel One Cucumber Mint, St. Germain, lemon juice, simple syrup, sparkling wine, soda, mint Cucumber Mint A cool, crisp, and refreshing spritz Wines Sparkling Val d’Oca Prosecco – Glass $9 / Bottle $35 Veuve Clicquot Brut – Bottle $120 White / Rosé Seaglass Riesling – $11 / $38 Ruffino Pinot Grigio – $8 / $28 Kim Crawford Sauvignon Blanc – $12 / $46 Robert Mondavi Private Selection Chardonnay – $9 / $31 Josh Cellars Chardonnay – $10 / $38 Bieler Rosé – $11 / $38 Red Meiomi Pinot Noir – $13 / $46 Terrazas de los Andes Malbec – $10 / $35 Robert Mondavi Private Selection Cabernet Sauvignon – $9 / $31 Frozen Cocktails – $12Wheatley Vodka, lemonade Dockside Lemonade – $12Deep Eddy Orange, Triple Sec, OJ, Sprite Cowboy Crush – $13Dockside Lemonade & Cowboy Crush, pomegranate liqueur Golden Crush – $14Pusser’s Rum, cream of coconut, pineapple, OJ, nutmeg Pusser’s Painkiller – $12Bacardi Rum, Irish cream, amaretto, crème de cacao, coffee Bacardi Creekwhacker Add a flavor floater to any frozen drink: strawberry, peach, watermelon, pomegranate, Smirnoff Vanilla, Crooked Cow caramel, Bailey’s Chocolate, Hoodoo Espresso, Skrewball (+$2) Creek Cocktails – $12Wheatley Vodka, lemon, Sprite, pink lemonade, Dockside float, cherry Volcano – $12Pusser’s Rum, peach schnapps, strawberry purée, pineapple Pusser’s Playmaker – $16Patrón Silver Tequila, triple sec, sour, pineapple Pineapple Paradise Margarita – $11Deep Eddy Peach Vodka, lime, ginger beer Playboy Mule – $12Deep Eddy Lime Vodka, raspberry liqueur, lime, Sprite Deep Trouble Limeade – $12End of Days Vodka, watermelon & black raspberry liqueur, pink lemonade End of Days Berry Lemonade – $12Corazón Tequila, lime, simple syrup, grapefruit, soda, Tajín rim Cowboy Paloma – $14Captain Morgan Coconut Rum, Blue Curaçao, pineapple, float of Painkiller Sandbar – $14Ghost Tequila, triple sec, strawberry purée, sour Spicy Strawberry Margarita – $12Twelve 33 Gin, elderflower liqueur, lemon, tonic Gin There, Done That – $12Deep Eddy Lemon Vodka, Deep Eddy Sweet Tea Vodka, peach schnapps, lemonade Palmetto Peach Tea – $12Parrot Bay Passionfruit Rum, mint, lime, simple syrup, cherry, soda, Sprite Parrot Bay Passionfruit Mojito – $13Crown Vanilla, cherry juice, lime juice, Coke Snakebite – $13Bulleit Bourbon, ginger ale, lime juice, blackberry liqueur Saltwater Smash Beers – $5 to $5.25 Domestics Michelob Ultra Miller Lite Coors Light Coors Banquet Bud Light Budweiser Sam Adams Seasonal Yuengling Imports Corona Light – $6 Pacifico – $5.75 Pacifico Bucket (5 beers) – $20 Modelo Especial – $6 Guinness – $8 Sapporo 22oz – $12 Crafts Blue Moon – $6 Golden Road Mango Cart – $6 Sierra Nevada Pale Ale – $7 Wicked Weed Pernicious IPA – $7 Wicked Weed Pilsner – $7.5 Kona Big Wave Golden Ale – $6 New Belgium VooDoo Juicy Haze IPA – $7 Wild Leap Blueberry Lemonade Sour – $7.25 Locals Commonhouse Park Circle Pale Ale – $7 Palmetto Huger Street IPA – $7 Island Coastal Lager – $6.5 Island Bucket (5 beers) – $22 Saltwater Cerveza – $7 Saltwater Cerveza Bucket (4 beers) – $20 Seltzers, Ciders & Non-Beers High Noon (Peach or Pineapple) – $10 Suncruiser (ask for flavors) – $9 White Claw Black Cherry – $6 Bravazzi Hard Italian Soda (Peach) – $7 Angry Orchard – $6 Nutrl Orange – $10 Twisted Tea Original – $5 Corona NA – $7 Michelob Ultra 0.0 – $5.25 DOWNLOAD MENU",
      "hash": "255e825ecac1",
      "downloadedAt": "2026-01-18T16:57:07.651Z",
      "trimmedAt": "2026-01-18T17:07:24.008Z",
      "sizeReduction": "97.1%"
    },
    {
      "url": "https://www.saltwater-cowboys.com/event-menus",
      "text": "Back Main Menu Drink Menu Brunch Menu Dog Treat Menu Gazebo Bar Menu To-Go Wagon Menu Back Plan Your Event Event Spaces Event Menus Event Request Form Back Merch + Sauces Gift Cards Back History The Wagon EVENT MENUS & PACKAGES At Saltwater Cowboys, we believe every celebration deserves bold flavors and Southern flair. Our private event menus are served buffet style and built around crowd-pleasing favorites—from smoked meats and seafood to Lowcountry sides and signature starters. With flexible packages and plenty of options to customize, you can build the perfect spread for your group, no matter the size or occasion. to find the perfect location for your next event. Check out our event space Package Options Includes: 2 Appetizers, 1 Entrée, 1 Side Small – $35 per person Includes: 2 Appetizers, 2 Entrées, 2 Sides Medium – $55 per person Includes: 3 Appetizers, 3 Entrées, 3 Sides Large – $70 per person PRIVATE EVENT MENU OPTIONS Appetizers Fried Green Tomatoes – with pimento cheese & strawberry bacon jam Pretzel Bites – choice of queso or horseradish mustard Crispy Brussels Sprouts – tossed in ginger soy with Sriracha aioli Fried Pickles – served with housemade buttermilk ranch Peel & Eat Shrimp – chilled with cocktail sauce & lemon Smoked Wings – buttermilk ranch or blue cheese (add $1 per person for dry rubs: ranch, buffalo, tajin, Old Bay) Nachos – queso, pico, sour cream, jalapeños, black beans Add pulled pork or chicken: +$2 per person Add brisket: +$4 per person BBQ Sliders – pulled pork on Hawaiian rolls Add coleslaw: +$1 per person Desserts Choice of 1 – $3 per person Lemon Squares Assorted Cookie Bites Brownie Bars Entrées Pulled Chicken Pulled Pork Shrimp & Grits – with tasso gravy, onions & peppers Smoked Turkey Fried Shrimp Grilled Shrimp Fried Flounder – with lemon dill tartar sauce Grouper Fingers – with lemon dill tartar sauce (+$2 per person) Sides Red Rice Collards Cowboy Baked Beans Pimento Cheese Grits Homemade Cole Slaw Tomato Cucumber Salad Mac 'N' Cheese Cilantro Lime Rice Add-Ons & Upgrades Salad Bar – $10 per person (choose one): SWC Caesar – romaine, parmesan, cornbread croutons, pickled red onions, Caesar dressing Cowboy Wedge – iceberg, bacon, tomato, cucumber, bleu cheese crumbles, ranch Shem Creek Salad – mixed greens, tomato, cucumber, peppers, pickled onions, cheese Includes: flour tortillas, black beans, pico, cheese, sour cream, cabbage, chipotle aioliServed with chicken and pork Taco Bar – $30 per person Sub shrimp: +$3 per person Sub brisket: +$4 per person Includes: cilantro lime rice, black beans, pico, cheese, sour cream, peppers, onionsServed with chicken and pork Creek Bowl – $30 per person Sub shrimp: +$3 per person Sub brisket: +$4 per person Shrimp, sausage, corn, onions, potatoes, Old Bay seasoning, served with cornbread Lowcountry Boil – $30 per person Choice of 3 appetizers (buffet-style) Cocktail Hour – $25 per person Open Bar Packages (2-Hour Duration Only) The Basics – $35 per person House Liquor: vodka, gin, rum, tequila, bourbon Domestic Beer: Bud, Bud Light, Coors Light, Miller Lite, Michelob Ultra, Yuengling Wine: Chardonnay & Cabernet Craft – $45 per person Craft Liquor: Tito’s, Bacardi, Jack Daniels, Dewars, Lunazul + house liquors Craft & Domestic Beer: includes Saltwater Cerveza, Blue Moon, Island Coastal Lager, etc. Wine: Chardonnay, Cabernet, Prosecco Top Shelf – $60 per person Premium Liquor: Grey Goose, Ketel One, Patron, Bulleit, Tanqueray, etc. Frozen Specialty Cocktails: Dockside Lemonade, Cowboy Crush, Golden Crush, etc. () Floaters & shots not included Craft & Domestic Beer Wine: Chardonnay, Pinot Grigio, Sauvignon Blanc, Rosé, Cabernet, Malbec, Prosecco REQUEST EVENT SPACE",
      "hash": "6f02efdf1517",
      "downloadedAt": "2026-01-18T16:57:10.405Z",
      "trimmedAt": "2026-01-18T17:07:24.026Z",
      "sizeReduction": "97.4%"
    },
    {
      "url": "https://www.saltwater-cowboys.com/main-food-menu",
      "text": "Back Main Menu Drink Menu Brunch Menu Dog Treat Menu Gazebo Bar Menu To-Go Wagon Menu Back Plan Your Event Event Spaces Event Menus Event Request Form Back Merch + Sauces Gift Cards Back History The Wagon MAIN Menu Explore the Saltwater Cowboys menu, featuring Southern-style seafood, BBQ, and Lowcountry favorites on the waterfront of Shem Creek in Mount Pleasant, SC. From smoked brisket and pulled pork to fried shrimp, tacos, and classic sides, our Charleston waterfront and seafood restaurant serves bold flavors with a laid-back coastal vibe. Whether you’re looking for Shem Creek restaurants with indoor dining or outdoor dockside views, Saltwater Cowboys is the perfect spot to enjoy a true taste of Mount Pleasant. Dine dockside at Saltwater Cowboys and taste why we’re a favorite among Shem Creek restaurants! Appetizers – $13.50Pico, queso, black beans, sour cream, and jalapeño Trash Can Nachos Add: Pulled Pork +$4, Brisket +$7, Smoked Turkey +$5, Smoked Chicken +$4 – $15.50Cucumber, sesame seeds, wakame, and red onion Ahi Tuna Poke – $14.50Served with lemon and dill tartar sauce Fried Grouper Fingers – $14.50Our 50-year-old Boals family recipe served chilled with Ritz crackers Boals Family Crab Dip – $11Fire-roasted corn, peppers, cilantro, lime, Parmesan cheese, and Tajín Mexican Street Corn Dip – $9Queso, pico, jalapeño served with tortilla chips Chips & Queso – $11Warm baked pretzel served with queso and mustard dipping sauce Colossal Pretzel – $14.50Old Bay seasoning and lemon with Boals family cocktail sauce Half-Pound Peel & Eat Shrimp – $12.508 crispy fried shrimp tossed in zesty Thai chili aioli Bang Bang Shrimp – $14.50Lightly breaded calamari served with a lemon citrus aioli Calamari – $9Hand-breaded garlic dill pickle chips served with honey horseradish sauce Fried Pickles – $12Bacon pimento cheese topped with smoked bacon and strawberry bacon jam Fried Green Tomatoes – $11.50Tossed in a ginger soy sauce and topped with Sriracha aioli Crispy Brussels Sprouts – $16Brined for 24 hours, spice-rubbed, smoked, and served dry or sauced Smoked Wings Toss in choice of dry rub (ranch, buffalo, or Old Bay): +$1 – $8Five halves of heaven Deviled Eggs Add another half: +$1 each Salads – $13Romaine, Parmesan, cornbread croutons, pickled red onions, and Caesar dressing Saltwater Caesar Salad – $12Iceberg wedges, smoked bacon, tomato, cucumber, bleu cheese crumbles, and homemade ranch Cowboy Wedge Salad – $12Mixed greens, tomato, cucumber, pickled red onion, bell pepper, and cheddar jack cheese Shem Creek Salad Add: Grilled or Fried Shrimp +$6, Grilled Mahi +$8, Brisket +$7, Fried Oysters +$6, Pulled Chicken or Pork +$4, Smoked Turkey Breast +$5 Southern Fried Seafood Served with your choice of two sides: Shrimp – $19 Flounder – $20 Oysters – $24 Grouper Fingers – $23 2-Item Combo – $24 3-Item Ultimate Combo – $29 Shem Creek Favorites – $19White and yellow grits with creamy tasso gravy, onions, and bell peppers Southern Shrimp & Grits – $23.50With sautéed Brussels sprouts, cilantro lime rice, and pineapple salsa Atlantic Grouper – $9.50Massive smoked baked potato topped with queso, green onions, and bacon The Smokehouse Spud Add: Pulled Pork +$4, Brisket +$7, Smoked Chicken +$4, Cowboy Baked Beans +$5 – $17.50Cilantro lime rice, black beans, wakame, bell peppers, cucumber, and red onion Sashimi Tuna Poke Bowl – $14Cilantro lime rice, black beans, cheddar jack, sour cream, jalapeño, pico, onions, and bell peppers Creek Bowl Add: Pulled Pork +$4, Brisket +$7, Smoked Chicken +$4, Grilled Shrimp +$6, Mahi Fingers +$6 – $24Enjoy a selection from our Southern Fried Seafood options and our House Smoked BBQ to experience the best Saltwater Cowboys has to offer Saltwater Combo Sub: Brisket +$4, St. Louis Spare Ribs +$4 House Smoked BBQ Served with your choice of two sides: Pulled Pork – $16 Smoked Chicken – $16 Smoked Wings – $19 Smoked Brisket – $20 Smoked Turkey Breast – $15 St. Louis Spare Ribs (Half Rack) – $20 St. Louis Spare Ribs (Full Rack) – $29 The 2 Meat Plate – $20 Sub Brisket +$4, Sub St. Louis Spare Ribs +$4 The 3 Meat Plate – $24 Sub Brisket +$4, Sub St. Louis Spare Ribs +$4 Tacos Served with fries – Flour tortillas, black beans, pico, cabbage, chipotle aioli Cowboy Tacos Mahi – $15.50 Shrimp – $14.50 Smoked Chicken – $12.50 Pork – $12.50 Brisket – $15.50 Burgers Half-pound American grass-fed beef served with fries – $16American cheese, lettuce, onion, tomato Classic Burger – $17Bacon pimento cheese, caramelized onions, bacon, lettuce, tomato Cowboy Burger – $17.50 wo patties, queso, bacon, chopped brisket Big Ol’ Boy Burger Sandwiches Served with fries – $15Baguette, lettuce, tomato, Cajun seasoning, rémoulade Shrimp Po Boy – $17Brioche bun, lettuce, tomato, lemon dill tartar Grilled Mahi Sandwich – $19Hand-breaded, lettuce, tomato, tartar, on brioche bun Fried Grouper Sandwich (Grilled grouper available) – $15Topped with cole slaw (+.75) Pulled Pork Sandwich – $15Topped with cole slaw (+.75) Pulled Chicken Sandwich – $14Smoked turkey breast, Swiss, lettuce, tomato, Duke’s mayo, bacon on a baguette Turkey Club Po Boy Sides (Each $4) Sweet Potato Fries Salt & Pepper Fries Cowboy Baked Beans Cole Slaw Collard Greens Mac ‘N’ Cheese Lima Beans Lowcountry Red Rice Tomato Cucumber Salad A 22% gratuity will be added to parties of 15 or more. Note: Consuming raw or undercooked meats, poultry, seafood, shellfish, or eggs may increase your risk of foodborne illness. DOWNLOAD MENU",
      "hash": "86455bec7039",
      "downloadedAt": "2026-01-18T16:57:07.102Z",
      "trimmedAt": "2026-01-18T17:07:24.054Z",
      "sizeReduction": "96.8%"
    },
    {
      "url": "https://www.saltwater-cowboys.com/menus-1",
      "text": "Back Main Menu Drink Menu Brunch Menu Dog Treat Menu Gazebo Bar Menu To-Go Wagon Menu Back Plan Your Event Event Spaces Event Menus Event Request Form Back Merch + Sauces Gift Cards Back History The Wagon MAIN Menu Explore the Saltwater Cowboys menu, featuring Southern-style seafood, BBQ, and Lowcountry favorites on the waterfront of Shem Creek in Mount Pleasant, SC. From smoked brisket and pulled pork to fried shrimp, tacos, and classic sides, our Charleston waterfront and seafood restaurant serves bold flavors with a laid-back coastal vibe. Whether you’re looking for Shem Creek restaurants with indoor dining or outdoor dockside views, Saltwater Cowboys is the perfect spot to enjoy a true taste of Mount Pleasant. Dine dockside at Saltwater Cowboys and taste why we’re a favorite among Shem Creek restaurants! Appetizers – $13.50Pico, queso, black beans, sour cream, and jalapeño Trash Can Nachos Add: Pulled Pork +$4, Brisket +$7, Smoked Turkey +$5, Smoked Chicken +$4 – $15.50Cucumber, sesame seeds, wakame, and red onion Ahi Tuna Poke – $14.50Served with lemon and dill tartar sauce Fried Grouper Fingers – $14.50Our 50-year-old Boals family recipe served chilled with Ritz crackers Boals Family Crab Dip – $11Fire-roasted corn, peppers, cilantro, lime, Parmesan cheese, and Tajín Mexican Street Corn Dip – $9Queso, pico, jalapeño served with tortilla chips Chips & Queso – $11Warm baked pretzel served with queso and mustard dipping sauce Colossal Pretzel – $14.50Old Bay seasoning and lemon with Boals family cocktail sauce Half-Pound Peel & Eat Shrimp – $12.508 crispy fried shrimp tossed in zesty Thai chili aioli Bang Bang Shrimp – $14.50Lightly breaded calamari served with a lemon citrus aioli Calamari – $9Hand-breaded garlic dill pickle chips served with honey horseradish sauce Fried Pickles – $12Bacon pimento cheese topped with smoked bacon and strawberry bacon jam Fried Green Tomatoes – $11.50Tossed in a ginger soy sauce and topped with Sriracha aioli Crispy Brussels Sprouts – $16Brined for 24 hours, spice-rubbed, smoked, and served dry or sauced Smoked Wings Toss in choice of dry rub (ranch, buffalo, or Old Bay): +$1 – $8Five halves of heaven Deviled Eggs Add another half: +$1 each Salads – $13Romaine, Parmesan, cornbread croutons, pickled red onions, and Caesar dressing Saltwater Caesar Salad – $12Iceberg wedges, smoked bacon, tomato, cucumber, bleu cheese crumbles, and homemade ranch Cowboy Wedge Salad – $12Mixed greens, tomato, cucumber, pickled red onion, bell pepper, and cheddar jack cheese Shem Creek Salad Add: Grilled or Fried Shrimp +$6, Grilled Mahi +$8, Brisket +$7, Fried Oysters +$6, Pulled Chicken or Pork +$4, Smoked Turkey Breast +$5 Southern Fried Seafood Served with your choice of two sides: Shrimp – $19 Flounder – $20 Oysters – $24 Grouper Fingers – $23 2-Item Combo – $24 3-Item Ultimate Combo – $29 Shem Creek Favorites – $19White and yellow grits with creamy tasso gravy, onions, and bell peppers Southern Shrimp & Grits – $23.50With sautéed Brussels sprouts, cilantro lime rice, and pineapple salsa Atlantic Grouper – $9.50Massive smoked baked potato topped with queso, green onions, and bacon The Smokehouse Spud Add: Pulled Pork +$4, Brisket +$7, Smoked Chicken +$4, Cowboy Baked Beans +$5 – $17.50Cilantro lime rice, black beans, wakame, bell peppers, cucumber, and red onion Sashimi Tuna Poke Bowl – $14Cilantro lime rice, black beans, cheddar jack, sour cream, jalapeño, pico, onions, and bell peppers Creek Bowl Add: Pulled Pork +$4, Brisket +$7, Smoked Chicken +$4, Grilled Shrimp +$6, Mahi Fingers +$6 – $24Enjoy a selection from our Southern Fried Seafood options and our House Smoked BBQ to experience the best Saltwater Cowboys has to offer Saltwater Combo Sub: Brisket +$4, St. Louis Spare Ribs +$4 House Smoked BBQ Served with your choice of two sides: Pulled Pork – $16 Smoked Chicken – $16 Smoked Wings – $19 Smoked Brisket – $20 Smoked Turkey Breast – $15 St. Louis Spare Ribs (Half Rack) – $20 St. Louis Spare Ribs (Full Rack) – $29 The 2 Meat Plate – $20 Sub Brisket +$4, Sub St. Louis Spare Ribs +$4 The 3 Meat Plate – $24 Sub Brisket +$4, Sub St. Louis Spare Ribs +$4 Tacos Served with fries – Flour tortillas, black beans, pico, cabbage, chipotle aioli Cowboy Tacos Mahi – $15.50 Shrimp – $14.50 Smoked Chicken – $12.50 Pork – $12.50 Brisket – $15.50 Burgers Half-pound American grass-fed beef served with fries – $16American cheese, lettuce, onion, tomato Classic Burger – $17Bacon pimento cheese, caramelized onions, bacon, lettuce, tomato Cowboy Burger – $17.50 wo patties, queso, bacon, chopped brisket Big Ol’ Boy Burger Sandwiches Served with fries – $15Baguette, lettuce, tomato, Cajun seasoning, rémoulade Shrimp Po Boy – $17Brioche bun, lettuce, tomato, lemon dill tartar Grilled Mahi Sandwich – $19Hand-breaded, lettuce, tomato, tartar, on brioche bun Fried Grouper Sandwich (Grilled grouper available) – $15Topped with cole slaw (+.75) Pulled Pork Sandwich – $15Topped with cole slaw (+.75) Pulled Chicken Sandwich – $14Smoked turkey breast, Swiss, lettuce, tomato, Duke’s mayo, bacon on a baguette Turkey Club Po Boy Sides (Each $4) Sweet Potato Fries Salt & Pepper Fries Cowboy Baked Beans Cole Slaw Collard Greens Mac ‘N’ Cheese Lima Beans Lowcountry Red Rice Tomato Cucumber Salad A 22% gratuity will be added to parties of 15 or more. Note: Consuming raw or undercooked meats, poultry, seafood, shellfish, or eggs may increase your risk of foodborne illness. DOWNLOAD MENU",
      "hash": "86f07c132768",
      "downloadedAt": "2026-01-18T16:57:11.172Z",
      "trimmedAt": "2026-01-18T17:07:24.083Z",
      "sizeReduction": "96.8%"
    },
    {
      "url": "https://www.saltwater-cowboys.com/gazebo-bar-menu",
      "text": "Back Main Menu Drink Menu Brunch Menu Dog Treat Menu Gazebo Bar Menu To-Go Wagon Menu Back Plan Your Event Event Spaces Event Menus Event Request Form Back Merch + Sauces Gift Cards Back History The Wagon GAZEBO Bar Menu Kick back with waterfront views at the Gazebo Bar at Saltwater Cowboys on Shem Creek in Mount Pleasant, SC. Our open-air bar serves creekside cocktails, cold beer, and shareable bites like flatbreads, wings, nachos, and tacos. Whether you’re meeting friends for happy hour, enjoying live music, or looking for the best outdoor bar in Mount Pleasant, the Gazebo Bar delivers laid-back vibes and unbeatable waterfront energy. Stop by the Gazebo Bar for the best drinks, food, and Shem Creek sunsets, no reservations needed! Flatbreads – $16Smoked chicken, mixed cheese, red onions, jalapeños, pineapple, and cilantro; topped with Carolina Gold and Sweet Hickory BBQ sauces BBQ Chicken Flatbread – $16Slow-smoked brisket, house queso, sautéed peppers and onions; finished with mixed cheese Philly Cheesesteak Flatbread – $14Red and green tomatoes, shaved Brussels sprouts, red onions, mixed cheese, and housemade garlic oil drizzle Veggie Flatbread Add: Pork +$2, Smoked Chicken +$2, Brisket +$2 – $15Brussels sprouts, smoked bacon, mixed cheese, and housemade hot honey sauce Brussels & Bacon Flatbread – $16Fresh mozzarella, fresh basil, housemade pizza sauce, and Italian seasoning Margherita Flatbread Appetizers & Snacks – $13.50Pico, queso, black beans, sour cream, jalapeños Trash Can Nachos Add: Pulled Pork +$4, Brisket +$7, Smoked Chicken +$4 – $16Add a rub or sauce for $1Rubs: Ranch, Old Bay, BuffaloSauces: Carolina BBQ, Hickory BBQ, Hot Honey, Reaper, Ghost Pepper Jumbo Smoked Wings – $11Served with queso and mustard sauce Jumbo Bavarian Pretzel – $11Fire-roasted corn, peppers, cilantro, lime, Parmesan cheese, Tajín Mexican Street Corn Dip – $13.50Cilantro lime rice, black beans, Colby Jack, sour cream, jalapeños, onions, and bell peppers Creek Bowl Add: Pulled Pork +$4, Brisket +$7, Smoked Chicken +$4 Flour tortillas, black beans, pico, cabbage, chipotle aioli; served with hand-cut potato chips or coleslawPork – $12.50Smoked Chicken – $12.50Brisket – $15.50 Cowboy Tacos – $14.50Old Bay, lemon, Boals family cocktail sauce Half-Pound Peel & Eat Shrimp – $14.50Boals 50-year-old family recipe served chilled with Ritz crackers Boals Family Crab Dip – $15Add slaw +.75Served with hand-cut potato chips or coleslaw Pulled Pork or Chicken Sandwich – $16.50Add slaw +.75Served with hand-cut potato chips or coleslaw Chopped Brisket Sandwich – $9.50Massive smoked baked potato, queso, green onions, bacon The Smokehouse Spud Add: Pulled Pork +$4, Brisket +$7, Smoked Chicken +$4, Cowboy Baked Beans +$5 Creek Cocktails – $12Pusser's Rum, peach schnapps, strawberry purée, pineapple Pusser’s Playmaker – $11Deep Eddy Peach Vodka, lime, ginger beer Playboy Mule – $12Deep Eddy Lime Vodka, raspberry liqueur, lime, Sprite Deep Trouble Limeade – $16Patrón Silver Tequila, triple sec, sour, pineapple Pineapple Paradise Margarita – $12Corazón Tequila, lime, simple syrup, grapefruit, soda Cowboy Paloma – $12Twelve 33 Gin, elderflower liqueur, lemon, tonic Gin There, Done That – $12Wheatley Vodka, lemon, Sprite, pink lemonade, float of Dockside, cherry Volcano – $12Parrot Bay Passionfruit Rum, mint, lime, simple syrup, cherry, soda, Sprite Parrot Bay Passionfruit Mojito – $14Captain Morgan Coconut Rum, blue curaçao, pineapple, float of Painkiller Sandbar – $12End of Days Vodka, watermelon & black raspberry liqueur, pink lemonade End of Days Berry Lemonade – $14Ghost Tequila, triple sec, strawberry purée, jalapeños, sour Spicy Strawberry Margarita – $12Deep Eddy Lemon & Sweet Tea Vodka, peach schnapps, lemonade Palmetto Peach Tea – $13Crown Vanilla, cherry juice, lime juice, Coke Snakebite – $13Bulleit Bourbon, ginger ale, lime juice, blackberry liqueur Saltwater Smash Frozen Cocktails – $12Wheatley Vodka, lemonade Dockside Lemonade – $12Deep Eddy Orange, Triple Sec, OJ, Sprite Cowboy Crush – $13Dockside Lemonade & Cowboy Crush, pomegranate liqueur+$2 Add any flavor floater: strawberry, peach, watermelon, pomegranate, Smirnoff Vanilla Golden Crush – $14Pusser’s Rum, cream of coconut, pineapple, OJ, nutmeg+$2 Add floater: dark rum, strawberry Pusser’s Painkiller – $12Bacardi Rum, Irish cream, amaretto, crème de cacao, coffee+$2 Add floater: Crooked Cow Caramel, Bailey’s Chocolate, Hoodoo Espresso, Skrewball Bacardi Creekwhacker High Noon (Peach or Pineapple) – $10Suncruiser (ask for flavors) – $9White Claw Black Cherry – $6Nutrl Orange – $10Bravazzi Hard Italian Soda (Peach or Blood Orange) – $7Bravazzi Hard Italian Soda Bucket (5) – $20 Seltzers Spritz Cocktails – $14A sweet and tart refreshing spritz – Parrot Bay Strawberry Rum, strawberry purée, lemon, sparkling wine, soda, splash of ginger ale Strawberry – $14A cool, crisp and refreshing spritz – Ketel One Cucumber Mint, St. Germain, lemon juice, simple syrup, sparkling wine, soda, mint Cucumber Mint – $14A refreshing and floral spritz with mint and lemon – St. Germain, lemon, simple syrup, sparkling wine, soda, mint Hugo – $14A classic, bittersweet floral spritz – Aperol, sparkling wine, soda, orange Aperol – $14Smooth, herbal, yet bitter spritz – Grey Goose Essences Watermelon Basil Vodka, pomegranate liqueur, simple syrup, lemon, sparkling wine, soda, basil leaf Watermelon Basil Wines Val d’Oca Prosecco – $9 glass / $35 bottleVeuve Clicquot Brut – $120 bottle Sparkling Seaglass Riesling – $11 / $38Ruffino Pinot Grigio – $8 / $28Kim Crawford Sauvignon Blanc – $12 / $46Robert Mondavi Private Selection Chardonnay – $9 / $31Josh Cellars Chardonnay – $10 / $38Bieler Rosé – $11 / $38 White / Rosé Meiomi Pinot Noir – $13 / $46Terrazas de los Andes Malbec – $10 / $35Robert Mondavi Private Selection Cabernet Sauvignon – $9 / $31 Red DOWNLOAD MENU",
      "hash": "9a63f00671c3",
      "downloadedAt": "2026-01-18T16:57:09.303Z",
      "trimmedAt": "2026-01-18T17:07:24.103Z",
      "sizeReduction": "96.1%"
    },
    {
      "url": "https://www.saltwater-cowboys.com/brunch-menu",
      "text": "Back Main Menu Drink Menu Brunch Menu Dog Treat Menu Gazebo Bar Menu To-Go Wagon Menu Back Plan Your Event Event Spaces Event Menus Event Request Form Back Merch + Sauces Gift Cards Back History The Wagon Brunch Menu Sundays are better with brunch at Saltwater Cowboys on Shem Creek in Mount Pleasant, SC. Join us every Sunday from 10 a.m. to 2 p.m. for a delicious spread of Southern favorites with a Lowcountry twist, including chicken & waffles, breakfast tacos, biscuits, and cinnamon sugar beignets. Pair your plate with a Mimosa Flight or our famous 32oz Bloody Mary Bucket and enjoy the best brunch in Charleston with waterfront views. Join us every Sunday and experience the best brunch on the waterfront at Saltwater Cowboys! Appetizers – $8Five biscuits served with homemade strawberry bacon jam & whipped butter Buttermilk Biscuits – $14Three fresh baked country biscuits with warm crispy bacon, scrambled eggs and American cheese Southern Style Breakfast Sliders Served with a side of sausage gravy – $9Five Halves of Heaven topped with candied bacon bits and finished with cayenne pepper Candied Bacon Deviled Eggs Add a half: +$1 each – $7Served with blueberry compote Cinnamon Sugar Beignets – $12Four of our soft BBQ bread dipped in cinnamon French toast batter and grilled to perfection, topped with powder sugar and macerated strawberries French Toast Sticks Served with our house made maple butter syrup Entrées * – $17Grilled Norwegian filet of salmon served on toasted brioche bread, topped with sliced tomato, bacon, tartar sauce, and lettuce Salmon BLT Served with breakfast potatoes * – $17Poached eggs served on a baked buttermilk biscuit topped with hollandaise and crab meat Crab Benedict Served with breakfast potatoes – $16Crispy chicken tenders breaded in Captain Crunch cereal and fried to perfection. Two freshly baked Belgian waffles topped with macerated strawberries, finished with a dust of powdered sugar Captain Crunch Chicken & Waffles Served with our Maple Butter Syrup – $14Diced ham, diced peppers & onions, melted jack/cheddar cheese Ham and Cheese Omelette Served with breakfast potatoes – $16House made grits topped with scrambled eggs, choice of bacon or smoked sausage, peppers and onions Traditional Southern SWC Grit Bowl Topped with a freshly baked buttermilk biscuit – $16Sliced brioche (French toast style) dipped in crushed corn flakes. Melted Swiss cheese, bacon, eggs, and sliced hardwood smoked ham inside Monte Cristo Sandwich Served with breakfast potatoes and a side of strawberry preserve * – $15Two 100% Certified Angus brisket/chuck blend patties topped with an over-easy egg, hash browns, American cheese, lettuce, tomato and onion Breakfast Burger Served with breakfast potatoes or salt & pepper fries – $13Our famous smoked spuds fried to perfection. Topped with sausage gravy, scrambled eggs, melted cheese, bacon and fresh scallions Loaded Breakfast Potatoes – $12Scrambled eggs, melted jack and cheddar cheese, pico and potato crisps between two warm flour tortillas Breakfast Tacos Finished with our house-made chipotle aioli – $14Giant flour tortilla filled with scrambled eggs, peppers and onions with your choice of bacon or smoked sausage BIG Breakfast Burrito Finished with Sriracha aioli and served with pico and sour cream À La Carte Hardwood Bacon – $4 Smoked Sausage – $4 Breakfast Potatoes – $4 Belgium Sugar Waffle – $5 DRINK MENU BLOODY MARY - 36OZ – $20Vodka, Bloody Mary mix, fresh lime juice, and SWC’s own sweet hickory BBQ sauce and a pork rind & bacon rim Big Daddy Bloody Mary Garnished with a chicken drum, pickled red onions, okra, green olives, celery, lemon & lime wedge – $20Tequila, Bloody Mary mix, fresh lime juice, and SWC’s own reaper BBQ sauce and a pork rind & bacon rim Spicy Mama Bloody Maria Garnished with a chicken drum, bacon slices, pickled red onions, okra, green olives, celery, lemon & lime wedge – $20Vodka, Bloody Mary mix, fresh lime juice, and SWC’s own reaper BBQ sauce and a pork rind & bacon rim Hangover Negotiator Bloody Mary Garnished with a large whole pickle, bacon slices, pickled red onions, okra, green olives, celery, lemon & lime wedge – $20Vodka, Bloody Mary mix, olive juice, and SWC’s own hot sauce and a pork rind & bacon rim After Church Bloody Mary Garnished with a deviled egg and cucumber ribbon, bacon slices, pickled red onions, okra, green olives, celery, lemon & lime wedge – $20Vodka, Bloody Mary mix, fresh lime juice, and SWC’s own sweet hickory BBQ sauce and an old bay seasoning rim The Three Horsemen Bloody Garnished with three head-on shrimp, pickled red onions, okra, green olives, celery, lemon & lime wedge GOOD MORNING PITCHER - 96OZ – $35Good Morning Pitcher with vodka, sparkling wine, pineapple juice and ginger beer Pineapple Mule-mosa Garnished with lime wheels and pineapple tidbits – $35Good Morning Pitcher with tequila, sparkling wine and orange juice. Topped with orange crush and pomegranate purée Sunrise Sparkling Sorbet Finished with orange & lemon wheels and maraschino cherries – $35Good Morning Pitcher with tequila, sparkling wine and pink lemonade. Topped with dockside lemonade and strawberry purée Strawberry Lemonade Sparkling Sorbet Garnished with lemon & lime wheels and cherries COCKTAILS – $16Bloody Mary with hot sauce, lime juice, tajin rim and a full can of SWC Cerveza Cowboy Michelada – $20A full bottle of champagne served with three 12-oz juices (orange, cranberry, grapefruit) Mimosa Flight – $13Blackberry liqueur, vodka, lemon juice, ginger beer, splash of champagne and mint Blackberry Champagne Mule – $11Ready to drink. Made with real iced tea and real vodka for an incredibly refreshing, smooth, and easy drinking beverage Suncruiser Served in a 12-oz can – ask for available flavors Consuming raw or undercooked meats, poultry, seafood, shellfish, or eggs may increase your risk of foodborne illness. DOWNLOAD BRUNCH MENU",
      "hash": "ad5fe0604935",
      "downloadedAt": "2026-01-18T16:57:08.199Z",
      "trimmedAt": "2026-01-18T17:07:24.120Z",
      "sizeReduction": "96.1%"
    },
    {
      "url": "https://www.saltwater-cowboys.com/dog-menu",
      "text": "Back Main Menu Drink Menu Brunch Menu Dog Treat Menu Gazebo Bar Menu To-Go Wagon Menu Back Plan Your Event Event Spaces Event Menus Event Request Form Back Merch + Sauces Gift Cards Back History The Wagon Dog Treat Menu At Saltwater Cowboys on Shem Creek in Mount Pleasant, SC, we welcome dogs like family! Our dog-friendly restaurant and waterfront patio are the perfect spots for pups to relax while you enjoy Southern food and Lowcountry views. With our special Dog Treat Menu, featuring tail-wagging favorites like pup burgers, ice cream cones, and beefy ales, Saltwater Cowboys is Charleston’s go-to dog-friendly dining destination. Bring your four-legged friends and discover why Saltwater Cowboys is the best dog-friendly restaurant on Shem Creek with treats for everyone, even the pups!",
      "hash": "b355f8b188da",
      "downloadedAt": "2026-01-18T16:57:08.749Z",
      "trimmedAt": "2026-01-18T17:07:24.128Z",
      "sizeReduction": "99.4%"
    },
    {
      "url": "https://www.saltwater-cowboys.com/",
      "text": "Back Main Menu Drink Menu Brunch Menu Dog Treat Menu Gazebo Bar Menu To-Go Wagon Menu Back Plan Your Event Event Spaces Event Menus Event Request Form Back Merch + Sauces Gift Cards Back History The Wagon Scroll View fullsize Welcome to Saltwater Cowboys on Historic Shem Creek Since 2017, Saltwater Cowboys has been Mount Pleasant’s go-to waterfront restaurant on , known for , slow-smoked BBQ, , and . As one of the top Shem Creek restaurants, we offer a laid-back Lowcountry dining experience with unbeatable marsh and harbor scenery. Whether you're here for oysters, brisket, happy hour, or a night out with friends, our authentic flavors, , and friendly crew make Saltwater Cowboys a favorite for locals and visitors looking for Charleston’s best seafood and BBQ on the water. historic Shem Creek seafood cold cocktails unforgettable sunset views live music LATEST SWC UPDATES Jan 16, 2026 5 Reasons To Visit Shem Creek This Winter Jan 16, 2026 Shem Creek dining is here all year. From beautiful winter sunsets to warming Southern flavors, Saltwater Cowboys is your go-to restaurant in Charleston for year-round indoor/outdoor dining. Jan 16, 2026 Jan 3, 2026 We'll be Closed for Renovations thru Jan. 16 Jan 3, 2026 We will be temporarily closed through Jan. 16 to complete a significant renovation. This marks our first major renovation since we opened in 2017. The Wagon remains open for to-go and delivery orders. Jan 3, 2026 Dec 12, 2025 Enjoy Your Christmas Break at Saltwater Cowboys Dec 12, 2025 There’s nothing better than Christmas on Shem Creek! Join Saltwater Cowboys for a one-of-a-kind holiday experience, featuring hot cocoa, festive cocktails, Christmas shopping and more. Dec 12, 2025 The food was fantastic, drinks were great and the staff was very friendly! “ ” — Tahra W. (July 2025) - Saltwater Certified GET SOCIAL WITH SALTWATER COWBOYS Loved the ambiance! Great food! Great service! We’ll be back! “ ” — Kevin S. (April 2025) - SALTWATER CERTIFIED",
      "hash": "d10e9d72f6c3",
      "downloadedAt": "2026-01-18T16:57:06.507Z",
      "trimmedAt": "2026-01-18T17:07:24.148Z",
      "sizeReduction": "98.8%"
    }
  ],
  "sizeReduction": "97.7%"
}