{
  "venueId": "ChIJ2zxKd2t6_ogReDXMv7VB5fU",
  "venueName": "Coast",
  "venueArea": "Downtown Charleston",
  "website": "https://www.coastbarandgrill.com/",
  "scrapedAt": "2026-01-19T03:25:38.545Z",
  "trimmedAt": "2026-01-19T03:26:08.247Z",
  "pages": [
    {
      "url": "https://www.coastbarandgrill.com/",
      "text": "[Page Title: Coast Bar And Grill - Holy City Hospitality]\n\nMake a Reservation View Menus Join Our Loyalty Program \nCharleston’s Freshest Seafood\n\nLocated in a historic warehouse, Coast Bar and Grill features 40-foot ceilings, rustic tin roofs and art from around the world, creating an atmosphere reminiscent of an eclectic beach bar.\n\nOur chefs are dedicated to procuring the freshest seafood from the Charleston shores and around the Lowcountry. Served nightly, our menu offers seafood classics along with the chefs’ nightly unique creations. At the heart of Coast Bar and Grill is the hickory and oak custom wood-burning grill, a feature you will only find at Coast.\n\nGuests’ favorites include our daily selection of oysters and wood-grilled fish paired with our freshly made in-house sauces; there’s an option for everyone’s palate. Here at Coast Bar and Grill, we are dedicated to making every effort to create an unique experience with only the highest quality of ingredients.\n\nFollow Us\n\nPrivate Events\n\nCoast is available for daytime events such as conferences or luncheons and semi-private evening gatherings.\n\nThe patio at Coast seats 25 comfortably, ideal for semi-private celebrations.\nThe dining room is an ideal space for meetings and luncheons.\nPrivate evening gatherings of varying sizes can be hosted Upstairs at 39 Rue de Jean.\n\nAll event spaces provide menus designed to your specific needs. Let our professionals tailor your special event and make the most of it.\nInquire Now \nGive the gift of delicious cuisine.\nPurchase Gift Cards \nContact Us\n\nOPEN FOR PICKUP, INDOOR AND OUTDOOR DINING\n\n39-D John Street Charleston, SC 29403\n\nOperating Hours:\nDinner\nMon-Thu, Sun 4:30 pm-9:30 pm\nFri, Sat 4:30 pm-10:00 pm\n\nPhone: (843) 722-8838\nEmail Us \nSee our news, reviews, and happenings.\nPress & Reviews View the Blog",
      "hash": "0e6ad119e898",
      "downloadedAt": "2026-01-19T02:06:52.967Z",
      "trimmedAt": "2026-01-19T03:26:08.247Z",
      "sizeReduction": "96.5%"
    }
  ],
  "sizeReduction": "96.5%"
}