{
  "venueId": "ChIJmedhesJ7_ogRX7pUf0W2PMU",
  "venueName": "Gene's Haufbrau",
  "venueArea": "West Ashley",
  "website": "http://genescharleston.com/",
  "scrapedAt": "2026-01-18T17:04:29.483Z",
  "trimmedAt": "2026-01-18T17:11:46.954Z",
  "pages": [
    {
      "url": "http://genescharleston.com/charleston-west-ashley-gene-s-haufbrau-happy-hours-specials",
      "text": "Specials Sunday January 18th Sunday Brunch! 11:00 AM - 03:00 PM Happy Hour! 04:00 PM - 07:00 PM Monday January 19th Blue Plate Specials! Monday - Fried Pork Chop 11:30 AM - 04:00 PM Happy Hour! 04:00 PM - 07:00 PM Tuesday January 20th Blue Plate Specials! Tuesday - Fried Chicken 11:30 AM - 04:00 PM Happy Hour! 04:00 PM - 07:00 PM Wednesday January 21st Blue Plate Specials! Wednesday - Pot Roast 11:30 AM - 04:00 PM Happy Hour! 04:00 PM - 07:00 PM Thursday January 22nd Blue Plate Specials! Thursday - Country Fried Steak 11:30 AM - 04:00 PM Happy Hour! 04:00 PM - 07:00 PM Friday January 23rd Blue Plate Specials! Friday - Fried Flounder 11:30 AM - 04:00 PM Happy Hour! 04:00 PM - 07:00 PM Saturday January 24th Happy Hour! 04:00 PM - 07:00 PM",
      "hash": "30ce2a51ad07",
      "downloadedAt": "2026-01-18T17:02:25.578Z",
      "trimmedAt": "2026-01-18T17:11:46.928Z",
      "sizeReduction": "98.9%"
    },
    {
      "url": "http://genescharleston.com/charleston-west-ashley-gene-s-haufbrau-beer-menu",
      "text": "Our Drinks",
      "hash": "90a3d093f8bc",
      "downloadedAt": "2026-01-18T17:02:24.946Z",
      "trimmedAt": "2026-01-18T17:11:46.930Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://genescharleston.com/charleston-west-ashley-gene-s-haufbrau-food-menu",
      "text": "Our Menu Menu Blue Plate Lunch Sunday Brunch",
      "hash": "a8d366679842",
      "downloadedAt": "2026-01-18T17:02:24.272Z",
      "trimmedAt": "2026-01-18T17:11:46.934Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://genescharleston.com/",
      "text": "× Did you know we do catering? Whatever your occasion, however big or small, we have the perfect options to choose from. Cater your birthday party, holiday party, corporate events, wedding festivities and more! Catering Packages × Let us host your special event! Whether a birthday party, office function or any other special occasion - we take care of all the fine details, bringing your event to life, just as you imagined. Host your next party or get together Book your party Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! Job Listings Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! 817 Savannah Hwy, Charleston, SC 29407 map marker pin Catering Let us cater your next event Gene's Haufbrau would be honored to provide our services for your next event. Each event is bespoke to your tastes and needs, to provide the best experience possible for you and your guests. Catering Groups and Parties Book your next party with us! Need the space for your event? Search no more we have a perfect place for you! Parties THE LITTLE DIVE BAR WITH THE BEST CRAFT BEER SELECTION IN CHARLESTON Specials Sunday Brunch! 11:00 AM - 03:00 PM ALL SPECIALS Good food done right Our Menu Book your next party with us! Parties Full bar is available Drinks Dot slide navigation number 1 Dot slide navigation number 2 Dot slide navigation number 3 slideshow start stop playing Chicken quesadillas, with salsa, and sour cream A glass of Guinness beer A bottle of High Life beer Fried pork chop, with crispy onion rings, fries, melted cheese, and... Burger, with ranch sauce, crumbled bacon, scallions, lettuce, tomato,... Greek salad, with romaine lettuce, tomato, black olives, feta, onion,... Pinball machines A bottle of Maisel's Weisse Original wheat beer A glass of Pabst Blue Ribbon lager A glass of hazy IPA Dart board A bottle of Pinkus Pilsner beer Buffalo Chicken, with lettuce, tomato, onion, celery, blue cheese... Chicken fingers, with dip Jumbo Soft Pretzel, with beer cheese Cheeseburger, with bacon, sauteed onions, fried egg, tomato, lettuce,... Bratwurst with sauerkraut Fried veal chop, served with potato cakes, lobster cream sauce, and... Cajun Fried Crawdads, served with jalapeno tartar sauce Grilled chicken sandwich, with cheese, bacon, avocado, hot sauce,... MexiClub sandwich, with grilled chicken, bacon, avocado, hot sauce,... Reviews Review by - Yelp Lisa C.: Enjoyed a cold beer then hubby had the bratwurst sandwich that he loved. I had blue plate pot roast special that was delicious. Nice sized portions of food and good atmosphere Review by - Yelp Michelle S.: Loved Genes for a delicious beer, welcoming atmosphere and the crawfish salad (the jalapeño vinegarette ) it was a fun few hours and I got some help with the days Wordle Review by - Yelp Sarah S.: Delicious food and a hefty beer list. Was difficult to decide! My Avondale burger didn't need any ketchup or mustard...my mouth is watering just thinking about it.. Review by - Yelp Jay W.: This place is great! The food and drinks are out of this world! Can't wait to come back. Best Bloody Mary I have ever had! Great music too! Review by - Yelp Amanda J.: My 5 year old says this is his favorite restaurant. Us adults love it because we have a choice of many craft beers, cocktails, and our favorite- Jameson. The kids enjoy the small arcade area. Bartenders are fun and helpful. Best dive bar around! Stop reviews carousel Play reviews carousel Newsletter Location 817 Savannah Hwy Charleston, SC 29407 Hours Sun, Mon, Tue, Wed, Thur, Fri, Sat 12:00 AM - 2:00 AM Find us on... Facebook page Yelp page Contact us (843)-225-4363 genes817@icloud.com Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "edc51bb40c5b",
      "downloadedAt": "2026-01-18T17:02:24.174Z",
      "trimmedAt": "2026-01-18T17:11:46.954Z",
      "sizeReduction": "97.4%"
    }
  ],
  "sizeReduction": "98.7%"
}