{
  "venueId": "ChIJvSqKX-B7_ogRBYT8cufAmBk",
  "venueName": "Pelato",
  "venueArea": "Mount Pleasant",
  "website": "https://www.pelatorestaurant.com/location/pelato-charleston/",
  "scrapedAt": "2026-01-18T17:04:31.793Z",
  "trimmedAt": "2026-01-18T17:12:56.468Z",
  "pages": [
    {
      "url": "https://www.pelatorestaurant.com/location/pelato-nashville/",
      "text": "× Reservations Location - Required Location Pelato Nashville Pelato Charleston Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service Main content starts here, tab to start navigating Nashville Slide 1 of 5 Slide 2 of 5 Slide 3 of 5 Slide 4 of 5 Slide 5 of 5 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Hours & Location 1300 3rd Ave N, Nashville, TN 37208 (opens in a new tab) (615) 953-0012 infoNASH@pelatorestaurant.com 5pm - 9pm Monday - Thursday 4:30pm - 10pm Friday Brunch: 11am - 2pm / Dinner: 4:30pm - 10pm Saturday Brunch: 11am - 2pm / Dinner: 4:30pm - 9pm Sunday Pelato Dining Information Due to high demand, dining is limited to 2-hours per table. Please arrive promptly for your reservation. Management reserves the right to return tables into rotation 2-hours beyond the reservation start time, or once all sales have been exhausted. Outdoor dining available year-round in our heated, covered, & enclosed patio. Reservations are advised both inside and on the patio, walk-ins are always welcome. Seating at our main bar and back bar is first come first serve. Click the reservation link for availability. Local street parking & paid parking lots are available in the area. 20% gratuity will be applied to groups of 6 or more. Split payments may be divided up to 4 credit cards at equal value. We do not split checks by item or by different increments - please plan accordingly if you are splitting the check with your guests. A corkage fee of $45 will be applied to any 750ml wines brought by guest – limit 2 per table. A dessert plating fee of $5 will be applied to any desserts brought by guests. Groups of 9 or more are subject to our Large Party Reservation Policies. A $10 per person (2 to 8 guests) or $30 per person (9 or more guests) fee will be charged in the event of a no-show or if reservations are cancelled within 24 hours of reservation start time. Cancellation fees will be waived for re-booking a new reservation within 2 weeks as a one-time courtesy, and will be charged at the full amount of the original reservation if cancelled twice. F&B minimums apply to groups of 9 or more. Inquire with host team for details & large party policies. Get Directions (opens in a new tab) Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Please, enter a valid which location are you signing up for? Which location are you signing up for? - Required Which location are you signing up for? Pelato Nashville Pelato Charleston Franklin - TN Submit Please check errors in the form above Thank you for signing up for email updates! Close and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service",
      "hash": "03812a691e94",
      "downloadedAt": "2026-01-18T16:56:53.100Z",
      "trimmedAt": "2026-01-18T17:12:56.393Z",
      "sizeReduction": "93.1%"
    },
    {
      "url": "https://www.pelatorestaurant.com/nashville-menus/",
      "text": "× Reservations Location - Required Location Pelato Nashville Pelato Charleston Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service Main content starts here, tab to start navigating Menus Nashville Slide 1 of 3 Slide 2 of 3 Slide 3 of 3 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Dinner Brunchy Sweets Vino & Boozy sunday sauce Dinner All Items Meant for Sharinga Little Bit of This, a Little Bit of That Small Plates Get Things Goin’ Garlic Bread Seeded Italian bread, parsley, butter Add melted parm Add red sauce Fresh Made House Mozzarella Served warm, olive oil, sea salt. Made to order gluten free Mozzarella Caprese Fresh made mozzarella, sliced kumoto tomatoes, balsamic reduction, basil gluten free Prosciutto Di Parma Parmigiano reggiano, aged balsamic, olive oil. Sliced fresh to order gluten free Pelato Salad Iceberg, salami, provolone, red onion, vinegar peppers, gigante beans, oregano vinaigrette gluten free The Goods Potato Croquettes Mozzarella, garlic aioli, parmigiano reggiano Seasonal Burrata Crostini toasted sesame bread, delicata squash, balsamic onions, scallions Panelle Fried Sicilian chickpea fritters, whipped ricotta, pecorino gluten free Crispy Zucchini Strings Lemon Crispy Garlic Potatoes fresh herbs, garlic aioli gluten free Crispy Cauliflower Piccata lemon-caper butter Street Style Arancini guanciale, peas, pecorino, mozzarella Burnt Broccolini Black garlic, Calabrian chili, lemon gluten free Stuffed Mushrooms Cremini mushrooms, lemon, breadcrumbs, parsley, butter Eggplant Stuffed Bread tomato, parmesan, mozzarella The Meats Creamy Polenta & Bolognese Sauce Creamy polenta, ragú bolognese, parmigiano reggiano gluten free Chicken Parmigiana Tomato, basil, parmigiano reggiano, mozzarella Meatballs Al Forno Tomato sughetto, parmigiano reggiano The Squids & Fishes Fried Calamari available as crispy or drenched in arrabbiata sauce DRY - crispy with candied peppers and arrabbiata side DRENCHED - in a spicy arrabbiata sauce, teardrop peppers Baked Clams Oreganata Middle neck clams, breadcrumbs, oregano, butter, lemon All pastas made in-house daily Saucy The Pelato Rav raviolini sheet, butternut squash, brown butter, parmigiana reggiano, balsamic Radiatori Vodka Tomato, cream, Calabrian chili, parmigiano reggiano Campanelle Shrimp Limone creamy lemon, parmigiano reggiano Substitute home-made gluten free pasta Gnocchi Pomodoro handmade potato gnocchi, eggplant, red sauce, mozzarella Bucatini Cacio E Pepe Fresh cracked black pepper, pecorino Bombolotti With Sausage, Peppers & Onions crumbled sausage, tomato sauce, garlic Penne Carbonara pancetta, egg yolk, pecorino, black pepper SUBSTITUTE HOME-MADE GLUTEN FREE PASTA *excludes Pelato Rav, Stuffed Shells and Cacio e Pepe* Brunchy Download PDF (opens in a new tab) Brunchy That Italian Sandwich Sliced sesame bread, prosciutto di parma, genoa salami, provolone, homemade mozzarella, pepperoncini, onion, oregano, vinegar Crispy Garlic Brunch Potatoes fresh herbs, garlic aioli gluten free Italian Biscuits & Gravy Sunny egg sausage gravy, sautéed spinach, cherry peppers Eggs Bene-Vic poached eggs over crispy pizzelle, prosciutto, arugula, tomato hollandaise Frittata Caprese baked egg, blistered roma tomato, scallion, basil, mozzarella, parmesan gluten free Cannoli Pancakes chocolate chips, raspberries, cannoli cream French Toast... But Italian Nutella, brioche, caramelized banana, maple syrup, whipped cream click the pdf above to view our brunch menu. most dinner items are available during brunch with the exception of a select few dishes Full Dinner Menu (Mostly) Available Slide 1 of 3 Slide 2 of 3 Slide 3 of 3 Desserts & Sweet Drinks Desserts San Gennaro Zeppoles fried dough, powdered sugar, served in-bag per tradition Rainbow Cookies three layer almond cookies with a dark chocolate coating The Cloud creamy rice pudding served with sweet berry misti Dark Chocolate Budino served with vanilla bean whipped cream Tiramisu layered espresso ladyfingers, house cream Cannoli Chips & Dip! house made sweet ricotta cream & cannoli chips, chocolate chips All fresh made in-house! Pelato Gelato Vanilla Bean Nutella Pistachio Goodness Olive Oil All fresh made in-house! Sorbet Lemon Coconut Raspberry Sweet Drinks Frozen Espresso Martini vodka, caffe lolita coffee liqueur, demerara syrup, nitro cold brew From the Bar Download PDF (opens in a new tab) Frozen Cocktails Freezios Frozen Espresso Martini vodka, caffe lolita coffee liqueur, demerara syrup, nitro cold brew Frozen Cosmo vodka, orange liqueur, white cranberry, pomegranate and lime juice Pelato Cocktails Stiff Drinks The Casanova...Our Take On A Negroni gin, cappelletti apertivo, blood orange \"New York Sour\" whiskey, orangecello, lemon, red wine float Smokey Zenzero scotch, cappelletti apertivo, lemon, honey, ginger Espresso Old Fashioned whiskey, coffee liqueur, espresso, demerara, bitters Lambrusco 75 gin, lemon, lambrusco Limoncello Margarita blanco tequila, limoncello, orange liqueur, lemon & lime juice Red Hook Sangria cabernet, brandy, pomegranate, pineapple and lime juice Beers & Spiked Seltzers Suds & Bubs Brooklyn Brewery Brown Ale 16oz Draft- Brooklyn, NY- 5.6% ABV Peroni 16oz Draft- Italy - 5% ABV Yazoo Hopry Hazy IPA 12oz- Nashville, TN, 6.5% ABV Birra Moretti L'Autentica 11.2oz- Italy- 6% ABV Bravazzi Grapefruit Hard Italian Soda 12oz- 4.2% ABV Wine The Grapes View PDF at top of the page N.A. Beer & Mocktails Not Boozy Brooklyn Special Effects N.A. IPA 12oz- Brooklyn, NY- 0.5% ABV Peroni N.A. 12oz- Italy- 0% ABV Sunset Park pineapple, orange, lime, grenadine, sprite Peachy Fields peach puree, lemon, ginger ale Sunday Sauce Sunday Sauce (for two) Also known as Sunday Gravy, this time honored classic evokes memories of weekends & family gatherings in which mom or grandma presided over the constantly stirred pot of sauce & meat, and various relatives were tasked with procuring the essential provisions. Our family is proud to share this tradition with your family every Sunday night. fusilli, tomato, ribs, braciola*, sausage, meatballs SUNDAYS ONLY - Limited Availability *contains pine nuts Slide 1 of 3 Slide 2 of 3 Slide 3 of 3 Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Please, enter a valid which location are you signing up for? Which location are you signing up for? - Required Which location are you signing up for? Pelato Nashville Pelato Charleston Franklin - TN Submit Please check errors in the form above Thank you for signing up for email updates! Close and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service",
      "hash": "1e4e84d0cd0c",
      "downloadedAt": "2026-01-18T16:56:53.628Z",
      "trimmedAt": "2026-01-18T17:12:56.420Z",
      "sizeReduction": "92.7%"
    },
    {
      "url": "https://www.pelatorestaurant.com/location/pelato-charleston/",
      "text": "× Reservations Location - Required Location Pelato Nashville Pelato Charleston Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service Main content starts here, tab to start navigating Charleston NOW OPEN! Slide 1 of 4 Slide 2 of 4 Slide 3 of 4 Slide 4 of 4 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Hours & Location 1085 Morrison Dr, Charleston, SC 29403 (opens in a new tab) infoCHS@pelatorestaurant.com 5pm - 9pm Monday - Thursday 4:30pm - 10pm Friday Brunch: 11am - 2pm / Dinner: 4:30pm - 10pm Saturday Brunch: 11am - 2pm / Dinner: 4:30pm - 9pm Sunday CLOSED Tuesday January 6th Pelato Dining Information Due to high demand, dining is limited to 2-hours per table. Please arrive promptly for your reservation. Management reserves the right to return tables into rotation 2-hours beyond the reservation start time, or once all sales have been exhausted. Outdoor dining available year-round in our heated, covered, & enclosed patio. Reservations are advised both inside and on the patio, walk-ins are always welcome. Seating at our main bar and back bar is first come first serve. Click the reservation link for availability. Parking available on-site 20% gratuity will be applied to groups of 6 or more. Split payments may be divided up to 4 credit cards at equal value. We do not split checks by item or by different increments - please plan accordingly if you are splitting the check with your guests. A corkage fee of $45 will be applied to any 750ml wines brought by guest – limit 2 per table. A dessert plating fee of $5 will be applied to any desserts brought by guests. Groups of 9 or more are subject to our Large Party Reservation Policies. Get Directions (opens in a new tab) Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Please, enter a valid which location are you signing up for? Which location are you signing up for? - Required Which location are you signing up for? Pelato Nashville Pelato Charleston Franklin - TN Submit Please check errors in the form above Thank you for signing up for email updates! Close and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service",
      "hash": "45f56b6a7a7a",
      "downloadedAt": "2026-01-18T16:56:53.071Z",
      "trimmedAt": "2026-01-18T17:12:56.427Z",
      "sizeReduction": "93.9%"
    },
    {
      "url": "https://www.pelatorestaurant.com/charleston-menus/",
      "text": "× Reservations Location - Required Location Pelato Nashville Pelato Charleston Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service Main content starts here, tab to start navigating Menus Charleston Slide 1 of 3 Slide 2 of 3 Slide 3 of 3 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Dinner Brunchy Sweets Vino & Boozy sunday sauce Dinner All Items Meant for Sharinga Little Bit of This, a Little Bit of That Small Plates Get Things Goin’ Garlic Bread Seeded Italian bread, parsley, butter Add melted parm Add red sauce Fresh Made House Mozzarella Served warm, olive oil, sea salt. Made to order gluten free Mozzarella Caprese Fresh made mozzarella, sliced kumoto tomatoes, balsamic reduction, basil gluten free Prosciutto Di Parma Parmigiano reggiano, aged balsamic, olive oil. Sliced fresh to order gluten free Pelato Salad Iceberg, salami, provolone, red onion, vinegar peppers, gigante beans, oregano vinaigrette gluten free The Goods Potato Croquettes Mozzarella, garlic aioli, parmigiano reggiano Seasonal Burrata Crostini toasted sesame bread, delicata squash, balsamic onions, scallions Panelle Fried Sicilian chickpea fritters, whipped ricotta, pecorino gluten free Crispy Zucchini Strings Lemon Crispy Garlic Potatoes fresh herbs, garlic aioli gluten free Crispy Cauliflower Piccata lemon-caper butter Street Style Arancini guanciale, peas, pecorino, mozzarella Burnt Broccolini Black garlic, Calabrian chili, lemon gluten free Stuffed Mushrooms Cremini mushrooms, lemon, breadcrumbs, parsley, butter Eggplant Stuffed Bread tomato, parmesan, mozzarella The Meats Creamy Polenta & Bolognese Sauce Creamy polenta, ragú bolognese, parmigiano reggiano gluten free Chicken Parmigiana Tomato, basil, parmigiano reggiano, mozzarella Meatballs Al Forno Tomato sughetto, parmigiano reggiano The Squids & Fishes Fried Calamari available as crispy or drenched in arrabbiata sauce DRY - crispy with candied peppers and arrabbiata side DRENCHED - in a spicy arrabbiata sauce, teardrop peppers Baked Clams Oreganata Middle neck clams, breadcrumbs, oregano, butter, lemon All pastas made in-house daily Saucy The Pelato Rav raviolini sheet, butternut squash, brown butter, parmigiana reggiano, balsamic Radiatori Vodka Tomato, cream, Calabrian chili, parmigiano reggiano Campanelle Shrimp Limone creamy lemon, parmigiano reggiano Substitute home-made gluten free pasta Gnocchi Pomodoro handmade potato gnocchi, eggplant, red sauce, mozzarella Bucatini Cacio E Pepe Fresh cracked black pepper, pecorino Bombolotti With Sausage, Peppers & Onions crumbled sausage, tomato sauce, garlic Penne Carbonara pancetta, egg yolk, pecorino, black pepper SUBSTITUTE HOME-MADE GLUTEN FREE PASTA *excludes Pelato Rav and Cacio e Pepe* Brunchy Download PDF (opens in a new tab) Brunchy EGGS BENE-VIC poached eggs over pizza dough, prosciutto, arugula, tomato hollandaise FRITTATA CAPRESE baked egg, blistered roma tomato, scallion, basil, mozzarella, parmesan gluten free Italian Biscuits & Gravy Sunny egg sausage gravy, sautéed spinach, cherry peppers That Italian Sandwich Sliced sesame bread, prosciutto di parma, genoa salami, provolone, homemade mozzarella, pepperoncini, onion, oregano, vinegar Cannoli Pancakes chocolate chips, raspberries, cannoli cream French Toast... But Italian Nutella, brioche, caramelized banana, maple syrup, whipped cream click the pdf above to view our brunch menu. most dinner items are available during brunch with the exception of a select few dishes Full Dinner Menu (Mostly) Available Slide 1 of 3 Slide 2 of 3 Slide 3 of 3 Desserts & Sweet Drinks Desserts San Gennaro Zeppoles fried dough, powdered sugar, served in-bag per tradition Rainbow Cookies three layer almond cookies with a dark chocolate coating The Cloud creamy rice pudding served with sweet berry misti Dark Chocolate Budino served with vanilla bean whipped cream Tiramisu layered espresso ladyfingers, house cream Cannoli Chips & Dip! house made sweet ricotta cream & cannoli chips, chocolate chips All fresh made in-house! Pelato Gelato Vanilla Bean Nutella Pistachio Goodness Olive Oil All fresh made in-house! Sorbet Lemon Coconut Raspberry Sweet Drinks Frozen Espresso Martini vodka, caffe lolita coffee liqueur, demerara syrup, nitro cold brew From the Bar Frozen & Wine Cocktails Freezios & Sangria Frozen Espresso Martini vodka, caffe lolita coffee liqueur, demerara syrup, nitro cold brew Frozen Cosmo vodka, orange liqueur, white cranberry, pomegranate and lime juice Big Apple Sangria white wine, brandy, apple cider, ginger, cinnamon sugar rim Pelato Cocktails Stiff Drinks The Casanova...Our Take On A Negroni gin, cappelletti apertivo, blood orange \"New York Sour\" whiskey, orangecello, lemon, red wine float Smokey Zenzero scotch, cappelletti apertivo, lemon, honey, ginger Espresso Old Fashioned whiskey, coffee liqueur, espresso, demerara, bitters Lambrusco 75 gin, lemon, lambrusco Limoncello Margarita blanco tequila, limoncello, orange liqueur, lemon & lime juice Beers & Spiked Seltzers Suds & Bubs Birra Menabrea Bionda 11.2oz- Italy- 4.8% ABV Holy City Hazy Dice IPA 16oz- DRAFT- Charleston- 6% ABV Peroni 16oz- DRAFT- Italy- 4.7% ABV Wine The Grapes View PDF at top of the page N.A. Beer & Mocktails Not Boozy Sunset Park pineapple, orange, lime, grenadine, sprite Peachy Fields peach puree, lemon, ginger ale Sunday Sauce Sunday Sauce (for two) Also known as Sunday Gravy, this time honored classic evokes memories of weekends & family gatherings in which mom or grandma presided over the constantly stirred pot of sauce & meat, and various relatives were tasked with procuring the essential provisions. Our family is proud to share this tradition with your family every Sunday night. fusilli, tomato, ribs, braciola*, sausage, meatballs SUNDAYS ONLY - Limited Availability *contains pine nuts Slide 1 of 3 Slide 2 of 3 Slide 3 of 3 Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Please, enter a valid which location are you signing up for? Which location are you signing up for? - Required Which location are you signing up for? Pelato Nashville Pelato Charleston Franklin - TN Submit Please check errors in the form above Thank you for signing up for email updates! Close and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service",
      "hash": "4c66c86148ae",
      "downloadedAt": "2026-01-18T16:56:55.392Z",
      "trimmedAt": "2026-01-18T17:12:56.454Z",
      "sizeReduction": "92.8%"
    },
    {
      "url": "https://www.pelatorestaurant.com/catering-store-v2/pelato-charleston/menu/order-settings/",
      "text": "",
      "hash": "53f149d7251e",
      "downloadedAt": "2026-01-18T16:56:56.618Z",
      "trimmedAt": "2026-01-18T17:12:56.455Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "https://www.pelatorestaurant.com/private-events-charleston/",
      "text": "× Reservations Location - Required Location Pelato Nashville Pelato Charleston Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service Main content starts here, tab to start navigating Private Events Charleston Slide 1 of 2 Slide 2 of 2 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides BOOK AN EVENT Pelato Charleston has begun booking large parties, semi-private, and private events! Looking for the perfect venue to host your next private event? Look no further! Pelato's pre-set menus & sharable plates makes for perfect group! We offer customizable settings for all special occasions. Whether you're planning a corporate gathering, a milestone celebration, or an intimate social event, our versatile spaces and exceptional service will make your event unforgettable. Contact or eventsCHS@pelatorestaurant.com Complete the form below for all inquiries Private Dining Amenities Fully private space separated from the main dining room | 65\" media center with Bluetooth, Airplay, and streaming capability abilities | Audio channel for customizable playlists & volume control | Wireless microphone | Customizable lighting levels up to 70 seated or 100 standing Capacity: Full Buyouts Amenities Enjoy all Pelato Charleston spaces and amenities including full bar, outdoor patio spaces, & multi-room dining up to 200 seated or 250 standing Capacity: Private Event Software powered by Tripleseat Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Please, enter a valid which location are you signing up for? Which location are you signing up for? - Required Which location are you signing up for? Pelato Nashville Pelato Charleston Franklin - TN Submit Please check errors in the form above Thank you for signing up for email updates! Close and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service",
      "hash": "908cff037ffb",
      "downloadedAt": "2026-01-18T16:56:55.918Z",
      "trimmedAt": "2026-01-18T17:12:56.461Z",
      "sizeReduction": "94.4%"
    },
    {
      "url": "https://www.pelatorestaurant.com/catering-store-v2/pelato-nashville/menu/order-settings/",
      "text": "",
      "hash": "968723448d14",
      "downloadedAt": "2026-01-18T16:56:54.851Z",
      "trimmedAt": "2026-01-18T17:12:56.461Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "https://www.pelatorestaurant.com/private-events-nashville/",
      "text": "× Reservations Location - Required Location Pelato Nashville Pelato Charleston Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service Main content starts here, tab to start navigating Private Events Nashville Slide 1 of 3 Slide 2 of 3 Slide 3 of 3 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides BOOK AN EVENT Looking for the perfect venue to host your next private event? Look no further! We offer an exquisite setting for all your special occasions. Whether you're planning a corporate gathering, a milestone celebration, or an intimate social event, our versatile spaces and exceptional service will make your event unforgettable. For all inquiries, please fill out the form below and we’ll be in touch soon. View events Brochure Private Dining Amenities Fully private space separated from the main dining room | Private bar | Dedicated restroom | 65\" media center with Bluetooth, Airplay, and streaming capability abilities | Audio channel for customizable playlists & volume control | Access to DJ console & wireless microphone | Customizable lighting levels | Disco Ball Up to 100 seated or 130 standing Capacity: Semi Private Dining Amenities Folding wall panels used to divide semi-private section for dining | Banquet style tables | 65” media center with Bluetooth, Airplay, and streaming capabilities Up to 50 seated or 65 standing Capacity: Private Event Software powered by Tripleseat Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Please, enter a valid which location are you signing up for? Which location are you signing up for? - Required Which location are you signing up for? Pelato Nashville Pelato Charleston Franklin - TN Submit Please check errors in the form above Thank you for signing up for email updates! Close and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service",
      "hash": "a4e022199693",
      "downloadedAt": "2026-01-18T16:56:54.155Z",
      "trimmedAt": "2026-01-18T17:12:56.467Z",
      "sizeReduction": "94.5%"
    }
  ],
  "sizeReduction": "93.6%"
}