{
  "venueId": "ChIJZVeaxBVj_ogRBEcnMfRk6kg",
  "venueName": "Charleston Beer Works",
  "venueArea": "North Charleston",
  "website": "http://charlestonbeerworks.com/",
  "scrapedAt": "2026-01-18T17:04:27.924Z",
  "trimmedAt": "2026-01-18T17:11:12.736Z",
  "pages": [
    {
      "url": "http://charlestonbeerworks.com/",
      "text": "Check out our ! weekly specials Monday - Friday Happy Hour House Liquor, House Wine and Local Draughts all $6 each Wednesday RUN CBW Every Wednesday at 7pm$5 Local Brews for all runners Thursday Bar + Music Bingo Bar Bingo Every 3rd Thursday + Music Bingo on Last Thursday Friday Live Music Sam Adams Music Series$5 Sam Lager and Sam Seasonal Saturday & SUnday Pitcher Specials $12 Bud Light$15 Michelob Ultra$15 Sam Adams Over 1,250,000 Pints and Counting! It’s simple. We created Charleston Beer Works with these things in mind...friends, cold beer, best friends, fresh food, more friends and an extra helping of sports. We are a come as you are Charleston bar- a craft beer bar, a modern sports bar and a fresh kitchen wrapped into one great place. A place where the Charleston locals and our friends that are visiting want to comeback for more. Enjoy the downstairs bar, the upstairs bar or a great seat on the patio...whatever vibe you’re feeling! At CBW, our team works hard everyday so you can relax and enjoy your free time. Our Certified Beer Servers are here to guide you across a long list of local and regional craft beers, updated weekly. We have over 48 beers on tap, in addition to the classic favorites, plenty more in bottles and cans - and yes, a growing, impressive list of premium spirits and wines. Charleston Beer Works features made from scratch bar foods, with a daily special or two, and live entertainment Thursday through Saturday to keep the good times rolling! Lively, Uncomplicated...and yes, beer is always the answer. What was the question? CBW: Visit Us 480 King Street Charleston, SC 29403 (843) 577-5885",
      "hash": "10cf5c31f139",
      "downloadedAt": "2026-01-18T16:58:17.395Z",
      "trimmedAt": "2026-01-18T17:11:12.613Z",
      "sizeReduction": "98.7%"
    },
    {
      "url": "https://charlestonbeerworks.com/events/",
      "text": "Upcoming Events Live music",
      "hash": "34ea025243bb",
      "downloadedAt": "2026-01-18T16:58:21.441Z",
      "trimmedAt": "2026-01-18T17:11:12.629Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "https://charlestonbeerworks.com/private-events/",
      "text": "Private Events Charleston Beer Works’ upstairs bar is available for private event rentals. Host your private game viewing, birthday get-together or rent out the area for your wedding reception after party! Your event’s menu can be customized by our chef. Our large beer selection is available, as well as an option to create signature drinks. Get in touch with us if you’re interested in learning more about the space and event options. Planning an event? Get in touch! Private Events Name * Email * Phone * Date * MM slash DD slash YYYY Time Frame Estimated Guest Count * What are you interested in providing for your guests? Food Service Bar Service Food & Bar Service Notes Comments This field is for validation purposes and should be left unchanged.",
      "hash": "7e1f246cbbdd",
      "downloadedAt": "2026-01-18T16:58:22.339Z",
      "trimmedAt": "2026-01-18T17:11:12.646Z",
      "sizeReduction": "99.5%"
    },
    {
      "url": "https://charlestonbeerworks.com/",
      "text": "Check out our ! weekly specials Monday - Friday Happy Hour House Liquor, House Wine and Local Draughts all $6 each Wednesday RUN CBW Every Wednesday at 7pm$5 Local Brews for all runners Thursday Bar + Music Bingo Bar Bingo Every 3rd Thursday + Music Bingo on Last Thursday Friday Live Music Sam Adams Music Series$5 Sam Lager and Sam Seasonal Saturday & SUnday Pitcher Specials $12 Bud Light$15 Michelob Ultra$15 Sam Adams Over 1,250,000 Pints and Counting! It’s simple. We created Charleston Beer Works with these things in mind...friends, cold beer, best friends, fresh food, more friends and an extra helping of sports. We are a come as you are Charleston bar- a craft beer bar, a modern sports bar and a fresh kitchen wrapped into one great place. A place where the Charleston locals and our friends that are visiting want to comeback for more. Enjoy the downstairs bar, the upstairs bar or a great seat on the patio...whatever vibe you’re feeling! At CBW, our team works hard everyday so you can relax and enjoy your free time. Our Certified Beer Servers are here to guide you across a long list of local and regional craft beers, updated weekly. We have over 48 beers on tap, in addition to the classic favorites, plenty more in bottles and cans - and yes, a growing, impressive list of premium spirits and wines. Charleston Beer Works features made from scratch bar foods, with a daily special or two, and live entertainment Thursday through Saturday to keep the good times rolling! Lively, Uncomplicated...and yes, beer is always the answer. What was the question? CBW: Visit Us 480 King Street Charleston, SC 29403 (843) 577-5885",
      "hash": "90fca65f7675",
      "downloadedAt": "2026-01-18T16:58:17.457Z",
      "trimmedAt": "2026-01-18T17:11:12.664Z",
      "sizeReduction": "98.7%"
    },
    {
      "url": "https://charlestonbeerworks.com/menu/",
      "text": "Check out our Menus In the Charleston Beer Works kitchen, we make it our mission to exceed the expectations of your everyday “Sports Bar” pub grub. We accomplish this by providing a fun and casual-creative menu that focuses on high quality, fresh ingredients and a made from scratch attitude. From our house ground beef burgers, local breads, house made soups, and many more… cooked to order just for you every time!",
      "hash": "9a65ef5b1d8b",
      "downloadedAt": "2026-01-18T16:58:19.635Z",
      "trimmedAt": "2026-01-18T17:11:12.678Z",
      "sizeReduction": "99.6%"
    },
    {
      "url": "https://charlestonbeerworks.com/blog/",
      "text": "Our Blog September 1, 2023 Our 20th Anniversary Celebration This month, we are celebrating our 20th birthday!! 20 years ago, CBW Founder, Tim Maahs, was a pioneer in paving the way for what is today’s […] Do you like it? Read more June 1, 2023 5 Sours of Summer! Join us this year for our collaboration with Snafu Brewing, 5 Sours of Summer! This event will take place for one weekend each month this summer, leading up […] Do you like it? Read more January 5, 2023 What 2023 Has in Store for Charleston Beer Works Happy 2023! It’s a new year which means a lot of excitement in store for Charleston Beer Works. Being Charleston’s home for beer and sports, we’re […] Do you like it? Read more September 20, 2022 September at Charleston Beer Works The best season of the year has finally arrived… football season! At Charleston Beer Works, Upper King’s Original Sports Bar, you can count on us to […] Do you like it? Read more July 15, 2022 Our July Burger of the Month Unwind this month with our mouth-watering July burger special and a local, craft beer. Our burger this month is the “I love it when you call […] Do you like it? Read more April 7, 2022 Spring is in Full Swing at Charleston Beer Works The weather is warming up, Spring is in the air, and Major League Baseball is back! Join us this baseball season and don’t miss a game […] Do you like it? Read more September 24, 2021 Fall Football Kicks Off at Charleston Beer Works Fall is officially here! That means college football and NFL games are on at Charleston Beer Works, Upper King’s Original Sports Bar. Charleston Beer Works college […] Do you like it? Read more July 2, 2021 The Summer Scene at Charleston Beer Works We’re starting July off with a bang! We’ve got live music all holiday weekend. Kicking off with Everett Turnpike Duo at 10pm on Friday, July 2nd, […] Do you like it? Read more April 22, 2021 What’s Happening at Charleston Beer Works We’re wrapping up April in a big way over here at Charleston Beer Works! Join us for our NFL Draft Event on Thursday, April 29th. We’re […] Do you like it? Read more March 23, 2021 Goals, Golf and Good Times As we round out March, we’re gearing up for a good time here at Charleston Beer Works. In case you need a reason to soak up […] Do you like it? Read more March 10, 2021 March at Charleston Beer Works: Big Shot Bracket Challenge We’re ready for the NCAA Division Men’s Basketball Tournament here at Charleston Beer Works! After last year’s March Tournament had to be canceled, we are even […] Do you like it? Read more April 13, 2020 Now Offering Takeout Every Friday Charleston Beer Works is now offering takeout every Friday from 4:00-9:00PM. Even though the days may be running together and every day might seem a little […] Do you like it? Read more 1 2 3 4 5 6 7 8 9 10 11 Next page",
      "hash": "ae5f52fc4c02",
      "downloadedAt": "2026-01-18T16:58:20.561Z",
      "trimmedAt": "2026-01-18T17:11:12.722Z",
      "sizeReduction": "98.0%"
    },
    {
      "url": "https://charlestonbeerworks.com/contact/",
      "text": "Contact Us Contact Info 480 King StreetCharleston, SC 29403 (843) 577-5885 charlestonbeerworks@gmail.com Hours of Operation Monday-Sunday: 11:30 am - MidnightHappy Hour: M-F 4 pm - 7 pm Social Send us a message Name * Email * Message Email This field is for validation purposes and should be left unchanged.",
      "hash": "bf164f15e0c7",
      "downloadedAt": "2026-01-18T16:58:22.879Z",
      "trimmedAt": "2026-01-18T17:11:12.736Z",
      "sizeReduction": "99.8%"
    }
  ],
  "sizeReduction": "99.1%"
}