{
  "venueId": "ChIJKbz6EhJ6_ogRDMfSunCEH2E",
  "venueName": "Planters Inn",
  "venueArea": "Downtown Charleston",
  "website": "http://www.plantersinn.com/",
  "scrapedAt": "2026-01-19T03:25:40.663Z",
  "trimmedAt": "2026-01-19T03:28:17.744Z",
  "pages": [
    {
      "url": "https://www.plantersinn.com/the-hotel.htm",
      "text": "[Page Title: Boutique Hotel in Charleston, SC | Planters Inn]\n\nArrival ) Departure Adults Children Book Now About Planters Inn Relais & Châteaux Awards & Press Charleston, SC Planters Inn Blog Online Store Contact Us Gallery \nHistoric Charleston\n\nThe Top Ranked Historic Hotel in Charleston\n\nPlanters Inn offers elegant accommodations with the very best location of all Charleston hotels.\n\nPREMIER LOCATION\n\nExplore Charleston\n\nPlanters Inn is situated in the very heart and soul of Charleston’s famed Historic District. The hotel overlooks the Charleston City Market and is ideally located for exploring the city on foot.\n\nDiscover\nthe charms of charleston \nTOP RANKED U.S. HOTEL\n\nAward-Winning Charleston Hotel\n\nPlanters Inn Charleston is the winner of Travel + Leisure magazine's #1 Best Boutique Hotel in the United States Award and also recognized on Conde Nast Traveler magazine's Top 100 Hotels List.\n\nDISCOVER\nPlanters Inn's awards \nONE-OF-A-KIND ACCOMMODATIONS\n\nFour Star Historic Hotel\n\nBuilt in 1844 as a luxury goods emporium, Planters Inn in an artfully preserved architectural treasure and one of the most unique boutique hotels in America. In a city that emanates stately Georgian Era elegance, the AAA Four-Diamond Planters Inn is no exception.\n\nDiscover\nour unique history \nART DE VIVRE\n\nRelais & Châteaux Designation\n\nPlanters Inn and Peninsula Grill are longstanding members of Relais & Châteaux, the exclusive collection of luxury boutique hotels and gourmet restaurants located in the world's most romantic destinations.\n\nDiscover\nthe world of Relais & Chateaux \n\"When you walk around Planters Inn, you’ll find subdued old Southern elegance, including a leafy interior courtyard and a parlor with patterned armchairs and gold chandeliers.\" - Forbes\nScroll to Top",
      "hash": "0129fe035253",
      "downloadedAt": "2026-01-19T02:09:17.193Z",
      "trimmedAt": "2026-01-19T03:28:17.708Z",
      "sizeReduction": "97.8%"
    },
    {
      "url": "https://www.plantersinn.com/celebrations.htm",
      "text": "[Page Title: Social Events in Charleston, SC | Celebrations in Charleston]\n\nArrival ) Departure Adults Children Book Now Weddings Dinners & Events Meetings & Retreats \nTHE BEST PRIVATE EVENT SPACES\n\nCharleston Event Venues\n\nPlanters Inn and Peninsula Grill are the sole Relais & Châteaux establishments in South Carolina. We specialize in multi-day corporate retreats, unforgettable private parties, and spectacular weddings. Discover the flexibility, ease, and elegance of hosting your next event at Planters Inn.\n\nWhen Planters Inn's magical courtyard and inviting event venues are combined with\nPeninsula Grill's exceptional cuisine,\nthe result is spectacular.\n\nPlanters Inn is\nwinner of the prestigious\n\nfor the 24th consecutive year.\nAAA Four Diamond Award \nPeninsula Grill is\nwinner of the prestigious\n\nfor the 20th consecutive year\nas well as .\nAAA Four Diamond Award Forbes Travel Guide\nFour Diamond Award \n\"Live the good life at (at least for an evening). Entering a gated courtyard, lush and tropical and full of soft lighting, you realize this is the storied Charleston you've read about.\"\nPeninsula Grill & Planters Inn \n-\nConde Nast Traveler \nVENUE SPOTLIGHT\n\nThe Planters Inn Courtyard\n\nPlanters Inn is the only historic hotel in Downtown Charleston with a garden courtyard venue available for hosting private events.\n\nCharleston is referred to as “a city set in a garden,” and preeminent landscape designer Sheila Wertimer is well known for returning historic gardens to their nineteenth-century glory. For the Planters Inn Courtyard, Wertimer created a bluestone terrace that beguiles in both scale and style.\n\nPerfectly manicured ornamental boxwoods are framed by historic brick pathways frame, while crepe myrtle and palmetto trees, wrought iron gates, and Charleston Battery benches enliven the venue with distinctively Southern character.\n\nEvery evening at dusk, the carriage lanterns are lit by hand—one-by-one—until the Planters Inn Courtyard comes alive. Trees are illuminated, candles glow, and tea lights flicker in a magical twilight tableau.\n\nThe Planters Inn Courtyard was intentionally designed to accommodate a variety of occasions—from intimate suppers to lively cocktail soirees. A gathering that begins outdoors can easily transition mid-event into either of Planters Inn’s two private dining rooms, both of which overlook the Courtyard.\n\nRegarded as one of the most enchanting places to socialize in the South, the Planters Inn Courtyard’s resplendent sense of arrival and ambiance will set the stage for your unforgettable event.\n\nVENUE SPOTLIGHT\n\nThe Planters Inn Garden Room\n\nOur Signature Event Venue: \nA Classic Charleston Setting for Your Event.\n\nThe Garden Room is an elegant 1,400-square-foot venue beautifully appointed with antique mirrors, historic reproduction sideboards, plush fabric panels, and a bank of windows overlooking the Planters Inn Courtyard.\n\nThe Garden Room accommodates up to 120 guests for a cocktail reception and up to 80 guests for a seated luncheon or dinner.\n\nVENUE SPOTLIGHT\n\nThe Charleston Room\n\nAn Aesthetically Stunning Yet Unpretentious Dining Room\n\nPlanters Inn is the only historic hotel in Downtown Charleston with a garden courtyard venue available for hosting private events.\n\nis an exquisite 450-square-foot venue with tasteful decor that opens onto the Planters Inn Courtyard. The Charleston Room accommodates up to 50 guests for cocktail receptions and up to 32 guests for a seated luncheon or dinner.\nThe Charleston Room Scroll to Top",
      "hash": "44c0b1ac4360",
      "downloadedAt": "2026-01-19T02:09:15.999Z",
      "trimmedAt": "2026-01-19T03:28:17.716Z",
      "sizeReduction": "95.8%"
    },
    {
      "url": "https://www.plantersinn.com/private-dining.htm",
      "text": "[Page Title: Private Dining in Charleston at Planters Inn]\n\nArrival ) Departure Adults Children Book Now Weddings Dinners & Events Meetings & Retreats \nPRIVATE DINNERS IN CHARLESTON\n\nPrivate Dining and Events at Peninsula Grill in Charleston\n\n\"At Peninsula Grill, you get the feeling that this is dinner how it's supposed to be done: a special spot for a special evening of elegant food and drink.\" — Conde Nast Traveler\n\nImagine... A hidden courtyard illuminated by flickering carriage lanterns and tea lights dancing in the trees. This is the enchanting entrance to your event.\n\nImagine... Sophisticated interpretations of Southern flavors made with the finest and freshest ingredients sourced daily. This is the cuisine served at your event.\n\nImagine... A professional staff working tirelessly behind-the-scenes to ensure your event is flawless. This is the Relais & Châteaux caliber of service both you and your guests will experience.\n\nPlanters Inn & Peninsula Grill private events are available seven days a week. In addition to dinner, Peninsula Grill private dining is available for brunch and daytime events. For ten to 120 guests.\nPrivate Events Gallery Online Look Book \n\"Indulge in a multi-course dinner of seared foie gras, jumbo blue crab salad, and pan-seared snapper at the upscale ... be sure to save room for dessert. 'The Peninsula Grill is just the best,' added one fan. 'My wife can’t stop talking about the coconut cake!'\" — Travel + Leisure World's Best Awards\nPeninsula Grill \nWe look forward to meeting & working with you. Please contact us to arrange a tour and discuss menu options.\nScroll to Top",
      "hash": "55212282a03d",
      "downloadedAt": "2026-01-19T02:09:16.570Z",
      "trimmedAt": "2026-01-19T03:28:17.723Z",
      "sizeReduction": "98.0%"
    },
    {
      "url": "http://www.plantersinn.com/",
      "text": "[Page Title: Luxury Hotel in Charleston SC | Planters Inn French Quarter]\n\nArrival ) Departure Adults Children Book Now Open Modal Button × Close Modal \nEnjoy 18% Off and a Welcome Drink at Benne's\n\nThis winter, let the cozy magic of Charleston wrap you in its seasonal glow. Our Warming Up to Charleston offer invites you to enjoy 18% off your room rate and a welcome drink at Benne’s, our cafe and bar, where Southern hospitality meets fire-side comfort.\nBOOK NOW \nThe Grande Dame  Boutique Hotels in Charleston's Historic French Quarter\nof \nWhen Planters Inn first opened its doors in 1844, it claimed one of  — the iconic corner of Market and Meeting Streets. Today, this historic luxury hotel continues to preside over the very heart of downtown Charleston, South Carolina, offering guests  steps from the City Market and King Street.\n\nAs , Planters Inn is an intimate sanctuary for travelers who appreciate timeless elegance, personal service, and a sense of place. Behind our stately façade, guests discover gracious interiors, residential-style suites, and a hidden garden courtyard that feels worlds away from the bustle outside.\nthe most coveted locations among Charleston Hotels refined accommodations South Carolina’s only Relais & Châteaux hotel \nTRAVEL + LEISURE MAGAZINE'S #1 BEST U.S. BOUTIQUE HOTEL AWARD-WINNER\n\n\"Staying at Planters Inn is akin \nto an overnight with well-to-do friends \nin their old Charleston mansion.\" \n—magazine\nTravel + Leisure \n★ ★ ★ ★ ★\n\nRefined Style & Historic Character\n\nEvery detail of our luxury boutique hotel reflects Charleston’s storied past and gracious hospitality.  feature four-poster beds from Baker’s Historic Charleston Collection, silk drapery, fireplaces, private piazzas, and curated antiques — all opening onto a serene, hidden garden courtyard. Planters Inn blends historic architecture with modern comfort, creating a setting that feels both elegant and inviting.\nGuest rooms and suites \nSTAY IN STYLE\n\nSpacious Hotel Suites in Charleston, SC\n\nPlanters Inn has some of the largest hotel suites in downtown Charleston. Every element has been thoughtfully considered to create a comfortable, residential-style living space equally suited to business and leisure travel--from oversized closets to accommodate your travel wardrobe to king-size four-poster beds for a wonderful night of sleep.\nSPACIOUS HOTEL SUITES \n\"Stepping into Planters Inn is like stumbling\nupon your own secret oasis. The elegant\nlobby is a precursor to the tranquility\nof the garden courtyard.\"\n—\nAtlanta Magazine \n★ ★ ★ ★ ★\n\nEnchanted Evenings\n\nAcclaimed Dining at Peninsula Grill\n\nBeyond the garden path illuminated by lantern light lies Peninsula Grill,  and a destination in its own right. Consistently ranked among the city’s finest dining experiences, Peninsula Grill is renowned for its elegant atmosphere, exceptional service, and iconic cuisine — including the world-famous Ultimate Coconut Cake®.\nCharleston’s most romantic restaurant PENINSULA GRILL \n\"Peninsula Grill epitomizes fine dining. \nThe velvet-lined walls and antebellum \nportraits set a cultivated mood \nand the food is sublime.\"\n—\nConde Nast Traveler \n★ ★ ★ ★ ★\n\nDISCOVER WHAT AWAITS\n\nSee & Be Seen\n\nWant to see photos of our hotel in Charleston? Our image gallery highlights the Lowcountry traditions that permeate our historic hotel, including sweetgrass baskets, four poster beds, Audubon prints, carriage lanterns, and more!\nSEE HOTEL PHOTOS \n\"When you walk around Planters Inn,\nyou will find old Southern elegance,\nincluding a leafy interior courtyard\nand parlor with gold chandeliers.\"\n— Forbes\n\n★ ★ ★ ★ ★\n\nTHINGS TO DO & SEE\n\nExperience the Best Place to Stay in Charleston\n\nWith a premier location in the Charleston Historic District, . Planters Inn overlooks the Charleston City Market and King Street is one block away.\nPlanters Inn places guests within walking distance of the city’s most celebrated attractions \nAsk the concierge for a map of Charleston. You will see that the most scenic neighborhoods, the most popular attractions, and the best things to do are within walking distance of the hotel.\nCHARLESTON TRAVEL GUIDE \n\"Sitting smack-dab in\nthe heart of\ndowntown, this beautiful hotel \nis the heart and soul of\nHistoric Charleston.\"\n— U.S. News\n\n★ ★ ★ ★ ★\n\nART DE VIVRE\n\nA Relais & Châteaux Hotel in Charleston, SC\n\nPlanters Inn is proud to be the only , part of an exclusive global collection of privately owned landmark hotels and restaurants. This distinction places Planters Inn among celebrated properties such as The Inn at Little Washington, The French Laundry, Ocean House, and Blackberry Farm — united by a shared philosophy of art de vivre, exceptional hospitality, and unforgettable experiences.\nRelais & Châteaux hotel in South Carolina DISCOVER OUR HISTORY \n\"Part of the Relais & Châteaux group,\nthis boutique property with well-appointed\nand beautifully maintained rooms is \na stately sanctuary amid the bustle of\n\nCharleston's City Market.\"\n— Fodor's\n\n★ ★ ★ ★ ★\n\nLET'S BE SOCIAL\n\nStay in the Know\n\nFollow along with us on our Instagram page for the latest happenings at Planters Inn.\nFOLLOW US \nEmail Sign Up\nSubmit Scroll to Top",
      "hash": "756e9cde90b7",
      "downloadedAt": "2026-01-19T02:09:15.360Z",
      "trimmedAt": "2026-01-19T03:28:17.737Z",
      "sizeReduction": "95.7%"
    },
    {
      "url": "https://www.plantersinn.com/special-offers.htm",
      "text": "[Page Title: Hotel Special Offers and Vacation Packages in Charleston, South Carolina]\n\nArrival ) Departure Adults Children Book Now \n★★★★★\n\nCharleston Hotel Stay\n\nSpecial Offers: How To Enjoy the Perfect Getaway\n\n★★★★★\n\nSpecial Experiences\n\nCharleston Hotel Packages\n\nDiscover the best Charleston has to offer with these special stay & play vacation packages.\n\nThis winter, let the cozy magic of Charleston wrap you in its seasonal glow. Our Warming Up to Charleston offer invites you to enjoy 18% off your room rate and a welcome drink at Benne’s, our cafe and bar, where Southern hospitality meets fire-side comfort.\nLEARN MORE \n20% off our rooms and suites for residents of South Carolina and our neighboring states.\nLEARN MORE \nImmerse yourself in the gracious spirit of Charleston with our exclusive Taste of Planters Inn package—where timeless elegance meets culinary delight. Receive a welcome drink at Benne's and a $50 dining credit for Peninsula Grill.\nLEARN MORE \nA tasteful beginning to every Charleston morning with daily American breakfast at our award-winning Peninsula Grill!\nLEARN MORE \nWhere history whispers and romance blooms. Includes in room prosecco and slice of Ultimate Coconut Cake, and breakfast for two at Peninsula Grill.\nLEARN MORE \nWant to Book An Extended Stay?\n\nCall our friendly on-site reservations staff at (843) 722-2345\nScroll to Top",
      "hash": "7577d6f28dc9",
      "downloadedAt": "2026-01-19T02:09:15.432Z",
      "trimmedAt": "2026-01-19T03:28:17.744Z",
      "sizeReduction": "98.3%"
    }
  ],
  "sizeReduction": "97.0%"
}