{
  "venueId": "ChIJg5CTYMt7_ogRWGzjSNU13ok",
  "venueName": "Wally Gyros",
  "venueArea": "North Charleston",
  "website": "https://wallygyros.com/",
  "scrapedAt": "2026-01-18T17:04:28.636Z",
  "trimmedAt": "2026-01-18T17:11:23.654Z",
  "pages": [
    {
      "url": "https://wallygyros.com/",
      "text": "Established In 2007 Established In 2007 Established In 2007 Established In 2007 Rated #1 Mediterranean Food Truck In Charleston, SC Upcoming Events Established In 2007 Established In 2007 Established In 2007 Established In 2007 Rated #1 Mediterranean Food Truck In Charleston, SC Upcoming Events Events Copyright © 2020 WallyGyros - All Rights Reserved. Powered by Website Builder GoDaddy Privacy Policy Terms and Conditions Announcement Wally Gyros Has Been Rated #1 Mediterranean Food Trucks In Mount Pleasant!! Cookie Policy This website uses cookies. By continuing to use this site, you accept our use of cookies. Accept & Close",
      "hash": "62d20be91afb",
      "downloadedAt": "2026-01-18T17:01:44.161Z",
      "trimmedAt": "2026-01-18T17:11:23.574Z",
      "sizeReduction": "99.4%"
    },
    {
      "url": "https://wallygyros.com/menu%2F-price-list",
      "text": "Menu Pita Sandwiches With Your Choice Of Meat, Vegetables, and Sauce Lamb Pita Grilled Lamb With Your Choice Of Toppings and Sauce Chicken Pita Grilled Chicken Breast With Your Choice Of Toppings and Sauce Beef Philly Cheesesteak Grilled Beef Philly With Your Choice Of Toppings and Sauce Beef Sausage pita Sandwich Grilled Beef Sausage With Your Choice Of Toppings and Sauce Wally Mixed Grill Pita Grilled Chicken and Lamb With Your Choice Of Toppings and Sauce Falafel Sandwich Falafel With Your Choice Of Toppings and Sauce Mixed vegetable Sandwich Mixed Vegetable Sandwich With Your Choice Of Toppings and Sauce Hummus Sandwich Hummus Sandwich With Your Choice Of Toppings and Sauce Roasted Chickpeas Sandwich Roasted Chickpeas With Your Choice Of Toppings and Sauce Rice Bowls With Your Choice Of Meat, Vegetables, and Sauce Lamb Rice Bowl Lamb Rice Bowl With Your Choice Of Toppings and Sauce Chicken Rice Bowl Chicken Rice Bowl With Your Choice Of Toppings and Sauce Beef Philly Cheesesteak Rice Bowl Beef Philly Rice Bowl With Your Choice Of Toppings and Sauce Beef sausage Rice Bowl Beef Sausage Rice Bowl With Your Choice Of Toppings and Sauce Wally Mixed Grill Chicken and Lamb Rice Bowl Chicken and Lamb Rice Bowl With Your Choice Of Toppings and Sauce Falafel Rice bowl Falafel Rice Bowl With Your Choice Of Toppings and Sauce Loaded Fries With Your Choice Of Meat, Vegetables, and Sauce Lamb Lamb Loaded Fries With Your Choice Of Toppings and Sauce Chicken Chicken Loaded Fries With Your Choice Of Toppings and Sauce Beef PHILLY CHEESE STEAK Beef Philly Loaded Fries With Your Choice Of Toppings and Sauce Beef Sausage Beef Sausage Loaded Fries With Your Choice Of Toppings and Sauce Wally Mixed Grill Chicken and Lamb Loaded Fries With Your Choice Of Toppings and Sauce Salads With Your Choice Of Meat and Vegetables Lamb Salad Lamb Salad With Your Choice Of Toppings and Sauce Chicken Salad Chicken Salad With Your Choice Of Toppings and Sauce BEEF PHILLY CHEESESTEAK SALAD Beef Philly Salad With Your Choice Of Toppings and Sauce Falafel Salad Falafel Salad With Your Choice Of Toppings and Sauce Greek Salad Greek Salad With Your Choice Of Toppings and Sauce Side Orders French Fries With Your Toppings and Sauce Cheese Fries With Your Toppings and Sauce Homemade Chili Cheese Fries Homemade Chili With No Beans Beef Hot Dog With Your Toppings and Sauce Beef Sausage With Your Toppings and Sauce Wally Hamburger With Your Toppings and Sauce 5pc Dolmeh With Side tzatziki Sauce Grape Leafs Stuffed With Rice And Herbs 5pc Falafel with side of tzatziki Sauce 8oz Hummus With 1 Pita Bread 8oz Baba Ganoush With 1 Pita Bread 8oz Tzatziki With 1 Pita Bread Toppings Lettuce, Tomato, Grilled Onions, Raw Onions, Jalapeño, Mushrooms, GreenPepper, BananaPepper, Dill Pickles, Cucumbers, Black Olives, American Cheese, and Feta Cheese Sauces Ketchup, Mustard, Hot Sauce, Cheese Sauce, Ranch, Mayo, BBQ Sauce, Olive Oil, and Tzatziki Sauce Drinks/ Desserts Bottled Water Bottled Soda Caned Soda 1pc Of Sweet Baklava Very Thin Philly Dough Stuffed With Roasted Pistachios And Honey Established In 2007 Copyright © 2020 WallyGyros - All Rights Reserved. Powered by Website Builder GoDaddy Privacy Policy Terms and Conditions Announcement Wally Gyros Has Been Rated #1 Mediterranean Food Trucks In Mount Pleasant!! Cookie Policy This website uses cookies. By continuing to use this site, you accept our use of cookies. Accept & Close",
      "hash": "79347cd4c2be",
      "downloadedAt": "2026-01-18T17:01:44.224Z",
      "trimmedAt": "2026-01-18T17:11:23.647Z",
      "sizeReduction": "98.4%"
    },
    {
      "url": "https://wallygyros.com/upcoming-events",
      "text": "Upcoming Food Events Copyright © 2020 WallyGyros - All Rights Reserved. Powered by Website Builder GoDaddy Privacy Policy Terms and Conditions Announcement Wally Gyros Has Been Rated #1 Mediterranean Food Trucks In Mount Pleasant!! Cookie Policy This website uses cookies. By continuing to use this site, you accept our use of cookies. Accept & Close",
      "hash": "ebcd1cead28e",
      "downloadedAt": "2026-01-18T17:01:44.794Z",
      "trimmedAt": "2026-01-18T17:11:23.654Z",
      "sizeReduction": "99.6%"
    }
  ],
  "sizeReduction": "99.0%"
}