{
  "venueId": "ChIJczr16Bdy_ogRsQvLejgWXus",
  "venueName": "Opal Restaurant & Bar",
  "venueArea": "Mount Pleasant",
  "website": "http://www.opaldininggroup.com/",
  "scrapedAt": "2026-01-18T17:04:28.306Z",
  "trimmedAt": "2026-01-18T17:11:18.842Z",
  "pages": [
    {
      "url": "http://www.opaldininggroup.com/opal/menu/",
      "text": "HOME OPAL LANGDON'S WOOD & GRAIN CHEF PATRICK OWENS NEWS CATERING DINNER MENU WINE LIST HAPPY HOUR RESERVATIONS PDF CHARCUTERIE & CHEESE $12 (3) $20 (5) $27 (7) $34 (9) $42 (12) $48 (14) $52 (16) Charcuterie Smoked Duck Ham House-cured duck leg, Charleston Speck Smoked dry cured ham, Italy Spicy Capicollo Spiced and smoked pork shoulder, California Finochietta Fennel spiced salami, New York Salami Etna Pistachio and lemon zest salami, Oregon Coppa Cured pork shoulder, New York Prosciutto di San Daniele Cured ham from San Daniele, Italy Soppressata Course ground large salami, New Jersey Artisan Cheeses Gran Delitia Buffalo milk Parmesan, Italy Midnight Moon Semi firm Gouda style goat cheese, Netherlands Taleggio Tangy, soft, washed rind cow’s milk, Italy Cambozola Blue-vein triple cream cow’s milk, Germany Humboldt Fog Creamy aged goat’s milk, California Carr Valley Glacier Wildfire Blue Peperoncino infused blue cow’s milk, Wisconsin Six Month Aged Manchego Semi-hard sheep’s milk, Spain Red Dragon English cheddar with wholegrain mustard & ale, Britain APPETIZERS Local Middle Neck Clams Berkshire sausage, chiles and tomato * Confit garlic, shallots, white wine and herbs 13 Daily Soup Preparation 8 Spicy Local Shrimp Bruschetta with Chiles and Garlic 9 Cold-Water Oysters with Cocktail Sauce and Seasonal Mignonette* 18 / 36 Strawberry Salad with Arugula, Manchego, Pistachios, Mint and Balsamic-Terragon Vinaigrette 12 Chopped Romaine Salad with Arugula, Feta Cheese, Celery, Tomatoes, English Cucumbers and Creamy Lemon-Oregano Dressing* 10 Warm House-made Mozzarella with Charred Tomato-Herb Relish and Prosciutto 12 Baked Veal and Ricotta Meatballs with Tallegio and Parmesan 11 HANDCRAFTED PASTA Ricotta Gnocchi with Local Shrimp, Grilled Zucchini, Spinach, Brown Butter and Herbs 29 Pappardelle with Wild Mushrooms and Black Truffle 19/27 Applewood-Smoked Bacon and Ricotta Agnolotti with Brussels Sprouts, Spinach, Crispy Pork and English Peas 19/27 Cavatelli with Veal Meatballs, Sweet Corn, Blistered Tomatoes and Arugula 19/27 Tagliatelle Bolognese with Lemon Ricotta 19/27 ENTREES Roasted Springer Mountain Chicken Breast with Crispy Golden Potatoes Caramelized Brussels Sprouts and Lemon-Truffle Aioli 27 Pan Seared Duck Breast with Seasonal Succotash, Fennel Sausage, Greens and Blackberry Mustard* 29 Local Market Fish over Cor4n, Jumbo Lump Crab and Carolina Gold Rice Pirloo with a Lemon-Tarragon Beurre Blanc 34 Grilled Bone-In Pork Rib Chop with Orecchiette, Spinach, Smoked Duck Ham and Apple-Citrus Pan Sauce* 32 Center Cut Filet of Beef with Mascarpone-Chive Potatoes and Barolo Sauce 43 Prime New York Strip with Roasted Garlic-Thyme Hasselback Potatoes and a Truffled Cabernet Demi-Glace 52 Preserved Lemon-Honey Glazed Scottish Salmon with a Chilled Salad of Orzo Cucumbers, Feta, Olives and Pepperonata Vinaigrette* 29 DINE WITH US Shoppes at Seaside Farms 1960 Riviera Dr. Suite C Mt. Pleasant, SC 29464 Map Our Location HOURS Monday - Sunday:4 pm - until Bar & Charcuterie @ 4 pm Full Menu @ 5 pm CONTACT US 843.654.9070 info@opalrestaurantsc.com Media Inquiries Gift cards available at all restaurants after 2pm or email info@langdonsrestaurant.com WordPress Themes COPYRIGHT © 2026 - ALL RIGHTS RESERVED - OWENS DINING GROUP Employment Opportunities",
      "hash": "94d4d37e0f2d",
      "downloadedAt": "2026-01-18T16:56:55.130Z",
      "trimmedAt": "2026-01-18T17:11:18.826Z",
      "sizeReduction": "90.9%"
    },
    {
      "url": "http://www.opaldininggroup.com/opal/happy-hour/",
      "text": "HOME OPAL LANGDON'S WOOD & GRAIN CHEF PATRICK OWENS NEWS CATERING DINNER MENU WINE LIST HAPPY HOUR RESERVATIONS HAPPY HOUR Daily from 4 -6 p.m. Chef’s Choice Charcuterie (2 meats and 1 cheese selected by the chef) $6 Spicy Local Shrimp Bruschetta with Chiles and Garlic $6 Warm House-made Mozzarella with Pickled Pepper Relish and Estate Olive Oil $8 Veal & Ricotta Meatballs with Pomodoro $5 Oysters on the Half-Shell $2 each House Liquors $5 Selected Wines by the Glass $6 Draft Beer $5 DINE WITH US Shoppes at Seaside Farms 1960 Riviera Dr. Suite C Mt. Pleasant, SC 29464 Map Our Location HOURS Monday - Sunday:4 pm - until Bar & Charcuterie @ 4 pm Full Menu @ 5 pm CONTACT US 843.654.9070 info@opalrestaurantsc.com Media Inquiries Gift cards available at all restaurants after 2pm or email info@langdonsrestaurant.com WordPress Themes COPYRIGHT © 2026 - ALL RIGHTS RESERVED - OWENS DINING GROUP Employment Opportunities",
      "hash": "b1d7ea0f2197",
      "downloadedAt": "2026-01-18T16:56:56.522Z",
      "trimmedAt": "2026-01-18T17:11:18.830Z",
      "sizeReduction": "97.2%"
    },
    {
      "url": "http://www.opaldininggroup.com/opal/wine-list/",
      "text": "HOME OPAL LANGDON'S WOOD & GRAIN CHEF PATRICK OWENS NEWS CATERING DINNER MENU WINE LIST HAPPY HOUR RESERVATIONS PDF WINES BY THE GLASS SPARKLING & WHITES Cavaliere D’Oro Prosecco, Italy NV….7 Jean-Charles Boisset “No 21⁰” Brut, France NV….8 Villa Sandi Brut Rose, Treviso, Italy NV….8 “F” by Orin Swift Rose, Provence, France NV….10 Peter Mertes Platinum Riesling, Germany 2018….8 Maso Canali Pinot Grigio, Italy 2018….11 Willamette Valley Vineyards Pinot Gris, OR 2018….10 Whitehaven Sauvignon Blanc, Marlborough, New Zealand 2019….11 Domaine Thomas et Fils Sancerre, France 2018….15 Fillaboa Albarino, Spain 2018….11 Carmel Road Unoaked Chardonnay, Monterey County, CA 2018….10 Sonoma-Cutrer Chardonnay, Sonoma, CA 2018….12 REDS Bouchard AÎné & Fils Pinot Noir, France 2018….10 J Vineyards Pinot Noir, Central Coast, CA 2018….12 Siduri Pinot Noir, Willamette Valley, OR 2018….15 Palacios Remondo “La Montesa” Rioja, Spain 2017….10 Vall Llach “Embruix” Priorat, Spain 2017….14 Lassegue “Les Cadrans” Saint-Emilion Grand Cru, Bordeaux, France 2016….13 Colome Estate Malbec, Salta, Argentina 2018….13 Beran Zinfandel, Sonoma County, CA 2017….11 Robert Hall Cabernet Sauvignon, Paso Robles, CA 2017….13 Wagner Family Wines “Quilt” Cabernet Sauvignon, Napa Valley, CA 2017….17 Rodney Strong “Symmetry” Meritage, Alexander Valley, CA 2015….20 STAFF FAVORITES Honig Sauvignon Blanc, Napa Valley, CA 2019….35 Ramey Chardonnay, Russian River Valley, CA 2016….72 Laroche “La Chevaliere” Chardonnay, Languedoc, France 2016….40 Vincent Girardin “Santenay” Burgundy, Cote-D’Or, France 2017….67 Gran Moraine Pinot Noir, Yamhill-Carlton, OR 2018….75 Far Niente Vineyards “En Route” Pinot Noir, Russian River Valley, CA 2017….75 Biutiful Malbec, Mendoza, Argentina 2018….55 Stag’s Leap Petite Sirah, Napa Valley, CA 2017….70 Baron Edmond de Rothschild Chateau Clarke, Bordeaux, France 2015….100 Freemark Abbey Merlot, Napa Valley, CA 2013….65 Masi Amarone Classico, Veneto, Italy 2013….125 Beran Zinfandel, Sonoma County, CA 2017….41 Beni di Batasiolo Barolo, Piedmont, Italy 2015….80 Capture “Innovant Red Blend”, Sonoma County, CA 2015….90 Honig Cabernet Sauvignon, Napa Valley, CA 2016….77 Far Niente Vineyards “Bella Union” Cabernet Sauvignon, Napa Valley, CA 2017….100 Faust Cabernet Sauvignon, Napa Valley, CA 2017….105 Nickel & Nickel “Rock Cairn” Cabernet Sauvignon, Napa Valley, CA 2016….140 WINES BY THE BOTTLE SPARKLING & ROSES Cavaliere D’Oro Prosecco, Italy NV….29 Jean-Charles Boisset “N⁰ 21” Brut, France NV….31 Mirabelle Brut Rose, North Coast, CA NV….45 Schramsberg Blanc de Blancs, North Coast, CA 2016….65 Delamotte Champagne, France NV….75 Villa Sandi Brut Rose, Treviso, Italy NV….30 La Crema Pinot Noir Rose, Monterey, CA 2018….34 Fleur de Mer Rose, Provence, France 2019….38 “F” by Orin Swift Rose, Provence, France NV….37 Puech-Haut Rose, Saint-Drezery, France 2018….35 WHITES Peter Mertes Platinum Riesling, Germany 2018….30 Maso Canali Pinot Grigio, Italy 2018….40 Jermann Pinot Grigio, Italy 2018….39 Willamette Valley Vineyards Pinot Gris, OR 2018….39 Bethel Heights Estate Pinot Gris, Willamette Valley, OR 2017….48 WillaKenzie Pinot Gris, Willamette Valley, OR 2017….35 M.A.N “Free-run Steen” Chenin Blanc, S. Africa 2019….30 Whitehaven Sauvignon Blanc, Marlborough, New Zealand 2019….40 Loveblock Sauvignon Blanc, Marlborough, New Zealand 2019….42 Domaine Thomas et Fils Sancerre, France 2018….58 Galerie “Naissance” Sauvignon Blanc, Napa Valley, CA 2015….46 Tornatore “Etna Bianco” Carricante, Italy 2018….38 Gundlach Bundschu Gewurztraminer, Sonoma, CA 2018….50 Patient Cottat “Anciennes Vignes” Sancerre, France 2018….50 Jean Reverdy et Fils “La Reine Blanche” Sancerre, Loire, France 2018….55 Famille Hugel “Gentil”, Alsace, France 2017….32 Fillaboa Albarino, Spain 2018….40 Carmel Road Unoaked Chardonnay, Monterey County, CA 2018….39 WillaKenzie Chardonnay, Willamette Valley, OR 2017….64 Laguna Ranch Vineyard Chardonnay, Russian River Valley, CA 2016….45 La Crema Chardonnay, Russian River Valley, CA 2017….52 Groth Chardonnay, Napa Valley, CA 2017….53 Sonoma-Cutrer Chardonnay, Sonoma, CA 2018….50 Nickel & Nickel “Truchard” Chardonnay, Carneros, CA 2019….55 Rombauer Chardonnay, Carneros, CA 2018….70 REDS J Vineyards Pinot Noir, Central Coast, CA 2018….47 Siduri Pinot Noir, Willamette Valley, OR 2018….57 Penner-Ash Pinot Noir, Willamette Valley, OR 2017….75 Bouchard AÎné & Fils Pinot Noir, France 2018….38 Belle Glos “Las Alturas” Pinot Noir, Santa Maria, CA 2018….60 Hartford Court Pinot Noir, Russian River Valley, CA 2017….60 Sokol Blosser Estate Pinot Noir, Dundee Hills, OR 2017….70 Goldeneye Pinot Noir, Anderson Valley, CA 2017….85 Domaine Serene “Evenstad Reserve” Pinot Noir, OR 2017….135 Palacios Remondo “La Montesa” Rioja, Spain 2017….35 Colome Estate Malbec, Argentina 2018….48 Copain “Tous Ensemble” Syrah, Mendocino County, CA 2016….60 Two Hands “Angel’s Share” Shiraz, McLaren Vale, Australia 2016….58 Antinori “Il Bruciato” Super Tuscan, Tuscany, Italy 2018….57 Tenuta di Arceno “Il Fauno di Arcanum” Super Tuscan, Italy 2017….48 Le Ragnaie Rosso di Montalcino, Tuscany, Italy 2016….54 Strada al Sasso Chianti Classico Riserva, Chianti, Italy 2015….75 Coudoulet de Beaucastel, Cotes-du-Rhone, France 2018….55 Lassegue “Les Cadrans” Saint-Emilion Grand Cru, Bordeaux, France 2016….52 Orin Swift “Abstract” Red Blend, Napa Valley, CA 2018….72 Alexander Valley Vineyards Merlot, Alexander Valley, CA 2018….30 The Federalist “Dry Creek Valley” Zinfandel, Sonoma, CA 2018….45 Famiglia Pasqua Amarone Della Valpolicella, Italy 2013….85 Vall Llach “Embruix” Priorat, Spain 2017….52 Palacios “Les Terasses”, Priorat, Spain 2017….83 Beckmen Vineyards “Cuvee Le Bec” Meritage, Santa Ynez, CA 2017….52 Matchbook “The Arsonist”, Dunningan Hills, CA 2017….60 Orin Swift “Papillion” Meritage, Napa Valley, CA 2017….130 Ramey Claret, Napa Valley, CA 2016….70 Rodney Strong “Symmetry” Meritage, Alexander Valley, CA 2015….75 Alexander Valley Vineyards “Cyrus”, Alexander Valley, CA 2014….120 Wagner Family Wines “Quilt” Cabernet Sauvignon, Napa Valley, CA 2017….65 Robert Hall Cabernet Sauvignon, Paso Robles, CA 2017….48 Chimney Rock Cabernet Sauvignon, Stags Leap, CA 2016….160 La Jota Cabernet Sauvignon, Howell Mountain, CA 2015….165 Vintages Are Subject To Change COCKTAILS & BEER COCKTAILS Grapefruit-Jalapeno Margarita Jalapeno Infused Milagro Silver, Grapefruit, Lime Porch Swing Kettle One Vodka, Absentroux, Fresh Lime Juice, Cucumber Sunset Over Sullivan’s n Bulleit Bourbon, Pomegranate Liqueur, Fresh Lemo Sand & Wind Hendrick’s Gin, Lillet, Honey, Fresh Lemon Blood Orange Cocktail Aperol, Kettle One Oranje, Blood Orange Juice, Prosecco Seasonal Sangria White Wine, Kettle One Peach & Orange Blossom, Fresh Fruit St. Germain Royale St. Germain, Prosecco, Lemon Twist DRAFT BEERS Coast Kolsch Allagash Saison Munkle Seasonal Freehouse “Battery” Brown Scofflaw “Basement” IPA Wicked Weed “Pernicious” IPA BOTTLE BEERS Duvel Belgian Golden Ale Revelry Poke the Bear American Pale Ale Bell’s Two Hearted Ale River Dog Riverwalk Empire Pilsner Heineken Budweiser/Bud Light Michelob Ultra/Amstel Light Heineken N/A BOURBON, WHISKEY & SCOTCH Defiant…10 Basil Hayden…10 Bulleit Rye…10 Old Scout….10 Angel’s Envy…11 Woodford Reserve…12 Blade and Bow…14 Jefferson’s Reserve…14 Elijah Craig…14 Whistle Pig…16 Suntory…15 Widow Jane…15 Dewar’s…7 Johnnie Walker Red…9 Chivas Regal…9 Glenmorangie…10 Glenlivet 12 yr…12 Glenfiddich 12 yr…12 Johnnie Walker Black…12 Macallan 12 yr…14 Talisker 10 yr…14 Balvenie 12 yr…14 Oban 14 yr…15 Balvenie Caribbean Cask…16 DINE WITH US Shoppes at Seaside Farms 1960 Riviera Dr. Suite C Mt. Pleasant, SC 29464 Map Our Location HOURS Monday - Sunday:4 pm - until Bar & Charcuterie @ 4 pm Full Menu @ 5 pm CONTACT US 843.654.9070 info@opalrestaurantsc.com Media Inquiries Gift cards available at all restaurants after 2pm or email info@langdonsrestaurant.com WordPress Themes COPYRIGHT © 2026 - ALL RIGHTS RESERVED - OWENS DINING GROUP Employment Opportunities",
      "hash": "d9831848bb57",
      "downloadedAt": "2026-01-18T16:56:55.826Z",
      "trimmedAt": "2026-01-18T17:11:18.838Z",
      "sizeReduction": "80.7%"
    },
    {
      "url": "http://www.opaldininggroup.com/",
      "text": "MENU MENU WINE LIST HAPPY HOUR RESERVATIONS E-GIFT CARDS Opal Restaurant + Bar is a contemporary neighborhood eatery offering California-Mediterranean inspired cuisine in an elegant but convivial atmosphere. We make all of our pastas in house and feature an array of housemade pastas, charcuterie, local seafood and top-quality meats. We constantly seek to create a unique and memorable dining experience. This pursuit is supported by our talented kitchen staff and knowledgeable front-of-house team, and nurtured by our relationships with local farmers and fine purveyors around the world. To purchase gift cards, please . click here “Opal is not just a place to go for food, but to go for an incredible dining experience. Much like Langdon’s, we predict Opal will quickly become an enduring favorite in Mt. Pleasant and a destination for serious eaters from the entire area.” – ERIC DOKSA, CHARLESTON CITY PAPER DINE WITH US Shoppes at Seaside Farms 1960 Riviera Dr. Suite C Mt. Pleasant, SC 29464 Map Our Location HOURS Sunday – Thursday: 5pm – 9pm Friday & Saturday: 5pm – 10pm Happy Hour: 4pm – 5pm CONTACT US 843.654.9070 info@opalrestaurantsc.com *not for reservations Media Inquiries E-GIFT CARDS E-Gift cards are available . HERE × WordPress Themes COPYRIGHT © 2026 - ALL RIGHTS RESERVED - OWENS DINING GROUP Employment Opportunities",
      "hash": "e5529d9a45d0",
      "downloadedAt": "2026-01-18T16:56:53.526Z",
      "trimmedAt": "2026-01-18T17:11:18.842Z",
      "sizeReduction": "97.9%"
    }
  ],
  "sizeReduction": "92.3%"
}