{
  "venueId": "ChIJGc3wgfBw_ogRHw07kHrttzo",
  "venueName": "Vicious Biscuit",
  "venueArea": "Mount Pleasant",
  "website": "https://www.viciousbiscuit.com/",
  "scrapedAt": "2026-01-19T02:19:32.450Z",
  "trimmedAt": "2026-01-19T02:20:34.790Z",
  "pages": [
    {
      "url": "https://www.viciousbiscuit.com/",
      "text": "[Page Title: Vicious Biscuit - Official Website]\n\nSkip to content \nImage Slide 1\n\nImage Slide 1\n\nGet More Vicious\n\nYour RewardsJourney Begins\n\nGet More Vicious\n\nYour RewardsJourney Begins\n\nGet More Vicious\n\nYour RewardsJourney Begins\n\nImage Slide 2\n\nImage Slide 3\n\nImage Slide 3\n\nImage Slide 3\n\nWelcome toVicious Biscuit\n\nA family born business since 2017, rooted in the heart of the South where biscuits are king! We pride ourselves on being a fast-casual restaurant dedicated to serving irresistibly delicious, creatively crafted comfort meals that push the boundaries, all while ensuring our guests experience genuine Southern hospitality and an unforgettable dining experience.\n\nOur mission is simple: to boldly revolutionize brunch, one biscuit at a time. We are committed to offering every guest an authentic Southern experience, infused with warmth and hospitality from the moment they enter our establishment until the very last crumb of our acclaimed, handcrafted biscuits has been savored.\n\nLocations\n\nGet More Vicious\n\nEverywhere you want, the way that you want. With our rewards app, you can order ahead, skip the wait, and enjoy your favorites at home. Earn and redeem points on every purchase, score a FREE biscuit Monday–Friday when you dine-in, and get special birthday rewards just for you. Download today for the ultimate Vicious experience and start enjoying more of what you love!\n\nJoin Rewards\n\nEGG WHITE OMELET\n\n“This was pretty good. Very light. Healthy choice. I love salsa with my omelet but the pico was nice and refreshing. Will was our server and he was great. See you next time Will!”\n\nMonica\n\nFAT BOY\n\n“Great Experiences”\n\nJermainevans\n\nOLD SCHOOL BREAKFAST\n\n“just to have some more!”\n\nCarol\n\nEGG WHITE OMELET\n\n“It was our final morning in your incredible city. Despite the fact that there was another restaurant we could have tried to get the full low country experience, we decided a second trip to your store was for us! It was a Monday morning so most of your customers were local workers grabbing something for the road. The staff was so attentive and showed us some real southern hospitality. This time I felt the need to go with a healthier option and chose the Egg White Omelet. I asked to switch out the Feta for your white cheddar and I decided to add your potatoes (I know – so much for healthy – LOL). It was delicious and your manager on duty allowed me to sample your pimento cheese – It was a delight to the tongue. I actually got some to take home in our cooler. Thanks for making our trip so wonderful”\n\nCarol\nScroll to Top",
      "hash": "a0d6415546de",
      "downloadedAt": "2026-01-19T02:13:22.157Z",
      "trimmedAt": "2026-01-19T02:20:34.790Z",
      "sizeReduction": "99.3%"
    }
  ],
  "sizeReduction": "99.3%"
}