{
  "venueId": "ChIJjUPa0QR6_ogRRwlyJyNEIpI",
  "venueName": "Two Meeting Street Inn",
  "venueArea": "Downtown Charleston",
  "website": "https://www.kiawahisland.com/island-club/two-meeting-street-inn/",
  "scrapedAt": "2026-01-19T02:45:56.793Z",
  "trimmedAt": "2026-01-19T02:52:51.646Z",
  "pages": [
    {
      "url": "https://www.kiawahisland.com/island-club/two-meeting-street-inn/",
      "text": "[Page Title: Two Meeting Street Inn | Kiawah Island Club & Real EstateTwo Meeting Street Inn | Kiawah Island Club & Real Estate]\n\nTwo Meeting Street Inn A Kiawah Island Club Amenity A Kiawah Island Club Amenity \nAn Exclusive Accommodation for Club Members\n\nImagine a day of Kiawah Island golf followed by a stroll through historic Charleston, dinner on King Street, then settling in with lush, overnight accommodations in the city. Thanks to Kiawah Island Club’s recently refurbished 1890’s Queen Anne Victorian mansion, Two Meeting Street Inn invites Members to do just that.\n\nSouth of Broad Street, occupying a prestigious corner at the tip of the peninsula, Two Meeting Street Inn’s locale offers a comfortable accommodation within close proximity to downtown Charleston’s many acclaimed restaurants, vibrant cultural scene, and historical landmarks.\n\nThe Inn features a 6,000-square-foot space with eight beautifully appointed bedrooms and ensuite bathrooms as well as a formal dining area, kitchen, living room, and second-floor den with a balcony overlooking The Battery’s White Point Garden and the harbor beyond. With an inspired design and restoration that reflects the Holy City’s storied heritage paired with the top-tier service provided by Kiawah Island Club, Two Meeting Street Inn serves as the perfect urban addition to the Club’s wide range of luxury amenities, offering unforgettable overnight accommodations, exclusive to Club Members and their families to enjoy.\n\nThe beautiful restoration of the Inn was due to the creativity and expert care of the very skilled renovation team including eefava architects, Tammy Connor Interior Design, and Tupper Builders. The meticulous design and oversight by eefava architects ensured that the original character and details of the historic property were maintained while incorporating completely new mechanical, electrical, and other modern advances to the infrastructure. Tammy Connor’s interior design reflects the elegant charms of its historic Charleston backdrop by incorporating antiques with modern craftsmanship to create comfortable, inviting, and one-of-a-kind interiors. Complementing the Inn’s timeless architectural style and the city’s traditional charm, landscape architect Elizabeth Pope accentuated the majestic live oaks and preserved the existing historic materials and hardscape elements to create a captivating garden and outdoor motif.\n\nA stay at The Inn offers the same comfort and convenient services that Members have already come to love and appreciate but with the addition of the rich cultural history of Charleston and its abundance of year-round events and award-winning culinary options.\n\nRecommended Blogs For You\n\nPerfectly Paired: Kiawah & Charleston\nThe Charleston and Kiawah connection moves beyond award-winning recognition to architectural achievement and time-honored hospitality. In addition to the graciousness of a city and island linked by natural beauty and proximity, arts & crafts, distinguished dining, and signature shopping are found in abundance. The Holy City’s historic architecture, church steeples, and cobblestone streets serve to reignite recognition year after year. Read More \nRecommended Blogs For You\n\nTwo Meeting Street Inn - A Distinguished Downtown Destination\nAn exclusive Kiawah Island Club amenity, Two Meeting Street Inn welcomes Members to the heart of historic downtown Charleston with opulent overnight accommodations. This elegantly refurbished 1890s Queen Anne Victorian mansion offers accessibility to historic landmarks, renowned bars and restaurants, and sophisticated shopping. Read More \nPRESS: A Charleston Icon Reborn–The Story Behind Two Meeting Street Inn’s Grand Restoration\nCharleston magazine recently featured an in-depth exploration of the meticulous restoration of Charleston’s iconic Two Meeting Street Inn, one of Kiawah Island Club’s newest amenities. Originally constructed in 1892 as a Queen Anne-style mansion for Waring and Martha Carrington, the property has undergone a significant transformation under the stewardship of South Street Partners, who acquired it in 2022.​ Read More \nPerfectly Paired: Kiawah & Charleston\nThe Charleston and Kiawah connection moves beyond award-winning recognition to architectural achievement and time-honored hospitality. In addition to the graciousness of a city and island linked by natural beauty and proximity, arts & crafts, distinguished dining, and signature shopping are found in abundance. The Holy City’s historic architecture, church steeples, and cobblestone streets serve to reignite recognition year after year. Read More",
      "hash": "c2ec014191a9",
      "downloadedAt": "2026-01-19T02:09:43.487Z",
      "trimmedAt": "2026-01-19T02:52:51.632Z",
      "sizeReduction": "91.4%"
    },
    {
      "url": "https://www.kiawahisland.com/island-club/club-events/",
      "text": "[Page Title: Club Events | Kiawah Island Club & Real EstateClub Events | Kiawah Island Club & Real Estate]\n\nEvents\nKiawah Island Club \nFor Members Of The Club, Every Day is\nA Special Event\nPair the tenacious bonds shared among Members with the Club’s wealth of activities to enjoy together, and each day is charged with memory-making potential. Through the Kiawah Island Club, golfers are paired for weekly play, Guys and Dolls events, and annual Member tournaments. Member Mingles unfold over light fare and cocktails. Fitness fans convene for yoga, aquatic aerobics, and water sports. And our aesthetically minded Members engage in book, bridge, and wine clubs. In addition, courtesy of our popular curated events, Members fortify friendships, and families strengthen connections across multiple generations. \nFor Members Of The Club, Every Day is\nA Special Event\nPair the tenacious bonds shared among Members with the Club’s wealth of activities to enjoy together, and each day is charged with memory-making potential. Through the Kiawah Island Club, golfers are paired for weekly play, Guys and Dolls events, and annual Member tournaments. Member Mingles unfold over light fare and cocktails. Fitness fans convene for yoga, aquatic aerobics, water sports, and cycling. And our aesthetically minded Members engage in book, bridge, and wine clubs. In addition, courtesy of our popular curated events, Members fortify friendships, and families strengthen connections across multiple generations. \nRock The River\nClub Members join family and friends for Lowcountry food and drinks, children’s activities, and five-star entertainment (Darius Rucker has rocked the event). The 18th fairway of River Course becomes a concert stage for this wildly popular event. \nRed, White, and Boom\n\nCrackling across the evening sky on July 3, our tremendously popular Independence Day blow-out has become a revered, yearly tradition. The family-friendly event is defined by a bright galaxy of fireworks, live music, holiday-themed festivities, and summertime food favorites. Energetic younger guests thrill to a rock-climbing wall, jump castle, carnival games, face-painting clowns, and more.\nLight Up The Links \nCelebrate Independence Day in style with your fellow adult Members with an elegant summer dinner event featuring a raw bar, charcuterie spread, food stations filled with a variety of epicurean delights, and delicious libations. Dance the night away to live music then close out the evening with a beauty fireworks display.\n\nMembers and their guests are invited to partake in our additional July 4th week activities, which include a poolside party, a family golf tournament, and more.\n\nBayou Bash\nIt’s Fat Tuesday at River Course when the spirit and the flavors of New Orleans touch down on Kiawah. Held the first Sunday after Valentine’s Day, the intoxicating celebration includes a Mardi Gras-themed Lowcountry boil, oyster roast, and rousing live music. The casual, adults-only party is a can’t-miss for Members who long for a little taste of Bourbon Street, served Island style. \nEaster Week\nThe fun multiplies during a full weekend of Club activities including creative kids’ adventures, an Easter Carnival and Egg Hunt, Family Bingo, a Fishing Tournament, and Junior Golf and Tennis Clinics. In honoring a long-held Club tradition, Easter Sunday begins with a Member brunch. \nMemorial & Labor Day Poolside Party\nThe Beach Club hosts two memory-making seasonal celebrations that include live entertainment, an all-you-can-eat poolside buffet, and engaging children’s activities. \nThanksgiving Weekend\nOne of the Club’s most popular holidays begins when families gather for Thursday’s traditional Thanksgiving feast. A cornucopia of activities including the annual Turkey Trot, a golf tournament, and holiday shopping keeps the mood festive throughout the weekend. \nNew Year’s Eve Bash\nRing in the New Year at the Club’s annual River Course party. Light hors d’oeuvres, live music, party favors, and midnight fireworks over the fairways set the fabulous year-to-come in motion. \nAnd Throughout the Year…\nA roster of special events fill calendars throughout the year. Quarterly Member Mingles introduce our newest Members to the Club community. Our interactive Behind the Line series brings Members together for hands-on cooking classes. Family Bingo Night unites parents and children over rousing game play, and Club canines meet up at Yappy Hour, where every guest is soon begging to speak , sit , and stay . \nTournaments\n\nGolf\n\nWomen’s Opening Day\n\nMen’s Opening Day\n\nPro-Am Invitational\n\nWomen’s Spring Member-Member\n\nMen’s Spring Member-Member\n\nFamily Cup\n\nJunior Club Championship\n\nWomen’s Interclub\n\nMen’s Fall Member-Guest\n\nMixed Member-Guest\n\nWomen’s Fall Member-Guest\n\nWomen’s Fall Member-Member\n\nWomen’s Club Championship\n\nMen’s Club Championship\n\nPresident’s Cup\n\nTennis\n\nMember-Member\n\nMike Hardwood Pro-Am\n\nExplore The Kiawah Island Club\n\nGolf\nTom Fazio, Tom Watson…and you! Take a swing at one of two world-class private courses, designed by masters of the game and rolling out against breathtaking natural landscapes. Details \nGoKids\nFor toddlers, teens, and in-betweens, our innovative and diverse programming celebrates fitness, fun, and friendship throughout the year. Here, go, go, go is the status quo. Details \nRacquet Sports\nFrom top-tier tennis to invigorating squash, our Har-Tru tennis courts, pickleball courts, and The Sports Pavilion’s state-of-the-art multi-purpose court are a win-win combination. Details \nExplore The Kiawah Island Club\n\nGolf\nTom Fazio, Tom Watson…and you! Take a swing at one of two world-class private courses, designed by masters of the game and rolling out against breathtaking natural landscapes. Details \nGoKids\nFor toddlers, teens, and in-betweens, our innovative and diverse programming celebrates fitness, fun, and friendship throughout the year. Here, go, go, go is the status quo. Details \nRacquet Sports\nFrom top-tier tennis to invigorating squash, our red clay and Har-Tru courts and the Sports Pavilion’s state-of-the-art multi-purpose room are a win-win combination. Details",
      "hash": "f1706b918514",
      "downloadedAt": "2026-01-19T02:09:44.248Z",
      "trimmedAt": "2026-01-19T02:52:51.646Z",
      "sizeReduction": "89.1%"
    }
  ],
  "sizeReduction": "90.2%"
}