{
  "venueId": "ChIJYUGCx9tz_ogRmerM8WZ2y_s",
  "venueName": "The Funky Pelican",
  "venueArea": "Isle of Palms",
  "website": "https://www.thefunkypelican.co/",
  "scrapedAt": "2026-01-19T02:19:35.696Z",
  "trimmedAt": "2026-01-19T02:25:48.129Z",
  "pages": [
    {
      "url": "https://www.thefunkypelican.co/reviews/5556vevjpedkj8923hedsmzuwp72c3-hhewz-rg8tk",
      "text": "[Page Title: — Isle of Palms & Charleston Vacation Rental | The Funky Pelican]\n\n0 Aug 13 \nWritten By\nHey There! Hey There! \nI’m Brittany, a mom of 4 beautifully energetic children. I run The Funky Pelican vacation rental with my husband, Eric, and collectively we work constantly to make it the best experience we can for our guests. We love this coastal town so much we want to share all our secrets with you. We hope to host you at our one-of-a-kind private getaway soon!\n\nPrevious\n\nPrevious\n\nNext\n\nNext",
      "hash": "8644da718eac",
      "downloadedAt": "2026-01-19T02:10:00.421Z",
      "trimmedAt": "2026-01-19T02:25:48.086Z",
      "sizeReduction": "99.5%"
    },
    {
      "url": "https://www.thefunkypelican.co/reviews/5556vevjpedkj8923hedsmzuwp72c3-hhewz",
      "text": "[Page Title: — Isle of Palms & Charleston Vacation Rental | The Funky Pelican]\n\n0 Aug 13 \nWritten By\nHey There! Hey There! \nI’m Brittany, a mom of 4 beautifully energetic children. I run The Funky Pelican vacation rental with my husband, Eric, and collectively we work constantly to make it the best experience we can for our guests. We love this coastal town so much we want to share all our secrets with you. We hope to host you at our one-of-a-kind private getaway soon!\n\nNext\n\nNext",
      "hash": "bfcf0192eeda",
      "downloadedAt": "2026-01-19T02:09:59.669Z",
      "trimmedAt": "2026-01-19T02:25:48.092Z",
      "sizeReduction": "99.5%"
    },
    {
      "url": "https://www.thefunkypelican.co/",
      "text": "[Page Title: Isle of Palms & Charleston Vacation Rental | The Funky Pelican - Isle of Palms Vacation Rental]\n\n0 THE FUNKY PELICAN Isle of Palms Private Beach Vacation Rental \nIsle of Palms\n\n•\n\nCharleston\n\n•\n\nSouth Carolina\n\n•\nIsle of Palms • Charleston • South Carolina • Isle of Palms • Charleston • South Carolina • Welcome to Isle of Palms A One-of-a-Kind Private Vacation Rental for Your Large Group Getaway \nWe can’t wait to host you at The Funky Pelican on Isle of Palms in South Carolina! With plenty of outdoor break-out space, your group will be surrounded by the natural beauty of the edge of America! A rental house with 4,000 square feet all to yourself.\nAbout the Property \nThe South Carolina beachside oasis of your dreams.\n\nSit back, relax and enjoy a well-deserved vacation.\n\nTrusted Reviews from airbnb\n\n“My family loved this house. We filled it to the max capacity allowed and it was still so spacious and allowed for privacy. Our stay was short but we really appreciated the short distance to the beach, amenities, and the isle as a whole.”\n-Elizabeth, July 2023 \n“I hosted a group for a golf outing, roughly 12 people. This house was perfect for us. Plenty of space, walkable to the beach, easy to find, beautiful rooftop view. A+”\n-Andrew, April 2023 \n“Eric was an excellent host. Very responsive, helpful and accommodating. House is amazing- host supplies everything you would need for an amazing vacation. Felt right at home. Thank you for a great experience! Very highly recommend.”\n-Jennifer, November 2022 \n“Beautiful place. It exceeded all expectations. Eric was a great host who answered all my questions before arriving and during our stay. I would stay here again and again and again. You won’t be disappointed.”\n\n-\nChris, October 2022 \n“Eric and Brittany were incredible. This house was perfect and equipped with everything we needed, and then some. There were a ton of questions and they were super quick to respond. Can not thank you guys enough for an incredible, painless, weekend rental experience!”\n-Johnny, September 2022 \n“Great location, short walk to the beach. House is stocked with nice beach chairs as well. Kitchen has everything you could need, and the rooftop is incredible. It’s just a great place to hang out and have a drink at night. Will truly miss that space.”\n-Brandon, September 2022 View the Property",
      "hash": "da018685f020",
      "downloadedAt": "2026-01-19T02:09:59.217Z",
      "trimmedAt": "2026-01-19T02:25:48.129Z",
      "sizeReduction": "99.2%"
    }
  ],
  "sizeReduction": "99.3%"
}