{
  "venueId": "ChIJl8xvHY57_ogRFen4y39sFos",
  "venueName": "Home Team BBQ",
  "venueArea": "West Ashley",
  "website": "http://www.hometeambbq.com/",
  "scrapedAt": "2026-01-19T02:45:56.965Z",
  "trimmedAt": "2026-01-19T02:52:56.667Z",
  "pages": [
    {
      "url": "http://www.hometeambbq.com/",
      "text": "[Page Title: Barbecue Restaurant - Home Team BBQ]\n\nA barbecue restaurant combining traditional processes and techniques of classical cuisine with the simplicity of comfort food, bbq, and southern fare.\n\nAt Home Team BBQ we have taken a unique approach by bringing the fundamentals of the “white tablecloth” world to the low and slow ideals of BBQ. In our barbecue restaurants, we believe in keeping it fresh and local, and sending guests happily on their way after a good time has\nbeen had by all. With a menu of award-winning food, ever-evolving bar offerings, a fun and family friendly atmosphere, catering options, and live entertainment, it makes it easy to root for Home Team BBQ!\n\nJOIN THE HOME TEAM!\n\nJoin a tight-knit crew of dedicated teammates who work together at your neighborhood go-to spot for College Football to serve up great BBQ, good vibes, and top-tier guest experiences. We are seeking driven candidates who are organized, professional, and have a love for the food and beverage industry. \n\nHome Team BBQ offers competitive salaries, a benefits program including employer-paid health insurance, paid time off, a 401k plan with employer match, quarterly profit sharing and opportunities for personal/professional growth. Interested candidates should submit resumes to employment@hometeambbq.com AND apply online at hometeambbq.com.\nView our job openings! \nEVENTS\n\nMUSIC FOOD good times\n\nSMELL WHAT’S COOKING\nour program! join loyalty Register your Pig Points Join our email list \nsign in here to earn PIG POINTS and take advantage of our latest deals!\n\nHome Team Catering\nOrder your 'Que! \nWe’re nothing without our community! Please reach out if you are interested in having Home Team BBQ support a community event or fundraiser.\nCLICK HERE FOR MORE INFO FOR DAILY SPECIALS AND HAPPENINGS Follow @HOMETEAMBBQ Open post by hometeambbq with ID 17873381190498556 Open post by hometeambbq with ID 18069199484530036 Open post by hometeambbq with ID 18080925941185201 Open post by hometeambbq with ID 18105409285685059 COLUMBIA, SC @HOMETEAMBBQCOLA Aspen, CO @HOMETEAMBBQASPEN GREENVILLE, SC @HOMETEAMBBQGVL We use cookies to ensure that we give you the best experience on our website. If you continue to use this site we will assume that you are happy with it. OK",
      "hash": "12710eb9781c",
      "downloadedAt": "2026-01-19T02:17:05.825Z",
      "trimmedAt": "2026-01-19T02:52:56.667Z",
      "sizeReduction": "98.5%"
    }
  ],
  "sizeReduction": "98.5%"
}