{
  "venueId": "ChIJ30Pcpg56_ogR7MJZgeN_T-g",
  "venueName": "HarbourView Inn",
  "venueArea": "Downtown Charleston",
  "website": "https://www.harbourviewcharleston.com/?utm_source=google&utm_medium=organic&utm_campaign=business_listing",
  "scrapedAt": "2026-01-18T17:04:23.395Z",
  "trimmedAt": "2026-01-18T17:04:52.968Z",
  "pages": [
    {
      "url": "https://www.harbourviewcharleston.com/meetings-and-events",
      "text": "Meetings & Events Group Gatherings and Celebrations Our Event Venues From board meetings and executive retreats to intimate celebrations, HarbourView Inn offers an inviting venue for meetings and events of every kind. From complimentary WiFi in the guest rooms and meeting spaces to the recently-refreshed Flagship Meeting Room, find all the essential features to make your gathering in downtown Charleston a success. Request for Proposal Floor Plans Chart MEETING ROOMS ROOMS SIZE(SQ FT) CEILINGHEIGHT MAXCAPACITY U-SHAPE BANQUETS COCKTAILS CLASSROOM BOARDROOM CRESCENT THEATER CONFERENCE RECEPTION Flagship Room 546 10 ft 30 18 18 25 25 18 12 - - - 1670 Room 1,105 11 ft 50 24 40 - 40 - - 50 22 50 1670 Room ELEVATE YOUR OCCASION Rooted in Old World charm, 1670 Room is a transportive private venue designed for exclusive gatherings. Located steps away at the French Quarter Inn, its 1,105 square feet of handsomely appointed event space features palmetto-inspired art, French chandeliers, and a stately fireplace. Read More Conveniently located in downtown Charleston Frequently Asked Questions How many rooms are considered a \"group\" to receive a discounted group rate? We offer a discounted group rate to groups of five or more rooms per night. Is there a food and beverage minimum in the meeting rooms? There is no minimum spend for food and beverage in meeting spaces. Is there a restaurant on-site? No, there is no restaurant at the inn itself. However, we are only a few short steps from some of the best restaurants in downtown Charleston. Is there a spa on-site? No, but we are only two blocks from Earthling Day Spa, one of the best spas in downtown Charleston. We can also arrange for certain spa treatments from the comfort of your guest room. Does the meeting space have natural light? It does not. Our meeting room is equipped with artificial lighting. How large is the meeting space? Our on-site meeting space is 546 square feet. For larger groups in need of more space, our sister hotel - French Quarter Inn - offers larger meeting rooms with abundant natural light, as well as a beautiful terrace. French Quarter Inn is just a couple of blocks away, within walking distance. Does the HarbourView Inn do buyouts? Yes, we are happy to offer buyouts of all 52 guest rooms! Website Design by Tambourine © HarbourView Inn 2026. All Rights Reserved.",
      "hash": "1766e1d4f31c",
      "downloadedAt": "2026-01-18T16:54:07.016Z",
      "trimmedAt": "2026-01-18T17:04:52.939Z",
      "sizeReduction": "96.4%"
    },
    {
      "url": "https://www.harbourviewcharleston.com/?utm_source=google&utm_medium=organic&utm_campaign=business_listing",
      "text": "From Harbour to Historic Completely Reimagined Charming, Southern Hospitality Introducing the newly-renovated HarbourView Inn, an intimate retreat in the heart of historic downtown Charleston that sets the stage for unforgettable adventures. From nighttime milk and cookies to enhanced beverage offerings from the comfort of your guest room, revel in a heartening selection of surprises at this intimate hideaway in the Holy City. About Our Inn top reasons to stay An Exceptional Downtown Location HarbourView Inn offers you premier access to fine dining, shopping, and some of Charleston's best historical attractions. Enhanced Beverage Offerings Indulge in a welcome cocktail, breakfast \"eye-opener\" and other curated beverages on the terrace, in the lobby, or within your own room. Complimentary Southern Treats Enjoy our continental breakfast, evening wine and cheese reception, and other treats throughout your day. Understated Conveniences for the Understated Traveler Allow us to make your life easier with onsite parking, late checkout, and knowledgeable concierge travel planning. Our Secluded Rooftop Terrace Take in expansive views of the surrounding cityscape and harbor from our private rooftop terrace. Our Dazzling Rooftop Terrace enjoy the view on Venture up and away at HarbourView Inn. From morning until evening, enjoy panoramic views of the city of Charleston from the cloistered respite of our Inn’s rooftop terrace. Read more Guests Say It Best “Excellent service and great location.” “The location was great. Within walking distance to shopping, dining, and excursions. The staff was so friendly and helpful.” -JHemp6861, TripAdvisor \"A Wonderful Getaway!\" \"I really enjoyed the time I spent at The HarbourView Inn. The view from our room was fantastic and the hotel staff really knows how to make you feel at home!\" -Emfn3, TripAdvisor In Charleston's Historic District Historic City Market Rainbow Row The Battery Centrally Located In Charleston's Historic District Essential downtown Charleston attractions are just a short walk away. Historic City Market A delightful, several-block-long collection of artisan stalls and antique stands. Rainbow Row A series of colorful, Georgian houses that make up the longest cluster in the country. The Battery Stunning views, charming homes and iconic buildings at the tip of the Charleston peninsula. Read More Website Design by Tambourine © HarbourView Inn 2026. All Rights Reserved.",
      "hash": "335880af8414",
      "downloadedAt": "2026-01-18T16:54:06.056Z",
      "trimmedAt": "2026-01-18T17:04:52.950Z",
      "sizeReduction": "97.0%"
    },
    {
      "url": "https://www.harbourviewcharleston.com/?utm_source=google&utm_medium=organic&utm_campaign=business_listing#",
      "text": "From Harbour to Historic Completely Reimagined Charming, Southern Hospitality Introducing the newly-renovated HarbourView Inn, an intimate retreat in the heart of historic downtown Charleston that sets the stage for unforgettable adventures. From nighttime milk and cookies to enhanced beverage offerings from the comfort of your guest room, revel in a heartening selection of surprises at this intimate hideaway in the Holy City. About Our Inn top reasons to stay An Exceptional Downtown Location HarbourView Inn offers you premier access to fine dining, shopping, and some of Charleston's best historical attractions. Enhanced Beverage Offerings Indulge in a welcome cocktail, breakfast \"eye-opener\" and other curated beverages on the terrace, in the lobby, or within your own room. Complimentary Southern Treats Enjoy our continental breakfast, evening wine and cheese reception, and other treats throughout your day. Understated Conveniences for the Understated Traveler Allow us to make your life easier with onsite parking, late checkout, and knowledgeable concierge travel planning. Our Secluded Rooftop Terrace Take in expansive views of the surrounding cityscape and harbor from our private rooftop terrace. Our Dazzling Rooftop Terrace enjoy the view on Venture up and away at HarbourView Inn. From morning until evening, enjoy panoramic views of the city of Charleston from the cloistered respite of our Inn’s rooftop terrace. Read more Guests Say It Best “Excellent service and great location.” “The location was great. Within walking distance to shopping, dining, and excursions. The staff was so friendly and helpful.” -JHemp6861, TripAdvisor \"A Wonderful Getaway!\" \"I really enjoyed the time I spent at The HarbourView Inn. The view from our room was fantastic and the hotel staff really knows how to make you feel at home!\" -Emfn3, TripAdvisor In Charleston's Historic District Historic City Market Rainbow Row The Battery Centrally Located In Charleston's Historic District Essential downtown Charleston attractions are just a short walk away. Historic City Market A delightful, several-block-long collection of artisan stalls and antique stands. Rainbow Row A series of colorful, Georgian houses that make up the longest cluster in the country. The Battery Stunning views, charming homes and iconic buildings at the tip of the Charleston peninsula. Read More Website Design by Tambourine © HarbourView Inn 2026. All Rights Reserved.",
      "hash": "ca18366d679b",
      "downloadedAt": "2026-01-18T16:54:07.613Z",
      "trimmedAt": "2026-01-18T17:04:52.960Z",
      "sizeReduction": "97.0%"
    },
    {
      "url": "https://www.harbourviewcharleston.com/offers",
      "text": "Hotel Deals in Charleston, SC EXTENDED STAYS 20% Off Your Stay Escape to the charming city of Charleston and unlock a world of relaxation and adventure with our exclusive 'Extended Stays' offer. 20% OFF 4-night stay minimum Book Now Terms & Conditions Plan Ahead & Save 15% Advanced Purchase Plan your escape to our intimate waterfront retreat set against the serene backdrop of Charleston's picturesque setting. Book Now Read More A Storied Stay Culture, History & Dining Indulge in an unforgettable journey through the heart of historic Charleston. Immerse yourself in the Holy City and embark on a curated exploration of its most cherished treasures. Call to Book Read More Top Reasons to Stay An Exceptional Downtown Location HarbourView Inn offers you premier access to fine dining, shopping, and some of Charleston's best historical attractions. Enhanced Beverage Offerings Indulge in a welcome cocktail, breakfast \"eye-opener\" and other curated beverages on the terrace, in the lobby, or within your own room. Complimentary Southern Treats Enjoy our continental breakfast, evening wine and cheese reception, and other treats throughout your day. Understated Conveniences for the Understated Traveler Allow us to make your life easier with onsite parking, late checkout, and knowledgeable concierge travel planning. Our Secluded Rooftop Terrace Take in expansive views of the surrounding cityscape and harbor from our private rooftop terrace. Website Design by Tambourine © HarbourView Inn 2026. All Rights Reserved.",
      "hash": "dc62cba17b15",
      "downloadedAt": "2026-01-18T16:54:06.381Z",
      "trimmedAt": "2026-01-18T17:04:52.968Z",
      "sizeReduction": "98.0%"
    }
  ],
  "sizeReduction": "97.1%"
}