{
  "venueId": "ChIJyetLilFx_ogRcalVMpXH_W0",
  "venueName": "The Obstinate Daughter",
  "venueArea": "Sullivan's Island",
  "website": "http://www.theobstinatedaughter.com/",
  "scrapedAt": "2026-01-18T17:04:32.153Z",
  "trimmedAt": "2026-01-18T17:13:06.935Z",
  "pages": [
    {
      "url": "http://www.theobstinatedaughter.com/",
      "text": "top of page Two time nominated - James Beard Award - Chef Jacques Larson and Team 2024 Wine Spectator Award of Excellence American South's 2025 Michelin Recommended Restaurants ​ ​ OPEN DAILY #FOODFORT Lunch 11 am - 3 pm Dinner 4 pm - 10 pm Friday / Saturday - 11 pm *Pizza is served all day* Pizza-Only Menu between 3-4pm DAILY 2063 Middle Street Sullivans Island, SC 29482 843.416.5020 BRUNCH Saturday / Sunday 10 am - 3 pm *Pizza is served all day* Pizza-Only Menu between 3-4pm Reservations We take reservations two weeks out. Click Here Patio Seating, Bar, and Bar Cocktail Tables are reserved for our waitlist from walk-in business. *** Day of, depending on weather, we will release a few patio reservation slots *** We chose the symbol of The Obstinate Daughter to celebrate the spirit, sass and determination of Miss Carolina Sullivan. Sullivan’s Island, with its rich history, is the perfect backdrop for our Lowcountry “Food Fort.” The Obstinate Daughter is a Southern restaurant that is influenced by French, Italian and Spanish cuisine with a wood fired oven, plancha and island kitchen range. Pizza, pasta, small plates and a raw bar are the focus of the menu. Changing seasonally, the menu also is rooted by the burgeoning farms and fishermen in the Lowcountry who all supply us with the superior products that make our region so special. The Obstinate Daughter is proud to be a part of the progressive food movement of Charleston and the cultural renaissance that we are experiencing. We are excited to achieve a Green Restaurant Certification. Promoting sustainable practices is a cornerstone of our business ideology. Though The Obstinate Daughter strives to provide the highest level of quality food and service, it is our relationships with our guests and suppliers that truly distinguish our restaurant. ABOUT Menu Click Here Thank You to Our Local Food Partners! Abundant Seafood Annie Mae's Ambrose Farms Anson Mills Barrier Island Oysters Bradford Family Farm Clammer Dave Crosby’s Seafood Fili-West Eggs Grow Food Carolina Keegan Filion Farms Low Country Cup Oysters Marsh Hen Mill Normandy Farms Oyster Point Seafood Rooting Down Farms Rosebank Farms Tarvin Seafood ...And Our Local Beverage Partners Charles Towne Fermentory Coast Brewing Co. Cooper River Brewing Co. Edmund's Oast Brewing Co. Freehouse Brewery Highwire Distilling Company Holy City Brewing Grassroots Wine Indigo Reef Brewing Company Lo-Fi Brewing Low Tide Brewing Munkle Brewing Company Nippitaty Distlling Company Revelry Brewing River Dog Brewing Company Westbrook Brewing Gift Cards Click Here Visit bottom of page",
      "hash": "978dbb7edd6b",
      "downloadedAt": "2026-01-18T17:01:51.644Z",
      "trimmedAt": "2026-01-18T17:13:06.750Z",
      "sizeReduction": "99.7%"
    },
    {
      "url": "https://www.theobstinatedaughter.com/menu",
      "text": "top of page LUNCH Lunch is served daily from 11am - 3pm. Please note the lunch menu is only available 11am-3pm; between 3 and 4pm, we serve pizzas only. Plates Obstinate Flatbread olive oil, sea salt, butterbean puree $9 Local Lettuce Salad croutons, parmesan, buttermilk vinaigrette, egg $17 Frogmore Chowder shrimp, sausage, corn, potato $14 N. Carolina Apple Salad celery, dates, mint, gorgonzola crema $14 Beet Salad strawberry jam, sesame granola, herbs, creme fraiche $15 Cheese of the Day seasonal jam with lavash $13 Farro with Chicken Brussels sprouts, peanut, balsamic, black truffle $18 Shrimp Roll Tarvin Shrimp, Marsh Hen Mill Frites $21 Peel n' Eat Shrimp remoulade and cocktail sauce $21 Swordfish Siciliana Tomato, green olives, capers, chickpeas, raisins, currants $27 Raw Oysters* Served on the half shell (half dozen $21 or dozen $42) with house made hot sauce and champagne mignonette $42 raw *Contains ingredients that are raw or undercooked Sandwiches Caprese* tomato, mozzarella, basil pesto, garlic aioli* served with grilled and marinated vegetables $14 raw *Contains ingredients that are raw or undercooked Meatball tomato braised pork meatballs, parmesan, mozzarella served with grilled and marinated vegetables $16 Pasta Fregula Vadouvan, market fish, Tarvin shrimp, clams, mussels, cilantro, lime $32 Radiatore \"alla vodka,\" ricotta, chive $27 Rigatoni Sausage and fennel ragu, parmesan $28 Ricotta Gnocchi short rib ragu, horseradish and pine nut gremolata $28 Mezzalune celery root, smoked beef belly, golden raisin sugo $35 Pizza Miss Carolina green and red tomato, mozzarella, basil, olive oil $17 The Moultrie pepperoni, Mepkin Abbey shiitake, tomato, mozzarella, parmesan $19 The Rutledge ricotta, Italian sausage, red onion, local greens, mozzarella, provolone picante $19 The Old Danger* pancetta, farm egg, scallion, white sauce, mozzarella, parmesan, black pepper $20 * *Contains ingredients that are raw or undercooked Weird Fishes tomato, white anchovy, black olive, red onion, garlic, chili oil $18 Night in Tunisia Merguez sausage, tomato, butternut squash, red onion, feta, mozzarella, chili flake $20 Five Fathom Hole 3.0 Clammer Dave’s Clams, rapini, mozzarella, garlic, chili flake, lemon $20 Dessert Pecan Bourbon Creme Brulee pecan sandy $12 Sticky Toffee Date Cake rum toffee sauce, mascarpone orange gelato $14 Chocolate Mascarpone Cake branca menta chocolate caramel, mint Stracciatella gelato $14 Burnt Honey White Chocolate Panna Cotta candied hazelnuts, espresso shortbread, frangelico coffee Caramel $14 Affogato with Gelato $10 Choice of Gelato or Sorbetto Rotating seasonal flavors $7 Wine List bottom of page",
      "hash": "b42c8ef42fe8",
      "downloadedAt": "2026-01-18T17:01:51.856Z",
      "trimmedAt": "2026-01-18T17:13:06.935Z",
      "sizeReduction": "99.8%"
    }
  ],
  "sizeReduction": "99.7%"
}