{
  "venueId": "ChIJjXrGMwx6_ogRC9WyXPVnChQ",
  "venueName": "Rudy Royale",
  "venueArea": "Downtown Charleston",
  "website": "https://rudyroyale.com/",
  "scrapedAt": "2026-01-18T17:04:28.931Z",
  "trimmedAt": "2026-01-18T17:11:33.635Z",
  "pages": [
    {
      "url": "https://rudyroyale.com/our-menu",
      "text": "0 Our Menu LUNCH DINNER BRUNCH DRINKS HAPPY HOUR KIDS F&B STARTERS 8 $ Deviled Eggs *GF four half eggs, pork rinds, paprika 8 $ 8 $ Fried Pickles rudy's famous sauce 8 $ 18 $ Warm Crab Dip blue crab, warm baguette 18 $ 14 $ Loaded Hummus olives, feta, tomato,red peppers, flatbread 14 $ 15 $ Egg Rolls brisket, potato, pimento cheese, alabama white sauce 15 $ 11 $ Brussel Sprouts *GF ginger-carrot dressing, honey yogurt, scallions 11 $ 10 $ Cast Iron Cornbread honey butter, strawberry jam 10 $ 14 $ Baked Mac & Cheese mornay, gouda, mozzarella 14 $ 16 $ Tuna Ceviche *GF lime, chipotle aioli, pico, tostada 16 $ 16 $ Oysters Rockefeller spinach-herb cream, parmesan, breadcrumbs 16 $ Salads add fried or pulled chicken +6 | shrimp +7 | salmon +12 14 $ Caesar romaine lettuce, parmesan, brioche breadcrumbs, caesar dressing 14 $ 14 $ Wedge *GF iceberg lettuce, blue cheese, bacon lardon, pickled red onion, ranch dressing 14 $ 14 $ Local Greens *GF beets, asian pears, goat cheese, hazelnut, champagne vinaigrette 14 $ 14 $ She Crab Bisque biscuit crouton, brown butter, sherry 14 $ FRIED CHICKEN SANDWICH fried or pulled, dukes mayo and slaw $17 ENTREES 18 $ Salmon Sandwich avocado, tomato, green goddess 18 $ 16 $ Royale with Cheese double smash patty burger, american cheese, pickles, rudy's sauce 16 $ 18 $ Prime Rib Melt caramelized onions, mozzarella, arugula, horseradish sauce, au jus 18 $ 15 $ Wood Roasted Vegetables *GF jasmine rice, market vegetables, cucumber salad, yum yum sauce 15 $ 22 $ Short Rib Ragu fettuccine, san marzano glace, pecorino 22 $ 18 $ General Rudy's *GF jasmine rice, broccoli, honey ginger, sesame seeds 18 $ 17 $ Tempura Flounder tartar sauce, slaw, cup of lobster bisque 17 $ 18 $ Chicken Pot Pie carrots, english peas, potato, chicken velouté, puff pastry crust 18 $ ENTREES Fried chicken 18 $ 2 pc dark thigh & drum 18 $ 19 $ 3 pc white two halved breasts, wing, 19 $ 28 $ Half Fried Chicken wing, breast, thigh, drum 28 $ 16 $ Tenders house made honey mustard 16 $ 18 $ Chicken & Waffles Belgium waffle, chicken tenders, syrup, applewood bacon 18 $ SIDES 5 $ Fries smoked comeback sauce 5 $ 5 $ Dill Coleslaw *GF - 5 $ 10 $ Wood Roasted Carrots *GF caramelized onions, apple, feta, pecans 10 $ 11 $ Brussel Sprouts ginger-carrot dressing, yogurt, scallions 11 $ 8 $ Crispy Garlic Cracked Potatoes *GF 8 $ DESSERTS 10 $ Banana Pudding nilla wafers, vanilla custard, whipped cream, banana 10 $ 10 $ Brownie Sundae vanilla ice cream, hot fudge, whipped cream, pecans 10 $ 10 $ Key lime Pie graham cracker crumble, white chocolate ganache 10 $ Order Online Now!",
      "hash": "24fd0ad366c3",
      "downloadedAt": "2026-01-18T16:54:47.790Z",
      "trimmedAt": "2026-01-18T17:11:33.619Z",
      "sizeReduction": "99.4%"
    },
    {
      "url": "https://rudyroyale.com/",
      "text": "0 Rudy Royale Chicken + Cocktails Located in downtown Charleston, Rudy Royale combines a fun atmosphere with approachable yet elevated seasonal cuisine Book Your Reservation CHICKEN + COCKTAILS + LIVE-FIRE GRILL + FUN Private events for every occasion! Contact Us to Book Your Event",
      "hash": "44837d0d5cf7",
      "downloadedAt": "2026-01-18T16:54:47.741Z",
      "trimmedAt": "2026-01-18T17:11:33.627Z",
      "sizeReduction": "99.8%"
    },
    {
      "url": "https://rudyroyale.com/book-your-event",
      "text": "0 Private Dining + Events Three Special Event Spaces Armory Room Located in the back of the restaurant, the Armory Room boasts a quiet space away from the hustle and bustle of the main restaurant. With exposed brick, wood beams, and original armory room door, the space offers a unique Charleston charm with rustic touches. 48 guests, table service | 60 guests, reception style | AV Capable Limmerick Nestled in the center of the restaurant, guests will find our quaint private dining space. The Limmerick Room offers a more intimate setting, ideal for business meetings, family dinners, baby showers, bachelor and bachelorette parties. Includes a screen for slideshows and presentations. Sliding doors provide privacy from restaurant diners or can be open into the larger event space, Custom House. 15 guests, table service | AV Capable Custom House Custom House sits at the front of the restaurant with direct views of Charleston’s custom house. A bright and cheery space with room for a larger party. An ideal location for wedding rehearsal dinners, wedding receptions, or corporate events. Can be combined with Limmerick Room. 70 guests, table service | 100 guests, reception style BOOK YOUR EVENT! Private Event Software powered by Tripleseat",
      "hash": "d1acb500579b",
      "downloadedAt": "2026-01-18T16:54:48.343Z",
      "trimmedAt": "2026-01-18T17:11:33.635Z",
      "sizeReduction": "99.0%"
    }
  ],
  "sizeReduction": "99.4%"
}