{
  "venueId": "ChIJ-2QjVv5l_ogRuXbJiBeHHg0",
  "venueName": "Macho Pichu Chicken",
  "venueArea": "North Charleston",
  "website": "http://www.machopichuchicken.com/",
  "scrapedAt": "2026-01-18T17:04:22.743Z",
  "trimmedAt": "2026-01-18T17:04:33.039Z",
  "pages": [
    {
      "url": "http://www.machopichuchicken.com/",
      "text": "Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Peruvian Rotisserie chicken Peruvian Rotisserie chicken Peruvian Rotisserie chicken Peruvian Rotisserie chicken Quarter, Half, Whole, that's how we roll! Peruvian Rotisserie chicken Peruvian Rotisserie chicken Peruvian Rotisserie chicken Peruvian Rotisserie chicken Quarter, Half, Whole, that's how we roll! Gallery Reviews Social Visit Us Contact Us Name Phone Email* Send This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Macho Pichu Chicken 1813 Reynolds Avenue North Charleston, SC 29405 US dine in or carry out (843) 640-3537 machopichuchicken@gmail.com Hours Open today 12:00 – 20:00 Copyright © 2024 Macho Pichu Chicken - All Rights Reserved. Powered by Website Builder GoDaddy",
      "hash": "5782ffa9a9b7",
      "downloadedAt": "2026-01-18T17:00:04.767Z",
      "trimmedAt": "2026-01-18T17:04:33.009Z",
      "sizeReduction": "98.0%"
    },
    {
      "url": "http://www.machopichuchicken.com/menu",
      "text": "Menu COMFORT FOOD CHICKEN EMPANADAS (2) $8.00 pulled chicken, olives, peppernato CHICKEN POT PIE (seasonal) $10.00 rotisserie chicken, peas, carrots, corn, green beans, gravy, puff pastry JUMBO CHILI LIME WINGS Market Price small (5 pc) large (8 pc) SANDWICHES CHICKEN SALAD $ 9.00 rotisserie chicken, red onion, celery, peruvian mayo served w/ lettuce, tomato on sourdough bread CHICKEN CUBANO $ 12.75 pulled mojo chicken, ham, swiss, yellow pepper mustard, house pickles on a pressed roll PICKLEBACK $10.25 fried pickle brined chicken thigh, sweet and sour pickles, house yum-yum sauce, served on a toasted bun PERUVIAN CHICKEN all natural chicken marinated in our authentic spice mix and roasted over hardwood charcoal. QUARTER DARK $ 7.00 QUARTER WHITE $9 HALF DARK & WHITE $15 WHOLE $28 PERUVIAN CHICKEN COMBO $34 SERVED FAMILY STYLE whole chicken, red beans and rice or steak fries. MACHO COMBO Served with a house salad or your choice of: red beans and rice or steak fries. QUARTER DARK $11.50 QUARTER WHITE $13.50 HALF DARK & WHITE $15.50 SIDES $5.00 EACH STEAK FRIES RED BEANS AND RICE HOUSE SALAD mixed greens, carrot, tomato, house vinaigrette SPECIALTY SIDES $6.00 EACH STRING BEANS ARROZARONI MADUROS YUCCA FRIES SWEETS ask about our weekly feature consuming raw or undercooked meats, poultry, seafood, shellfish, or eggs may increase your risk of food borne illness Copyright © 2024 Macho Pichu Chicken - All Rights Reserved. Powered by Website Builder GoDaddy",
      "hash": "c53c58e24c5b",
      "downloadedAt": "2026-01-18T17:00:05.034Z",
      "trimmedAt": "2026-01-18T17:04:33.039Z",
      "sizeReduction": "98.6%"
    }
  ],
  "sizeReduction": "98.3%"
}