{
  "venueId": "ChIJdeGgrGt6_ogR0sJ-N72qXAs",
  "venueName": "O-Ku",
  "venueArea": "Downtown Charleston",
  "website": "https://www.o-kusushi.com/location/o-ku-charleston/?y_source=1_ODE4NDQwNjctNzE1LWxvY2F0aW9uLndlYnNpdGU%3D",
  "scrapedAt": "2026-01-18T17:04:28.444Z",
  "trimmedAt": "2026-01-18T17:11:20.938Z",
  "pages": [
    {
      "url": "https://www.o-kusushi.com/location/o-ku-charlotte/",
      "text": "Main content starts here, tab to start navigating Charlotte Slide 1 of 4 Slide 2 of 4 Slide 3 of 4 Slide 4 of 4 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Hours & Location 2000 South Boulevard, Suite 510, Charlotte, NC 28203 (704) 594-1922 okucharlotte@theindigoroad.com 5:00 PM - 9:00 PM Sunday 5:00 PM - 10:00 PM5:00 PM - 11:00 PMMonday & Wednesday: 4:00 PM - 7:00 PM Monday Thursday through Friday & Saturday Sushi Happy Hour (dine-in only) Instagram Facebook O-Ku Charlotte celebrates authentic Asian cuisine with a regional approach with a menu that focuses on unique ingredients and sophisticated presentations. From petite plates to sushi specialties, the kitchen showcases the freshest fish from the world’s finest markets in areas such as Norway, Scotland, Hawaii and New Zealand, as well as local sustainable sources. Menu About Private Dining Gallery 2021 BOB AWARDS: THE BEST OF THE BEST IN CHARLOTTE O-KU SUSHI BAR ROLLS INTO CHARLOTTE TOP 100 RESTAURANTS 2024 8 Spots for Sushi in Charlotte, North Carolina Charlotte Magazine Style Blueprint OpenTable Eater Get Directions RESERVATIONS EMAIL SIGNUP Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Alys Beach Atlanta Charleston Charlotte Greenville Jacksonville Beach Nashville Raleigh Washington D.C. Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "047c9bf8190e",
      "downloadedAt": "2026-01-18T16:54:41.419Z",
      "trimmedAt": "2026-01-18T17:11:20.828Z",
      "sizeReduction": "94.8%"
    },
    {
      "url": "https://www.o-kusushi.com/location/alys-beach/",
      "text": "Main content starts here, tab to start navigating Alys Beach Slide 1 of 8 Slide 2 of 8 Slide 3 of 8 Slide 4 of 8 Slide 5 of 8 Slide 6 of 8 Slide 7 of 8 Slide 8 of 8 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Hours & Location 27 Admiralty Row R102, Alys Beach, FL 32461 (850) 909-0380 okualysbeach@theindigoroad.com Monday - Thursday 4 to 10 p.m.Friday - Sunday 11am to10 p.m.Winter Happy HourMonday - Thursday 4 to 6 p.m. Follow us on Instagram Modern Japanese meets new urban architecture in the heart of Alys Beach at 30A. Overlooking the town’s iconic Amphitheatre, O-Ku will welcome guests with warm hospitality and authentic Japanese cuisine. O-Ku celebrates unique ingredients, traditional techniques, and sophisticated presentations through an approachable menu featuring sushi, sashimi, and nigiri alongside savory dishes. Menu About Gallery Sister Restaurant Press: Best Sushi Restaurants in the US Travel + Leisure Gwyneth’s Favorite Nashville Restaurants Eater Best Sushi in Atlanta Eater Get Directions RESERVATIONS EMAIL SIGNUP Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Alys Beach Atlanta Charleston Charlotte Greenville Jacksonville Beach Nashville Raleigh Washington D.C. Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "481142579465",
      "downloadedAt": "2026-01-18T16:54:39.840Z",
      "trimmedAt": "2026-01-18T17:11:20.837Z",
      "sizeReduction": "95.3%"
    },
    {
      "url": "https://www.o-kusushi.com/location/o-ku-atlanta/",
      "text": "Main content starts here, tab to start navigating Atlanta Slide 1 of 10 Slide 2 of 10 Slide 3 of 10 Slide 4 of 10 Slide 5 of 10 Slide 6 of 10 Slide 7 of 10 Slide 8 of 10 Slide 9 of 10 Slide 10 of 10 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Hours & Location 1085 Howell Mill Rd NW A3, Atlanta, GA 30318 (404) 500-2383 o-kuatlanta@theindigoroad.com Dinner Daily at 5pm Monday through Thursday, 5 PM – 6:30 PM Happy Hour Friday through Sunday, 11 AM - 2:30 PM Weekend Lunch Recognized by & for the best happy hours in Atlanta. Eater Discover Atlanta Instagram Facebook O-Ku Atlanta provides a fresh and innovative take on traditional Japanese sushi and cuisine. Led by executive chef Masatomo Hamaya, O-Ku’s menu is comprised of signature starters, contemporary Japanese entrees and seasonal traditional sushi that reflect the uniquely designed space. The West Midtown restaurant offers rare and unique dining options along with traditional sashimi and specialty rolls, sourcing seafood from the finest fish markets in Tokyo and Hawaii alongside local and seasonal ingredients. Menu About Private Dining Gallery Best Rooftop Bars in Atlanta Thrillist Best Atlanta Rooftop Bars Eater Best Sushi in Atlanta Eater Get Directions RESERVATIONS EMAIL SIGNUP Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Alys Beach Atlanta Charleston Charlotte Greenville Jacksonville Beach Nashville Raleigh Washington D.C. Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "4b202a53f0f7",
      "downloadedAt": "2026-01-18T16:54:40.365Z",
      "trimmedAt": "2026-01-18T17:11:20.847Z",
      "sizeReduction": "94.9%"
    },
    {
      "url": "https://www.o-kusushi.com/location/o-ku-washington-dc/",
      "text": "Main content starts here, tab to start navigating Washington D.C. Slide 1 of 3 Slide 2 of 3 Slide 3 of 3 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Hours & Location 1274 5th Street NE, Washington, DC 20002 (202) 888-8790 5:00 PM - 10:00 PM Dinner Daily Monday throughThursday: 5:00 PM - 7:00 PM Happy Hour Facebook Instagram OMOTENASHI: What sets Japanese hospitality apart Omotenashi is the word that embodies Japanese hospitality, where every service is from the bottom of the heart – honest, no hiding, no pretending. O-Ku DC offers modern Japanese cuisine defined by the freshest ingredients from around the world and a reference for traditional technique. From sushi and sashimi specialties to contemporary robata-style dishes, we create a distinctive international experience in the Union Market neighborhood. We look forward to welcoming you into O-Ku DC so you may experience Omotenashi firsthand. Menu About Private Dining Gallery BIG AND BEAUTIFUL, D.C.’S NEWEST JAPANESE RESTAURANT MASTERS THE GRILL The 12 Best Sushi Restaurants in DC Washington Post DC Magazine Get Directions RESERVATIONS EMAIL SIGNUP Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Alys Beach Atlanta Charleston Charlotte Greenville Jacksonville Beach Nashville Raleigh Washington D.C. Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "6251186be302",
      "downloadedAt": "2026-01-18T16:54:45.001Z",
      "trimmedAt": "2026-01-18T17:11:20.856Z",
      "sizeReduction": "94.7%"
    },
    {
      "url": "https://www.o-kusushi.com/location/o-ku-charleston/",
      "text": "Main content starts here, tab to start navigating Charleston Slide 1 of 3 Slide 2 of 3 Slide 3 of 3 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Hours & Location 463 King Street, Charleston, SC 29403 (843) 737-0112 5:00 PM - 10:00 PM5:00 PM - 11:00 PMMonday, Tuesday, & Wednesday: 5:00 PM - 7:00 PM Sunday through Thursday Friday & Saturday Happy Hour Instagram Facebook O-Ku celebrates authentic Asian cuisine with a regional approach with a menu that focuses on unique ingredients and sophisticated presentations. From petite plates to sushi specialties, the menu showcases the freshest fish from the world’s finest markets and producers in areas such as Norway, Scotland, Hawaii and New Zealand, as well as local sustainable sources. Menu About Private Dining Gallery OUTSTANDING RESTAURATEUR SEMIFINALISTS Top 20 Best New Restaurants America's Best Sushi Restaurants James Beard Foundation Esquire magazine Travel + Leisure Get Directions RESERVATIONS EMAIL SIGNUP Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Alys Beach Atlanta Charleston Charlotte Greenville Jacksonville Beach Nashville Raleigh Washington D.C. Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "725f90d43d5b",
      "downloadedAt": "2026-01-18T16:54:40.889Z",
      "trimmedAt": "2026-01-18T17:11:20.872Z",
      "sizeReduction": "95.0%"
    },
    {
      "url": "https://www.o-kusushi.com/location/o-ku-charleston/?y_source=1_ODE4NDQwNjctNzE1LWxvY2F0aW9uLndlYnNpdGU%3D",
      "text": "Main content starts here, tab to start navigating Charleston Slide 1 of 3 Slide 2 of 3 Slide 3 of 3 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Hours & Location 463 King Street, Charleston, SC 29403 (843) 737-0112 5:00 PM - 10:00 PM5:00 PM - 11:00 PMMonday, Tuesday, & Wednesday: 5:00 PM - 7:00 PM Sunday through Thursday Friday & Saturday Happy Hour Instagram Facebook O-Ku celebrates authentic Asian cuisine with a regional approach with a menu that focuses on unique ingredients and sophisticated presentations. From petite plates to sushi specialties, the menu showcases the freshest fish from the world’s finest markets and producers in areas such as Norway, Scotland, Hawaii and New Zealand, as well as local sustainable sources. Menu About Private Dining Gallery OUTSTANDING RESTAURATEUR SEMIFINALISTS Top 20 Best New Restaurants America's Best Sushi Restaurants James Beard Foundation Esquire magazine Travel + Leisure Get Directions RESERVATIONS EMAIL SIGNUP Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Alys Beach Atlanta Charleston Charlotte Greenville Jacksonville Beach Nashville Raleigh Washington D.C. Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "75216ef463df",
      "downloadedAt": "2026-01-18T16:54:39.791Z",
      "trimmedAt": "2026-01-18T17:11:20.885Z",
      "sizeReduction": "95.0%"
    },
    {
      "url": "https://www.o-kusushi.com/location/o-ku-greenville/",
      "text": "Main content starts here, tab to start navigating Greenville Slide 1 of 3 Slide 2 of 3 Slide 3 of 3 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Hours & Location 30 W Broad Street, Greenville, SC 29601 (864) 326-4812 okugreenville@theindigoroad.com 5:00 PM - 9:00 PM Sunday 5:00 PM - 10:00 PM5:00 PM - 11:00 PM Monday Thursday through Friday & Saturday Monday & Tuesday: 4:00 - 6:00 PM Happy Hour Reservations Facebook Instagram O-Ku Greenville brings a high-end point of precision to sushi, celebrating authentic Asian cuisine with a regional approach. Our menu focuses on new seafood and classic Japanese dishes, as well as classic and avant-garde sushi and artistic cocktails. Our kitchen showcases the freshest fish from the world’s finest markets in areas such as Norway, Scotland, Hawaii and New Zealand, as well as local sustainable sources. For press inquiries, please contact irmarketing@theindigoroad.com Menu About Private Dining Gallery 10 Hottest Restaurants in Greenville 15 Best Restaurants in Greenville Falling for Greenville Eater Southern Living Raleigh Magazine Get Directions RESERVATIONS EMAIL SIGNUP Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Alys Beach Atlanta Charleston Charlotte Greenville Jacksonville Beach Nashville Raleigh Washington D.C. Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "a406385b57df",
      "downloadedAt": "2026-01-18T16:54:41.945Z",
      "trimmedAt": "2026-01-18T17:11:20.895Z",
      "sizeReduction": "94.8%"
    },
    {
      "url": "https://www.o-kusushi.com/location/o-ku-nashville/",
      "text": "Main content starts here, tab to start navigating Nashville Slide 1 of 4 Slide 2 of 4 Slide 3 of 4 Slide 4 of 4 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Hours & Location 81 Van Buren Street, Nashville, TN 37208 (629) 900-0021 okunashville@theindigoroad.com 5:00 PM - 9:30 PM5:00 PM - 10:30 PM Sunday through Thursday Friday & Saturday Monday - Wednesday5 to 6 PMLocated on the corner of Van Buren and Adams StreetMetered Parking & Street Parking AvailableNo parking in front of Delek Fuel building for risk of ticketing Happy Hour Instagram Facebook O-Ku Nashville celebrates authentic Asian cuisine with a regional approach with a menu that focuses on unique ingredients and sophisticated presentations. From petite plates to sushi specialties, O-Ku showcases the freshest fish from the world’s finest markets and producers in areas such as Norway, Scotland, Hawaii and New Zealand, as well as local sustainable sources. Menu About Private Dining Gallery Nashville Tasting Menus: The Ultimate List O-Ku offers expansive menu of Asian delights Where to Eat Sushi in Nashville Where to Eat and Drink in Germantown Style Blueprint The Tennessean Eater Eater Get Directions RESERVATIONS EMAIL SIGNUP Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Alys Beach Atlanta Charleston Charlotte Greenville Jacksonville Beach Nashville Raleigh Washington D.C. Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "ae787f1086e2",
      "downloadedAt": "2026-01-18T16:54:43.028Z",
      "trimmedAt": "2026-01-18T17:11:20.909Z",
      "sizeReduction": "94.6%"
    },
    {
      "url": "https://www.o-kusushi.com/location/tampa/",
      "text": "Main content starts here, tab to start navigating Tampa - Coming Soon Slide 1 of 4 Slide 2 of 4 Slide 3 of 4 Slide 4 of 4 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Hours & Location 2907 W Bay to Bay Blvd, Tampa, FL 33629 Coming Soon Follow us on Instagram O-Ku Tampa Located on the ground floor of the celebrated Bayshore Gardens renovation, O-Ku will welcome guests with warm hospitality and authentic Japanese cuisine. O-Ku celebrates unique ingredients, traditional techniques, and sophisticated presentations through an approachable menu featuring sushi, sashimi, and nigiri alongside savory dishes. Be the First to Know Get insider access to O-Ku West Palm Beach. Sign up for our mailing list and be the first to hear about our opening date, exclusive pre-opening events, and priority to our first reservations. Email Signup Get Directions Press: Most Anticipated Restaurants Coming to Tampa Creative Loafing Gwyneth’s Favorite Nashville Restaurants Eater for O-Ku Nashville Best Sushi in Atlanta Eater for O-Ku Atlanta RESERVATIONS EMAIL SIGNUP Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Alys Beach Atlanta Charleston Charlotte Greenville Jacksonville Beach Nashville Raleigh Washington D.C. Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "bfa1d1c130dc",
      "downloadedAt": "2026-01-18T16:54:44.450Z",
      "trimmedAt": "2026-01-18T17:11:20.918Z",
      "sizeReduction": "94.8%"
    },
    {
      "url": "https://www.o-kusushi.com/location/o-ku-jacksonville-beach/",
      "text": "Main content starts here, tab to start navigating Jacksonville Beach Slide 1 of 4 Slide 2 of 4 Slide 3 of 4 Slide 4 of 4 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Hours & Location 502 First Street North, Jacksonville Beach, FL 32250 904.694.2770 okujacksonville@theindigoroad.com Monday through Saturday 5:00 PM - 10:00 PMSunday 5:00 PM- 9:00 PM Dinner Saturday 12:00 PM - 4:00 PMSunday 12:00 PM - 4:00 PM Lunch Saturday & Sunday 12:00 PM - 2:00 PMSpecially priced chef's specialties, small plates, makimono, cocktails and wine. Happy Hour Instagram Facebook What’s better than O-Ku? How about O-Ku beachside? Welcome to O-Ku Jax Beach. O-Ku provides a fresh and innovative take on traditional Japanese sushi and cuisine. O-Ku’s menu is comprised of signature starters, contemporary Japanese entrees and seasonal traditional sushi that reflect the uniquely designed space. The beachside location with waterfront and rooftop dining offers traditional sashimi and specialty rolls, sourcing seafood from the finest fish markets in Tokyo and Hawaii alongside local and seasonal ingredients. Menu About Private Dining Gallery Best of Jax - Best Sushi & Best New Restaurant JACKSONVILLE'S TOP ROOFTOP BARS Jacksonville Magazine Visit Jacksonville Get Directions RESERVATIONS EMAIL SIGNUP Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Alys Beach Atlanta Charleston Charlotte Greenville Jacksonville Beach Nashville Raleigh Washington D.C. Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "c6120878d39e",
      "downloadedAt": "2026-01-18T16:54:42.485Z",
      "trimmedAt": "2026-01-18T17:11:20.928Z",
      "sizeReduction": "94.5%"
    },
    {
      "url": "https://www.o-kusushi.com/location/o-ku-raleigh/",
      "text": "Main content starts here, tab to start navigating Raleigh Slide 1 of 6 Slide 2 of 6 Slide 3 of 6 Slide 4 of 6 Slide 5 of 6 Slide 6 of 6 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Hours & Location 411 W Hargett Street, Raleigh, NC 27603 (919) 792-3777 okuraleigh@theindigoroad.com 5:00 PM - 9:00 PM Sunday Tuesday through 5:00 PM - 10:00 PM Wednesday & Thursday 5:00 PM - 11:00 PM Friday & Saturday Monday through Thursday: 5:00 PM to 7:00 PM Happy Hour Reservations on OpenTable are recommended. Facebook Instagram O-Ku Raleigh is located at The Dillon in downtown Raleigh’s vibrant Warehouse District. O-Ku Raleigh celebrates authentic Asian cuisine with a regional approach, providing a dining experience that focuses on unique ingredients and sophisticated presentations. From petite plates to sushi specialties to contemporary robata-style dishes, O-Ku Raleigh showcases the freshest fish from the world’s finest markets in areas such as Norway, Scotland, Hawaii and New Zealand, as well as local sustainable sources. Menu About Private Dining Gallery 6 Spectacular Sushi Spots in the Triangle BEST OMASAKE SPOTS IN RALEIGH FOR SUSHI AFICIONADOS The Best Sushi Restaurant in Every State Eater Raleigh Magazine The Daily Meal Get Directions RESERVATIONS EMAIL SIGNUP Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Alys Beach Atlanta Charleston Charlotte Greenville Jacksonville Beach Nashville Raleigh Washington D.C. Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "f699efad7955",
      "downloadedAt": "2026-01-18T16:54:43.566Z",
      "trimmedAt": "2026-01-18T17:11:20.938Z",
      "sizeReduction": "94.6%"
    }
  ],
  "sizeReduction": "94.8%"
}