{
  "venueId": "ChIJNxplWbVx_ogRgfB4gVEDEtU",
  "venueName": "Naan at Mt Pleasant",
  "venueArea": "Mount Pleasant",
  "website": "https://naanatmtpleasant.com/",
  "scrapedAt": "2026-01-18T17:04:25.663Z",
  "trimmedAt": "2026-01-18T17:07:14.221Z",
  "pages": [
    {
      "url": "https://naanatmtpleasant.com/mount-pleasant-naan-at-mt-pleasant-locations",
      "text": "Locations View map Back to Location Mount Pleasant Address: 915 Houston Northcutt Boulevard Mount Pleasant, SC 29464 on Google maps Location Hours: Fri, Sat 11:00 AM - 10:00 PM Sun, Mon, Tue, Wed, Thur 11:00 AM - 9:30 PM Phone: 854-227-5861 View Mount Pleasant on Google maps View on map Mount Pleasant Naan at Northwoods Address: 7620 Rivers Ave Suite 375, North Charleston, SC 29406 on Google maps Location Hours: Mon, Tue, Wed, Thur 11:00 AM - 9:30 PM Fri, Sat 11:00 AM - 10:00 PM Sun 11:00 AM - 9:00 PM Phone: 843-471-1344 View Naan at Northwoods on Google maps View on map Naan at Northwoods Naan Appetit Address: 1 North Godley Station Boulevard, Unit C105, Pooler, GA 31322 on Google maps Location Hours: Mon, Tue, Wed, Thur, Fri 11:00 AM - 9:30 PM Sat, Sun 12:00 PM - 9:30 PM Phone: 912-348-2446 View Naan Appetit on Google maps View on map Naan Appetit Naan on Broughton Address: 114 East Broughton Street, Savannah, GA 31401 on Google maps Location Hours: Sun, Mon 11:00 AM - 9:00 PM Tue, Wed, Thur 11:00 PM - 10:00 PM Fri, Sat 11:00 PM - 11:00 PM Phone: 912-349-0324 View Naan on Broughton on Google maps View on map Naan on Broughton Go back to the main content Reset zoom",
      "hash": "9f7de1995c03",
      "downloadedAt": "2026-01-18T16:56:49.640Z",
      "trimmedAt": "2026-01-18T17:07:14.195Z",
      "sizeReduction": "98.6%"
    },
    {
      "url": "https://naanatmtpleasant.com/mount-pleasant-naan-at-mt-pleasant-drink-menu",
      "text": "Our Drinks Beverages",
      "hash": "d8f03e56e32c",
      "downloadedAt": "2026-01-18T16:56:49.050Z",
      "trimmedAt": "2026-01-18T17:07:14.197Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "https://naanatmtpleasant.com/",
      "text": "× We are taking online reservations! Let’s ensure you get a great table: Book today! We recommend making a reservation ahead of time. Book your table today! Book Table × Turn moments into memories! Choose us for your next special occasion or get-together. Got a birthday party, rehearsal dinner, corporate or other event coming up? We're a great option for your gathering! Inquire today and let us know how we can make your special occasion perfect! Book your party × Did you know we do catering? Whatever your occasion, however big or small, we have the perfect options to choose from. Cater your birthday party, holiday party, corporate events, wedding festivities and more! Catering Packages × We're hiring! Call, email, or submit an inquiry today to learn more! Job Listings 915 Houston Northcutt Boulevard, Mount Pleasant, SC 29464 map marker pin View 915 Houston Northcutt Boulevard, Mount Pleasant, SC 29464 on Google maps - opens in a new tab Locations Mount Pleasant View on Google maps - opens in a new tab Naan at Northwoods View on Google maps - opens in a new tab Naan Appetit View on Google maps - opens in a new tab Naan on Broughton View on Google maps - opens in a new tab Welcome to Naan at Mt. Pleasant Naan Group of restaurants started in 2013. We are a family-run, modern restaurant that is blueprinted to exhibit the diversity in Indian cuisine through its flavorful & indulgent food. our menu Cater With Us! We cater to all occasions. Everything is made to order and we love serving the local community. catering Naan At Mt. Pleasant Naan At Mt. Pleasant Naan At Mt. Pleasant Naan At Mt. Pleasant Naan At Mt. Pleasant Garlic Naan Naan At Mt. Pleasant Naan At Mt. Pleasant Naan At Mt. Pleasant Naan At Mt. Pleasant Naan At Mt. Pleasant Naan At Mt. Pleasant Naan At Mt. Pleasant Naan At Mt. Pleasant Naan At Mt. Pleasant Naan At Mt. Pleasant Naan At Mt. Pleasant Naan At Mt. Pleasant Naan At Mt. Pleasant Naan At Mt. Pleasant Naan At Mt. Pleasant Naan At Mt. Pleasant Naan At Mt. Pleasant Naan At Mt. Pleasant Order online We love serving the local community. No matter what you order, the quality and taste of your meal and beverage will be made to perfection. Order WELCOME TO Naan At MT. PLEASANT Delicious dishes for the whole family! Our Menu Catering Services Available Quality, fresh ingredients catering Your Private Party Spot Host your next party with us parties previous slide next slide Dot slide navigation number 1 Dot slide navigation number 2 Dot slide navigation number 3 slideshow start stop playing BOOK AN EVENT Your Private Party Spot For all inquiries, please fill out the form below and we'll be in touch soon. parties REVIEWS Review by - Yelp Scott E: This place has real Indian food, and it is fresh and delicious. Best I have had in Charleston by far. Very good, great, scrumptious. People come here to dine from far away regularly -- that is how good it is. Review by - Yelp Kenny S: My wife and I went to Naan tonight and we were not disappointed one bit! The restaurant itself is super cool and has a modern hipsterish vibe to it with a very cool bar right by the entrance. The waitstaff was super attentive with multiple people checking in on us at different times making sure everything was alright without being overbearing Review by - Yelp Holli A: My daughter talked me into eating here, as it was my first time ever eating Indian cuisine. I wasn't sure what to order so we just got the buffet. Everything I tried was really good and I was impressed. Review by - Yelp Joanne B: We ate dinner here and everything was amazing. We had Chicken 65 for an appetizer. It was full of flavor, tender and just a little spicy. We had Seekh Kebab and Dal Makhani. Both were tasty and perfectly prepared. The service was spot-on and the restaurant is so clean! Everyone was very nice. Also, order the garlic naan. Stop reviews carousel Play reviews carousel Newsletter Location 915 Houston Northcutt Boulevard Mount Pleasant, SC 29464 Hours Monday to Thursday - Lunch - 11.00 AM to 3.00 PM Dinner - 5.00 PM to 9.30 PM Friday and Saturday Lunch - 11.00 AM to 3.00 PM Dinner - 5.00 PM to 10.00 PM Sunday Lunch - 11.00 AM to 3.00 PM Dinner - 5.00 PM to 9.00 PM Find us on... Contact us (855)-681-8694 gudla.maganti@gmail.com Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "e5433cbf0a50",
      "downloadedAt": "2026-01-18T16:56:48.401Z",
      "trimmedAt": "2026-01-18T17:07:14.216Z",
      "sizeReduction": "97.2%"
    },
    {
      "url": "https://naanatmtpleasant.com/mount-pleasant-naan-at-mt-pleasant-food-menu",
      "text": "Our Menu Menu",
      "hash": "f85c16d7973c",
      "downloadedAt": "2026-01-18T16:56:48.464Z",
      "trimmedAt": "2026-01-18T17:07:14.221Z",
      "sizeReduction": "100.0%"
    }
  ],
  "sizeReduction": "98.7%"
}