{
  "venueId": "ChIJn5HuTQ5k_ogRhl6T6GYoTF4",
  "venueName": "LG's By The Creek",
  "venueArea": "North Charleston",
  "website": "http://www.lgsbythecreek.net/",
  "scrapedAt": "2026-01-18T17:04:29.627Z",
  "trimmedAt": "2026-01-18T17:11:47.658Z",
  "pages": [
    {
      "url": "https://www.lgsbythecreek.net/",
      "text": "top of page VIEWMENU Welcome to LG's by the Creek, the neighborhood sports bar and grill that has everything you need to enjoy a good time with good friends. Open seven days a week, we serve lunch, dinner, and Sunday brunch with mouth-watering dishes you'll keep coming back for. Whether you're hanging out with old friends or meeting new ones, our lively atmosphere and drink specials will keep you entertained all night long. Join us for live music every Saturday night and various events that we host throughout the week! Experience LG's by the Creek - Eat, Drink, and Chill LG's by the Creek is not just your run-of-the-mill bar and restaurant; it is a local friendly neighborhood watering hole where we will welcome you with open arms and are always eager to hear your stories. Whether you need a cold beer or delicious food, our team is here to provide the best possible service and atmosphere. So come on over and let us show you what LG's is all about! See the menu Welcome to the Clubhouse! Happy Hour 4-7PM Monday - Friday What's Happening Every Wednesday Free Trivia Think you know it all? Prove it! Free to play and win prizes every Saturday Live Music Lineup of various local bands playing live starting at 9 PM Every Sunday Brunch Join us every Sunday for brunch! LOCATION & HOURS 1005 Tanner Ford Blvd Hanahan SC, 29410 OPEN DAILY 11AM Till 2AM CONTACT lgsbythecreek.net 843-553-8046 Connect Follow us on social media bottom of page",
      "hash": "02b56921ab94",
      "downloadedAt": "2026-01-18T17:00:05.867Z",
      "trimmedAt": "2026-01-18T17:11:47.424Z",
      "sizeReduction": "99.8%"
    },
    {
      "url": "https://www.lgsbythecreek.net/s-projects-basic",
      "text": "top of page VIEWMENU Monday Lunch Special Big 3 Special: Your choice of hamburger steak, pork loin, chicken grilled or fried along with mac and cheese, field peas, rice and gravy for $13.95! Wednesday Lunch Special Fried pork chops with rice & gravy and field peas for $12.95! Friday Lunch Special Fried shrimp, coleslaw and cries for $12.95 or spaghetti for $10.95! Tuesday Lunch Special 4 crunchy tacos (chicken or beef) and a side of chips & queso for $12.95! Thursday Lunch Special Hamburger steak smothered with gravy and mashed potatoes with green beans for $12.95! bottom of page",
      "hash": "3e8c1b0710bc",
      "downloadedAt": "2026-01-18T17:00:04.718Z",
      "trimmedAt": "2026-01-18T17:11:47.452Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "https://www.lgsbythecreek.net/menus",
      "text": "top of page VIEWMENU Full Menu Appetizers Chicken Wings Lemon pepper, honey mustard, teriyaki, dry ranch,Jamaican, Thai chili, wild willy, mild, medium, hot 5 $8.00 10 $14.00 20 $27.00 Boneless Chicken Wings Lemon pepper, honey mustard, teriyaki, dry ranch,Jamaican, Thai chili, wild willy, mild, medium, hot 10 $12.00 Nachos Tortilla chips, queso, lettuce, tomato, black olives, & jalapeños served with salsa & sour cream Add chicken/pulled pork $4 Add steak/shrimp $5 $9.00 Buffalo Shrimp Fried shrimp tossed in hot buffalo sauce $9.00 Lumpia Homemade “Oriental Cuisine” egg rolls served with duck sauce $14.00 Loaded Cheese Fries Fries covered with bacon, cheddar cheese, and a side of ranch $8.50 Cheese Sticks Freshly breaded mozzarella cheese deep fried and served with marinara $8.00 Frog Legs Crispy fried frog legsserved with a side of house made dill shallot sauce $13.00 Pork Skins Add a side of pimento cheese for $3 $6.00 Mahi Bites Lightly fried mahi-mahi bitesserved with a house made dill shallot sauce $12.00 Fried Pickles Battered and fried dill pickle chipsserved with a dill shallot sauce $6.00 Quesadilla Served with salsa and sour cream Add chicken/pulled pork $4 Add steak/shrimp $6 $9.00 Redneck Nachos Pork skins, queso, coleslaw, green onions, tomatoes, & jalapeños Add chicken/pulled pork $4 Add steak/shrimp $6 $9.00 Pizza The Mexican Pepperoni, jalapenos, olives, pepperjack, and mozzarella cheese 10\" $12.00 16\" $17.00 The Big Hinson Beef, sausage, bacon, ham, and pepperoni 10\" $15.00 16\" $18.00 The Carroll Pie Caramelized onions, peppers, mushrooms, tomatoes, and basil 10\" $12.00 16\" $17.00 The Fat Guy BBQ chicken, red onions, bacon, mozzarella cheese, and cilantro 10\" $12.00 16\" $17.00 The Hawaiian Ham, pineapple, mozarella cheese 10\" $12.00 16\" $16.00 The White Head Roasted garlic oil base, mozzarella cheese, feta cheese 10\" $12.00 16\" $16.00 Build Your Own Pizza 1. Choose Your Sauce Tomato sauce, roasted garlic oil, bbq sauce 2. Choose Your Cheese Mozzarella, cheddar, blue cheese, feta, goat, american, parmesan, Romano, provolone 10\" - $2 / 16\" $3 3. Choose Your Toppings Red onion, sundried tomato, mushrooms, broccoli, bell peppers, pineapple, olives, tomato, basil, cilantro, spinach, green onions 10\" - $1 / 16\" $1.50 5. Choose a Protein Pepperoni, beef, ham, salami, sausage, meatball, bacon, chicken, capicola, anchovies, shrimp 10” - $3 / 16” - $4 Sandwiches & Baskets Chicken Finger Basket Crispy fried chicken tenders with french fries with your choice of sauce on the side (ranch, honey mustard, buffalo, BBQ) $13.00 Shrimp Basket Fried shrimp with french fries served with cocktail or tartar $15.00 Fish N' Shrimp Basket Fish (6oz) and shrimp (8) lightly beer battered and fried with french fries $16.00 Creekside Griller Grilled cheese for adults. Add bacon or ham for $2. Add tomato for .75c $8.00 Tacos (2) Choice of pulled pork BBQ tacos or fried fish tacos topped with coleslaw and served with a side of pineapple salsa $12.00 Build Your Own Burger Turkey burger for $9.00 | Veggie burger for $8.00 includes lettuce, tomato, onion, and a pickle spear Add cheese ($1): American, cheddar, feta, parmesan, Swiss, pimento Additional toppings: Bacon ($1.50), fried egg ($2), pulled pork ($4), double patty ($5), jalapenos(.50c), mushrooms(.50c) $10.50 Chicken Sandwich Grilled or fried chicken breast with lettuce, tomato, and onion Add cheese for $1 / Add bacon for $1.50 $12.00 The Flanigan Salami, ham, turkey, capicola, pepperoni, lettuce, tomato, onion, and provolone on a toasted hoagie roll $13.00 Trailblazer Burger 1/2 lb. ground chuck topped with homemade pimento cheese and crispy bacon $12.00 Dave & Barry Burger 1/2 lb ground chuck, pulled pork and smothered in BBQ sauce $12.00 Club Sandwich Turkey, ham, bacon, lettuce, tomato, and mayonnaise stacked between 3 pieces of toasted white bread $12.00 Philly Sandwich Choice of beef or chicken with sauteed peppers and onions and provolone cheese $12.00 Meatball Sandwich Meatballs, mozzarella and marinara on a hoagie bun $12.00 Entrees Served with choice of two sides (see sides) Mahi 6oz, pan seared mahi-mahi $17.00 Salmon 6oz, pan seared salmon $17.00 Sauteed Shrimp Butter & herb sauteed shrimp $17.00 Chicken Breast 8 oz grilled and seasoned chicken breas $16.00 Salads Add chicken or pork $4, or Steak or Shrimp $6 Classic Caesar Crispy romaine lettuce with croutons, parmesan cheese, and Caesar dressing $10.00 Italian Chef Crispy field mix with ham, salami, capicola, peppers, olives, tomatoes, provolone, mozzarella cheese, and basil $12.00 Doc Wilson Fresh baby spinach with feta cheese, craisins, and almonds served with grilled or fried chicken $11.00 Greek Salad Crispy field mix with tomatoes, onions, pepperoncini, feta cheese, and olives $11.00 Build Your Own Salad $11.00 1. CHOOSE YOUR GREENS Romaine, field mix, baby spinich 2. CHOOSE A CHEESE Mozzarella, cheddar, feta, American, parmesan, provolone 3. CHOOSE 5 TOPPINGS Egg, tomato, red onion, broccoli, mushrooms, olives, cucumbers, bell peppers, almonds, candied walnuts, sunflower seeds, corn, chickpeas, sundried tomatoes, craisins 4. CHOOSE A PROTEIN Grilled or fried chicken, BBQ (+$4) Steak, Shrimp (+$6) 5. CHOOSE A DRESSING Ranch, bleu cheese, caesar, balsamic, honey mustard, greek, raspberry, vinaigrette, thousand island Sides Fries $4.00 Tots $4.00 Sweet Potato Fries $5.00 Onion Rings $5.00 Pasta Salad $4.00 Side Salad $6.00 Veggies $5.00 Mac n' Cheese $4.00 Kids Served with a choice of fries or apple sauce PB&J $6.00 Kids Chicken Fingers (2) $6.00 Grilled Cheese $6.00 Kids Burger $6.00 Kids Mac n' Cheese $6.00 Beverages Soft Drinks Coke, Diet Coke, Sprite, Mr. Pibb, Ginger Ale, Powerade $2.25 Sweet / Unsweet Tea $2.25 bottom of page",
      "hash": "9a43d7824ce7",
      "downloadedAt": "2026-01-18T17:00:05.305Z",
      "trimmedAt": "2026-01-18T17:11:47.589Z",
      "sizeReduction": "99.5%"
    },
    {
      "url": "http://www.lgsbythecreek.net/",
      "text": "top of page VIEWMENU Welcome to LG's by the Creek, the neighborhood sports bar and grill that has everything you need to enjoy a good time with good friends. Open seven days a week, we serve lunch, dinner, and Sunday brunch with mouth-watering dishes you'll keep coming back for. Whether you're hanging out with old friends or meeting new ones, our lively atmosphere and drink specials will keep you entertained all night long. Join us for live music every Saturday night and various events that we host throughout the week! Experience LG's by the Creek - Eat, Drink, and Chill LG's by the Creek is not just your run-of-the-mill bar and restaurant; it is a local friendly neighborhood watering hole where we will welcome you with open arms and are always eager to hear your stories. Whether you need a cold beer or delicious food, our team is here to provide the best possible service and atmosphere. So come on over and let us show you what LG's is all about! See the menu Welcome to the Clubhouse! Happy Hour 4-7PM Monday - Friday What's Happening Every Wednesday Free Trivia Think you know it all? Prove it! Free to play and win prizes every Saturday Live Music Lineup of various local bands playing live starting at 9 PM Every Sunday Brunch Join us every Sunday for brunch! LOCATION & HOURS 1005 Tanner Ford Blvd Hanahan SC, 29410 OPEN DAILY 11AM Till 2AM CONTACT lgsbythecreek.net 843-553-8046 Connect Follow us on social media bottom of page",
      "hash": "c8f8b23c7c11",
      "downloadedAt": "2026-01-18T17:00:04.569Z",
      "trimmedAt": "2026-01-18T17:11:47.658Z",
      "sizeReduction": "99.8%"
    }
  ],
  "sizeReduction": "99.7%"
}