{
  "venueId": "ChIJS_mGHRdx_ogRJxsj3M9cAsU",
  "venueName": "MIX",
  "venueArea": "Mount Pleasant",
  "website": "https://www.mix.life/",
  "scrapedAt": "2026-01-18T17:04:26.528Z",
  "trimmedAt": "2026-01-18T17:08:01.483Z",
  "pages": [
    {
      "url": "https://www.mix.life/",
      "text": "Skip to content Speakeasy Bar Check Out Our Step into our private Lebowski-Themed speakeasy, where “The Dude” himself would abide! Abide & Imbibe Go Outdoor Indoor Bars! and Rain or Shine, We’ve Got Your Buzz Covered! Check Out Our Menu Go Party the Patio! on Where the Sun Shines and the Fun Never Sets! Let's Play Some Games Go It's REMix Sunday! OPEN TODAY: 11:00AM–9:00PM Join us for Happy Hour! MON–FRI, 4PM–8PM: $2 off drafts, $4 wells, $5 John Dalys, 50% off wine, $1 wings, and $5 cheese pizza • Join us for Happy Hour! MON–FRI, 4PM–8PM: $2 off drafts, $4 wells, $5 John Dalys, 50% off wine, $1 wings, and $5 cheese pizza • DUCKPIN It’s like regular bowling, but with smaller balls and bigger bragging rights. Perfect for those who think size doesn’t matter—until you miss that spare by an inch. Come for the strikes, stay for the laughs, and leave your ego at the door! Roll With It Go GAMES We’ve got all kinds of wild ways to unleash your inner badass! Channel your inner lumberjack with our axe-throwing (no flannel required), dominate the high scores on our vintage arcade and pinball machines, or kick back with a drink and go big with our oversized yard games like giant pong. Trust us, boredom doesn’t stand a chance here! Level Up Go Weekly Specials + Promotions BOOKING FAQs Can I rent the entire venue? Yes!! When you opt for a venue buyout, you gain complete control over the space. A venue buyout allows you to customize every aspect of your event. From decor and layout to catering and entertainment, the possibilities are endless. Our dedicated event specialists will work closely with you from start to finish guiding you through the planning process and ensuring that every detail is executed flawlessly. With our expertise and attention to detail, you can relax and enjoy your event knowing that everything is taken care of. Can I bring outside food/drinks to MIX? No, we have a full-service restaurant here at MIX. We want this to be your new favorite hangout spot. We have a ton of huge TVs with all the popular games on, a variety of food options, and great beer/liquor selections. There will most definitely be something for everyone. If you’d like to have a special cake at your party or celebration, please contact us directly. Do you have private event space? Heck yeah! We have a Big Lebowski-Themed speakeasy that can handle up to 40 guests and comes with a private bar. You can also rent specific spaces within the venue. Where is MIX Located? You can find us at 730 Coleman Boulevard in Mt Pleasant, SC. Just 10 minutes from Downtown Charleston, 3 minutes from Shem Creek and 5 minutes from Sullivan’s Island. What games and experiences can I enjoy at Mix? We have a range of activities, including Duckpin Bowling, Pinball, new and Retro Arcade games, Axe Throwing. Foosball, Ping Pong, Patio Pong, and more. Do you have any age restrictions? Our venue is open to all ages, but we may, at times, require the kiddos to be escorted by an adult. Please check our social media pages for updates. Please note that our axe throwing is for guests 18 and older and all participants must have a waiver signed. Do you take lane reservations? Yes, please complete our events request form and our Event Sales Team will contact you. BOOKING FAQs Can I rent the entire venue? Yes!! When you opt for a venue buyout, you gain complete control over the space. A venue buyout allows you to customize every aspect of your event. From decor and layout to catering and entertainment, the possibilities are endless. Our dedicated event specialists will work closely with you from start to finish guiding you through the planning process and ensuring that every detail is executed flawlessly. With our expertise and attention to detail, you can relax and enjoy your event knowing that everything is taken care of. Can I bring outside food/drinks to MIX? No, we have a full-service restaurant here at MIX. We want this to be your new favorite hangout spot. We have a ton of huge TVs with all the popular games on, a variety of food options, and great beer/liquor selections. There will most definitely be something for everyone. If you’d like to have a special cake at your party or celebration, please contact us directly. Do you have private event space? Heck yeah! We have a Big Lebowski-Themed speakeasy that can handle up to 40 guests and comes with a private bar. You can also rent specific spaces within the venue. Where is MIX Located? You can find us at 730 Coleman Boulevard in Mt Pleasant, SC. Just 10 minutes from Downtown Charleston, 3 minutes from Shem Creek and 5 minutes from Sullivan’s Island. What games and experiences can I enjoy at Mix? We have a range of activities, including Duckpin Bowling, Pinball, new and Retro Arcade games, Axe Throwing. Foosball, Ping Pong, Patio Pong, and more. Do you have any age restrictions? Our venue is open to all ages, but we may, at times, require the kiddos to be escorted by an adult. Please check our social media pages for updates. Please note that our axe throwing is for guests 18 and older and all participants must have a waiver signed. Do you take lane reservations? Yes, please complete our events request form and our Event Sales Team will contact you. Ready To Party? Book now and get ready for a time so epic, you’ll be bragging about it for weeks! Go nuts with unlimited arcade action, claim your Duckpin lane like a boss, challenge your crew to an axe-throwing showdown, or take over the whole place for your own private party. Let’s make some memories (and maybe a few enemies) together! Book Now Our Hours MON–THURS: 3PM–10PM FRI: 3PM–11PM SAT: 11AM–11PM SUN: 11AM–9PM",
      "hash": "576bbfc77ef6",
      "downloadedAt": "2026-01-18T16:56:49.786Z",
      "trimmedAt": "2026-01-18T17:08:01.146Z",
      "sizeReduction": "98.8%"
    },
    {
      "url": "https://www.mix.life/food-drinks/",
      "text": "Skip to content Food & Drinks Happy Hour Monday–Friday: 4:00PM–8:00PM $2 Off Draft Beers | $4 Wells | $5 John Dalys | 50% off Wine | $1 Wings | $5 Cheese Pizza Fuel The Fun! Welcome to the only place where you can munch on epic food, sip on dangerously good cocktails, and still have a hand free to dominate the arcade, nail that bullseye, or crush a duckpin strike. Our menu is like a high score for your taste buds, and our drinks are the secret power-up you need to keep the fun going all night. Whether you’re recharging after some yard games on the patio or fueling up for an Guitar Hero showdown, our menu’s got the delicious edge to match the vibe. View Menu Go Download Menu Open Cocktails Go Beer Go Food Menu Drink Menu Shareables Appetizers Wings Handhelds Pizza Salads Kid's Menu Desserts Sides The Sampler chicken tenders | fried pickles | classic nachos | dipping sauces Pretzel Bites salt | queso | brewpub mustard Loaded Tots bacon | cheddar jack | scallions | sour cream Nachos Avalanche Pulled chicken | queso | pico de gallo | jalapenos | sour cream Parmesan Truffle Fries White truffle oil, truffle sea salt & parmesan cheese, drizzled with parmesan lime aioli Buffalo Chicken Quesadilla Shredded chicken | cheddar jack | pico de gallo | buffalo sauce | side of ranch Boiled Peanuts Locally sourced from salty dog peanuts Co. Fried Pickles Hand-breaded pickles served with our in-house mix sauce Crispy Cauliflower Hand breaded, buffalo sauce, scallions & ranch Fried Mozzarella Marinara sauce Steak + Cheese Eggrolls Hand-rolled | horseradish cream sauce Bone-In Wings Choice of sauce | dressing | celery Sauces: buffalo | bbq | garlic teriyaki | thai sweet chili Rubs: old bay | lemon pepper Boneless Tenders Choice of sauce | dressing | celery Sauces: buffalo | bbq | garlic teriyaki | thai sweet chili Rubs: old bay | lemon pepper Double Smash Two 1/4 pound smashed patties, American cheese, shredded romaine, sesame bun French Dip Shaved steak | provolone | sauteed onions | horseradish cream sauce | au jus | toasted roll Buffalo Chicken Wrap Crispy chicken | buffalo sauce | ranch dressing | romaine | tomato | onion Sausage Supreme Grilled sausage, peppers + onions | toasted roll Hot Honey Pepperoni Pepperoni | three cheese | red sauce | hot honey drizzle Three Cheese Three cheese | red sauce Vegetarian Mushrooms | green peppers | onions | three cheese | red sauce Chicken Bacon Ranch Grilled chicken | bacon | red onion | three cheese | ranch sauce Meat lovers Ground beef | bacon | pepperoni | sausage | three cheese | red sauce Buffalo Chicken romaine | crispy buffalo chicken | diced tomatoes | onions | blue cheese crumble | side of ranch Chopped Caesar Salad Romaine | grilled chicken | parmesan | caesar dressing | croutons Taco Bowl chopped romaine | ground beef | pico de gallo | tortilla chips | cheddar jack cheese | side of cajun ranch Hot Dog Ages 10 & under | french fries | kids drink Burger Sliders Ages 10 & under | french fries | kids drink Chicken Tenders Ages 10 & under | french fries | kids drink Kraft Mac + Cheese Ages 10 & under | french fries | kids drink Grilled Cheese Ages 10 & under | french fries | kids drink Brownie Sundae fudge brownie | chocolate or vanilla | ice cream | whipped cream | chocolate syrup | sprinkles | cherry Donut Dippers Hot glazed donut dippers with caramel & chocolate dipping sauces House Salad Caesar Salad Basket of French Fries Basket of Tator Tots Basket of Onion Rings OG Classics Seasonal Sips Giant Andre’s Beer Me Zero Proof Wines Crimson Crush bourbon | st germain | blood orange syrup | lemon juice | fee foam | pop rocks orange wheel Rockstar ‘Rita tequila | triple sec | lemonade | simple syrup | blueberry puree | lemon juice | pop rocks lime wheel | edible straw Spritz Me Up Aperol | peachtree | sparkling rosé | soda water | edible straw Twisted Childhood Deep eddy kool-aid vodka | lemonade | edible glitter | flight of three Pink Lightning vodka | ginger beer | watermelon puree | lime juice | rock candy stick Sangria Splash red or white | muddled cherries | muddled orange | watermelon liqueur | peach liqueur | oj | pineapple juice | starry Chameleon L.I.T. vodka | gin | tequila | rum | butterfly pea simple syrup | color changing lemon pipette Poolside Pop Deep eddy vodka | mango puree | pineapple juice | prosecco | aperol float | popsicle Melon Mayhem vodka | green apple liqueur | watermelon puree | lime juice | soda | green apple popping boba Calling Dr. Love cherry vodka | cherry liqueur | dr. pepper | sweet cream foam Tropical Tiki tequila | triple sec | fresh lime juice | mango puree | pineapple juice | coconut cream | pop rocks crusted lime wheel | edible straw Taste the Rainbow rum | watermelon liqueur | lime juice | soda water | airhead rainbow gummy Sun-Kissed Lager Corona | tequila | orange juice | grenadine Pool Party rum | lemon vodka | blue curacao | pineapple juice | fresh lemonade, | two popsicles + a duck Bear Necessities pineapple vodka | strawberry liqueur | lemon & lime | soda water | gummy bears Space Cadet vodka, | blue curacao | pineapple juice | cranberry juice | grenadine | fresh lemonade | edible glitter | green apple popping boba Electric Agave tequila | watermelon | mango | lime | soda water | edible straws | pop rock crusted limes PBR Tall Boy’s Ask your server/ bartender for our latest our beer lineup, packed with local gems and national classics on tap or in bottles/cans! Doc Strawberry dr pepper | strawberry puree | sweet cream float Sunbeam Sparkler soda water | pineapple juice | strawberry puree | lemon juice | popping passionfruit boba Italian Cream Soda soda water | choice of puree | sweet cream float GR Marchand Cabernet Red wine Spring St Pinot Noir Red wine Notebook Red Blend Red wine Greeting Merlot Red wine Bonanno Chardonnay White wine Pasaqua Pinot Grigio White wine Band of Roses Rosé White wine Nobilo Sauvignon Blanc White wine Cupcake Prosecco White wine Weekly Specials Check Out More Events Go Saturday All Day College Football Specials $1 dollar wings* (min 6 of bone-in or boneless) | $2.50 PBR tall boys *only available during NCAA football games Monday–Friday 4:00PM–8:00PM Happy Hour Cheers! 🍻 Come in Monday through Friday from 4 to 8 pm and enjoy our Happy Hour! $2 off drafts | $4 wells | $5 John Dalys | 50% off wine | $1 wings | $5 cheese pizza *MIX Daily Specials are not valid during any holidays or School Vacation weeks. Certain restrictions apply. Price does not include tax. Activity time is limited to space availability. MIX reserves the right to place up to 6 people per lane. Lane time may be limited to one game based on availability. Not valid with any other offer or group reservations Check Out More Events Go Party On The Patio Whether it’s our free-to-play yard games, drinks at the outdoor bar, or dining al fresco, our patio has something for everyone! Yard Games Go Ready To Party? Book now and get ready for a time so epic, you’ll be bragging about it for weeks! Go nuts with unlimited arcade action, claim your Duckpin lane like a boss, challenge your crew to an axe-throwing showdown, or take over the whole place for your own private party. Let’s make some memories (and maybe a few enemies) together! Book Now",
      "hash": "64f7a3184144",
      "downloadedAt": "2026-01-18T16:56:51.390Z",
      "trimmedAt": "2026-01-18T17:08:01.482Z",
      "sizeReduction": "98.9%"
    }
  ],
  "sizeReduction": "98.9%"
}