{
  "venueId": "ChIJ2Tz5Shhx_ogRWzT5SMTCUTo",
  "venueName": "Bodega Mt. Pleasant",
  "venueArea": "Mount Pleasant",
  "website": "https://www.eatdrinkbodega.com/",
  "scrapedAt": "2026-01-18T17:04:23.235Z",
  "trimmedAt": "2026-01-18T17:04:48.764Z",
  "pages": [
    {
      "url": "https://www.eatdrinkbodega.com/mt-pleasant-menus/",
      "text": "Main content starts here, tab to start navigating Mt Pleasant Menus Food Menu Café Menu Cocktails Kid's Menu Catering Menu Food Menu Breakfast Sammies & Toasts The Bodega Classic Runny egg*, American, kaiser roll Add: bacon, breakfast sausage, chorizo, taylor ham, cold smoked salmon, vegan breakfast sausage, avocado Add: bacon, breakfast sausage, taylor ham, smoked salmon, vegan breakfast sausage, pastrami, avocado 3 $ Bodega Platter Two eggs* any style, bacon, home fries, sourdough toast The Cow Double bacon, fried egg*, American, home fries, ketchup, hot sauce, kaiser roll Lowcountry Breakfast sausage, fried egg*, cheddar, sausage gravy, kaiser roll Avocado Toast Avocado spread, radish, cucumber, microgreens, chili oil, sourdough Add egg* 2 $ Salmon Toast Smoked salmon, boursin, capers, red onion, everything bagel seasoning, sourdough Add egg* 2 $ Pancakes & Sweets Cinnie Sticks Cinnamon Toast Crunch breaded challah, maple pudding dipping sauce Short Stack 2 buttermilk pancakes Add: Blueberries or Chocolate chips Candy Shoppe Pancakes 3 buttermilk pancakes, the candy shelf, whipped cream, chocolate syrup PB&J Pancakes 3 buttermilk pancakes, peanut butter sauce, mixed berry jam, fresh fruit, powdered sugar Big Apple Pancakes 3 buttermilk pancakes, cinnamon apple compote, candied pecans, whipped cream, caramel sauce Affogato Espresso poured over your favorite ice cream from our freezer Sub vegan cheese, gluten-free bread, gluten-free pancakes, or gluten-free chicken cutlet $1 Dietary Restrictions? Deli Sammies Diner Club Turkey, bacon, Swiss, shredded lettuce, tomato, avocado, chipotle aioli, seeded hoagie roll Arthur Ave Prosciutto, salami, capicola, fresh mozzarella, provolone, tomato, red onion, oregano vinaigrette, shredded lettuce, calabrian chili relish, seeded hoagie roll Chick Flick Rosemary chicken salad, mixed greens, candied nuts, mixed berry jam, kaiser roll Caprese Burrata, tomato, roasted pepper, pesto, balsamic glaze, seeded hoagie roll Add: cutlet, buffalo cutlet or cold smoked salmon 4 $ BLT Double bacon, tomato, shredded lettuce, tomato aioli, sourdough Add: cutlet, buffalo cutlet or cold smoked salmon 4 $ Hummus Wrap Hummus, roasted peppers, cucumbers, radish, tomato, mixed greens, balsamic glaze, oregano vinaigrette Chopped Cheese Ground beef, grilled onions, cheddar, white american, tomato, shredded lettuce, 'dega sauce, kaiser roll All served over home fries Bowls Balance Bowl Home fries, vegan sausage, egg white*, spinach, tomato, pesto Cheat Day Bowl Home fries, sausage gravy, sausage patty, fried egg*, cheddar jack The Cali Bowl Chorizo, home fries, cheddar jack, scrambled egg, avocado, pico de gallo, chipotle aioli All cutlets available are dipped in buffalo sauce. Substitute to eggplant cutlet $1.00 Chicken Cutlet Sammies The Gropfather Cutlet, fresh mozzarella, provolone, pesto, spicy nduja, seeded hoagie roll The Parm Cutlet, marinara, fresh mozzarella, parmesan, garlic bread The Cardini Cutlet, fresh mozzarella, parmesan, shredded lettuce, caesar dressing, garlic bread The CBB Cutlet, bacon, burrata, mixed greens, roasted tomato aioli, seeded hoagie roll The Calabrese Cutlet, prosciutto, pepperoni, salami, double fresh mozz, roasted pepper, lettuce, calabrian chili relish, oregano vinaigrette, seeded hoagie roll The Frat Boy Buffalo dipped cutlet, cheddar jack, coleslaw, seeded hoagie roll *consuming raw or undercooked meats, poultry, seafood, shellfish, or eggs may increase your risk of foodborne illness. Café Menu Classics Drip Coffee Cold Brew Latte Espresso Cortado Cappuccino Shaken Espresso Hot Tea Chai Latte Matcha Latte House Hits Latte's Favorite Cookie Oreo ganache, espresso, vanilla foam, cookie crumbs, choice of milk Cereal Milk Cold Brew Cinnamon Toast Crunch cereal milk, cold brew, whipped cream, cereal crumbs Strawberry Matcha Green tea matcha, vanilla syrup, strawberry cold foam, choice of milk Coffee Palmer Cold brew, lemonade Nutella Shaken Espresso Nutella, espresso, shaken over ice Hibiscus Jammer Hibiscus tea, strawberry puree, vanilla cold foam, choice of milk PB&J Latte peanut butter syrup, espresso, strawberry cold foam, choice of milk Samoa' That Coconut Cold Brew, Salted Caramel Cold Foam, Chocolate Drizzle, Choice of Milk Rich vanilla - sugar free vanilla - caramel - hazelnut - chocolate - white chocolate - coconut - lavender - nutella - oreo - brown sugar cinnamon Syrup Flavors Vanilla • Dairy-Free Vanilla • Strawberry • Salted Caramel • Seasonal Cold Foam Flavors Slushies Coke 6 $ Lemonade 6 $ Red Bull Frozen 6 $ Cocktails Signature Cocktails Bloody Mary White claw vodka, Charleston mix bold and spicy, pickle juice, bacon, Old Bay rim make it flamin' hot! Mimosa Choice of: fresh squeezed oj, mango, strawberry, grapefruit, or peach Espresso Martini Early bird cold brew vodka, counter culture brew, Mr. black coffee liqueur, chocolate bitters add a cold foam! Aperol Spritz Choice of: fresh squeezed OJ, mango, strawberry, grapefruit, or peach For the Kids All items $6.00All sandwiches served on a kaiser roll Kid's Menu Bacon, Egg, and Cheese Bacon, fried egg*, white american cheese Chicken Salad Chicken salad, mixed greens BLT Bacon, lettuce, tomato, mayo Turkey LTO Turkey, lettuce, tomato, red onion Turkey Ched Turkey, cheddar PBJ Peanut butter, mixed berry jam Grilled Cheese Cheddar, white american cheese Catering Menu The below items need to be ordered 48 hours in advance. A La Carte Egg Sandwich Choice of: bacon, sausage, or vegan sausage Choice of: eggs over hard or scrambled american cheese, kaiser roll Egg Burrito Choice of: bacon, sausage, chorizo or vegan sausage scrambled eggs, cheddar jack, home fries, pico de gallo, chipotle aioli, pressed tortilla Yogurt Parfait Greek yogurt, mixed berry jam, mixed berries, honey granola Apple Pie Overnight Oats Cinnamon oat milk oats, apple compote, honey granola Chocolate Strawberry Chia Pudding Dark chocolate chia pudding, strawberry, almond, mixed fruit cup Assorted Pastries Rotating assortment of muffins, cookies, and donuts Priced for 10 ppl For the Group Scrambled Eggs Bacon Sausage Patties Home Fries Loaded Home Fries Cheddar Jack, sausage gravy, scallions Smoked Salmon Platter Smoked salmon, hard boiled egg, tomato, avocado, red onion, capers, boursin, cream cheese, crostinis Pancakes Buttermilk pancakes, pure maple syrup, butter Assorted Sweet Pastries Assorted Savory Pastries Add-ons: Ranch • Chipotle Aioli • Tomato Aioli • Homemade Pickles • Calabrian Chili Relish $5 Bacon • Fresh Mozzarella $10 Add Chips & A Soda or Water $25 Sandwiches $0.50 to wrap all sandwiches in halves A La Carte Diner Club Turkey, bacon, Swiss, shredded lettuce, tomato, avocado, chipotle aioli, seeded hoagie roll Arthur Ave Prosciutto, salami, capicola, fresh mozzarella, provolone, tomato, red onion, oregano vinaigrette, shredded lettuce, calabrian chili relish, seeded hoagie roll Chick Flick Rosemary chicken salad, mixed greens, candied nuts, mixed berry jam, kaiser roll Caprese Burrata, tomato, roasted pepper, pesto, balsamic glaze, seeded hoagie roll Add: cutlet, buffalo cutlet or cold smoked salmon BLT Double bacon, tomato, shredded lettuce, tomato aioli, sourdough Add: cutlet, buffalo cutlet or cold smoked salmon Hummus Wrap Hummus, roasted peppers, cucumbers, radish, tomato, mixed greens, balsamic glaze, oregano vinaigrette The Parm Cutlet, marinara, fresh mozzarella, parmesan, garlic bread The Bodega Smash Burger 2oz beef patty, cheddar, pickle, shaved onion, ‘dega sauce, potato bun Each tray comes with 10 x 2 in sandwiches. All trays are served with individually packaged salt & pepper, oil & vinegar, and mayo & mustard packets For the Group Turkey & Swiss - Lto Ham & Cheddar - Lto Italian & Provolone - Lto Chicken Salad - Lto Tuna Salad - Lto Bacon & Avocado - Lto Roasted Pepper & Provolone - Lto Includes cups Coffee’s including sugar and half & half (oat milk +$3.00) Drink Menu Hot Coffee Cold Brew Classic Lemonade Strawberry Lemonade Vanilla Limeade Sweet Tea Arnold Palmer Coffee Palmer Fresh Squeeze Orange Juice Cocktail Kits Mimosa Kit One bottle of champagne. Choice of juice: orange, strawberry, grapefruit, mango, peach Bloody Mary Kit Charleston bloody mary mix, olives, bacon, citrus wedges, tabasco, tajín *Vodka not included Espresso Martini Kit Bodega’s signature espresso martini base, beans for garnishing *Vodka not included Salads Mixed Greens Mixed greens, tomato, red onion, cucumber. Choice of dressing: ranch, lemon vinaigrette, Caesar, green goddess, oregano vinaigrette Farmer’s Market Bowl Spinach, quinoa, tomato, cucumber, avocado, radish, lemon vinaigrette Caprese Arugula, tomato, fresh mozzarella, red onion, pesto, balsamic glaze Caesar Romaine, kitchen sink croutons, parmesan, caesar dressing Harvest Mixed greens, farro, butternut squash, dried cranberries, candied pecans, red onion, goat cheese, green goddess dressing Spinach Spinach, goat cheese, candied pecans, mixed berries, red onion, lemon vinaigrette Chopped Chopped greens, salami, pepperoni, prosciutto, fresh mozzarella, red onion, tomato, olives, oregano vinaigrette Sides Deviled Egg Potato Salad Celery, egg, pickle, mayo, paprika Loaded Potato Salad Sour cream, cheddar, bacon, scallions BLT Macaroni Salad Bacon, lettuce, tomato, scallions, ranch Pesto Tortellini Salad Tortellini, pesto, roasted tomato, red onion, fresh mozzarella Arthur Ave Pasta Salad Cavatappi, prosciutto, salami, peperoni, fresh mozzarella, provolone, lettuce, tomato, onion, red wine vinaigrette Chili Cucumber & Radish Salad Cucumber, radish, scallion, chili crunch, sesame Truffle Brussels Sprout Slaw Brussels, parm, caramelized onions, sunflower seeds, truffle vin Broccoli Salad Chopped broccoli, bell peppers, red onion, carrot, dried cranberries, sunflower seeds, creamy dressing Coleslaw Creamy dressing Assorted Chips Veggie Entrée Options Vegan Rigatoni Bolognese Beyond beef bolognese, rigatoni, vegan cheese sauce Baked Ziti Penne, marinara, fresh mozzarella, parmesan, basil Eggplant Parmesan Crispy eggplant cutlet, marinara, fresh mozz, parmesan. Substitute vegan cheese Three Cheese Mac N’ Cheese Three cheese blend, cavatappi, garlic bread crumbs Vegan Mac N’ Cheese Vegan cheese sauce Rice Pilaf Long grain rice, orzo, white wine, parsley Steamed Green Beans Butter, slivered almonds Meat Entrée Options Creamy Pesto Chicken Rigatoni Olive oil poached chicken, peas, pesto, cream Penne a La Vodka Bacon vodka sauce, grilled chicken, onions Chicken Parmesan Crispy chicken cutlet, marinara, fresh mozz, parmesan. Substitute vegan cheese BBQ Chicken Mac N’ Cheese Three-cheese blend, cavatappi, BBQ chicken nuggets Grilled Chicken Chicken breast, garlic & herb marinated Lasagna Bolognese Beef and pork bolognese, rigatoni, ricotta, parsley Spaghetti & Meatballs Beef meatballs, marinara, parmesan Chicken Nuggets Hand-breaded chicken nuggets. Choice of: ranch, BBQ, or honey mustard Sausage, Peppers & Onions Italian sausage, sautéed onions & peppers Shrimp & Lemon Spaghetti Capers, sundried tomatoes, spinach, white wine beurre blanc Extra Services Off-Site Chafing Trays with Sterno Includes water pan, sternos, and metal chafing dish Dinnerware Includes dinner plates, salad bowls, cutlery kits, and dinner napkins Per person Sandwich to Be Wrapped in Halves Per sandwich Order Online Email Signup Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "47949a2f47ed",
      "downloadedAt": "2026-01-18T16:55:49.425Z",
      "trimmedAt": "2026-01-18T17:04:48.696Z",
      "sizeReduction": "90.3%"
    },
    {
      "url": "https://www.eatdrinkbodega.com/downtown-private-events/",
      "text": "Main content starts here, tab to start navigating Downtown Private Events Book an Event Looking for the perfect venue to host your next private event? Look no further! We offer an exquisite setting for all your special occasions. Whether you're planning a corporate gathering, a milestone celebration, or an intimate social event, our versatile spaces and exceptional service will make your event unforgettable. For all inquiries, please fill out the form below and we’ll be in touch soon. Inquire Now Order Online Email Signup Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Private Event Software powered by Tripleseat",
      "hash": "5266551c68b3",
      "downloadedAt": "2026-01-18T16:55:49.968Z",
      "trimmedAt": "2026-01-18T17:04:48.699Z",
      "sizeReduction": "97.6%"
    },
    {
      "url": "https://www.eatdrinkbodega.com/private-events/",
      "text": "Main content starts here, tab to start navigating Downtown Private Events Book an Event Looking for the perfect venue to host your next private event? Look no further! We offer an exquisite setting for all your special occasions. Whether you're planning a corporate gathering, a milestone celebration, or an intimate social event, our versatile spaces and exceptional service will make your event unforgettable. For all inquiries, please fill out the form below and we’ll be in touch soon. Inquire Now Order Online Email Signup Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Private Event Software powered by Tripleseat",
      "hash": "5748732c8597",
      "downloadedAt": "2026-01-18T16:55:50.741Z",
      "trimmedAt": "2026-01-18T17:04:48.702Z",
      "sizeReduction": "97.6%"
    },
    {
      "url": "https://www.eatdrinkbodega.com/",
      "text": "Home Main content starts here, tab to start navigating Slide 1 of 10 Slide 2 of 10 Slide 3 of 10 Slide 4 of 10 Slide 5 of 10 Slide 6 of 10 Slide 7 of 10 Slide 8 of 10 Slide 9 of 10 Slide 10 of 10 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Welcome to Bodega is a true “can’t miss” whether it be dining at one of our two locations, a day on the boat, or a lazy Sunday on the couch! For those looking for a nice morning pick me up, our coffee program is 2nd to none! Choose your Bodega Mt Pleasant Downtown Charleston Our Story For those that grew up in the New York/metropolitan area, there is nothing more nostalgic than a good ole fashioned “Bodega” breakfast sandwich on a warm kaiser roll. Executive Chef Alec Gropman brings his childhood favorite to life with a menu full of old school brunch staples, some with a Charleston twist! Catering Let us cater your next event! Inquire Now Skip the line! Order from either of our locations for pick up or delivery! Order Online Swag! Give a gift card to a friend so they can treat you to a night of good food and drinks! Share the Love Follow along @eatdrinkbodega Order Online Email Signup Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "75ed90d28533",
      "downloadedAt": "2026-01-18T16:55:47.804Z",
      "trimmedAt": "2026-01-18T17:04:48.713Z",
      "sizeReduction": "97.9%"
    },
    {
      "url": "https://www.eatdrinkbodega.com/location/bodega-mt-pleasant/",
      "text": "Main content starts here, tab to start navigating Hours & Location 414 W Coleman Blvd, Mount Pleasant, SC 29429 (843) 891-6300 info@eatdrinkbodega.com Hours: Everyday 7AM - 3PM Get Directions Order Online Email Signup Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "a9d81898903c",
      "downloadedAt": "2026-01-18T16:55:48.896Z",
      "trimmedAt": "2026-01-18T17:04:48.716Z",
      "sizeReduction": "98.4%"
    },
    {
      "url": "https://www.eatdrinkbodega.com/downtown-menus/",
      "text": "Main content starts here, tab to start navigating Downtown Menus From the Kitchen From the Café From the Bar Kid's Menu Beer Menu Catering Menu From the Kitchen Executive chef & partner Alec Gropman Bodega Plate Two Eggs* Any Style, Bacon, Homefries, Sourdough Toast Breakfast Sammies & Toasts The Bodega Classic Runny egg*, American, kaiser roll Add: bacon, breakfast sausage, chorizo, taylor ham, cold smoked salmon, vegan breakfast sausage, avocado Add: bacon, breakfast sausage, taylor ham, smoked salmon, vegan breakfast sausage, pastrami, avocado 3 $ The Cow Double bacon, fried egg*, American, home fries, ketchup, hot sauce, kaiser roll Lowcountry Breakfast sausage, fried egg*, cheddar, sausage gravy, kaiser roll Avocado Toast Avocado spread, radish, cucumber, microgreens, chili oil, sourdough Add egg* 2 $ Salmon Toast Smoked salmon, boursin, capers, red onion, everything bagel seasoning, sourdough Add egg* 2 $ All pancakes are available as GF $1 Pancakes & Sweets Cinnie Sticks Cinnamon Toast Crunch breaded challah, maple pudding dipping sauce Candy Shoppe Pancakes 3 buttermilk pancakes, the candy shelf, whipped cream, chocolate syrup Big Apple Pancakes 3 buttermilk pancakes, cinnamon apple compote, candied pecans, whipped cream, caramel sauce PB&J Pancakes 3 buttermilk pancakes, peanut butter sauce, mixed berry jam, fresh fruit, powdered sugar *Consuming raw or undercooked meats, poultry, seafood, shellfish or eggs may increase your risk of foodborne illness. Lunch Sammies Diner Club Turkey, bacon, Swiss, shredded lettuce, tomato, avocado, chipotle aioli, seeded hoagie roll Arthur Ave Prosciutto, salami, capicola, fresh mozzarella, provolone, tomato, red onion, oregano vinaigrette, shredded lettuce, calabrian chili relish, seeded hoagie roll Chick Flick Rosemary chicken salad, mixed greens, candied nuts, mixed berry jam, kaiser roll The Gropfather Chicken cutlet, fresh mozz, provolone, pesto, nduja, seeded hoagie roll Chopped Cheese Ground beef, grilled onions, cheddar, white american, tomato, shredded lettuce, 'dega sauce, kaiser roll Ryan's Reuben Pastrami, sauerkraut, Swiss, Bo's special sauce, rye The Gropmother Eggplant cutlets, vegan cheese, basil, vegan nduja, seeded hoagie roll The CBB Cutlet, bacon, burrata, mixed greens, roasted tomato aioli, seeded hoagie roll The Parm Cutlet, marinara, fresh mozzarella, parmesan, garlic bread Bowls Salads Cheat Day Bowl Home fries, sausage gravy, sausage patty, fried egg*, cheddar jack Balance Bowl Home fries, vegan sausage, egg white*, spinach, tomato, pesto The Cali Bowl Chorizo, home fries, cheddar jack, scrambled egg, avocado, pico de gallo, chipotle aioli Farmer's Market Bowl Quinoa, cucumber, avocado, tomato, spinach, radish, lemon vinaigrette Add grilled chicken 5 $ Chicken cutlet 6 $ Smoked salmon 8 $ Caesar Salad Romaine, Caesar dressing, parmesan, kitchen sink croutons Add grilled chicken 5 $ Chicken cutlet 6 $ Smoked salmon 8 $ Mixed Greens Salad Cucumber, tomato, red onion, choice of dressing (oregano vinaigrette, lemon vinaigrette, ranch, Caesar) Add grilled chicken 5 $ Chicken cutlet 6 $ Smoked salmon 8 $ Spinach Salad Goat cheese, mixed berries, candied pecans, red onion, lemon vinaigrette Add grilled chicken 5 $ Chicken cutlet 6 $ Smoked salmon 8 $ Parfait Bowl Greek yogurt, mixed berry jam, fresh berries, granola From the Café Open daily8AM - 4PM House Hits Latte's Favorite Cookie Oreo ganache, espresso, vanilla foam, cookie crumbs, choice of milk Cereal Milk Cold Brew Cinnamon Toast Crunch cereal milk, cold brew, whipped cream, cereal crumbs Nutella Shaken Espresso Nutella, espresso, shaken over ice Coffee Palmer Cold brew, lemonade Strawberry Matcha Green tea matcha, vanilla syrup, strawberry cold foam, choice of milk Hibiscus Jammer Hibiscus tea, strawberry puree, vanilla cold foam, choice of milk Reese’s Hot Chocolate Peanut butter syrup, chocolate ganache, choice of milk Ask your server for current offerings Rotating Frozens & Lemonades Classics Bodega Brew Cold Brew Espresso Cortado Cappuccino Latte Matcha Latte Chai Latte Shaken Espresso Tea Service Jasmine green, earl grey, hibiscus ginger, English breakfast, peach. Choice of iced or hot Rich vanilla - sugar free vanilla caramel - hazelnut - chocolate ganache coconut - lavender - nutella - oreo brown sugar cinnamon Syrup Flavors From the Bar Breakfast Martinis Espresso Martini Early bird cold brew vodka, counter culture brew, black river coffee liqueur, chocolate bitters, cocoa powder Vanilla Latte Martini Pearl vanilla vodka, carolyn's cold brew liquor, half and half, vanilla sugar Cookies & Cream Martini Pearl vanilla vodka, chocolate bitters, white chocolate ganache, half & half, oreo sidecar French Toast Martini Fireball whisky, butterscotch schnapps, cereal milk, maple syrup, french toast stick Strawberry Lemonade Martini Firefly lemonade vodka, strawberry puree, lemon juice, strawberry sugar Vitamin C Martini Tanqueray gin, grand marnier, lemon juice, orange marmalade Pickle Martini Tanqueray gin, dry vermouth, celery bitters, pickle juice Shooters Teeny Espresso Tini Our signature espresso martini, just bite-sized Irish Breakfast Tullamore D.E.W., butterscotch schnapps, fresh OJ, bacon Fluffernutter Screwball peanut butter whiskey, peanut butter syrup, toasted marshmallow Sour patch Watermelon schnapps, lime vodka, strawberry sugar lime Super Chill & Refreshing Frozens Espresso Martini Our signature espresso martini, frozen and topped with whipped cream and chocolate syrup Margarita CHS margarita mix, lunazul tequila, sour mix, lime juice Signature Cocktails Mt. P Tea Tito's handmade vodka, iced tea, lemon juice, mixed berry jam Bloody Mary White claw vodka, Charleston mix bold and spicy, pickle juice, bacon, Old Bay rim make it flamin' hot! Signature Mimosa Choice of: fresh-squeezed OJ, passionfruit-mango, strawberry, grapefruit S'mores Irish Coffee Graham cracker-infused Tullamore Dew, chocolate syrup, hot coffee, whipped cream, toasted marshmallow Spicy Breakfast Paloma Ghost tequila, grand marnier, grapefruit juice, agave, lime juice, tajin rim The Central Park Hendricks gin, st. germaine, lemon juice, basil green juice, soda Captain Corner Store Kool-Aid infused Captain Morgan rum, Luxardo, Mexican coke Smoking Section Bacon fat-infused Elijah Craig bourbon, maple syrup, and orange bitters Large format cocktails meant for a group Sharing is Caring Espresso Not so Tini Our signature espresso martini, just not so tini Aperol Punch Aperol, orange smirnoff, fruit punch, high noon Mega Mimosa 2 bottles of prosecco with a choice of our signature mimosa flavors For the Kids All items $6.00Available for children 12 & underAll sandwiches served on a kaiser roll Kid's Menu Bacon, Egg, and Cheese Bacon, fried egg*, white american cheese Chicken Salad Chicken salad, mixed greens BLT Bacon, lettuce, tomato, mayo Turkey LTO Turkey, lettuce, tomato, red onion Turkey Ched Turkey, cheddar PBJ Peanut butter, mixed berry jam Pancakes Plain pancakes, maple sy Beer Menu All beers cold, all beers local Drafts Tropicalia Creature comforts • Athens, GA • 6.6% ABV. Ripe & Juicy IPA Lofi Mexican Lager Lofi Brewing • CHS, SC • 5% ABV. Light & crushable Mexican-style lager Guinness St. James Gate Brewery • Dublin, Ireland • 4.2% ABV. Dry Irish Stout Blood Orange Cider Austin Eastciders • Austin, TX • 5% ABV. Bittersweet, crisp, raspberry, grapefruit Trop Hop Kings Calling Brewing • CHS, SC • 6.1% Tropical infused IPA from \"That Guy\" on \"That Show\" Wicked Hazy IPA Boston Beer Co. • Boston, MA • 6.8% Fruity New England-style IPA Miller High Life Pony | Red Stripe | Pacifico Coors Light | Corona Premier | Magners Irish Cider Dominga | Fruit Smash | Island Active Sycamore Rotating | Estrella Michelob Ultra | Bud Light | Athletic N/A Everyday Buys White Claw | Truly | High Noon Sun Sips Long Drink | Volley Tequila Seltzer Surfside Iced Tea + Vodka | Deep Bay | Loverboy Seltzers & Canned Cocktails Porch Pounders Munkle Pilsner Charleston, SC – 5.1% ABV. Crisp Pilsner Coast Kölsch N. Charleston, SC – 4.8% ABV. Dry, Wine-Like Kölsch Westbrook One Claw Charleston, SC – 5.5% ABV. Zesty & Tropical Pale Ale Wicked Weed Sour Burst Asheville, NC – 4.5% ABV. Dragonfruit and watermelon flavored sour Rotating Sycamore IPA Asheville, NC. Ask Bartender Catering Menu The below items need to be ordered 48 hours in advance. A La Carte Egg Sandwich Choice of: bacon, sausage, or vegan sausage Choice of: eggs over hard or scrambled american cheese, kaiser roll Egg Burrito Choice of: bacon, sausage, chorizo or vegan sausage scrambled eggs, cheddar jack, home fries, pico de gallo, chipotle aioli, pressed tortilla Yogurt Parfait Greek yogurt, mixed berry jam, mixed berries, honey granola Apple Pie Overnight Oats Cinnamon oat milk oats, apple compote, honey granola Chocolate Strawberry Chia Pudding Dark chocolate chia pudding, strawberry, almond, mixed fruit cup Assorted Pastries Rotating assortment of muffins, cookies, and donuts Priced for 10 ppl For the Group Scrambled Eggs Bacon Sausage Patties Home Fries Loaded Home Fries Cheddar Jack, sausage gravy, scallions Smoked Salmon Platter Smoked salmon, hard boiled egg, tomato, avocado, red onion, capers, boursin, cream cheese, crostinis Pancakes Buttermilk pancakes, pure maple syrup, butter Assorted Sweet Pastries Assorted Savory Pastries Add-ons: Ranch • Chipotle Aioli • Tomato Aioli • Homemade Pickles • Calabrian Chili Relish $5 Bacon • Fresh Mozzarella $10 Add Chips & A Soda or Water $25 Sandwiches $0.50 to wrap all sandwiches in halves A La Carte Diner Club Turkey, bacon, Swiss, shredded lettuce, tomato, avocado, chipotle aioli, seeded hoagie roll Arthur Ave Prosciutto, salami, capicola, fresh mozzarella, provolone, tomato, red onion, oregano vinaigrette, shredded lettuce, calabrian chili relish, seeded hoagie roll Chick Flick Rosemary chicken salad, mixed greens, candied nuts, mixed berry jam, kaiser roll Caprese Burrata, tomato, roasted pepper, pesto, balsamic glaze, seeded hoagie roll Add: cutlet, buffalo cutlet or cold smoked salmon BLT Double bacon, tomato, shredded lettuce, tomato aioli, sourdough Add: cutlet, buffalo cutlet or cold smoked salmon Hummus Wrap Hummus, roasted peppers, cucumbers, radish, tomato, mixed greens, balsamic glaze, oregano vinaigrette The Parm Cutlet, marinara, fresh mozzarella, parmesan, garlic bread The Bodega Smash Burger 2oz beef patty, cheddar, pickle, shaved onion, ‘dega sauce, potato bun Each tray comes with 10 x 2 in sandwiches. All trays are served with individually packaged salt & pepper, oil & vinegar, and mayo & mustard packets For the Group Turkey & Swiss - Lto Ham & Cheddar - Lto Italian & Provolone - Lto Chicken Salad - Lto Tuna Salad - Lto Bacon & Avocado - Lto Roasted Pepper & Provolone - Lto Includes cups Coffee’s including sugar and half & half (oat milk +$3.00) Drink Menu Hot Coffee Cold Brew Classic Lemonade Strawberry Lemonade Vanilla Limeade Sweet Tea Arnold Palmer Coffee Palmer Fresh Squeeze Orange Juice Cocktail Kits Mimosa Kit One bottle of champagne. Choice of juice: orange, strawberry, grapefruit, mango, peach Bloody Mary Kit Charleston bloody mary mix, olives, bacon, citrus wedges, tabasco, tajín *Vodka not included Espresso Martini Kit Bodega’s signature espresso martini base, beans for garnishing *Vodka not included Salads Mixed Greens Mixed greens, tomato, red onion, cucumber. Choice of dressing: ranch, lemon vinaigrette, Caesar, green goddess, oregano vinaigrette Farmer’s Market Bowl Spinach, quinoa, tomato, cucumber, avocado, radish, lemon vinaigrette Caprese Arugula, tomato, fresh mozzarella, red onion, pesto, balsamic glaze Caesar Romaine, kitchen sink croutons, parmesan, caesar dressing Harvest Mixed greens, farro, butternut squash, dried cranberries, candied pecans, red onion, goat cheese, green goddess dressing Spinach Spinach, goat cheese, candied pecans, mixed berries, red onion, lemon vinaigrette Chopped Chopped greens, salami, pepperoni, prosciutto, fresh mozzarella, red onion, tomato, olives, oregano vinaigrette Sides Deviled Egg Potato Salad Celery, egg, pickle, mayo, paprika Loaded Potato Salad Sour cream, cheddar, bacon, scallions BLT Macaroni Salad Bacon, lettuce, tomato, scallions, ranch Pesto Tortellini Salad Tortellini, pesto, roasted tomato, red onion, fresh mozzarella Arthur Ave Pasta Salad Cavatappi, prosciutto, salami, peperoni, fresh mozzarella, provolone, lettuce, tomato, onion, red wine vinaigrette Chili Cucumber & Radish Salad Cucumber, radish, scallion, chili crunch, sesame Truffle Brussels Sprout Slaw Brussels, parm, caramelized onions, sunflower seeds, truffle vin Broccoli Salad Chopped broccoli, bell peppers, red onion, carrot, dried cranberries, sunflower seeds, creamy dressing Coleslaw Creamy dressing Assorted Chips Veggie Entrée Options Vegan Rigatoni Bolognese Beyond beef bolognese, rigatoni, vegan cheese sauce Baked Ziti Penne, marinara, fresh mozzarella, parmesan, basil Eggplant Parmesan Crispy eggplant cutlet, marinara, fresh mozz, parmesan. Substitute vegan cheese Three Cheese Mac N’ Cheese Three cheese blend, cavatappi, garlic bread crumbs Vegan Mac N’ Cheese Vegan cheese sauce Rice Pilaf Long grain rice, orzo, white wine, parsley Steamed Green Beans Butter, slivered almonds Meat Entrée Options Creamy Pesto Chicken Rigatoni Olive oil poached chicken, peas, pesto, cream Penne a La Vodka Bacon vodka sauce, grilled chicken, onions Chicken Parmesan Crispy chicken cutlet, marinara, fresh mozz, parmesan. Substitute vegan cheese BBQ Chicken Mac N’ Cheese Three-cheese blend, cavatappi, BBQ chicken nuggets Grilled Chicken Chicken breast, garlic & herb marinated Lasagna Bolognese Beef and pork bolognese, rigatoni, ricotta, parsley Spaghetti & Meatballs Beef meatballs, marinara, parmesan Chicken Nuggets Hand-breaded chicken nuggets. Choice of: ranch, BBQ, or honey mustard Sausage, Peppers & Onions Italian sausage, sautéed onions & peppers Shrimp & Lemon Spaghetti Capers, sundried tomatoes, spinach, white wine beurre blanc Extra Services Off-Site Chafing Trays with Sterno Includes water pan, sternos, and metal chafing dish Dinnerware Includes dinner plates, salad bowls, cutlery kits, and dinner napkins Per person Sandwich to Be Wrapped in Halves Per sandwich Order Online Email Signup Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "aff848dd3432",
      "downloadedAt": "2026-01-18T16:55:48.369Z",
      "trimmedAt": "2026-01-18T17:04:48.761Z",
      "sizeReduction": "89.5%"
    },
    {
      "url": "https://www.eatdrinkbodega.com/location/bodega-charleston/",
      "text": "Main content starts here, tab to start navigating Hours & Location 23 Ann St, Charleston, SC 29403 (843) 297-4772 info@bodegachs.com Hours: Sunday - Thursday 8AM - 4PM Friday - Saturday 8AM - 4PM, 10PM - 2AM Get Directions Order Online Email Signup Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "d4c61964ee50",
      "downloadedAt": "2026-01-18T16:55:47.845Z",
      "trimmedAt": "2026-01-18T17:04:48.764Z",
      "sizeReduction": "98.3%"
    }
  ],
  "sizeReduction": "93.6%"
}