{
  "venueId": "ChIJ16f1dMJ7_ogR4EcwXU40RoU",
  "venueName": "Mellow Mushroom Charleston - West Ashley",
  "venueArea": "West Ashley",
  "website": "https://mellowmushroom.com/location/sc-charleston-19-magnolia-rd-29407/?utm_source=gmb&utm_medium=organic&utm_campaign=Charleston-SC&utm_content=122",
  "scrapedAt": "2026-01-18T17:04:23.067Z",
  "trimmedAt": "2026-01-18T17:04:46.199Z",
  "pages": [
    {
      "url": "https://mellowmushroom.com/locations/all",
      "text": "Skip to main content Loading Locations Map View Alabama Arkansas Arizona Florida Georgia Indiana Kentucky Missouri North Carolina Nebraska Ohio South Carolina Tennessee Texas Virginia",
      "hash": "65791cadc341",
      "downloadedAt": "2026-01-18T17:03:00.571Z",
      "trimmedAt": "2026-01-18T17:04:46.152Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "https://mellowmushroom.com/menu",
      "text": "Skip to main content Loading Get Free Pretzel Bites When You Create an Account Our Menu",
      "hash": "cc0a602e95b9",
      "downloadedAt": "2026-01-18T17:02:59.814Z",
      "trimmedAt": "2026-01-18T17:04:46.160Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "https://mellowmushroom.com/beverages",
      "text": "Skip to main content Loading Beverages Let's Have a Drink Take A Sip. Take A Trip. Wine Magic Mocktails Liquid Karma Cocktails™ & More Beer Wine Magic Mocktails Liquid Karma Cocktails™ & More Beer Wine Magic Mocktails",
      "hash": "d9ac2985d701",
      "downloadedAt": "2026-01-18T17:02:59.124Z",
      "trimmedAt": "2026-01-18T17:04:46.176Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "https://mellowmushroom.com/location/sc-charleston-19-magnolia-rd-29407/?utm_source=gmb&utm_medium=organic&utm_campaign=Charleston-SC&utm_content=122",
      "text": "Skip to main content Loading Charleston - West Ashley Charleston - West Ashley Open at 11:00 AM | Delivery | Patio | Private Room Available Mellow Mushroom has the best pizza in the West Ashley area of Charleston, South Carolina. Our cinematic-themed restaurant is located in the Ashley Shoppes shopping center off Magnolia Road. Mellow is a favorite among locals from West Ashley, Avondale, Byrnes Down, James Island, Folly Beach, and the surrounding areas. Mellow delivers the best pizza experience in town with our delicious dough, premium ingredients, and unique flavors. Delivering A Higher Order of Pizza™ is our standard. If we can make pizza this tasty and delicious, just imagine what we can do with Munchies, Greens, calzones, and burgers. Many of our pizzas can be made gluten-free or vegan. Take your pick from our selection of 30 draft beers and our tasty, handcrafted cocktails. Looking to feed a group? Mellow has carefully curated catering options to make sure everyone goes home with their cravings satisfied. Store Details Monday 11:00 AM - 11:00 PM Tuesday 11:00 AM - 11:00 PM Wednesday 11:00 AM - 11:00 PM Thursday 11:00 AM - 11:00 PM Friday 11:00 AM - 12:00 AM Saturday 11:00 AM - 12:00 AM Sunday 11:00 AM - 11:00 PM Address 19 Magnolia Rd, Charleston SC 29407 Phone (843) 747-4992 Careers Learn More Store Specials Monday Happy Hour 4:00 - 7:00PM Beer, Wine, and Cocktail Specials Tuesday Happy Hour 4:00 - 7:00PM Beer, Wine, and Cocktail Specials Team Trivia 7:00 - 9:00 PM Wednesday Happy Hour 4:00 - 7:00PM Beer, Wine, and Cocktail Specials Thursday Happy Hour 4:00 - 7:00PM Beer, Wine, and Cocktail Specials Friday Happy Hour 4:00 - 7:00PM Beer, Wine, and Cocktail Specials Explore Drinks Order Catering The Art of Mellow Mushroom Charleston - West Ashley",
      "hash": "dbafb3b28843",
      "downloadedAt": "2026-01-18T17:02:58.893Z",
      "trimmedAt": "2026-01-18T17:04:46.199Z",
      "sizeReduction": "99.5%"
    }
  ],
  "sizeReduction": "99.9%"
}