{
  "venueId": "ChIJ4SjsxUh__ogRboqTivjMDJQ",
  "venueName": "Somm Wine Bar",
  "venueArea": "West Ashley",
  "website": "http://johnsisland.sommchs.com/",
  "scrapedAt": "2026-01-18T17:04:23.547Z",
  "trimmedAt": "2026-01-18T17:04:56.105Z",
  "pages": [
    {
      "url": "http://johnsisland.sommchs.com/",
      "text": "× Want to be in the know? Head to our Events page to see all the fun we have planned -- and visit the Wine Club page if you're ready to sip a little more often! Sip Sip Somm SOMM | Wine Bar At SOMM - Wine Bar, we take pride in providing our valued patrons with an exceptional range of delectable cheese and sumptuous charcuterie options at incredibly reasonable prices. Additionally, we boast an unparalleled variety of wines by the glass, captivating wine flights, and an enticing assortment of wines available for retail purchase, ensuring that every wine enthusiast finds their perfect match. Read more about us Groups & Parties Impress Your Guests Create memories to last a lifetime with our personalized private party options. Let our team help you plan an unforgettable celebration. Book now a private party our menu Treat yourself We believe in using only the finest ingredients in our menu offerings. Come taste the difference for yourself at our restaurant. menu our drinks Finally, a place for wine lovers Savor the rich and complex flavors of our carefully curated wine selection. drinks Reviews Start stop reviews carousel Review by - Google Mick: five star review by Had a great afternoon at Somm- wonderful hospitality and comfort while the ladies and gents drank their pink wine and wine flights. Local IPA was great, but IPA from MI was slightly oxidized - though a wonderful option on the menu to try. Lovely outdoor patio. Inside felt like you are drinking with friends in your living room. Great staff, can't wait to come back. Review by - Google Brad: five star review by This is a really enjoyable place to enjoy a glass of wine. The meat and cheese boards are really great for the price and are beautifully decorated. The variety of wine is quite expansive, and staff knowledge is always helpful. There are so many different sitting areas including couches, patio areas, bar, and cafe tables. Taking a bottle to go is also great when we find a wine we like! Review by - Google Christae: five star review by We enjoyed our time here. We stopped by after dinner and immediately loved the atmosphere. We were immediately greeted and was able to choose our seating. We told our server our typical wine choice and he recommended two that we purchased and loved. It was quiet (but not too quiet) and a great date night stop. I even appreciated the clean restroom with a hook for my purse. I noted the female sanitary products in the bathroom. It's the little things 😉 A must visit! Review by - Google Annie: five star review by Amaaaazing wine bar nestled in Johns Island. There was a pop up winemaker from South Africa the evening I visited. He came around and poured the wines and told us about each. Super cool experience. Additionally the owner was incredibly educated on all things wine/cheese and made the best recommendations. This place is a must visit! Skip Gallery Carousel Start stop gallery carousel slideshow start stop playing Slide 1 content Slide 2 content previous slide next slide We welcome every type of private event Parties Finally, a place for wine lovers Events Newsletter Location 700 Halcyon Loop Johns Island, SC 29455 Hours Tue, Wed, Thur 4:00 PM - 9:00 PM Fri 4:00 PM - 10:00 PM Sat 2:00 PM - 10:00 PM Sun, Mon Closed Find us on... Facebook page Instagram page Google page Contact us (843)-713-7666 Call us at somm.johnsisland@gmail.com Write us at Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "10885397526e",
      "downloadedAt": "2026-01-18T17:03:13.905Z",
      "trimmedAt": "2026-01-18T17:04:56.053Z",
      "sizeReduction": "97.8%"
    },
    {
      "url": "http://johnsisland.sommchs.com/johns-island-somm-wine-bar-about",
      "text": "Somm Wine Bar slideshow start stop playing Dot slide navigation number 1 Dot slide navigation number 2 previous slide next slide Somm Wine Bar Johns island’s newest wine bar At SOMM Wine Bar, our esteemed establishment takes great pride in providing our discerning clientele with an exquisite assortment of delectable cheese and charcuterie options, exquisitely curated to satisfy even the most refined palates. Our distinguished selection of wines, available by the glass, as wine flights, or for retail purchase, showcases the diversity and artistry inherent in the world of viticulture. LEAD STAFF Jordan Hooker / Owner & Sommelier Bobby Le / Wine Expert - Manager Contact us: (843)-713-7666, by phone somm.johnsisland@gmail.com by email Location 700 Halcyon Loop Johns Island, SC 29455 Hours Tue, Wed, Thur 4:00 PM - 9:00 PM Fri 4:00 PM - 10:00 PM Sat 2:00 PM - 10:00 PM Sun, Mon Closed Find us on... Facebook page Instagram page Google page Contact us (843)-713-7666 Call us at somm.johnsisland@gmail.com Write us at",
      "hash": "20b7c6bf7cfd",
      "downloadedAt": "2026-01-18T17:03:14.005Z",
      "trimmedAt": "2026-01-18T17:04:56.060Z",
      "sizeReduction": "98.8%"
    },
    {
      "url": "http://johnsisland.sommchs.com/johns-island-somm-wine-bar-careers",
      "text": "Careers We are hiring! Apply below to become a part of our awesome team and we'll get back to you ASAP! Alternatively if you have questions you can call us at (843)-716-7666 {{reservations.submitMessage}} Name (required) This field is required Phone (required) This field is required Email (required) This field is required Entered email is not valid Experience (required) This field is required Position(s) applying for: {{item}} Submit Your request is being processed, please wait...",
      "hash": "5c7c577adbb2",
      "downloadedAt": "2026-01-18T17:03:18.503Z",
      "trimmedAt": "2026-01-18T17:04:56.067Z",
      "sizeReduction": "99.4%"
    },
    {
      "url": "http://johnsisland.sommchs.com/johns-island-somm-wine-bar-food-menu",
      "text": "Our Menu Menu",
      "hash": "622ac11a95bb",
      "downloadedAt": "2026-01-18T17:03:15.294Z",
      "trimmedAt": "2026-01-18T17:04:56.070Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://johnsisland.sommchs.com/johns-island-somm-wine-bar-drink-menu",
      "text": "Our Drinks Wine",
      "hash": "88775ec6ece1",
      "downloadedAt": "2026-01-18T17:03:14.636Z",
      "trimmedAt": "2026-01-18T17:04:56.075Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://johnsisland.sommchs.com/johns-island-somm-wine-bar-party",
      "text": "",
      "hash": "a4afaf310982",
      "downloadedAt": "2026-01-18T17:03:19.757Z",
      "trimmedAt": "2026-01-18T17:04:56.077Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://johnsisland.sommchs.com/johns-island-somm-wine-bar-reservations#",
      "text": "",
      "hash": "b226344553e2",
      "downloadedAt": "2026-01-18T17:03:17.228Z",
      "trimmedAt": "2026-01-18T17:04:56.080Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://johnsisland.sommchs.com/johns-island-somm-wine-bar-wine-club",
      "text": "OGWINE CLUB Where It All Began! When? The first Sunday of every month, 11:00 AM - 6:00 PM Details Two bottles of wine (predominantly red) and samples of both wines. Access to purchase previous OG wines. Complimentary offerings of our fan favorite charcuterie items on pickup day! 10% off charcuterie, small plates and desserts. $60/ MONTH* PREMIUMWINE CLUB An Elevated Version OfOur OG Club WithAdditional Offerings& Even MoreExclusive Wines. When? The second Sunday of every month, 11:00 AM - 6:00 PM Details Two bottles of wine (predominantly red), samples of both wines as well as samples of OG Club wines. Access to purchase previous Premium wines, OG wines and Novel Pairings wines. Complimentary premium charcuterie and small plate offerings on pickup day! 10% off charcuterie, small plates and desserts. 10% off at High Steaks Butcher Shop the weekend of Premium Wine Club pickup. $120 / MONTH* CLUBCHILL A Club For Lovers OfSparkling, Rosé & WhiteWines To Always KeepYou Chill. When? The third Sunday of every month, 3:00 - 6:00 PM Details Two bottles of wine and samples of both wines. Access to purchase previous Club Chill wines. Complimentary offerings of our fan favorite charcuterie items on pickup day! 10% off charcuterie, small plates and desserts. $80 / MONTH* NOVEL PAIRINGS A novel club for wine & book lovers alike! When? The fourth Sunday of every month, 3:00 - 6:00 PM Details Each month we'll read and chat about a new book & you'll receive two bottles of wine that pair with the literature, thematically and regionally! Enjoy complimentary charcuterie on pickup day while you sip and discuss in a space where our bookworms and wine lovers can thrive. Access to purchase previous Novel Pairings wines. 10% off charcuterie, small plates and desserts. $65 / MONTH* FAQ Stop by in person or email us at to find out how you can get started. Availability and spots are limited. JHOOK1025@GMAIL.COM Can I purchase Wine Club wines without joining a club? No. Wine Club wines are offered exclusively to members at prices that can't be beat. What if I miss pickup day? No worries! We will hold your wine until you're able to pick it up. Can I bring a plus one to Wine Club pickup? Yes! A plus one is included. Additional guests can join at $30/person. FIND US EVERYWHERE @SOMMCHS",
      "hash": "bc077f11bf9b",
      "downloadedAt": "2026-01-18T17:03:15.922Z",
      "trimmedAt": "2026-01-18T17:04:56.086Z",
      "sizeReduction": "96.9%"
    },
    {
      "url": "http://johnsisland.sommchs.com/johns-island-somm-wine-bar-meet-the-team",
      "text": "Meet the Team Jordan Hooker Owner/Sommelier Favorite Red Grape: Sangiovese Favorite White Grape: Chenin Blanc Tim S. Favorite Red Grape: Nerello Mascalese Favorite White Grape: Chardonnay Taylor D. Favorite Red Grape: Syrah Favorite White Grape: Sauv Blanc Caroline C. Favorite Red Grape: Nebbiolo Favorite White Grape: Riesling Bradley P. Favorite Red Grape: Nebbiolo Favorite White Grape: Pinot Meunier Champage Lorraine R. Favorite Red Grape: Argentinian Malbec Favorite White Grape: Verdejo Location 700 Halcyon Loop Johns Island, SC 29455 Hours Tue, Wed, Thur 4:00 PM - 9:00 PM Fri 4:00 PM - 10:00 PM Sat 2:00 PM - 10:00 PM Sun, Mon Closed Find us on... Facebook page Instagram page Google page Contact us (843)-713-7666 Call us at somm.johnsisland@gmail.com Write us at",
      "hash": "c9e81d5bd5c6",
      "downloadedAt": "2026-01-18T17:03:19.131Z",
      "trimmedAt": "2026-01-18T17:04:56.092Z",
      "sizeReduction": "98.9%"
    },
    {
      "url": "http://johnsisland.sommchs.com/johns-island-somm-wine-bar-events",
      "text": "Events CLUB CHILL WINE CLUB Sunday January 18th We will be closed for club chill wine club members on the THIRD Sunday of the month 03:00 PM - 06:00 PM MAHJONG OPEN PLAY Wednesday January 21st SOLD OUT Let's get the New Year started with Mahjong fun! $35 per person: includes all mahjong game items + one glass of wine Please bring your 2025 National Mahj card 05:30 PM - 07:30 PM KYN HANDROLL OMAKASE POP UP Thursday January 22nd SOLD OUT Charleston’s newest omakase experience! A chefs selection of hand rolls and nigiri by artists Tae and Peter. They are putting a creative flair on traditional sushi technique and will be opening their own place downtown later this year. 06:00 PM - 09:00 PM JI --> NXT FIELD TRIP Saturday January 24th We’re taking a wine bar field trip 🚌🍷 Join us on a charter bus ride from our Johns Island location to check out our new store in Nexton Pick up at OG Somm: 3:30pm Leave Nexton: 6:00pm $40 per person, 50 spots, plenty of wine and fun to be had! To reserve your seat, call or text us 843-713-7666 03:30 PM - 06:00 PM NOVEL PAIRINGS WINE CLUB Sunday January 25th We will be closed for novel pairings wine club members on the FOURTH Sunday of the month 03:00 PM - 06:00 PM CHAMPAGNE, CAVIAR & FRIED CHICKEN TASTING Tuesday January 27th We have a few spots left for this incredible tasting! We will be pouring wines from Phillips Gonet & Eric Taillet along with the hard to beat pairing of caviar and fried chicken $175++ per person Secure your spot now before we fill up! 06:00 PM - 08:00 PM KYN HANDROLL OMAKASE POP UP Thursday January 29th Charleston’s newest omakase experience! A chefs selection of hand rolls and nigiri by artists Tae and Peter. They are putting a creative flair on traditional sushi technique and will be opening their own place downtown later this year. We are sold out for the 6pm seating — 1 spot left for the 7:45pm seating 06:00 PM - 09:00 PM DOMAINE PIERRE USSEGLIO & FILS Tuesday February 10th We are very excited to tell y’all we will have Gregory (wine maker) from Domaine Pierre Usseglio Chateauneuf-du-Pape here at Somm to lead a wine tasting dinner. 6 incredible wines will be served along with special retail prices on tasting bottles - for tasting attendees only the night of. $160++ per person Very limited seating left - give us a shout to reserve your seat! 843-713-7666 06:00 PM - 08:00 PM SMASH BURGER NIGHT Wednesday February 11th Ya'll know the drill, come early to secure your spot and a smash burger! $10 smash burgers dine-in only order a glass of the nightly pour for the perfect pairing 05:30 PM - 07:30 PM PAINT WITH A BUZZ Thursday February 12th Sittin on the Dock Join us for an evening of fine wine sipping + sunset marsh. Your $65 ticket includes your first glass of wine https://www.paintwithabuzz.com/event-details-registration/sittin-on-the-dock 05:00 PM - 07:00 PM LOPEZ DE HEREDIA VERTICAL DINNER Tuesday February 17th Six course tasting dinner featuring Lopez de Heredia Rioja Lopez de Heredia is known for being one of the most historic Rioja producers, established in the late 19th century. At the event, you’ll be tasting six back vintages produced between 1995 and 2011. Keep in mind we have special pricing on retail bottles for event members the night of only Dinner will be provided by High Steaks Butcher Shop We have very limited seating left – call/text/email to save your seat $200 ++ per person 06:00 PM - 08:00 PM SMASH BURGER NIGHT Wednesday February 25th $10 smash burgers dine-in only order a glass of the nightly pour for the perfect pairing 05:30 PM - 07:30 PM BROOKS TASTING & DINNER Tuesday March 3rd ✨ more details coming soon ✨ $150++ per person 06:00 PM - 08:00 PM CHATEAU MOUTON ROTHSCHILD 6 YEAR VERTICAL TASTING DINNER Tuesday March 10th This tasting has been a long time coming, thoughtfully curated down to every last detail! We can't wait to share more. $650++ per person 06:00 PM - 08:00 PM ISTAS MENDI TASTING & DINNER Tuesday March 24th ✨ more details coming soon ✨ $125++ per person 06:00 PM - 08:00 PM",
      "hash": "cbe539f1cb83",
      "downloadedAt": "2026-01-18T17:03:16.553Z",
      "trimmedAt": "2026-01-18T17:04:56.102Z",
      "sizeReduction": "95.0%"
    },
    {
      "url": "http://johnsisland.sommchs.com/johns-island-somm-wine-bar-party#",
      "text": "",
      "hash": "cf73217af25f",
      "downloadedAt": "2026-01-18T17:03:17.863Z",
      "trimmedAt": "2026-01-18T17:04:56.105Z",
      "sizeReduction": "100.0%"
    }
  ],
  "sizeReduction": "98.7%"
}