{
  "venueId": "ChIJMZUoa0h5_ogRRkPAIY3VnHQ",
  "venueName": "Tropical Smoothie Cafe",
  "venueArea": "James Island",
  "website": "https://locations.tropicalsmoothiecafe.com/sc/charleston/869-folly-rd?y_source=1_MjM4MTE0NzAtNzE1LWxvY2F0aW9uLndlYnNpdGU%3D",
  "scrapedAt": "2026-01-18T17:04:25.564Z",
  "trimmedAt": "2026-01-18T17:07:13.403Z",
  "pages": [
    {
      "url": "https://locations.tropicalsmoothiecafe.com/sc/charleston/869-folly-rd?y_source=1_MjM4MTE0NzAtNzE1LWxvY2F0aW9uLndlYnNpdGU%3D",
      "text": "Menu Rewards Catering Gift Cards Careers Own A Franchise Book A Fundraiser Download App Find a Cafe Order Now! Tropical Smoothie Cafe Charleston Closed Order online Locations Charleston 869 Folly Rd View Menu CAFE INFO Charleston, SC 29412 869 Folly Rd (843) 764-9980 Get Directions CAFE HOURS CAFE FEATURES Drive Thru Order Online Breakfast Kids Menu Wifi A FREE SMOOTHIE* IS AN APP AWAY DOWNLOAD, JOIN TROPIC REWARDS® & GET ONE AFTER YOUR 1ST PURCHASE* Terms and conditions apply NEW YEAR, NEW DELICIOUS WAYS TO SIP YOUR PROTEIN Ring in the New Year with three new mouth-watering blends. Sip our Cherry Berry Protein Smoothie with 24g of protein, our Chocolate PB Protein Smoothie with 30g & our Almond Banana Protein Smoothie with 29g. ORDER NOW THE ONLY CRUSH YOU ACTUALLY WANT IS BACK The Chocolate Covered Strawberry Smoothie is back and serving delicious chocolatey flavor. Here for a limited time, love it before it leaves! ORDER NOW TROPIC REWARDS IS WHERE IT’S AT ® We’re letting you in on a little secret! The fastest way to score free tropic faves is signing up for Tropic Rewards! It’s as easy as downloading our app and earning points with every qualifying order. Get started today! ​ LEARN MORE Find your next tropic getaway SIPS & BITES THAT TASTE AS FRESH AS THE TROPICS We thought it was about time somebody gave good-for-you a glow-up! With our deliciously tropical twist on fresh-from-the-blender smoothies and freshly made wraps and flatbreads, eating fruits and veggies has never been this much fun. ORDER NOW Bite into vacay vibes with a Tropic Bowl! Go hazelNUTS for the Acai Bowl with NUTELLA®, PB Protein Crunch Bowl packed with 32 grams of protein or dive spoon first into any of our Breakfast Bowls topped with refreshing fruit, granola & chia seeds. ORDER NOW MADE-TO-ORDER-SMOOTHIES Here in the tropics, we’re serving up fresh from the blender smoothies all day long – just the way you like it. Customize yours with add-ins like protein or collagen and even choose your preferred sweetness level! ORDER NOW View Menu About Tropical Smoothie Cafe Tropical Smoothie Cafe® was born on a beach® and on that beach, we learned a better way to live. We make eating better easy breezy with fresh, made to order smoothies, wraps, flatbreads and bowls that instantly boost your mood. Experience the good vibes of the tropics whether you’re ordering ahead in our app or online for delivery, curbside* or pickup. It’s like a tiny vacay in the middle of your day. You're on Tropic Time Now®. *At participating locations. Visit our site Frequently Asked Questions Is Tropical Smoothie Cafe Delivery available near me? Does Charleston Tropical Smoothie Cafe have Curbside? Does Charleston Tropical Smoothie Cafe have a Drive-thru? Is Charleston Tropical Smoothie Cafe hiring? How can I access the Tropical Smoothie Cafe® App? Does Tropical Smoothie Cafe serve food? Does Tropical Smoothie Cafe® in Charleston serve breakfast? About Us Blog Our Story Locations Franchise with us National flip flop day Camp Sunshine Order Tropical Smoothie Cafe Catering Gift Cards Online Ordering Smoothies and food Menu Nutrition Overview Nutritional Guide Careers Corporate Opportunities Cafe Opportunities How can we help? Contact Download App App Faq ACCESSIBILITY TERMS AND PRIVACY SITEMAP © 2023 Tropical Smoothie Cafe, LLC",
      "hash": "2c75686c6377",
      "downloadedAt": "2026-01-18T16:55:43.790Z",
      "trimmedAt": "2026-01-18T17:07:13.370Z",
      "sizeReduction": "96.4%"
    },
    {
      "url": "https://locations.tropicalsmoothiecafe.com/search",
      "text": "Loading...",
      "hash": "3d24ff875295",
      "downloadedAt": "2026-01-18T16:55:43.827Z",
      "trimmedAt": "2026-01-18T17:07:13.370Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "https://locations.tropicalsmoothiecafe.com/",
      "text": "Menu Rewards Catering Gift Cards Careers Own A Franchise Book A Fundraiser Download App Find a Cafe Order Now! Tropical Smoothie Cafe Locations Locations Alabama Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Virginia Washington Washington DC West Virginia Wisconsin About Us Blog Our Story Locations Franchise with us National flip flop day Camp Sunshine Order Tropical Smoothie Cafe Catering Gift Cards Online Ordering Smoothies and food Menu Nutrition Overview Nutritional Guide Careers Corporate Opportunities Cafe Opportunities How can we help? Contact Download App App Faq ACCESSIBILITY TERMS AND PRIVACY SITEMAP © 2023 Tropical Smoothie Cafe, LLC",
      "hash": "e95e59572226",
      "downloadedAt": "2026-01-18T16:55:44.377Z",
      "trimmedAt": "2026-01-18T17:07:13.403Z",
      "sizeReduction": "99.9%"
    }
  ],
  "sizeReduction": "99.6%"
}