{
  "venueId": "ChIJ8Q9AjOZ8_ogRHt_IdZq1bKs",
  "venueName": "Taste Of The Islands Charleston. SC",
  "venueArea": "West Ashley",
  "website": "https://totichs.com/",
  "scrapedAt": "2026-01-18T17:04:23.810Z",
  "trimmedAt": "2026-01-18T17:05:04.860Z",
  "pages": [
    {
      "url": "https://totichs.com/charleston-west-ashley-taste-of-the-islands-food-menu",
      "text": "Our Menu Menu",
      "hash": "11e92c6ddc43",
      "downloadedAt": "2026-01-18T17:03:20.954Z",
      "trimmedAt": "2026-01-18T17:05:04.834Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "https://totichs.com/",
      "text": "× Did you know we do catering? Whatever your occasion, however big or small, we have the perfect options to choose from. Cater your birthday party, holiday party, corporate events, wedding festivities and more! Catering Packages × Order your favorite dishes in seconds! Order Online × We are taking online reservations! Let’s ensure you get a great table: Book today! We recommend making a reservation ahead of time. Book your table today! Book Table × Turn moments into memories! Choose us for your next special occasion or get-together. Got a birthday party, rehearsal dinner, corporate or other event coming up? We're a great option for your gathering! Inquire today and let us know how we can make your special occasion perfect! Book your party 630 Skylark Dr. Ste A, Charleston, SC 29407 Visit us at map marker pin Reserve your table Make a reservation here Reservations are not necessary, but they are welcome! reservations Taste of the Islands Welcome to our restaurant! Taste of the Islands features authentic cuisine from around the Caribbean, using the freshest ingredients to create what promises an unforgettable culinary experience. our menu Private parties Celebrate your event with us! Taste of the Islands has the perfect space for birthday bashes, holiday parties, corporate events, wedding festivities, and more! parties Let us cater Catering for all occasions Whether a birthday, a wedding, a corporate event, whatever matters to you, we offer catering packages for all occasions. catering slideshow start stop playing Slide 1 content Slide 2 content Slide 3 content previous slide next slide Classic dishes inspired by the Caribbean Good food done right Our Menu Let us cater your holiday event catering Your Private Party Spot Bring the Whole Family! private parties Order online Don't feel like cooking today? Your favorite food is just a click away. Order online and enjoy! Order Taste of The Islands Skip Photo Gallery Reviews Start stop reviews carousel Review by - Google Kimberlee F: five star review by I was scrolling through restaurants in the area since I don't live on this side of town. This restaurant came up with great reviews so I decided to give them a try. I'm sooo glad I did! I ordered the curry goat and it was so DELICIOUS. I didn't have to add salt or pepper to my food. It was very reasonably priced and I will definitely return! Service was fast and friendly! Review by - Google Dynamic D: five star review by Wonderful atmosphere and people. Oxtail tender and full of flavor. Would highly recommend. The patties are delightful and always fresh . Good pricing especially compared to other places . Review by - Google Jason K: five star review by Great comfort food ! Generous portions . Had the curry chicken. Had takeout but was in a hurry so sat at the bar for a quick bite. Review by - Google Nikki B: five star review by This restaurant is soooooo good! I have not one complaint!! Staff is amazing, the food is amazing, the location is amazing, and the atmosphere is amazing!! I will be back again and again and again!! Review by - Google a walker: five star review by The food was delicious. I stopped by for the desert. The sweet potato pie was delicious. There was a live band as well. They were very good. They were singing a variety of songs, 80s to present. I highly recommend. 10/10. Newsletter Location 630 Skylark Dr. Ste A Charleston, SC 29407 Hours Sun, Mon, Tue, Wed, Thur, Fri, Sat 11:00 AM - 9:00 PM Find us on... Facebook page Instagram page Google page Contact us (843)-737-5681 Call us at tasteoftheislandsllc2@gmail.com Write us at Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "277a0f25f92d",
      "downloadedAt": "2026-01-18T17:03:20.871Z",
      "trimmedAt": "2026-01-18T17:05:04.851Z",
      "sizeReduction": "97.6%"
    },
    {
      "url": "https://totichs.com/charleston-west-ashley-taste-of-the-islands-events",
      "text": "Events National Pizza Day Monday February 9th Best. Day. Ever. Join us for National Pizza Day February 9th ! 11:00 AM - 09:00 PM Valentine's Day Saturday February 14th Join us on Valentine's Day for the perfect romantic evening! 11:00 AM - 09:00 PM Mardi Gras Tuesday February 17th Come celebrate Mardi Gras with us. 11:00 AM - 09:00 PM National Margarita Day Sunday February 22nd Come celebrate National Margarita day with us on February 22nd. 11:00 AM - 09:00 PM International Women's Day Sunday March 8th Come celebrate International Women's Day with us - March 8th 11:00 AM - 09:00 PM St. Patrick's Day Tuesday March 17th Grab your best green garb and join us for St. Patrick's Day! 11:00 AM - 09:00 PM Easter Sunday April 5th Come celebrate Easter with us! 11:00 AM - 09:00 PM",
      "hash": "68cc83af8cae",
      "downloadedAt": "2026-01-18T17:03:22.181Z",
      "trimmedAt": "2026-01-18T17:05:04.857Z",
      "sizeReduction": "99.0%"
    },
    {
      "url": "https://totichs.com/charleston-west-ashley-taste-of-the-islands-drink-menu",
      "text": "Our Drinks Beverages",
      "hash": "989d434d067c",
      "downloadedAt": "2026-01-18T17:03:21.571Z",
      "trimmedAt": "2026-01-18T17:05:04.860Z",
      "sizeReduction": "100.0%"
    }
  ],
  "sizeReduction": "98.9%"
}