{
  "venueId": "ChIJn7Z2NgB7_ogRJtyFwXBm8Ko",
  "venueName": "Red Palm Tavern",
  "venueArea": "Mount Pleasant",
  "website": "http://redpalmtavern.com/",
  "scrapedAt": "2026-01-18T17:04:29.659Z",
  "trimmedAt": "2026-01-18T17:11:47.685Z",
  "pages": [
    {
      "url": "http://redpalmtavern.com/charleston-red-palm-tavern-events",
      "text": "Events We are updating our events Please stay tuned",
      "hash": "4613f919e1f7",
      "downloadedAt": "2026-01-18T16:56:54.745Z",
      "trimmedAt": "2026-01-18T17:11:47.664Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "http://redpalmtavern.com/charleston-red-palm-tavern-drink-menu",
      "text": "Our Drinks Cocktails",
      "hash": "54f779192c37",
      "downloadedAt": "2026-01-18T16:56:54.122Z",
      "trimmedAt": "2026-01-18T17:11:47.666Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://redpalmtavern.com/charleston-red-palm-tavern-happy-hours-specials",
      "text": "Specials We are updating our specials Please stay tuned",
      "hash": "5d78bcb28191",
      "downloadedAt": "2026-01-18T16:56:55.367Z",
      "trimmedAt": "2026-01-18T17:11:47.668Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "http://redpalmtavern.com/charleston-red-palm-tavern-food-menu",
      "text": "Our Menu Lunch & Dinner Menu",
      "hash": "8d3190b24dd8",
      "downloadedAt": "2026-01-18T16:56:53.501Z",
      "trimmedAt": "2026-01-18T17:11:47.670Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://redpalmtavern.com/",
      "text": "× Let us host your special event! Whether a birthday party, office function or any other special occasion - we take care of all the fine details, bringing your event to life, just as you imagined. Host your next party or get together Book your party Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! Job Listings Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! 45 Romney Street, Charleston, SC 29403 Visit us at map marker pin About Us Step into Red Palm Tavern, a soon to be Charleston institution where American tavern charm meets modern sports bar energy. Unwind from 11am to midnight, Tuesday through Sunday, with a menu influenced by the warmth of a wood-fired grill. Soak up the Charleston sunshine on the patio, challenge friends to billiards or darts, and catch the game on one of 15 TVs or the massive LED screen. Red Palm Tavern is your neighborhood hub for casual eats, drinks, and good times Groups & Parties Unforgettable celebrations From customized menus to table settings, we'll handle all the details so you can focus on enjoying the occasion. Parties slideshow start stop playing Slide 1 content Slide 2 content Slide 3 content previous slide next slide Flavorful cocktails crafted to perfection Drinks Diverse Menu Something for Everyone Our Menu Journey through Special Flavors Specials We are hiring! We are looking for the best in local talent We are looking for great people to join our amazing team! Check out our current job openings and apply with just a few clicks! Learn More & Apply for a job Wood Fired Cheesy Collard Green Dip, served with flatbread Club sandwich, with turkey, BLT, white cheddar, and a side of fries Spicy Margarita Cobb salad, with turkey, bacon, egg, tomato, cucumber, red onion,... Spiced Capone Mule Old Fashioned Bartender making a cocktail Customers at the bar Crispy Mozzarella Triangles, served with marinara Shrimp and Grits Bonnie and Clyde's Temptation cocktail Baked brownie, topped with vanilla ice cream, and caramel sauce Bugsy's Palm Punch Crowded interior, customers dining and drinking Reviews Start stop reviews carousel Review by - Google Victoria L: five star review by The best new bar in chs, great place to watch sports and fantastic bar food!! Somewhere we will be going at least once every week! Review by - Google Casy V: five star review by This place is absolutely awesome! Everything was on point. The owners are phenomenal as well! Review by - Google Jason L: five star review by Cool spot to watch sports, hang out with friends or shoot pool. Food was pretty good, the service was great and the atmosphere is classy but relaxed/casual. Excited to go back here again! Newsletter Location 45 Romney Street Charleston, SC 29403 Hours Tuesday, 4pm-12am Wednesday-Sunday, 11am-12am Closed on Mondays Find us on... Google page Contact us beausliger@gmail.com Write us at Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "a0a82da5cd69",
      "downloadedAt": "2026-01-18T16:56:53.401Z",
      "trimmedAt": "2026-01-18T17:11:47.685Z",
      "sizeReduction": "97.8%"
    }
  ],
  "sizeReduction": "99.2%"
}