{
  "venueId": "ChIJp7lEdgZ5_ogROxlzxcSd1SY",
  "venueName": "Lowdown Oven and Bar",
  "venueArea": "James Island",
  "website": "http://whatsthelowdown.com/",
  "scrapedAt": "2026-01-18T17:04:30.351Z",
  "trimmedAt": "2026-01-18T17:12:04.077Z",
  "pages": [
    {
      "url": "http://whatsthelowdown.com/james-island-the-lowdown-oven-and-bar-happy-hours-specials",
      "text": "Specials Sunday January 18th Brunch 10:30 AM - 02:30 PM Monday January 19th $6 Specialty Cocktails 11:00 AM - 02:00 AM Tuesday January 20th 1/2 price cheesesteaks and $5 local drafts 11:00 AM - 12:00 AM Wednesday January 21st 1/2 price pizza and wine 11:00 AM - 12:00 AM Thursday January 22nd 1/2 price burgers 11:00 AM - 12:00 AM",
      "hash": "2bdf07de395c",
      "downloadedAt": "2026-01-18T16:55:41.823Z",
      "trimmedAt": "2026-01-18T17:12:04.049Z",
      "sizeReduction": "99.5%"
    },
    {
      "url": "http://whatsthelowdown.com/james-island-the-lowdown-oven-and-bar-food-menu",
      "text": "Our Menu Menu Brunch",
      "hash": "56046134fc8f",
      "downloadedAt": "2026-01-18T16:55:40.582Z",
      "trimmedAt": "2026-01-18T17:12:04.052Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://whatsthelowdown.com/",
      "text": "× Let us host your special event! Whether a birthday party, office function or any other special occasion - we take care of all the fine details, bringing your event to life, just as you imagined. Host your next party or get together Book your party Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! Job Listings Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! 967 Folly Rd, James Island, SC 29412 map marker pin About us Located on James Island, the Lowdown is what a neighborhood bar should be. The Lowdown was started in 2013 by two guys who felt the simple pleasure of pulling up a bar stool for a cold beer and a solid meal was being lost in the world of deconstructed Caesar Salads and bartenders calling themselves mixologists. Make people feel at home, keep the damn beer cold, and make simple food favorites exceptionally well. That's why we are here. Our menu Parties Book your next party with us! Need the space for your event? Search no more, we have a perfect place for you! Parties book now Specials Brunch 10:30 AM - 02:30 PM ALL SPECIALS Reviews review by - Yelp Sharon C: Beyond delicious n cooked to perfection. We are 2 Senior ladies n stopped in. Great service. Place clean. We ordered hamburgs on rye. W/carmelized onions. Melt in my mouth delicious. Hard to find a awesome burger. review by - Yelp Claudia H: LDOB has amazing food and incredibly reasonable prices, especially because they have daily specials! Thursday's half price burger it's not only delicious but a deal you can't beat! Cold, inexpensive beer, and a laid back atmosphere make it a favorite of the locals!! review by - Yelp William B: Got to-go here the other day. I've had many friends that go there a ton but this was our first. Inside is small but there's a larger covered outdoor patio with tv's that seem like a good hangout spot. We had the meatballs, quesadilla and philly. All were on point. The cornbread dessert stole the show however... review by - Yelp Vickie P: Not the first time on James island, but definitely the first time at LDOB. Our server Sean is nice and personable. Food is great, not one complaint from the group, including my little one. The bar itself appears to be a local hang out... review by - Yelp Mark W: It's a five because it's what I wanted. Had the chicken pesto pizzA and it was as good as I get in NY and NJ. The menu looked great. What a nice place. Might be back tonight for music. Wish lived closer. Maybe I will someday. Bravo on the service. Stop reviews carousel Play reviews carousel GREAT PIZZA Our Menu Outside dining Book a party BURGERS &CHEESESTEAKS Our Menu Dot slide navigation number 1 Dot slide navigation number 2 Dot slide navigation number 3 slideshow start stop playing Newsletter Location 967 Folly Rd James Island, SC 29412 Hours Mon, Tue, Wed 11:00 AM - 12:00 AM Thur, Fri 11:00 AM - 1:00 AM Sat 10:00 AM - 12:00 AM Sun 12:00 AM - 2:00 AM Find us on... Twitter page Instagram page Yelp page Contact us (843)-795-7569 dporter@whatsthelowdown.com Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "90808f519d66",
      "downloadedAt": "2026-01-18T16:55:40.490Z",
      "trimmedAt": "2026-01-18T17:12:04.070Z",
      "sizeReduction": "97.7%"
    },
    {
      "url": "http://whatsthelowdown.com/james-island-the-lowdown-oven-and-bar-drink-menu",
      "text": "Our Drinks Beer Wine Cocktails",
      "hash": "a3a8b2ea4852",
      "downloadedAt": "2026-01-18T16:55:41.205Z",
      "trimmedAt": "2026-01-18T17:12:04.077Z",
      "sizeReduction": "100.0%"
    }
  ],
  "sizeReduction": "99.1%"
}