{
  "venueId": "ChIJ-VDspi9s_ogRMQMG6c5Gv78",
  "venueName": "Rivertowne Public House",
  "venueArea": "Mount Pleasant",
  "website": "http://rivertownepublichouse.com/",
  "scrapedAt": "2026-01-18T17:04:22.845Z",
  "trimmedAt": "2026-01-18T17:04:41.651Z",
  "pages": [
    {
      "url": "http://rivertownepublichouse.com/mount-pleasant-rivertowne-public-house-drink-menu",
      "text": "Our Drinks Beer Cocktails Wine Spirits",
      "hash": "0c5e241d0323",
      "downloadedAt": "2026-01-18T16:57:07.427Z",
      "trimmedAt": "2026-01-18T17:04:41.616Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://rivertownepublichouse.com/",
      "text": "× Let us host your special event! Whether a birthday party, office function or any other special occasion - we take care of all the fine details, bringing your event to life, just as you imagined. Host your next party or get together Book your party × Did you know we do catering? Whatever your occasion, however big or small, we have the perfect options to choose from. Cater your birthday party, holiday party, corporate events, wedding festivities and more! Catering Packages 2015 South Carolina 41, Mount Pleasant, SC 29466 Visit us at map marker pin Elevated Pub Fare something for everyone! Indulge your appetite with our menu of delicious options. From light bites to hearty meals, there's something for everyone. Come see for yourself what makes us different. view menu About Rivertowne Public House Open for Inside and Outside Dining Located in the Rivertowne Shopping Plaza is Rivertowne Public House. A neighborhood establishment offering a refined but casual atmosphere serving high end pub fare, gourmet pizzas, specialty cocktails, craft beers and distinct wines. We are open 7 days a week with some brunch specials on the weekends. Our goal is to provide the Rivertowne and Dunes West communities a warm and inviting bar and grille that is welcome to all. read more about us Order Online & enjoy your favorite food is just click away! Whether you're short on time or just prefer convenience, online ordering is a great way to get your food from our restaurant. It's quick and easy, and your order will be ready for pick-up or delivery in no time. Order slideshow start stop playing Slide 1 content Slide 2 content previous slide next slide Perfect drinks for a night out Our drinks let us cater your event catering groups & Parties Book your next party with us! With flexible private party spaces and exceptional cuisine, your guests are sure to have a memorable and enjoyable experience. Your guests will be impressed by the ambiance and attention to detail, from start to finish. parties we do Catering Always freshly prepared! Let us cater your next event! We pride ourselves on providing top-notch catering services for any occasion, whether you're hosting a small intimate gathering or a large party, our menu options are sure to please your guests. Catering Inquiry Bartender serving a drink Sausages, firecracker shrimp, spiced mustard, pimento cheese, pickled... Shrimp and Grits Red Martini cocktail Taster board, with sausages, fried shrimp, veggies, pimento cheese,... Veggie Pizza, with mozzarella, marinara, onion, mushrooms, red... Burger and fries Mule cocktail Testimonials Start stop reviews carousel Review by - Google Derek M: five star review by Another great find in our new neighborhood! Started off with the poutine and hadn't ever had it with country gravy but now know I've been missing out! Decided to try a couple of their small plates and found out there is nothing small about them... Review by - Google Rob C: five star review by This place is fabulous. We both had the burgers and they were probably some of the best burgers we've had in this area. The fries are also really good and the appetizer we had was excellent. Their menu is very divers and they have really good beer prices too! I've never had a colder beer at a local restuarant! Review by - Google Debi M: five star review by Attended a private event wedding here and was very impressed. The food was so good, yummy appetizers, great drinks & the main food was all amazing! The staff was amazing and very attentive! Highly recommend! Review by - Google Shane S: five star review by Love this place, have eaten here probably about 15 times and it's consistently good and inexpensive. Great staff, phone is always answered quickly and in a friendly manner. I suggest the pizza and the fillet sliders Review by - Google Jeremy K: five star review by Always a fantastic stop. Great food and top class service. Everyone there is super friendly and will go out of their way to accommodate you. I've had about 2/3 of the lunch and dinner selections and all of them are winners... Newsletter Location 2015 South Carolina 41 Mount Pleasant, SC 29466 Hours Mon: Bar Hours: 12pm - 11pm Kitchen Hours: 12pm - 9pm Tue: Bar Hours: 12pm - 11pm Kitchen Hours: 12pm - 9pm Wed: Bar Hours: 12pm - 11pm Kitchen Hours: 12pm - 9pm Thur: Bar Hours: 12pm - 11pm Kitchen Hours: 12pm - 10pm Fri: Bar Hours: 12pm - 1am Kitchen Hours: 12pm - 10pm Sat: Bar Hours: 11:30am - 1am Kitchen Hours: 11:30am - 10pm Sun: Bar Hours: 12pm - 11pm Kitchen Hours: 12pm - 9pm Find us on... Facebook page Instagram page Google page Contact us (843)-971-3822 Call us at info@rivertownepublichouse.com Write us at Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "4832ce7f5bfa",
      "downloadedAt": "2026-01-18T16:57:06.703Z",
      "trimmedAt": "2026-01-18T17:04:41.638Z",
      "sizeReduction": "96.8%"
    },
    {
      "url": "http://rivertownepublichouse.com/mount-pleasant-rivertowne-public-house-events",
      "text": "Events We are updating our events Please stay tuned",
      "hash": "8590f11a3d24",
      "downloadedAt": "2026-01-18T16:57:08.680Z",
      "trimmedAt": "2026-01-18T17:04:41.641Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "http://rivertownepublichouse.com/mount-pleasant-rivertowne-public-house-happy-hours-specials",
      "text": "Specials Sunday January 18th $9 Mimosas/$18 Carafe Mimosa 12:00 PM - 03:00 PM Monday January 19th $6 House Margaritas 04:00 PM - 07:00 PM Tuesday January 20th $12 Taco Tuesday 12:00 PM - 04:00 PM Kids Night! Half Price under 12 Menu 04:00 PM - 07:00 PM Wednesday January 21st $12 RTPH House Wings all day! 12:00 PM - 09:00 PM $1 Off All Wine Glasses 04:00 PM - 07:00 PM Half Price Wine Bottles 04:00 PM - 07:00 PM Thursday January 22nd $12 RTPH Burger & Pub Fries 12:00 PM - 04:00 PM $8 Signature Martinis 04:00 PM - 07:00 PM Friday January 23rd $12 Pizzas 12:00 PM - 04:00 PM",
      "hash": "91117191b257",
      "downloadedAt": "2026-01-18T16:57:08.062Z",
      "trimmedAt": "2026-01-18T17:04:41.645Z",
      "sizeReduction": "99.2%"
    },
    {
      "url": "http://rivertownepublichouse.com/mount-pleasant-rivertowne-public-house-food-menu",
      "text": "Our Menu Menu Brunch Menu Pies Kids Menu",
      "hash": "a6592879e046",
      "downloadedAt": "2026-01-18T16:57:06.805Z",
      "trimmedAt": "2026-01-18T17:04:41.651Z",
      "sizeReduction": "100.0%"
    }
  ],
  "sizeReduction": "98.9%"
}