{
  "venueId": "ChIJlwZatQ16_ogRXeTwtWSkcaA",
  "venueName": "Market Pavilion Hotel",
  "venueArea": "Downtown Charleston",
  "website": "https://www.marketpavilion.com/",
  "scrapedAt": "2026-01-19T02:45:57.044Z",
  "trimmedAt": "2026-01-19T02:52:57.564Z",
  "pages": [
    {
      "url": "https://www.marketpavilion.com/pavilionbar.cfm",
      "text": "[Page Title: Pavilion Bar]\n\nReservations: 843-723-0500\nHome \nOur Home Page\nAccommodations \nBrowse Guestrooms\nGrill 225 \nPremier Prime Steakhouse\nPavilion Bar \nInfinite Celebrations\nVIP Tables Food Menu Drink Menu Wine and Champagne Request Information Events and Meetings \nPlan the Very Best\nContact \nGet in Touch\n\nInfinite Celebrations\n\nThe Pavilion Bar is a rooftop must-do, complete with views of historic Charleston, a cascading pool, signature cocktails, eclectic cuisine offerings and the city's most spectacular sunsets. The Pavilion Bar maintains a sophisticated and stylish atmosphere for its guests. \n Opens daily at Noon.\n\nCheers\n\nTruly the lap of luxury, retreat to Charleston's only rooftop cascading pool. Sip on one of our signature cocktails, or enjoy a selection from our extensive champagne menu or wine list.\nView our Drink Menu \nSavor\n\nEnjoy the casual but superb fare from the Pavilion Bar. It features only the finest 100% USDA Prime Beef and freshest seafood, as well as an eclectic assortment of inspired local salads, flatbreads, shareable bites, and curated cocktails.\nView our Food Menu \nVIP Tables\n\nEnjoy a private table reservation that includes an array of amenities such as: beverages from our renowned wine, cocktail and champagne menus as well as cuisine from the Pavilion Bar menu.\nVIP Tables Hotel Reservations Grill 225 Reservations Information Request Events \n© Copyright 2026 Market Pavilion Hotel - All Rights Reserved.\n\nDesign by Palas Software Systems\nAccommodations Grill 225 Pavilion Bar Events Gifts Contact Policies Careers Top",
      "hash": "19eeb38fcf9b",
      "downloadedAt": "2026-01-19T02:09:05.033Z",
      "trimmedAt": "2026-01-19T02:52:57.552Z",
      "sizeReduction": "93.7%"
    },
    {
      "url": "https://www.marketpavilion.com/events.cfm",
      "text": "[Page Title: Market Pavilion Hotel - Events]\n\nReservations: 843-723-0500\nHome \nOur Home Page\nAccommodations \nBrowse Guestrooms\nGrill 225 \nPremier Prime Steakhouse\nPavilion Bar \nInfinite Celebrations\nEvents and Meetings \nPlan the Very Best\nContact \nGet in Touch\nRequest Information \nHow may we be of service?\n\nYour next social gathering or corporate event deserves the very best, which is just what you'll find at the Market Pavilion Hotel. As a venue, we offer a one-of-a-kind, historic Charleston setting. As a top hotel with two world-class restaurants, Grill 225 and the Pavilion Bar, we ensure a pristine experience and the finest cuisine for your guests. .\n\nSpecial Occasions\n\nOf course you want your guests to eat, drink and be merry, so host your next special occasion at the Market Pavilion Hotel. Perfect for intimate showers, sophisticated luncheons, cocktail receptions, or lavish weddings, we have the indoor or outdoor venue that's just right for you.\n\nCorporate Events\n\nHost your next meeting or corporate event with the latest advanced technology and a sense of style at the Market Pavilion Hotel. Want to make it memorable? Let us customize it for you with creative ideas to energize and surprise your guests with all that is bespoke Charleston.\n\nPrivate Event Dining\n\nThe private and semi-private areas of Market Pavilion Hotel, Grill 225, and the Pavilion atop the Market Pavilion Hotel are the perfect place to celebrate all of life's happy occassions, from an engagement party to an unforgettable 50th anniversary soiree.\nHotel Reservations Grill 225 Reservations Information Request Events \n© Copyright 2026 Market Pavilion Hotel - All Rights Reserved.\n\nDesign by Palas Software Systems\nAccommodations Grill 225 Pavilion Bar Events Contact Careers Top",
      "hash": "362fe4f8bb89",
      "downloadedAt": "2026-01-19T02:09:05.568Z",
      "trimmedAt": "2026-01-19T02:52:57.557Z",
      "sizeReduction": "92.7%"
    },
    {
      "url": "https://www.marketpavilion.com/",
      "text": "[Page Title: Market Pavilion Hotel - Home]\n\nReservations: 843-723-0500\nHome \nOur Home Page\nAccommodations \nBrowse Guestrooms\nGrill 225 \nPremier Prime Steakhouse\nPavilion Bar \nInfinite Celebrations\nEvents and Meetings \nPlan the Very Best\nContact \nGet in Touch\n\nWelcome to the Art of Southern Hospitality\n\nWelcome to the Market Pavilion, Charleston's most luxurious hotel. Located in the epicenter of Downtown, we're just minutes from the waterfront, tour guides, shopping and grand old homes. Set among some of Charleston's most historical landmarks, the Market Pavilion offers decadent guest rooms, countless amenities, outstanding dining and nightlife.\nCheck Hotel Availability \nGrill 225\n\nDinner at Grill 225 is about a premier steakhouse, impeccable service and just the right atmosphere. Under the direction of Executive Chef Gerry Elliot, we specialize in the superb preparation of top-notch ingredients.\nVisit Grill 225 \nPavilion Bar\n\nThe Pavilion Bar is a rooftop must-do, complete with views of historic Charleston, a cascading pool, signature cocktails, eclectic cuisine offerings and the city's most spectacular sunsets.\nVisit Pavilion Bar \nEvents and Meetings\n\nHow may we be of service? Your next social gathering or corporate event deserves the very best, which is just what you'll find at the Market Pavilion Hotel. As a venue, we offer a one-of-a-kind, historic Charleston setting.\nVisit Our Events Hotel Reservations Grill 225 Reservations Information Request Events \n© Copyright 2026 Market Pavilion Hotel - All Rights Reserved.\n\nDesign by Palas Software Systems\nAccommodations Grill 225 Pavilion Bar Events Gifts Contact Policies Careers Top",
      "hash": "ea0a9c4ebb1b",
      "downloadedAt": "2026-01-19T02:09:04.819Z",
      "trimmedAt": "2026-01-19T02:52:57.564Z",
      "sizeReduction": "95.1%"
    }
  ],
  "sizeReduction": "94.0%"
}