{
  "venueId": "ChIJyc03ZQB9_ogR6rTHm-ebn1M",
  "venueName": "Mazal",
  "venueArea": "West Ashley",
  "website": "https://mazaleat.com/",
  "scrapedAt": "2026-01-18T17:04:32.145Z",
  "trimmedAt": "2026-01-18T17:13:06.597Z",
  "pages": [
    {
      "url": "https://mazaleat.com/pages/our-menu-mazal-shawarma-grill",
      "text": "Skip to content Item added to your cart View cart Check out Continue shopping STARTERS SALADS HUMMUS MAINS STARTERS SEASONED FRIES (V,GF) $10 Crispy fries tossed in our house Mediterranean seasoning blend FALAFEL PLATE (V) $10 Five falafel balls, fried to perfection and served with smooth tahini. A classic Middle Eastern favorite that embodies authentic Mediterranean flavor. SALAD PLATE (GF, V option) $12 Choose four fresh salads from our vibrant Mediterranean salad bar. A light, colorful, and healthy way to taste the best of Mazal Charleston. ROASTED CABBAGE STEAK (V, GF) $12 Oven-roasted cabbage with tahini mustard drizzle - smoky, nutty, and perfectly tender. BAKED CAULIFLOWER (V, GF) $16 Roasted cauliflower with lemon, garlic, and parsley sauce - a fresh Mediterranean favorite. SALADS FALAFEL SALAD (V option) $16.9 Fresh tomato, cucumber, parsley, pickles, za’atar, and crispy pita chips. A refreshing Mediterranean salad with bold Israeli flavors. CHICKEN SALAD (GF) $18.9 Grilled chicken breast served over lettuce, tomato, cucumber, and red onion. A healthy, protein-packed choice from Mazal Charleston. SCHNITZEL SALAD $18.9 Crispy chicken schnitzel on a bed of cabbage, cucumber, and carrot, tossed with house pickled seasoning. A modern twist on an Israeli street food classic. HUMMUS Serverd with 1 pita CLASSIC (V, GF) $12.4 Creamy, house-made hummus topped with olive oil and whole chickpeas. Smooth, rich, and comforting. WITH TAHINI & CHICKPEAS (V, GF) $13.4 Rich hummus topped with tahini and warm chickpeas. A Charleston favorite for Mediterranean food lovers. WITH GRILLED CHICKEN BREAST (GF) $16.9 A hearty hummus bowl topped with juicy grilled chicken breast and olive oil drizzle - flavorful, filling, and healthy. WITH GROUND BEEF KEBAB (GF) $18.9 Classic hummus topped with spiced ground beef kebab and fresh herbs. WITH SHAWARMA (GF) $18.9 Smooth hummus paired with tender chicken shawarma, tahini, and house seasoning - one of Mazal’s signature Mediterranean dishes. MAINS FALAFEL (V option) Pita $13 Baguette $15 Bowl $19 Crispy falafel made fresh daily, served with your choice of Mediterranean salads and sauces. Light, flavorful, and full of authentic taste. Available in pita, baguette, or bowl. (Vegetarian, Vegan) SABICH [ EGGPLANT & EGG ] (V,GF option) Pita $13 Baguette $15 Bowl $19 SABICH [ EGGPLANT & EGG ] A Mediterranean favorite with fried eggplant, boiled egg, tahini, and fresh vegetables. Creamy, hearty, and satisfying. Served in pita, baguette, or bowl. CRISPY SCHNITZEL Pita $15 Baguette $18 Bowl $20 Crispy breaded chicken schnitzel, golden and flavorful, served with your choice of salads and sauces. Comfort food with a Mediterranean twist. Available in pita, baguette, or bowl. GRILLED CHICKEN BREAST (GF Option) Pita $15 Baguette $18 Bowl $20 Marinated chicken breast grilled to perfection and paired with your choice of fresh Mediterranean salads and sauces. A clean, healthy option with rich flavor. Served in pita, baguette, or bowl. SHAWARMA (GF Option) Pita $18 Baguette $20 Bowl $22 Tender chicken shawarma slow-roasted on a vertical spit, carved fresh to order, and served with your choice of salads and sauces. Juicy, aromatic, and perfectly seasoned. Available in pita, baguette, or bowl. SMASH KEBAB (GF option) Pita $18 Baguette $20 Bowl $22 Juicy ground beef kebab grilled with Mediterranean spices and fresh herbs. Served with your choice of salads and sauces for a smoky, hearty, and bold flavor. Available in pita, baguette, or bowl. MAZAL Menu - Mediterranean Street Food MAZAL brings authentic Mediterranean street food to Charleston. Our menu includes shawarma, falafel, hummus, salads and classic Middle Eastern flavors made fresh daily. Explore bold, fresh and handmade dishes crafted with Mediterranean tradition. VISIT US location_on 1901 Ashley River Rd, Charleston, SC 29407, United States schedule Sun-Fri: 11am - 8pm SITE MAP Our Menu About Contact QUICK LINKS Privacy policy Terms of service Refund and Return Allergen Disclaimer Accessibility Statement CONTACT mazalrsc@gmail.com (843) 425-8551",
      "hash": "56aa0d91dd50",
      "downloadedAt": "2026-01-18T17:02:58.606Z",
      "trimmedAt": "2026-01-18T17:13:06.581Z",
      "sizeReduction": "96.3%"
    },
    {
      "url": "https://mazaleat.com/",
      "text": "Skip to content Item added to your cart View cart Check out Continue shopping [ 1901 Ashley River Rd, Charleston, SC 29407, United States ] [ 1901 Ashley River Rd, Charleston, SC 29407, US ] Authentic Yet Contemporary Mediterranean Street Food.From a Quick Street Bite to an Overflowing Table. We Serve It Juicy, Fresh, and Bold. From a Quick Street Biteto an Overflowing Table. We Serve It Juicy, Fresh, and Bold. LET’S EAT > OUR DINING OPTIONS IN A BOX Order Online > \"ON THE TABLE\" Make a Reservation > MEDITERRANEAN FEAST Coming Soon! ABOUT MAZAL For us, food was never just food.It’s our way of celebrating life, bringing people together, and creating memories. For us, food was never just food.It’s our way of celebrating life, bringing people together, and creating memories. is inspired by our grandmother Mazal - the heart of our family,a legendary hostess whose kitchen was always open, warm, and full of flavor.We bring that same spirit to Charleston: authentic Mediterranean street food,From quick shawarma and falafel to vibrant, shareable plates -all made fresh, bold, and full of soul. MAZAL is inspired by our grandmother Mazal - the heart of our family,a legendary hostess whose kitchen was always open, warm, and full of flavor.We bring that same spirit to Charleston: authentic Mediterranean street food, From quick shawarma and falafel to vibrant, shareable plates - all made fresh, bold, and full of soul. MAZAL OUR MENU > VISIT US location_on 1901 Ashley River Rd, Charleston, SC 29407, United States schedule Sun-Fri: 11am - 8pm SITE MAP Our Menu About Contact QUICK LINKS Privacy policy Terms of service Refund and Return Allergen Disclaimer Accessibility Statement CONTACT mazalrsc@gmail.com (843) 425-8551",
      "hash": "e48d60a1e88b",
      "downloadedAt": "2026-01-18T17:02:58.484Z",
      "trimmedAt": "2026-01-18T17:13:06.597Z",
      "sizeReduction": "98.5%"
    }
  ],
  "sizeReduction": "97.4%"
}