{
  "venueId": "ChIJy5sQLuJw_ogRnxFgqpnQ1SY",
  "venueName": "Post House",
  "venueArea": "Mount Pleasant",
  "website": "https://www.theposthouseinn.com/?y_source=1_MjAxMTIwMjEyMC03MTUtbG9jYXRpb24ud2Vic2l0ZQ%3D%3D",
  "scrapedAt": "2026-01-18T17:04:32.099Z",
  "trimmedAt": "2026-01-18T17:13:05.931Z",
  "pages": [
    {
      "url": "https://www.theposthouseinn.com/menus/",
      "text": "× Reservations Location - Required Location Post House Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service Main content starts here, tab to start navigating Menus Dinner Lunch Brunch Beverage Dessert Kids Restaurant Week Dinner Download PDF (opens in a new tab) Raw Bar East Coast Oysters* Classic accompaniments Half-dozen 24 $ Dozen 46 $ Tuna Tartare* strawberry, yuzu, sesame oil, crostini 20 $ Crab Toast brioche, blue crab, pickled chili, comeback sauce 19 $ Siberian Caviar* traditional accompaniments, toast points 90 $ Small Plates Anson Mills Cornbread Benne seed, whipped butter 11 $ Caesar Parmigiano reggiano, croutons 17 $ Butterbean Spoon Salad Fennel, peanut, oregano, breadcrumbs 17 $ Beets & Burrata Pistachio vinaigrette, pomegranate seeds 18 $ Goat Cheese Creme Brulee goji berries, pine nuts, arugula salad, fermented strawberry vinaigrette 18 $ Entrées Purple Risotto with Grouper tarragon chlorophyll, rainbow chard 42 $ Tarvin Shrimp Cavatelli Tomato cream bisque, fines herbes 32 $ Braised Beef Short Ribs sweet potato purée, smoked sweet potato, brussels sprouts, jus 35 $ Crispy Tapioca Chicken crispy potatoes, sauteed corn 36 $ Boil & Baisse mussels, shrimp, calamari, market fish, rouille 48 $ Backbar Cheeseburger* B&B Pickles, special sauce, caramelized onion, American cheese, fries 20 $ Filet Mignon with Potatoes Galette 6oz Certified Angus Beef, asparagus, mushrooms fricassee 47 $ Pulled Pork Stuffed Persimmon butternut squash carolina rice purlou, pecan praliné, tomato bisque 36 $ Stuffed Quail with Foie Gras glazed with sorghum syrup, chestnut, crispy sunchoke chips 45 $ Sides Crispy Potatoes Yukon golds, aioli, soft herbs 12 $ Asparagus romesco 12 $ Roasted Carrots apple relish 10 $ Brussels Sprouts pecan crumble 12 $ Lunch Download PDF (opens in a new tab) Snacks Marinated Olives Citrus, herbs, garlic 8 $ East Coast Oysters* Classic accompaniments 24 $ 46 $ Anson Mills Cornbread Benne seed, whipped butter 11 $ Salmon Pâté Roe, sourdough crostini 17 $ French Onion Dip Seasonal crudités 15 $ Small Plates Beets & Burrata Pistachio vinaigrette, pomegranate seeds 18 $ Crab Toast Brioche, blue crab, pickled chili, comeback sauce 20 $ Ricotta Toast Whipped ricotta, oyster mushrooms, lemon 15 $ Crispy Potatoes Yukon golds, aioli, soft herbs 12 $ Soup & Salad Soup Du Jour 8 $ 14 $ Chicory Salad Local citrus, fennel, candied hazelnuts, honey vinaigrette 17 $ Caesar Parmigiano reggiano, croutons 17 $ Entrées Seasonal Vegetable Quinoa Bowl Lacinato kale, radish, local vegetables, spring garlic vinaigrette 20 $ Ahi Poke Bowl* Charleston Gold rice, cucumber, red cabbage, soy, sesame, spicy aioli 24 $ Pasta Primavera Rio Bertolini’s rigatoni, seasonal vegetables, basil, parmesan, pine nuts 24 $ Crispy Butterbean Burger American cheese, carrot slaw, comeback sauce, French fries 19 $ Backbar Cheeseburger* B&B pickles, special sauce, caramelized onion, American cheese, French fries 20 $ Tomato & Burrata Sandwich Pesto, greens, baguette, balsamic & red wine vinaigrette , green salad 18 $ Seared Grouper Sandwich Red pepper relish, zhoug, arugula, French fries 24 $ Tuna Melt Vermont cheddar, comeback sauce, sourdough, green salad 22 $ Steak Frites 12 oz Certified Angus Beef NY Strip 54 $ Additions Avocado 4 $ Chicken 7 $ Grilled Tarvin Shrimp 12 $ Brunch Download PDF (opens in a new tab) Full beverage menu available Brunch Cocktails Brunch Buster Gin, blood orange, thyme, lime 15 $ Bloody Mary Vodka, Charleston bloody Mary mix, lemon, tajin 15 $ PH Mimosa Sparkling wine, fresh orange juice 14 $ Baked Goods Anson Mills Cornbread Benne seed, housemade jam 11 $ Coffee Cake Citrus cream cheese 10 $ Seasonal Muffin Salted butter 8 $ To Start East Coast Oysters* Classic accompaniments 24 $ 46 $ Caesar Parmigiano Reggiano, breadcrumbs 17 $ Avocado 4 $ Chicken 9 $ Grilled Tarvin Shrimp 12 $ Salmon Pâté Roe, sourdough crostini 17 $ Crispy Potatoes Yukon golds, aioli, soft herbs 12 $ Plates Blue Crab Fried Rice Kimchi, sesame, Storey Farms eggs* 24 $ Seasonal Vegetable Quinoa Bowl Kale, local vegetables, spring garlic vinaigrette 20 $ Avocado 4 $ Chicken 9 $ Grilled Tarvin Shrimp 12 $ Turkish Eggs Potato rosti, roasted red pepper relish, tahini crème, zhoug 23 $ Avocado 4 $ Broadbent Bacon 5 $ Sausage 5 $ Chicken & Waffles Belgian waffle, fried chicken, maple syrup, honey Dijon 24 $ Full Southern Storey farms soft scrambled eggs, toast, Anson mills grits, Bradford collards, choice of bacon or sausage 20 $ Steak & Eggs* Brasstown Beef tenderloin, Storey Farms eggs, Bradford collards, tarragon herb butter 38 $ Egg Sandwich Egg soufflé, bacon, american cheese, spicy aioli, green salad 15 $ Crispy Butterbean Burger American cheese, carrot slaw, comeback sauce, French fries 19 $ Backbar Cheeseburger* B&B pickles, special sauce, caramelized onion, American cheese, French fries 20 $ Broadbent Bacon 5 $ Buy the Kitchen a Burger Give thanks to the kitchen and we will match your purchase! 5 $ Beverage Cocktails Smoke & Apple bourbon, rosemary sage syrup, apple cider, lemon, spritz of scotch | fresh & herbal with a hint of smoke 16 $ Pineapple Margarita Tequila, pineapple, lime, agave, orange bitters | Not too sweet, not too stiff. Spicy if you’d like 15 $ Cinnamon Raisin Old Fashioned bourbon, pedro ximenez sherry, sorghum syrup, blackstrap bitters | southern twist on a classic with notes of dried fruit 16 $ Melon Ball Vodka, pineapple, lime, Midori, orgeat, orange | The 80s Hit, Finally Upgraded with Fresh Ingredients 15 $ Aperol Spritz Aperol, prosecco, soda, orange blossom | Like a boozy, bittersweet orange soda. Now on draft! 15 $ Gold Rush Bourbon, salted honey, lemon, underberg bitters | A tart and refreshing but serious bourbon cocktail 15 $ Bells of Jalisco Tequila, mezcal, honey, lime, fresno | A spicy margarita with local wildflower honey and just a touch of smoke 15 $ Espresso Martini Vodka, bevlab espresso, kahlúa, amaro montenegro 15 $ Non-Alcoholic Drinks Leitz Sparkling Rose 0.5% Dry, properly balanced de-alcoholized bubbles from one of Germany’s finest winemakers 15 $ 60 $ Original Sin White Widow 0% Drier-than-you-think sparkling blackberry cider. You’ll want two 8 $ Untitled Art Ale 0.5% De-alcoholized Italian styler pilsner from the best NA brewery we’ve ever tried 8 $ ST Agrestis Phony Negroni Lightly spritzy bitter red soda, in the Italian tradition, from a great distiller 14 $ Ghia “Le Spritz” Bright, bitter, punchy soda, made from wine grapes, herbs, and citrus. No added sugar 14 $ Post House Lemonade Made with the freshest juice 6 $ New Creation Split Banana cream soda from Georgia 5 $ In Pursuit of Tea Selections Hot or iced. Ask your server 5 $ Second State Coffee Drip and espresso drinks Bevlab Iced Latte Rich and robust without the bitter 6 $ Draft Edmunds Oast Something Cold Light, crisp and Ultra Deluxe blonde ale 11 $ Coast Hopart IPA Classic style IPA from one of the first breweries in Charleston 10 $ Seasonal Draft Rotating selection from our favorite breweries Bottles & Cans Edmunds Oast Brewing CO Mango Orange Passionfruit (16oz) Locally made from our friends across the river in Charleston 10 $ Wölffer Dry Rose Cider - 6.9% (12oz) The summeriest cider money can buy 10 $ König Brewery Pilsener - 4.9% (16.9oz) XL pounder from the port of Duisberg 10 $ Westbrook Brewing Co. 'A Very Fine Milk Stout' - 5.8% (12oz) Smooth roasted coffee and chocolate notes 8 $ Dessert Turtle Cake Chocolate cake, pecan pie filling, caramel frosting, salted caramel sauce 14 $ Niepoort 10yr Tawny Port 13 $ Sweet Potato Buttermilk Pie Gingersnap crust, brown sugar cinnamon chantilly 14 $ Amaro Nonino 14 $ Sticky Toffee Pudding housemade toffee sauce, brown butter streusel 13 $ Apple Crumble Spiced apple compote, brown butter, oak buckwheat streusel, vanilla ice cream 13 $ Michter’s Bourbon 16 $ Hummingbird Cake Brown butter cream cheese, pineapple curd, banana, walnuts 13 $ Moscato d’Asti, La Spinetta 12 $ Gelato & Sorbet 5 $ Affogato Vanilla gelato, Second State espresso 9 $ Espresso Martini High wire vodka, BevLab espresso, Kahlua, amaro montenegro 15 $ Download PDF (opens in a new tab) To Eat Menu Kids Chicken Grilled or fried, broccolini or French fries 10 $ Mac & Cheese 10 $ Grilled Cheese Broccolini or French fries 10 $ Cheeseburger or Hamburger French fries 10 $ To Drink Roy Rogers 5 $ Shirley Temple 5 $ Guests can enjoy a 3-course dinner for $55/person South Carolina Restaurant WeekJanuary 8 - 18 Download PDF (opens in a new tab) Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service",
      "hash": "08709d4e0461",
      "downloadedAt": "2026-01-18T16:56:53.681Z",
      "trimmedAt": "2026-01-18T17:13:05.914Z",
      "sizeReduction": "92.7%"
    },
    {
      "url": "https://www.theposthouseinn.com/?y_source=1_MjAxMTIwMjEyMC03MTUtbG9jYXRpb24ud2Vic2l0ZQ%3D%3D",
      "text": "× Reservations Location - Required Location Post House Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service Homepage Main content starts here, tab to start navigating Book a Table Book A Room (opens in a new tab) Slide 1 of 5 Slide 2 of 5 Slide 3 of 5 Slide 4 of 5 Slide 5 of 5 Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service",
      "hash": "a9665aa8dbd4",
      "downloadedAt": "2026-01-18T16:56:53.128Z",
      "trimmedAt": "2026-01-18T17:13:05.920Z",
      "sizeReduction": "96.4%"
    },
    {
      "url": "https://www.theposthouseinn.com/location/post-house/",
      "text": "× Reservations Location - Required Location Post House Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service Main content starts here, tab to start navigating Hours & Location Hours & Location 101 Pitt St, Mount Pleasant, SC 29464 (opens in a new tab) (843) 203-7678 posthouseinn@theindigoroad.com 5:00 - 10:00 PM Dinner:Mo nday - Sunday 11:00 AM - 3:00 PM Lunch: Monday - Friday 10:00 AM - 3:00 PM Brunch: Saturday - Sunday CONTACT US Send us a message via the button below and we’ll get back to you as soon as possible. You can also reach us by phone at . We look forward to hearing from you. (843) 203-7678 Send a Message Get Directions (opens in a new tab) Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service",
      "hash": "bac20de6189d",
      "downloadedAt": "2026-01-18T16:56:53.153Z",
      "trimmedAt": "2026-01-18T17:13:05.925Z",
      "sizeReduction": "95.2%"
    },
    {
      "url": "https://www.theposthouseinn.com/private-dining/",
      "text": "× Reservations Location - Required Location Post House Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service Main content starts here, tab to start navigating Private Events Post House is an inviting, lively restaurant and boutique inn featuring a dedicated private events space ideal for large parties and special occasions. Nestled in the heart of the Old Village, Mount Pleasant, SC, Post House’s original features and historic charm lend to its unique character. Book Now The Rose Room True to its name, the light rose color palette is complemented by custom Murano chandeliers, an elegant backdrop perfect for rehearsal dinners, private brunches, cocktail parties and beyond. The Rose Room is equipped with its own private bar, dedicated events kitchen, and flat screen television to be used for presentations throughout your event if needed. The maximum seated capacity is 36. Photo by . Sarah Westmoreland Photography LLC Book Now Full Buyout For a large event, consider a full buyout of Post House. The perfect all-in-one venue, Post House provides a private dining space, ceremony space, and reception space with seven inn rooms for added charm and convenience. A full buyout includes our bar, main dining room, and courtyard. Our events team will work with you to provide the most creative and functional use of the space. The maximum capacity is 100. Book Now Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close and apply. This site is protected by reCAPTCHA and the Google Privacy Policy Terms of Service",
      "hash": "cd4661e062f2",
      "downloadedAt": "2026-01-18T16:56:54.209Z",
      "trimmedAt": "2026-01-18T17:13:05.931Z",
      "sizeReduction": "93.2%"
    }
  ],
  "sizeReduction": "93.7%"
}