{
  "venueId": "ChIJaZ77_iZ7_ogRkIbToV7u2Hs",
  "venueName": "Veranda Lounge",
  "venueArea": "Downtown Charleston",
  "website": "https://www.theloutrel.com/veranda-lounge?utm_source=google&utm_medium=organic&utm_campaign=business_listing",
  "scrapedAt": "2026-01-19T02:19:35.964Z",
  "trimmedAt": "2026-01-19T02:25:54.432Z",
  "pages": [
    {
      "url": "https://www.theloutrel.com/meetings-and-events/request-for-proposal",
      "text": "[Page Title: Request For Proposal | The Loutrel]\n\nSKIP TO CONTENT \nclose\n\nEmail Sign Up\nHidden Field Your Name Your Email I have read and agree to the . Privacy & Cookie Policy Yes, I would like to receive emails with exclusive specials and offers. subscribe \nGet in Touch\nDon't Be A Stranger Be it a long-awaited reunion or a spontaneous elopement, The Loutrel serves as a gracious Southern host to your finest hour. To start planning your event, please complete and submit our online Request For Proposal, sharing a few details about the event you envision. We’ll be in touch soon to get started. Contact Details First Name * Last Name * Email Address * Phone Number * Company Name * Company Address Event Details Meeting/Event Name * Event Date Start * Event Date Finish * Number of Guestrooms * Number of Attendees Estimated Budget Please tell us more about your visit I have read and agree to the . Privacy Policy Yes, I would like to receive emails with exclusive specials and offers. Submit",
      "hash": "08e2620139e6",
      "downloadedAt": "2026-01-19T02:09:46.766Z",
      "trimmedAt": "2026-01-19T02:25:54.364Z",
      "sizeReduction": "98.9%"
    },
    {
      "url": "https://www.theloutrel.com/menu",
      "text": "[Page Title: Menu | The Loutrel]\n\nSKIP TO CONTENT \nclose\n\nEmail Sign Up\nHidden Field Your Name Your Email I have read and agree to the . Privacy & Cookie Policy Yes, I would like to receive emails with exclusive specials and offers. subscribe \nMenus\n\nMENUS\nCocktails Beer Wine Bites Afternoon Tea \nVeranda Cocktails\n\nFine Brine Pickle Martini\n\nWódka Vodka or Fords Gin, Dry Vermouth, Housemade Pickle Brine\n$15 \nGold Rush To The Hive\n\nBeyond Distilling Bourbon, Lemon, Honey Demerara, Egg White\n$17 \nWhat Would Carrie Think?\n\nTitos Vodka, Lime, Italicus, Chinola Passionfruit, Passionfruit Tea & Hibiscus Simple Syrup\n$15 \nThe Garden Adventure Espresso Martini\n\nLavazza Espresso, Giffard’s Orgeat\n\nChoice of: Wódka Vodka or Four Roses 80 Bourbon\n\nChoice of: Cold Brew Vodka or Cold Brew Whiskey Coffee Liqueur\n$15 \nSunset In The French Quarter\n\nLalo Tequila, Pineapple, Blackberry-Ginger-Juniper Berry Cordial, Simple Syrup\n$17 \nThe Trust Tree\n\nCelebrating local and nature-inspired ingredients we’ve grown to love.\n$17 \n'Tis The Season\n\nOpora's Sidecar\n\nMartell VS Cognac, St. George’s, Spiced Pear, Lavender-Honey Simple Syrup, Lemon Juice\n$16 \nApple Butter Old Fashion\n\nBrown-Butter Washed Beyond Garden Reserve Bourbon, Local Apple Butter, Walnut Bitters\n$19 \nAutumn Equinox\n\nRon Del Barrilito Rum, Cinnamon-Vanilla Demerara Syrup, Pineapple Juice, Lime Juice, Coconut Milk, Cream of Coconut, Pumpkin Spice\n$16 \nThe Garden Maharaja\n\nIndian-Spiced Coconut Milk Clarified Devil’s Grin Gin, Honey Syrup, Lemon Juice, Egg White, Fire Tincture\n$18 \nPecan Pie Martini\n\nCharleston Distillery Bourbon Cream, Jumping Goat Cold-Brew Liqueur, Cream, Charleston Distillery Smoked Pecan Liqueur\n$15 \nThe Zesty Goat\n\nThe Funk Rum, Jumping Goat Cold-Brew Liqueur, Licor 43, Coffee, Orange Zest Cream, Cinnamon\n$15 \nDraft Beer\n\nSungazer Hazy IPA\n\nCharlestowne Fermentory, Charleston, SC\n$10 \nMunkle Lager\n\nMunkle Brewing, Charleston, SC\n$10 \nSomething Cold Blonde Ale\n\nEdmund's Oast Brewing, Charleston, SC\n$10 \nSemi-Dry Apple Hard Cider\n\nFlat Rock Cider Co., Flat Rock, NC\n$10 \nBound By Time IPA\n\nEdmund's Oast Brewing, Charleston, SC\n$10 \nPoke the Bear APA\n\nRevelry Brewing, Charleston, SC\n$10 \nCans\n\nMichelob Ultra Light Lager\n\nAnheuser-Busch - St. Louis, MO\n$7 \nAmerican Apple Imperial Hard Cider\n\nBlake’s Hard Cider Co, Armada, MI\n$8 \n\"Hops\" Non Alcoholic Hopped Pilsner\n\nCEEBO, Charleston, SC\n$7 \n\"Classic\" Non Alcoholic German Pilsner\n\nCEEBO, Charleston, SC\n$7 \nSparkling\n\nChampagne\n\nBrut Nature Silver, André Clouet - Champagne AOC, France\n$35 $140 \nSparkling Cava\n\nBrut Nature Reserva, Vilarnau - Barcelona, Spain\n$17 $62 \nProsecco\n\nBrut, Poggio Costa - Prosecco DOC, Veneto, Italy\n$11 $40 \nWhite\n\nGrüner Veltliner\n\nvom Löss, Diwald - Wagram DAC, Austria\n$15 $52 \nPinot Bianco\n\nvom Stein, Castelfeder - Südtirol-Alto Adige DOC, Italy\n$15 $52 \nArneis\n\nBlange, Ceretto - Langhe-Arneis DOC, Piemonte, Italy\n$17 $60 \nChardonnay\n\nLes Cepages, Domaine Jean-Marc Brocard - Côteaux Bourguignons AOC, France\n$15 $52 \nBordeaux Blanc\n\nChâteau Pilet - Bordeaux AOC, France\n$11 $40 \nSauvignon Blanc\n\nHunky Dory - Marlborough AMW, New Zealand\n$13 $44 \nAlbariño\n\nLegado del Conde - Rías Baixas DO, Spain\n$16 $56 \nRosé\n\nRosé\n\nBordeaux Rosé, Atlantique - Entre-deux-Mers AOC, Bordeaux, France\n$11 $40 \nSparkling Rosé\n\nDe Nit, Raventós i Blanc - Conca del Riu Anoia, Catalonia, Spain\n$16 $58 \nRed\n\nMalbec\n\nFelino, Viña Cobos - Mendoza DOC, Argentina\n$15 $52 \nCabernet Sauvignon\n\nThe Fableist Wine Company - Paso Robles AVA, California\n$17 $60 \nTempranillo\n\nReserva, Bodegas Beronia - Rioja Alta DOC, Spain\n$16 $54 \nPinot Noir\n\nMt. Eden Clone, Moffett - Chehalem Mountains AVA, Willamette Valley, Oregon\n$19 $68 \nMerlot\n\nLa Storia Block 500, Trentadue - Alexander Valley AVA, Sonoma County, California\n$18 $64 \nSyrah\n\nGust, Cline Family Cellars - Petaluma Gap AVA, Sonoma County, California\n$17 $60 \nMontepulciano D'Abruzzo\n\nSpelt, La Valentina, Abruzzo DOC, Italy\n$18 $64 \nShareables\n\nJorge's Empanadas\n\nGF\n\nHandmade Empanadas, Shredded Chicken, Pickled Red Onions, Garlic Crema\n$17 \nThe Beet Farm\n\nVG\n\nGF\n\nRoasted Red Beets, Pistachio Vinaigrette, Feta Cheese\n$17 \nThe Odd Couple\n\nVG\n\nBaba Ganoush and Citrus Wheat Beer Cheese\n\nServed with Beet Bread Slices\n$18 \nCharcuterie\n\nChef's Selection of Cured Meats, Soft and Hard Cheese\n\nServed with Paired Preserves and Accompaniments\n$28 \nChicken Roulade\n\nGF\n\nBaked Chicken with Ham, Swiss Cheese, Harissa and Chimichurri Sauce\n$20 \nAll Day\n\nHarvest Kale Salad\n\nGF\n\nChopped Kale, Green Apple, Shaved Carrot, Parmesan Cheese, Apple Cider Vinaigrette\n\nAdd Chicken +$9 / Add Steak +$13\n$15 \nThe Ever Classic Caesar Salad\n\nRomaine Lettuce, Shaved Parmesan Cheese, Homemade Beet Bread Croutons, Caesar Dressing\n\nAdd Chicken +$9 / Add Steak +$13\n$15 \nPCLT Sandwich\n\nPimento Cheese, Chicken Breast, Romaine Lettuce, Tomato, Beet Brioche Bun\n\nServed with Herb Chickpea Salad\n$18 \nSteak Sandwich\n\nShaved Medium Rare Steak, Whole Grain Mustard Aioli, Swiss Cheese, Caramelized Onion on Ciabatta\n\nServed with Herb Chickpea Salad\n$21 \nLady Loutrel's Afternoon Tea\n\nAfternoon Tea Service\n\nIncludes one Scone Course and Tea Tower comprised of a variety of sweet and savory treats built for the number of guests in your party and a pot of loose-leaf hot tea.\nAvailable Thursday - Sunday from 11 am - 5 pm by . reservation \nSeasonal Scones Served with Edisto Gold Honey, Clotted Cream, Seasonal Preserves, and Lemon Curd\nSCONES \nPimento Cheese, Chicken SaladBacon & Sweet Cream Cheese, Smoked Salmon with Capers, Pickled Onions, Cream Cheese & Cucumber*\nTEA SANDWICHES \nPetit Fours, Macarons, Canelé, Seasonal Cake\nSWEETS \nCountess Grey, East Indian, Masala Chai, Blackberry, Passion Fruit Peach, Jasmine, White Peony, Hibiscus\nOLIVER PLUFF TEA SELECTION $85 \nAdditions\n\nBeyond Distilling Tropical Gin, Passionfruit Tea Syrup, Lemon, Velvet Falernum17\nLOWCOUNTRY REVERIE \nBeyond Distilling Bourbon, See The Elephant, Sweet Tea Syrup, Angostura Bitters17\nPORCH SWING OLD-FASHIONED \nGratien & Meyer, Loire, France12 / 48\nCRÉMANT \nRaventós i Blanc, Conca del Riu Anoia de Nit, Catalonia, Spain20 / 80\nSPARKLING ROSÉ \nAndré Clouet Silver, Champagne, France35 / 140\nCHAMPAGNE \nGLUTEN FREE\nGF \nVEGAN\nV \nVEGETARIAN\nVG \n*Consuming raw or undercooked meats, poultry, seafood, shellfish, or eggs may increase your risk of foodborne illness, especially if you have certain medical conditions. Regarding the safety of these foods, written information is available upon request.",
      "hash": "2d4ed6c8f2cc",
      "downloadedAt": "2026-01-19T02:09:47.590Z",
      "trimmedAt": "2026-01-19T02:25:54.389Z",
      "sizeReduction": "94.4%"
    },
    {
      "url": "https://www.theloutrel.com/meetings-and-events/celebrations",
      "text": "[Page Title: Wedding Venues in Charleston SC | Celebrations | The Loutrel]\n\nSKIP TO CONTENT \nclose\n\nEmail Sign Up\nHidden Field Your Name Your Email I have read and agree to the . Privacy & Cookie Policy Yes, I would like to receive emails with exclusive specials and offers. subscribe \nCelebrate Life's Best Moments\nSpecial Event Venues In Charleston With a spectacular location, a sophisticated ambience, and sincere Southern hospitality, The Loutrel acts as a gracious host to life’s most cherished occasions. From birthday and anniversary parties to once-in-a-lifetime gatherings, our gracious Charleston event venues ensure moments that are uniquely unforgettable. Request For Proposal \nWeddings\n\nElopements\nIntimate Weddings and Whether you’re looking for an exquisite rooftop for an intimate wedding ceremony, a perfect setting for a post-wedding brunch, or a romantic hideaway for a surprise elopement, The Loutrel provides an elegant backdrop for every aspect of your special day. \nAccommodations\nWedding Couple \nNamed Azalea, Camellia, and Oleander, our three light-filled Corner King Rooms that can be separated with a Lounge King, creating a private two-bedroom retreat ideal for wedding day pampering and primping.\n\nFor The Group\nGetaways \nBe it a weekend getaway or a family reunion, The Loutrel offers a quintessential Charleston experience that delights at every age, from its central location to an array of complimentary signature experiences, like curated snacks and beverages and bikes for sightseeing.\nRequest For Proposal",
      "hash": "4e4d1e215a11",
      "downloadedAt": "2026-01-19T02:09:45.848Z",
      "trimmedAt": "2026-01-19T02:25:54.394Z",
      "sizeReduction": "97.5%"
    },
    {
      "url": "https://www.theloutrel.com/meetings-and-events/corporate",
      "text": "[Page Title: Corporate | The Loutrel]\n\nSKIP TO CONTENT \nclose\n\nEmail Sign Up\nHidden Field Your Name Your Email I have read and agree to the . Privacy & Cookie Policy Yes, I would like to receive emails with exclusive specials and offers. subscribe \nInspired Events\nWe're in the Business of When it comes to planning corporate events, our professional staff and business-minded amenities make it easy to focus on the agenda at hand and leave the details to us. With a complimentary daily European breakfast, high-speed Wi-Fi, and one of the only-state-of-the-art fitness studios in downtown, you and your colleagues can show up refreshed and ready to orchestrate your next big idea. Request For Proposal \nCorporate Amenities\nFor the Modern Traveler \nHigh-Speed Wi-Fi Throughout The Property\n\nEuropean Breakfast Included\n\nState-Of-The-Art Fitness Studio\n\nFull Concierge Services\n\nIn-Room Workspace & Televisions with HDMI, USB, RF & AV Interfaces\n\nComplimentary In-Room Beverages & Snacks\n\nComplete Meeting Packages With Curated Food & Beverage Options\n\nTalk\nLet's Business \nCorporate Travel Program\nHigh-Class Conveniences \n10% off best available rate\n\nComplimentary room upgrade (based on availability)\n\nComplimentary cocktail at the Veranda Lounge\n\nGroup rates available for 5+ rooms/night\nRequest For Proposal",
      "hash": "5a62f94e0435",
      "downloadedAt": "2026-01-19T02:09:45.041Z",
      "trimmedAt": "2026-01-19T02:25:54.400Z",
      "sizeReduction": "97.8%"
    },
    {
      "url": "https://www.theloutrel.com/veranda-lounge?utm_source=google&utm_medium=organic&utm_campaign=business_listing",
      "text": "[Page Title: Veranda Lounge | The Loutrel]\n\nSKIP TO CONTENT \nclose\n\nEmail Sign Up\nHidden Field Your Name Your Email I have read and agree to the . Privacy & Cookie Policy Yes, I would like to receive emails with exclusive specials and offers. subscribe \nGarden-Inspired Lounge\nWelcome to our True to the inspiration of Charleston’s celebrated private and public gardens, cherished traditions and the organic beauty of nature are blended at Veranda Lounge to create innovative libations tinged with familiarity. Tucked into the side of our elegant lobby, this is your culinary introduction to the story of Charleston, narrated through thoughtfully curated cocktail and food programs. \nhours OF Operations\n\nSUNDAY - THURSDAY\n12:00 PM - 10:00 PM \nFRIDAY - SATURDAY\n12:00 PM - 11:00 PM BOOK NOW VIEW MENUS \nMenu\n\nWhat We're Sipping\nBotanical Craft Cocktails Indulge in your favorite cocktail served with a Charleston twist and a bit of fresh perspective by one of our creative cocktail artisans. Read more \nWhat We're Eating\nDelectable Delicacies Craveable, bite-sized, savory flavors live here. From classic spiced nuts to exquisite tarts, discover refined accoutrements to your drink of choice. Read more \nThe Study\nA Sophisticated Setting \nGather your closest confidantes for a spirited experience in our private dining room. With room for up to 16 guests, this sophisticated space complements any occasion in The Loutrel’s signature style.\n\nPORCH-INSPIRED\ngather at our bar & lounge @VERANDALOUNGECHS \nexpand\n\nexpand\n\nexpand\n\nexpand",
      "hash": "ddd7feab5c4e",
      "downloadedAt": "2026-01-19T02:09:43.034Z",
      "trimmedAt": "2026-01-19T02:25:54.406Z",
      "sizeReduction": "97.6%"
    },
    {
      "url": "https://www.theloutrel.com/offers",
      "text": "[Page Title: Charleston SC Hotel Deals | Offers | The Loutrel]\n\nSKIP TO CONTENT \nclose\n\nEmail Sign Up\nHidden Field Your Name Your Email I have read and agree to the . Privacy & Cookie Policy Yes, I would like to receive emails with exclusive specials and offers. subscribe \nPlan A Perfect Escape\nCharleston SC Hotel Deals \nGood Neighbor\n10% OFF + Complimentary Valet \nExperience Southern hospitality with our exclusive rate for South Carolina, North Carolina, and Georgia neighbors.\n10% Off Your Stay Complimentary Valet Parking ($45/night value) book now Terms & Conditions \nThis is a limited time offer available for new reservations booked by March 19, 2026 for travel through March 19, 2026 for stays of 2 or more nights. Not applicable to groups, corporate-negotiated, or third party rates. Cannot be combined with any other promotion or offers. Subject to availability and blackout dates. Taxes and gratuities are not included.\n\nRest, Recharge, & Rejuvenate\n\nTravel Well With The Loutrel\nPrioritize your well-being with The Loutrel’s wellness package, designed for deep relaxation and restful sleep. Thoughtful amenities and personalized touches ensure you wake refreshed in Charleston. book now Read More \nRest, Recharge, & Rejuvenate\n\nTravel Well With The Loutrel\n\nPrioritize your well-being with The Loutrel’s wellness package, designed for deep relaxation and restful sleep. Thoughtful amenities and personalized touches ensure you wake refreshed in Charleston.\n\nYour wellness experience includes:\n\nCustom Pillow Selection – Choose from memory foam, down alternative, or goose feather options\n\nBlissy 100% Mulberry Silk Pillowcase\n\nLavender Pillow Spray & Loutrel Sleep Mask\n\nSound Machine with White Noise\n\nFresh Eucalyptus Shower Enhancement\n\nPersonalized Sleep & Wake Preferences – Set your ideal room temperature and wake-up time\n\nNighttime Snack & In-Room Herbal Tea Service featuring Oliver Pluff blends\n*Enhance your stay with an optional Deep End exposure therapy session at Ethos Athletic Club, a guided 45-minute experience combining breathwork and cold immersion to elevate well-being. \nTerms and Conditions\nThis is a limited-time offer available for new reservations. Not applicable to groups, corporate-negotiated, or third-party rates. Cannot be combined with any other promotion or offers. Package must be booked at least two weeks prior to arrival date. Minimum stay of 2 nights required. Additional cost applies for the Ethos Athletic Club's Deep End experience. book now \nCoastal Beach Lounging Experience\n\nSeaside Serenity\n\nExperience a day at Sullivan's Island with our beach package, thoughtfully curated to meet all your seaside needs. Relax and immerse yourself in the breathtaking beauty of our pristine coastline while we take care of the details for you!\nbook now Read More \nCoastal Beach Lounging Experience\n\nSeaside Serenity\n\nExperience a day at Sullivan's Island with our beach package, thoughtfully curated to meet all your seaside needs.\nOur beach package includes the use of all the essentials for a day of sun-soaked relaxation. \nTwo beach chairs\n\nUmbrella\n\nBeach towels\n\nJBL speaker\n\nCooler with drinks +\nartisanal sandwiches \nTerms and Conditions\nThis is a limited time offer available for new reservations only. Not applicable to groups, corporate-negotiated, or third party rates. Cannot be combined with any other promotion or offers. Subject to availability and blackout dates. Taxes and gratuities are not included. Beach transportation not included; add roundtrip service for $115 through the front desk. Package requires a 2-night minimum stay and must be booked at least one week before arrival. book now \nBlind Date Book Package\n\nLiterary Getaway\n\nEmbark on a journey of mystery, discovery, and relaxation with this exclusive experience inspired by the allure of \"blind date\" books. Choose from curated genres like historic fiction, romance, cooking, and culture & art.\nBook now Read More \nBlind Date Book Package\n\nLiterary Getaway\n\nEmbark on a literary journey of mystery, discovery, and relaxation with The Loutrel and Buxton Books.\nChoose from curated genres like historic fiction, romance, cooking, and culture & art. \nPackage Includes:\n\nA surprise “blind date” book based on your preferred genre\n\nA curated itinerary tailored to the theme of the book, suggesting related spots for exploration\n\nA visit to Buxton Books to explore their extensive collection and perhaps discover your next favorite read\n\nA round of botanical-inspired cocktails at Veranda Lounge\n\nTerms and Conditions\n\nThis is a limited-time offer available for new reservations booked for travel through December 31, 2025. Not applicable to groups, corporate-negotiated, or third-party rates. Cannot be combined with any other promotion or offers. Package must be booked at least two weeks prior to arrival date. Minimum stay of 2 nights required. Additional costs may apply for suggested items on the itinerary and is not included in the package price.\nBook now \nBE YOUR BEST SELF\n\nReinvigorate with a Massage + More\nEnjoy a soothing massage from the comfort of your room and take advantage of our state-of-the-art fitness amenities that includes Peloton and Precor equipment, plus complimentary bicycles for exploring the city. book now Read More \nBE YOUR BEST SELF\n\nReinvigorate with a Massage + More\nEnjoy a soothing massage from the comfort of your room and take advantage of our state-of-the-art fitness amenities. \nPackage includes:\n\nIn-room 60-minute massage with Charleston Mobile Massage\n\nFresh fruit and infused water\n\nTerms and Conditions\n\nNot applicable to groups, corporate-negotiated, or third party rates. Cannot be combined with any other package, promotion or discount. Subject to availability and blackout dates. Taxes and gratuities are not included.\nThis is a limited time offer that requires a two-night minimum stay. book now \nA CHARLESTON CELEBRATION\n\nEnjoy with Charleston's Finest Treats\nCommemorate your moments, both brief and extended, at The Loutrel with a few high-touch treats that inspire even more delight, including a petite cake, bottle of Prosecco and a fresh garden floral bouquet. book now Read More \nA CHARLESTON CELEBRATION\n\nEnjoy with Charleston's Finest Treats\n\nEnjoy some of Charleston's favorite treats and commemorate all the best memories made here.\n\nPackage Includes:\n\nPetite Cake\n\nBottle of Prosecco\n\nFresh Garden Floral Bouquet\n\nTerms and Conditions\n\nNot applicable to groups, corporate-negotiated, or third party rates. Cannot be combined with any other package, promotion or discount. Subject to availability and blackout dates. Taxes and gratuities are not included.\nThis is a limited time offer that requires a two-night minimum stay. book now \nLove in the Lowcountry\n\nExclusive Romantic Experience\n\nElevate your date night with exclusive access to one of Charleston's premier rooftop terraces that offers breathtaking views of the historic French Quarter.\nbook now Read More \nLove in the Lowcountry\n\nExclusive Romantic Experience\nElevate your date night with exclusive access to one of Charleston's premier rooftop terraces. \nPackage includes:\n\nSpecialty cocktails for two paired with a custom charcuterie board, complete with tasty treats, including strawberries and chocolates by Charleston Chocolatier\n\nPetite floral arrangement\n\nA custom scented Candlefish candle\n\nMatouk blanket, a guest favorite\n\nTerms and Conditions\nThis is a limited time offer that requires a two-night minimum stay. Not applicable to groups, corporate-negotiated, or third party rates. Cannot be combined with any other promotion or offers. Subject to availability and blackout dates. Taxes and gratuities are not included. book now \nsets us\nwhat Apart \nCentrally Located In The Heart of Historic Charleston\n\nStep out our front doors into the heart of historic Charleston where cherished Colonial mansions, cobblestone streets, and the trendy boutiques of King Street lay at your feet.\n\nAll-Inclusive Clubroom\nLeave the lobby for a more intimate atmosphere at our exclusive social club on the Mezzanine level, serving complimentary sips and small plates. \nRooftop Terrace\nWelcome to a refreshing vantage point overlooking the city on our expansive Rooftop Terrace, ornamented with verdant greenery and open-air seating. \nFitness Studio\n\nSet yourself in motion in our modern fitness studio, equipped with everything you need for an active stay in Charleston. From a full range of strength training machines to a Peloton bike—come sweat it out in one of the only state-of-the-art fitness studios in downtown.\n\nVeranda Lounge\nPull up a seat and begin a rapport with our jovial mixologists while they concoct a drink from our signature menu. Tucked into the side of our lobby, Veranda Lounge is a place to see and be seen",
      "hash": "ecc6ef51fbc3",
      "downloadedAt": "2026-01-19T02:09:43.368Z",
      "trimmedAt": "2026-01-19T02:25:54.422Z",
      "sizeReduction": "93.3%"
    },
    {
      "url": "https://www.theloutrel.com/meetings-and-events",
      "text": "[Page Title: Event Space Charleston SC | Plan an Event | The Loutrel]\n\nSKIP TO CONTENT \nclose\n\nEmail Sign Up\nHidden Field Your Name Your Email I have read and agree to the . Privacy & Cookie Policy Yes, I would like to receive emails with exclusive specials and offers. subscribe \nTo Your Finest Hour\nLet us play host Against the backdrop of Charleston’s historic district, hosting sophisticated events comes as second nature to us. Pair an iconic location with one of our four distinct Charleston event spaces and you have the makings of an exquisite affair that captures the true spirit of the city and leaves a lasting impression on your guests. Request For Proposal \nThe Highlights\nUnforgettable Events \nHigh-Speed Wi-Fi Throughout The Property\n\nFour Distinct Venue Options\n\nComplete Meeting Packages With Curated Food & Beverage Options\n\nEvening Reception With A Selection Of Food & Drinks\n\nState-Of-The-Art Fitness Studio\n\nLocal Off-Site Catering Options\n\nSpaces\nEvent to Inspire \nRooftop Terrace\nPicturesque Views An unforgettable event deserves an unforgettable view to match. Overlooking Market Street and the colorful facades of the French Quarter, this expansive rooftop terrace offers plenty of open-air seatings in a refreshingly contemporary setting. \nVeranda Lounge\nLibations & Small Plates Perfect for private cocktails hours and mixers, Veranda Lounge is a place to see and be seen. Sit around our sit around our bar and dining space then swap stories and share city secrets over can’t-miss libations and small plates. \nThe Clubroom\nAll-Inclusive \nThe Loutrel's exclusive Clubroom on the Mezzanne level offers 700 sq. feet of flexible event space.\n\nThe Study\nPrivate Dining Gather your closest confidantes for a spirited experience in our private dining room. With room for up to 16 guests, this sophisticated space complements any occasion in The Loutrel’s signature style. \nCapacity Chart\nMeeting Room Dimensions Area(sq ft) Classroom Theater Banquet Reception Conference U-Shape Veranda Lounge 24' x 28' 672 - - - - 125 - The Study 18' x 12' 216 - 25 16 25 12 - Clubroom 28' x 25' 700 36 75 48 75 23 20 Rooftop Terrace 55' x 45' 2,475 - - 125 125 - - 1670 Room (Off-Site) 23' x 43' 1,105 40 50 50 70 22 24",
      "hash": "f8ebcadb7471",
      "downloadedAt": "2026-01-19T02:09:44.211Z",
      "trimmedAt": "2026-01-19T02:25:54.432Z",
      "sizeReduction": "96.6%"
    }
  ],
  "sizeReduction": "96.1%"
}