{
  "venueId": "ChIJZYukiWl6_ogRlbFtzB2FF7w",
  "venueName": "Indaco",
  "venueArea": "Downtown Charleston",
  "website": "https://www.indacorestaurant.com/location/indaco-charleston/?y_source=1_ODE4NDQwNzctNzE1LWxvY2F0aW9uLndlYnNpdGU%3D",
  "scrapedAt": "2026-01-18T17:04:27.940Z",
  "trimmedAt": "2026-01-18T17:11:13.041Z",
  "pages": [
    {
      "url": "https://www.indacorestaurant.com/charleston-menu/",
      "text": "Main content starts here, tab to start navigating Menus Charleston Slide 1 of 3 Slide 2 of 3 Slide 3 of 3 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Restaurant Week Dinner Brunch Desserts Happy Hour Red Sauce Monday Cocktails & Beer Wine List Download PDF DINNER Download PDF ANTIPASTI Focaccia whipped ricotta, apple butter 9 $ Marinated Olives Castelvetrano, Cerignola, salsa verde, lemon 9 $ Little Gem Lettuce* Caesar, Parmesan, garlic crumb, cured egg yolk 15 $ Prosciutto Di Parma Asian pear, honey, parmesan, flatbread 24 $ Burrata Asian pear, endive, radicchio, shallot, brown butter, hazelnut, flatbread +prosciutto / 6 19 $ Polpette Certified Angus Beef, Keegan Filion pork, San Marzano tomato DOP, Parmesan, basil 16 $ Roasted Beet Salad artisan greens, apple, spiced pepitas, gorgonzola, aged balsamic 18 $ Charred Octopus 'nduja braised field peas, squid ink, salsa verde, crispy prosciutto, pepitas 24 $ PIZZA Margherita San Marzano tomato DOP, mozzarella, basil, Parmesan 20 $ Spicy Soppressata San Marzano tomato DOP, mozzarella, basil, honey 22 $ Sausage roasted squash, Parmesan cream, fontina, Asiago pepperoncino, Aleppo, parsley 22 $ Mushroom Pizza smoked mozzarella, fontina, Parmesan, salsa verde 22 $ Amatriciana San Marzano tomato DOP, mozzarella, guanciale, red onion, Aleppo, oregano, pecorino 21 $ Brussels Sprouts bacon, apple, ricotta, smoked mozzarella, spiced maple syrup, Aleppo 22 $ *STATE OF SOUTH CAROLINA REGULATIONS DICTATES THAT “THOROUGHLY COOKING FOODS OF ANIMAL ORIGIN SUCH AS BEEF, EGGS, FISH, LAMB, POULTRY, PORK, OR SHELLFISH MAY REDUCE THE RISK OF FOOD BORNE ILLNESS.” INDACO WILL ADD A SERVICE CHARGE OF 20% TO PARTIES OF 6 OR MORE // NO SEPARATE CHECKS PASTA Tagliatelle* pork tesa, black pepper, Storey Farms egg, chives, Parmesan 29 $ Cappelletti lemon ricotta, roasted mushrooms, pepitas, rosemary, crispy prosciutto 29 $ Tajarin Nero Tarvin Shrimp, aglio e olio, Castelvetrano olives, lemon bread crumbs 30 $ Ricotta Gnudi fresh White Alba truffles, parmesan, butter, chives 75 $ Ricotta Cavatelli brown butter, roasted squash, Parmesan fonduta, fried sage, hazelnuts 29 $ Agnolotti roasted sweet potato, ricotta, pecan ragu, pecorino, aged balsamic 29 $ Creste Di Gallo Certified Angus Beef Bolognese, Parmesan, basil +Ricotta/$4 30 $ PIATTI Market Fish pecan crust, farro, roasted squash, cipollini, black garlic, pepitas 39 $ Roasted Half Chicken Parmesan grits, arrabbiata sauce, wood-fired broccolini 38 $ 8 oz Flatiron* Certified Angus Beef, fingerling potatoes, arugula, gorgonzola, pickled red onion, aged balsamic 45 $ CONTORNI Crispy Potatoes Parmesan, Calabrian aioli 10 $ Wood-Fired Broccolini olive vinaigrette, Parmesan 10 $ Marsh Hen Grits arrabbiata sauce, Parmesan, chive 10 $ Warm Farro Salad roasted squash, cipollini onion, black garlic vinaigrette, pepitas 10 $ Crispy Brussels Sprouts apples, balsamic, gorgonzola 10 $ Saturday + Sunday | 10 a.m - 2:30 p.m. Download PDF Antipasti Warm Marinated Olives Castelvetrano, Cerignola, salsa verde, lemon 9 $ Polpette Certified Angus Beef, Keegan Filion pork, San Marzano tomato DOP, Parmesan, basil 16 $ Burrata Toast avocado, prosciutto, arugula, grilled bread 19 $ + add Storey Farm egg 3 $ Little Gem Lettuce* Caesar, Parmesan, garlic crumb, cured egg yolk 15 $ Ricotta Toast seasonal jam, powdered sugar 13 $ Apple Pie Waffle caramelized apples, toasted pecans, vanilla whipped cream 17 $ Zeppole cannoli cream, chocolate chip 12 $ Pranzo Creste di Gallo Certified Angus Beef Bolognese, Parmesan, basil + Ricotta /4 29 $ Tagliatelle* pork tesa, black pepper, Storey Farms egg, chives, Parmesan 29 $ Spaghetti pecorino, black pepper, chive 26 $ Italian Sandwich prosciutto, soppressata, burrata, arugula, balsamic, olive oil, rosemary fries 20 $ Cavatelli arrabbiata, bread crumb, chives 29 $ Meatball Sandwich polpette, fresh mozzarella, basil, focaccia garlic bread, rosemary fries 20 $ Brunch Cocktails Brunch Bubbles orange, tangerine, or cranberry Glass 11 $ Carafe 45 $ Bloody Mary Charleston Bloody Mary Mix, Castelvetrano olive, soppressata, fontina 14 $ Smoke Show Illegal mezcal, dry vermouth, Licor 43, cardamom, orange bitters 17 $ When I Take My Sugar To Tea High Wire southern amaro, limoncello, tea 16 $ One in a Melon melon cello, Domaine de Canton, lemon, Prosecco 16 $ Empire State Angel’s Envy bourbon, lemon, rhubarb, red wine, egg white 17 $ Sweater Weather Beefeater gin, Laird’s Apple Jack, Aquavit, apple 17 $ Lime & the Coconut Beyond Distilling coconut rum, Frangelico, sage, lime, orange bitters 16 $ The Hugo Elderflower liqueur, mint syrup, lemon, Prosecco 16 $ Served with Crispy Fingerling Potatoes and Gem Salad Brunch Roady Plate* two Storey Farms Eggs any style, bacon, toast 17 $ Eggs in Purgatory* two eggs, spicy tomato, basil, Parmesan, toast 18 $ Steak and Eggs* 4 oz CAB flatiron, two Storey farm eggs any style, herb butter | Sub 8oz CAB flat iron - 30 24 $ Breakfast Sandwich* Toasted sourdough, bacon, egg, cheese 16 $ Scramble broccolini, roasted squash, smoked mozzarella, fontina 18 $ Extras Crispy Potatoes 4 $ Fries 4 $ Bacon 5 $ Side Gem Salad 4 $ Toast 3 $ Bagel 4 $ Pizza Margherita San Marzano tomato DOP, mozzarella, basil, Parmesan 20 $ Spicy Soppressata San Marzano tomato DOP, mozzarella, basil, honey 22 $ Breakfast Pie* fontina, smoked mozzarella, bacon, sausage, garlic, egg yolk 20 $ Mushroom ricotta, fontina, mozzarella, oyster mushrooms, garlic, Parmesan, rosemary, arugula 21 $ Oreganata tomato, garlic, oregano, burrata 21 $ Zero-Proof Limonata lemon, thyme, soda 6 $ Let's Pretend raspberry reduction, lime, ginger beer 10 $ Elote* Garden Seedlip, jalapeño corn reduction, lime, cream, soda 11 $ *STATE OF SOUTH CAROLINA REGULATIONS DICTATES THAT “THOROUGHLY COOKING FOODS OF ANIMAL ORIGIN SUCH AS BEEF, EGGS, FISH, LAMB, POULTRY, PORK, OR SHELLFISH MAY REDUCE THE RISK OF FOOD BORNE ILLNESS.” Desserts, After Dinner Drinks, & Spirits Download PDF Desserts Budino dark chocolate budino, black cherries, vanilla whipped cream 12 $ Zeppole cannoli cream, chocolate chip 12 $ Tiramisu mascarpone, espresso, cocoa 14 $ Gelato Trio daily assorted flavors 8 $ Sorbet daily assorted flavor 5 $ Biscotti almond, pistachio, orange 5 $ Butternut Squash Tart almond mascarpone, candied apple, toasted almond 13 $ Apple Crostata hazelnut frangipane, pecorino romano gelato 15 $ Dessert Wine DONNA FUGATA “BEN RYÉ Passito Di Pantelleria, 2017 16 $ ANGEL NEGRO “BIRBET” Brachetto, Piedmont 2020 11 $ LA GIARETTA Recioto Della, Valpolicella, Veneto 2018 12 $ CARPINETO \"FARNITO\" Vin Santo, Chianti 1999 26 $ Available Monday through Friday from 5 - 7 p.m., at the bar only. Download PDF Light Bites Marinated Olives Cerignola, Castelvetrano, salsa verde, lemon 6 $ Polpette Certified Angus Beef, Keegan Filion pork, San Marzano tomato DOP, Parmesan, basil 10 $ Little Gem Lettuce Caesar, Parmesan, garlic crumb, cured egg 9 $ Pizza of the Day ask your bartender, changes daily 12 $ Prosciutto Di Parma Parmesan, melon, honey, flatbread 16 $ Drink Specials Peroni 7 $ Negroni 9 $ House Wine Red, White, Rose 9 $ Old Fashioned 9 $ Moscow Mule 9 $ Red sauce specials available on Mondays only. Menu subject to change. Crispy Calamari banana peppers, calabrian aioli, arribiatta sauce 22 $ Supreme Pizza San Marzano tomato DOP, sausage, soppressata, peppers, onions, olives, parmesan 23 $ Chicken Parmesan Joyce Farms chicken breast,tomato, mozzarella, spaghetti, parmesan, basil 32 $ Spaghetti & Meatballs C.A.B, Keegan Filion pork, tomato, spaghetti, parmesan, basil 29 $ Cocktails & Beer Download PDF Signature Cocktails Plum Velvet Dream Plum-infused vodka, Disaronno, lemon 17 $ Smoke Show Illegal mezcal, dry vermouth, Licor 43, cardamom, orange bitters 17 $ Chai Town chai infused Lunazul blanco tequila, lemon, pineapple, vanilla 16 $ Lime & the Coconut Beyond Distilling coconut rum, Frangelico, sage, lime, orange bitters 16 $ Sunset Mule Bacardi silver rum, Chinola, lime, ginger beer 16 $ Barrel-Aged Black Manhattan Elijah Craig Barrel Select, Averna, orange bitters, Angostura bitters 26 $ Empire State Angel’s Envy bourbon, lemon, rhubarb, red wine, egg white 17 $ Sweater Weather Beefeater gin, Laird’s Apple Jack, Aquavit, apple 17 $ Zero Proof Limonata lemon, thyme syrup, sparkling water 8 $ Apple Jack Mule Seedlip spice, apple, lime, ginger beer 10 $ SPRITZ The Hugo Elderflower liqueur, mint syrup, lemon, Prosecco 16 $ One in a Melon melon cello, Domaine de Canton, lemon, Prosecco 16 $ Get Figgy with It fig cello, vanilla, lemon, Prosecco 16 $ Crimson Fall Sangria red wine, apple, fall spices, lemon, soda 16 $ Please accept our apologies if we are ever without a particular vintage or varietal, wine in this world cannot be guaranteed. Download PDF Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Atlanta Charleston Charlotte Greenville Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "0415f52bb7c0",
      "downloadedAt": "2026-01-18T16:54:18.624Z",
      "trimmedAt": "2026-01-18T17:11:12.854Z",
      "sizeReduction": "93.3%"
    },
    {
      "url": "https://www.indacorestaurant.com/location/indaco-charleston/?y_source=1_ODE4NDQwNzctNzE1LWxvY2F0aW9uLndlYnNpdGU%3D",
      "text": "Main content starts here, tab to start navigating Indaco Charleston Reservations Hours & Location 526 King St, Charleston, SC 29403 (843) 727-1229 indaco@theindigoroad.com Sunday - Thursday: 5 - 10 p.m.Friday + Saturday: 5 - 11 p.m. Dinner Saturday + Sunday: 10 a.m. - 2:30 p.m. Weekend Brunch Monday - Friday: 5 - 7 p.m. Happy Hour, available at the bar Facebook Instagram *Please note that we do not offer valet service; parking behind the building is monitored by a third party and is not affiliated with Indaco or The Indigo Road Hospitality Group. Get Directions About Our Story Menus View Menus Gallery Gallery Press Eater Carolinas 8 Best Italian Restaurants in Charleston All Recipes Italian Chefs Favorite Store-Bought Pasta Conde Nast Traveler 40 Best Restaurants in Charleston Eater Carolinas 13 Best Stops for Pizza in Charleston Eater Carolinas 11 Best Italian Restaurants in Charleston Eater Carolinas 12 Essential Stops for Pizza in Charleston OpenTable 12 top restaurants in Charleston that scream special occasion Post & Courier Thin crust? Deep dish? Here's our list of the top 20 Charleston-area pizza restaurants Charleston Guru A Look Inside: Indaco The Local Palate The Best Food + Drink in the South’s #1 Dining Town Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Atlanta Charleston Charlotte Greenville Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "3543dc7e0ac9",
      "downloadedAt": "2026-01-18T16:54:14.361Z",
      "trimmedAt": "2026-01-18T17:11:12.862Z",
      "sizeReduction": "95.0%"
    },
    {
      "url": "https://www.indacorestaurant.com/location/west-palm-beach/",
      "text": "Main content starts here, tab to start navigating West Palm Beach Coming Soon Slide 1 of 4 Slide 2 of 4 Slide 3 of 4 Slide 4 of 4 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Hours & Location 905 N Railroad Avenue, West Palm Beach, FL 33401 Hours Coming Soon Located in the vibrant Nora District of West Palm Beach, Indaco (Italian for “indigo”) brings the flavors of Italy to a dynamic new community. The menu showcases wood-fired pizzas, hand-crafted pastas, and house-made sausages, available family-style or à la carte. Guests can pair their meals with a thoughtfully curated wine list emphasizing Italian varietals, signature cocktails, local brews, and spirit-free options. Nora breathes new life into historic railway warehouses, blending character and innovation to create a cornerstone for contemporary West Palm living. Indaco’s inviting atmosphere aligns seamlessly with this vision, offering a front-row seat to the art of Italian cooking. Get Directions Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Atlanta Charleston Charlotte Greenville Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "740cf146447f",
      "downloadedAt": "2026-01-18T16:54:17.561Z",
      "trimmedAt": "2026-01-18T17:11:12.870Z",
      "sizeReduction": "94.8%"
    },
    {
      "url": "https://www.indacorestaurant.com/atlanta-menu/",
      "text": "Main content starts here, tab to start navigating Menu Atlanta Slide 1 of 3 Slide 2 of 3 Slide 3 of 3 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Dinner Weekend Brunch Dessert Beverage Aperitivo Hour Indaco Café Red Sauce Sunday Wine Mondays Antipasti Focaccia whipped butter, rosemary, wildflower honey 11 $ Marinated Olives castelvetrano, gordal, alorena, cerignola, citrus verde 10 $ Little Gem parmesan, garlic crumb, caesar dressing 15 $ Polpette certified Angus beef, heritage pork, San Marzano tomato DOP, basil, parmesan 16 $ PEI Mussels san marzano tomatoes, white wine garlic, calabrian chili, grilled focaccia 21 $ Burrata white balsamic, beets, shaved root vegetables, arugula, calabrian crouton 19 $ Tuna Tartare focaccia, marcona almond, chili crisp, castelvetrano olive 19 $ Kale Salad shaved apple, lavender vinaigrette, pecorino , pine nuts, local satsuma 15 $ Tomato-based pies made with san marzano tomato dop Pizza Margherita tomato, mozzarella, basil, parmesan, evoo 18 $ Spicy Soppressata tomato, mozzarella, basil, honey, parmesan 24 $ Italian Sausage tomato, mozzarella, red onion, goat cheese, pancetta, thyme 24 $ Funghi garlic oil, smoked mozzarella, pioppino, carmelized onion, fried rosemary 22 $ Short Rib ricotta, fontina, mozzarella, black pepper, frico 22 $ Butternut black truffle, coppinger cheese, proscuitto, red onion, crispy kale 24 $ * gluten-sensitive pizza dough available upon request +4 Pasta Tagliatelle pork tesa, black pepper, farm egg, parmesan, chive 30 $ Radiatori beef bolognese, stracciatella, tomato, aleppo, basil 30 $ Rigatoni ham hock, grain mustard, collards, grana 30 $ Agnolotti beef cheek, fontina fonduta, red wine, crispy sage 32 $ Bucatini white wine, butter, black truffle, italian sausage, pecorino, ricotta 32 $ Malfadine Nero butter, lemon, gulf shrimp, chili, basil 30 $ Lobster Ravioli lobster tail, ricotta, lemon zest, chili butter, old bay breadcrumb, pine nut 42 $ * gluten sensitive pasta available upon request Piatti Risotto sunchoke, oyster mushroom, chili oil, sae, pecorino 34 $ Hanger certified angus beef, fingerling potato, caramelized onion, truffle butter, mushroom demi 72 $ Roasted Half Chicken sweet potato, brussels, local apple, sherry agrodolce, crispy kale 34 $ market catch cauliflower stufato, romanesco, calabrian chili, crispy caper, lemon brodo 57 $ Contorni Crispy Potatoes calabrian chili aioli, parmesan 11 $ Crispy Brussels sherry, pinenuts, pecorino 11 $ Charred broccoli salsa aglio, apple, parmesan 10 $ Confit Sunchoke cauliflower, caramelized onion, brown butter, caper 12 $ Let our chef curate three courses, served family-style For the Table Family Style per guest 65 $ Saturday + Sunday: 11 a.m. - 2:30 p.m. Brunch Pastry Board chef select pastries 16 $ Zeppole ricotta donuts with blackberry jam and cannoli cream 13 $ Ricotta pancakes blueberry jam, lemon crema, hazelnut streusel 14 $ Burrata n’duja vinaigrette, sweet potato, arugula, prosciutto, balsamic, honey 19 $ Little Gem caesar, parmesan, garlic crumb 14 $ add chicken 5 $ shrimp & polenta heirloom tomato, shishito, red onion, pancetta, brown gravy 27 $ Soft Scramble foccacia, tomato, anaheim pepper, pecorino 16 $ Steak & Eggs 4oz tri-tip steak, arugula, caesar dressing, crispy potato, foi gras butter, demi-glace 25 $ Crispy Chicken Biscuit seasonal jam, b&b pickles, buttermilk biscuit, hot sauce 16 $ Eggs in Purgatory poached storey farm eggs, spicy tomato, basil, parmesan, focaccia 16 $ BIANCA PIZZA garlic, fontina, whipped ricotta, aged balsamic, arugula, Prosciutto di Parma 24 $ Breakfast Pizza garlic, prosciutto, smoked mozzarella, fried egg, hot sauce 24 $ Margherita Pizza DOP tomato, mozzarella, basil, parmesan 18 $ Bucatini carbonara or a la amatriciana 26 $ Radiatori pesto genovese, lemon, grana, bread crumb 25 $ add chicken 5 $ Dessert Tiramisu coffee soaked lady fingers, mascarpone cream, coffee chocolate sauce 15 $ Zeppole Gingerbread ricotta donuts, cinnamon sugar, cannoli cream, chai anglais 14 $ Amaretto Cheesecake citrumelo jam, amoretto crumb, vanilla chantilly, candied almond 14 $ chocolate torte(Gluten free) dark chocolate cake, blood orange ganache, candied walnut, vanilla soft serve 15 $ Apple Crostata roasted GA apples, salted caramel, spiced pecans 14 $ Soft Serve Apple Cider pecan praline, caramel 9 $ Swirl (Apple cider & Vanilla) pecan praline, caramel syrup, and butter cookie crumble 9 $ Vanilla Soft Serve butter cookie crumble 9 $ Wine Michele Chiarlo Moscato D'asti, Piedmont 2021 14 $ Donna Fugata “Ben Ryé” Passito Di Pantelleria, 2021 16 $ Marenco \"Pineto\" Brachetto d'Acqui, Piedmont 2021 14 $ Giulio Cocchi Barolo Chinato, Piedmont NV 15 $ Badia Coltibuono Vin Santo, Chianti 2014 19 $ After Dinner Drinks Cello Martini lazzaroni limoncello, gin, simple syrup, salt 12 $ Cafe Martini lazzaroni cafe liqueur, vodka, simple syrup, salt 12 $ Amaretto Peach Martini lazzaroni amaretto peach liqueur, montenegro, honey, salt 12 $ Nocino Martini lazzaroni nocino liqueur, bourbon, demerara syrup, salt 12 $ Cherry Martini lazzaroni marascino, tequila, simple syrup, salt 12 $ Dessert Martini flight pick three dessert martinis for the table 32 $ Signature Cocktails Il Rimedio absinthe rinse, sazerac rye, bourbon, lazzaroni amaretto peach, peychaud bitters, angostura bitters, sugar cube 19 $ Tintura No.2 pear infused tequila, honey, lemon, cocchi americano, cinnamon 17 $ LA PERLA vodka, limoncello, lemon, olive oil, basil, simple 16 $ Farmacista cognac, amaro montenegro, amaro dell etna, orange bitters 20 $ Alchemista galliano, st. remy's signature cognac, cocchi americano, lemon, agave 16 $ Zero Proof SODA DEL GIORNO flavor of the day, simple, soda 10 $ Helena Sprtiz elderflower, lemon, oddbird bubbles, soda 10 $ Aperolish Spritz mionetto, plus &minus N/A bubbles, soda 10 $ Available Monday through Friday, 4 - 6 p.m. Antipasti Marinated Olives castelvetrano, gordal, alorena, cerignola, citrus verde 5 $ Little Gem Salad parmesan, lemon, garlic crumb, caesar dressing 8 $ Polpette C.A.B, heritage pork, San Marzano tomato DOP, basil, parmesan 10 $ Pizza Margherita tomato, mozzarella, basil, parmesan, evoo 12 $ Spicy Soppressata tomato, mozzarella, basil, honey, parmesan 12 $ Beverage Peroni lager 5 $ Weekly Classic rotating selection of classic cocktails 10 $ Aperitif Spritz aperitif, bubbles, orange, soda 10 $ *Grab-and-go options with self-serve seating inside or on the outdoor patio Monday - Friday Pastries & Coffee : 8 a.m. - 2:30 p.m. Lunch Cafe Menu : 11 a.m. - 2:30 p.m. Antipasti Polpette certified angus beef, heritage pork, san marzano tomato, basil, parmesan 15 $ Little Gem garlic crumb, black pepper, parmesan, caesar dressing 12 $ add chicken 5 $ Italian Salad soppressata, olives, pickled pepper, little gem, provolone picante, red onion, Italian vinaigrette 13 $ Pasta Rigatoni beef bolognese, tomato, basil, parmesan 19 $ Bucatini cacio e pepe, parmesan, pecorino, black pepper, evoo 15 $ Radiatori pesto, genovese, lemon, parmesan 15 $ add chicken 5 $ Pizza Margherita San Marzano tomato DOP, mozzarella, basil, parmesan 16 $ Pepperoni tomato, mozzarella, basil, honey, parmesan 18 $ Panini Meatball provolone, basil, tomato 19 $ Prosciutto prosciutto di parma, provolone, arugula, balsamic 15 $ Chicken Parmesan provolone, basil, tomato, calabrian chili 19 $ Affettati Italian soppressata, mortadella, proscuitto, provolone, pickled red pepper, arugula, red onion, italian vinaigrette 15 $ WOOD FIRE CHICKEN fennel, red onion, green garlic, arugula, hot cherry pepper 14 $ shaved calabrian pancetta giardiniera, green garlic vinaigrette, little gem 15 $ Special menu available in addition to full dinner menu on Sunday evenings. Red Sauce Sunday Calzone arrabiata, spicy soppressata, smoked mozzarella 24 $ Chicken Parmesan mozzarella, provolone, pomodoro sauce, bucatini 27 $ Spaghetti & Meatballs CAB beef, heritage pork, tomato, basil, grana 28 $ amatriciana san marzano, pork tesa, calabrian chili, white wine, parmesan, chive 26 $ Monday Wine Special Enjoy half-off all bottles of wine.* *Valued up to $100. Receive $50 off bottles over $100. Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Atlanta Charleston Charlotte Greenville Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "7dcc0bea0213",
      "downloadedAt": "2026-01-18T16:54:18.094Z",
      "trimmedAt": "2026-01-18T17:11:12.929Z",
      "sizeReduction": "93.4%"
    },
    {
      "url": "https://www.indacorestaurant.com/charlotte-menus/",
      "text": "Main content starts here, tab to start navigating Menus Charlotte Slide 1 of 3 Slide 2 of 3 Slide 3 of 3 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Dinner Desserts Weekend Lunch + Brunch Happy Hour Wine Wednesdays Cocktails & Beer Red Sauce Sunday Restaurant Week Dinner Antipasti Focaccia sage, brown sugar butter 11 $ Marinated Olives cerignola, castelvetrano, cuquillo, arbequina, citrus, herbs 9 $ Little Gem Salad caesar, breadcrumbs, parmesan, cured egg yolk 15 $ Panzanella Salad mixed greens, heirloom tomatoes, cucumbers, pickled red onion, croutons, basil, sherry vinaigrette 16 $ Burrata focaccia, pickled beets, arugula, pears, pumpkin seeds, apple sage balsamic glaze 18 $ Polpette Cheshire pork, C.A.B., parmesan, basil 16 $ Prosciutto di Parma fig jam, pickled vegetables, parmesan, honey, olive oil, flatbread 22 $ Brussels Sprouts Italian chili crisp, pesto, honey, parmesan 13 $ Ahi Tuna Crudo tonnato, chili oil, radish, microgreens, crouton 23 $ Pizza Margherita Pizza San Marzano DOP tomato, mozzarella, basil, parmesan 18 $ Spicy Soppressata Pizza San Marzano DOP tomato, mozzarella, basil, honey 21 $ Bianca Pizza ricotta, fontina, mozzarella, garlic, parmesan, parsley 18 $ Mushroom Pizza* local mushrooms, garlic, fontina, gorgonzola, truffle aioli, parsley 20 $ Fig Pizza gorgonzola whip, smoked mozzarella, arugula, parmesan, balsamic glaze 21 $ Sausage Pizza roasted red pepper, fontina, smoked mozzarella, parmesan, herbs 20 $ Pasta Tagliatelle* black pepper, pork tesa, Storey Farm's egg yolk, chives, parmesan 28 $ Casarecce C.A.B. bolognese, basil, tomato, parmesan 29 $ Campanelle duck bolognese, roasted pears, focaccia crumbs, pickled fresnos 30 $ Bucatini cacio e pepe, black truffle, pecorino toscano 28 $ Mezzelune lobster, mascarpone, lemon, local Bradford Farms butternut squash, basil, toasted pinenuts 36 $ Radiatori Nero* squid ink, shrimp, blistered tomatoes, roasted red bell peppers, Italian chili crisp 30 $ Piatti Joyce Farms Half Chicken mustard greens, polenta, mushroom marsala cream, cilantro, microgreens 34 $ Grilled Trout* butternut squash, gnocchi, baby spinach, pomegranate 37 $ Bistecca* 8oz CAB flat iron, grilled broccolini, crispy potatoes, black garlic, olive vinaigrette 55 $ Bistecca* 22oz CAB bone-in ribeye, grilled broccolini, crispy potatoes, black garlic, olive vinaigrette 75 $ Contorni Smashed Potatoes* calabrian aioli, parmesan, chive 10 $ Broccolini olive vinaigrette, parmesan 10 $ Italian Greens spinach, mustard greens 10 $ Chef curated family-style three-course meal, $60/guest For The Table Desserts Dessert Burnt Orange Posset orange custard, spiced chocolate pistachios, berries 13 $ Tiramisu mascarpone mousse, coffee-soaked ladyfingers, espresso sauce 15 $ Zeppole sweet ricotta donut, cinnamon sugar, apple caramel 13 $ Caramel Hazelnut Cheesecake chocolate shortbread, hazelnut meringue, caramelized white chocolate sauce 15 $ Apple Crostata apple caramel, spiced gelato, white chocolate crumb 15 $ Affogato double scoop gelato, double espresso, biscotti 12 $ Gelato Trio daily selection 12 $ Sorbet daily selection 12 $ Espresso Espresso 3 $ Double Espresso 6 $ Cappuccino 6 $ Americano 6 $ Dessert Cocktails House Limoncello 9 $ Espresso Martini house espresso mix, kahlua, smirnoff whipped vodka 15 $ Crème Brûlée Martini smirnoff whipped vodka, white chocolate liquor, baileys, cream 15 $ Limoncello Float house-made Limoncello gelato, prosecco 14 $ *Contains ingredients that are raw or undercooked. Consuming raw or undercooked meats, poultry, seafood, shellfish, or eggs may increase risk of foodborne illness. **Items are special order and may not always be available. Amari and Digestivi Cardamaro - Piedmonte, Italy sweet, herbal, orange peel, pine 9 $ Montenegro - Bologna, Italy tangerine, cucumber, black cherry 13 $ Averna - Sicily, Italy cola, orange peel, licorice, vanilla 14 $ Amaro Nonino - Fruili, Italy caramel, orange peel, gentile spice 16 $ Zucca Rubarbaro - Milan, Italy bitter orange, sweet, notes of rhubarb 13 $ Fernet Branca - Milan, Italy mint, eucalyptus, medicinal 14 $ Don Ciccio Cinque - Washington, DC bitter orange, gentian root 9 $ Friday: 11 a.m. - 2:30 p.m. Saturday + Sunday: 11 a.m. - 3 p.m. Antipasti Marinated Olives cerignola,castelvetrano,cuquillo, arbequina, citrus, herbs 9 $ Polpette* C.A.B. beef, cheshire pork, parmesan, basil 16 $ Burrata Toast avocado, prosciutto, pickled red onion, greens, grilled foccacia 18 $ Little Gem Lettuce* caesar, garlic crumb, parmesan 15 $ Panzanella Salad mixed greens, heirloom tomatoes, cucumbers, pickled red onion, croutons, basil, sherry vinaigrette 16 $ Zeppole sweet ricotta donut, cinnamon sugar, apple caramel 13 $ Pizza Margherita San Marzano tomato DOP, mozzarella, basil, parmesan 16 $ Bianca roasted garlic, mozzarella, fontina, ricotta, parsley 18 $ Spicy Soppressata Pizza San Marzano DOP tomato, mozzarella, basil, honey 21 $ Breakfast Pie* mozzarella, heirloom tomatoes, bacon, over-easy egg, calabrian aioli 18 $ Brunch Roady Plate* two Storey Farms eggs any style, bacon, toast 15 $ Eggs in Purgatory* two poached Storey Farms eggs, spicy tomato, basil, parmesan, focaccia toast 16 $ B.E.C.A.* house brioche bun, bacon, two hard fried eggs, mozzarella, smashed avocado, spicy aioli 15 $ Lemon Ricotta Pancakes seasonal fruit compote, chantilly 15 $ Pumpkin Roll fall spiced yeast roll, brown sugar maple glaze, pepitas 13 $ Steak and Eggs* 4 oz CAB flatiron, two Storey farm eggs any style, herb butter | Sub 8oz CAB flat iron - 30 24 $ Smashed Potatoes 4 $ French Fries 4 $ Mixed Green Salad 4 $ Pasta Casarecce C.A.B. bolognese, basil, tomato, parmesan 29 $ Tagliatelle* black pepper, pork tesa, Storey Farms egg, chives, parmesan 28 $ Spaghetti pomodoro, garlic confit, parmesan, basil 22 $ Tramezzino Polpette smoked mozzarella, plum tomato, parmesan, basil, hoagie 17 $ Italian prosciutto, soppressata, mortadella, stracciatella, greens, balsamic, EVOO, hoagie 18 $ From the Bar Bloody Mary aleppo, charred lemon pancetta 14 $ Tableside Mimosa prosecco, two juices 35 $ Bellini peach reduction, prosecco 12 $ Available Monday through Friday from 4:30 - 6:30 p.m., at the bar only. Snacks Marinated Olives cerignola, castelvetrano, cuquillo, arbequina, citrus, herbs 5 $ Little Gem Salad* caesar, bread crumbs, parmesan, cured egg yolk 9 $ Polpette* Cheshire Pork, C.A.B. Beef, Parmesan, Basil 9 $ Prosciutto di Parma parmesan, melon, hot honey, hazelnut, chive, aleppo & herb flatbread 15 $ PEI mussels white wine, lemon, calabrian chili, butter, parsley, grilled bread 13 $ Pizza of the Day 12 $ Cocktails Spicy Margarita serrano infused tequilla, triple sec, house made sour mix 9 $ Italian Gin & Tonic gin, limoncello, elderflower 9 $ Select Wines 6 $ Wednesday Wine Special Enjoy half-off all bottles of wine.* *Valued up to $100. Receive $50 off bottles over $100. *Contains Nuts **Contains Eggs or Legumes Cocktails Blue Dreams new amsterdam gin, elderflower, blueberry chamomile shrub, lemon, aquafaba** 16 $ Corpses Bride montenegro, domaine canton, peach, maple, egg** 16 $ Equinox Elixir plantation rum, aperol, limecello, lime, pineapple, matcha 17 $ Ghost of Montenegro old forester bourbon, fernet mentha, montenegro, mint, honey 18 $ Misty Mountain lunazul tequila, velvet falernum*, spiced pear, orange syrup 16 $ The Montresor los vecinos mezcal, licor 43, plum, grapefruit shrub, lemon 17 $ Smoke & Mirrors private barrel elijah craig, maple pecan syrup* 23 $ Artic Affair amaretto*, spiced cranberry, lemon, prosecco 15 $ Fig Fritz elderflower, lime, pomegranate juice, fig, prosecco 16 $ Spirit-Free Cocktails Spiced & Stormy pomegranate & fig, ginger beer 10 $ Ember Glow blueberry chamomile shrub, lime, basil 10 $ Vicious Vanilla orange syrup, vanilla bean, lemon 10 $ Beer Good Morning Vietnam Coffee Vanilla Blonde Ale | Charlotte, NC | 5.0% 8 $ Wooden Robot Pilsmatic Pilsner | Charlotte, NC | 5.0% 8 $ Edmunds Oast Bound By Time American India Pale Ale | Charleston, SC | 7.0% 9 $ Bottiglie Triple C Golden Boy Blond Ale | Charlotte, NC | 4.5% 8 $ Peroni Italiana | 5% 7 $ Allagash White Belgian Style Wheat Beer | Maine | 5.2% 8 $ Best Day Brewing Kolsch Style | California Non-Aloholic 7 $ Red sauce specials available on Sundays only. *Menu is subject to change. Red Sauce Sunday Fried Calamari seasoned breadcrumbs, lemon, pomodoro 18 $ Chicken Parmesan Joyce Farms chicken breast, tomato, mozzarella, spaghetti, parmesan, basil 32 $ Spaghetti & Meatballs C.A.B, Keegan Filion pork, tomato, spaghetti, parmesan, basil 24 $ Dine with us January 23 - February 1 for Queen's Feast Restaurant Week and enjoy a three-course dinner for $55+ per person. We’re offering your choice of antipasti or pizza, pasta or piatti, and dessert. Download PDF Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Atlanta Charleston Charlotte Greenville Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "97270789734a",
      "downloadedAt": "2026-01-18T16:54:19.168Z",
      "trimmedAt": "2026-01-18T17:11:12.988Z",
      "sizeReduction": "93.2%"
    },
    {
      "url": "https://www.indacorestaurant.com/location/indaco-charleston/",
      "text": "Main content starts here, tab to start navigating Indaco Charleston Reservations Hours & Location 526 King St, Charleston, SC 29403 (843) 727-1229 indaco@theindigoroad.com Sunday - Thursday: 5 - 10 p.m.Friday + Saturday: 5 - 11 p.m. Dinner Saturday + Sunday: 10 a.m. - 2:30 p.m. Weekend Brunch Monday - Friday: 5 - 7 p.m. Happy Hour, available at the bar Facebook Instagram *Please note that we do not offer valet service; parking behind the building is monitored by a third party and is not affiliated with Indaco or The Indigo Road Hospitality Group. Get Directions About Our Story Menus View Menus Gallery Gallery Press Eater Carolinas 8 Best Italian Restaurants in Charleston All Recipes Italian Chefs Favorite Store-Bought Pasta Conde Nast Traveler 40 Best Restaurants in Charleston Eater Carolinas 13 Best Stops for Pizza in Charleston Eater Carolinas 11 Best Italian Restaurants in Charleston Eater Carolinas 12 Essential Stops for Pizza in Charleston OpenTable 12 top restaurants in Charleston that scream special occasion Post & Courier Thin crust? Deep dish? Here's our list of the top 20 Charleston-area pizza restaurants Charleston Guru A Look Inside: Indaco The Local Palate The Best Food + Drink in the South’s #1 Dining Town Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Atlanta Charleston Charlotte Greenville Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "a512fa82bc35",
      "downloadedAt": "2026-01-18T16:54:15.441Z",
      "trimmedAt": "2026-01-18T17:11:12.996Z",
      "sizeReduction": "95.0%"
    },
    {
      "url": "https://www.indacorestaurant.com/location/indaco-atlanta-beltline/",
      "text": "Main content starts here, tab to start navigating Indaco Atlanta Reservations Slide 1 of 4 Slide 2 of 4 Slide 3 of 4 Slide 4 of 4 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Hours & Location 725 Ponce De Leon Ave NE Suite 250, Atlanta, GA 30306 (404) 205-5183 indacoatlanta@theindigoroad.com HOURS Bar Monday - Friday: Opens at 4 p.m. Dinner Sunday - Thursday: 5 – 10 p.m Friday + Saturday: 5 – 11 p.m. Weekend Brunch Saturday + Sunday: 11 - 2:30 p.m. Indaco Café [Grab-and-Go Options with Self-Serve Seating] 8 a.m. - 2:30 p.m. Monday - Friday: Order Pickup Catering Menu LOCATION Indaco is located on the office lobby level of the 725 Ponce building, accessible from the main building entrance off of Ponce de Leon or North Avenue, and from the Atlanta BeltLine Eastside Trail. INDACO ATLANTA Located on the BeltLine, Indaco offers a blend of elevated and casual dining with a modern, Italian menu. Enjoy house-made pastas and wood-fired pizzas along with classic piatti, a fresh cocktail menu and an Italian-forward wine list. For press inquiries, please contact Laura Craft at lecraft@theindigoroad.com Facebook Instagram PARKING Guests have the option of complimentary self-parking, with parking tickets validated by request after your meal. Self-parking is located below the 725 Ponce building. Valet parking is available Thursday through Saturday. Kroger parking is monitored by a third party and is not affiliated with Indaco or The Indigo Road Hospitality Group. Please call us if you need extra assistance with parking/directions. Get Directions About Our Story Menus View Menus Gallery Gallery Private Dining Learn More Press Atlanta Jewish Times Italian Food and Wine Elevated on the Beltline The Local Palate Cinnamon Coffee Cake Atlanta Eats The Ultimate Guide to Italian Restaurants in Atlanta Rough Draft Recipe: Indaco’s breakfast pizza Atlanta Magazine Dishes We Love: Indaco’s zeppole Southern Living 16 Things To Eat And Do On Atlanta's BeltLine Jezebel Magazine 2024 Best Of Atlanta List Atlanta Journal Constitution Four Atlanta bartenders who showcase the industry and our city Eater Atlanta The 14 Hottest New Restaurants Around Atlanta, January + February 2024 Appetito Indaco Atlanta Brings Italian Food to the BeltLine Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Atlanta Charleston Charlotte Greenville Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "c8663385d9f8",
      "downloadedAt": "2026-01-18T16:54:14.917Z",
      "trimmedAt": "2026-01-18T17:11:13.008Z",
      "sizeReduction": "93.5%"
    },
    {
      "url": "https://www.indacorestaurant.com/location/indaco-charlotte/",
      "text": "Main content starts here, tab to start navigating Indaco Charlotte Reservations Hours & Location 2046 South Blvd, Charlotte, NC 28203 (704) 741-9004 indacocharlotte@theindigoroad.com Friday, Saturday + Sunday: 11 a.m. - 3 p.m. Brunch Mon – Thurs: 5 - 10 p.m.Fri + Sat: 5 - 11 p.m.Sunday: 5 - 9 p.m. Dinner Mon - Friday: 4:30 - 6:30 p.m. Happy Hour, available at the bar Facebook Instagram Get Directions About Our Story Menus View Menus Gallery View Gallery Press Axios Charlotte Charlotte's top dishes chosen by our journalists, February 2024 QC Exclusive Sundays Just Got Better With Our Guide to the Best Brunch In Charlotte NC Charlotte Observer Highest-rated Italian restaurants in Charlotte by diners Charlotte Observer Who does the best with Duke’s Mayo and tomatoes? QC Exclusive Complete Guide To Italian Restaurants In Charlotte NC And What To Order Charlotte Magazine A Guide to Charlotte’s Best Italian Restaurants: 2023 Charlotte Agenda The 21 most anticipated new restaurant, bar, and brewery grand openings Charlotte Agenda View 12 photos and full menu at Indaco, an Italian restaurant opening in South End QC Life A New Restaurant Offering Rustic Italian Food Set to Open Late Fall Charlotte Agenda Wild month: Full list of all 19 restaurants and bars opening in October Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Atlanta Charleston Charlotte Greenville Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "e68b0b6cb05a",
      "downloadedAt": "2026-01-18T16:54:15.964Z",
      "trimmedAt": "2026-01-18T17:11:13.018Z",
      "sizeReduction": "94.9%"
    },
    {
      "url": "https://www.indacorestaurant.com/location/indaco-greenville/",
      "text": "Main content starts here, tab to start navigating Indaco Greenville Reservations Hours & Location 40 W Broad Street, Greenville, SC 29601 (864) 326-4817 Indacogreenville@theindigoroad.com Sunday - Thursday: 5 - 10 p.m.Friday + Saturday: 5 - 11 p.m.Saturday + Sunday: 11 a.m. - 2:30 p.m. Dinner Weekend Brunch Monday - Friday: 4 - 6 p.m.Saturday + Sunday: 3 - 5 p.m. Aperitivo Hour, at the outdoor bar *Limited menu available. Outdoor bar open weather permitting. Indaco Greenville Indaco Greenville seamlessly blends both elevated and casual dining with an airy, Italian-inspired menu. Indulge with hand-made pasta and wood-fired pizzas, alongside an exciting cocktail menu and an Italian-forward wine list. Enjoy Indaco favorites in our main dining room, or dine al fresco on our covered outdoor patio with access from Main Street. For press inquiries, please contact Laura Craft at . lecraft@theindigoroad.com Facebook Instagram Get Directions About Our Story Menus View Menus Gallery Gallery Private Dining Learn More Press VisitGreenvilleSC Greenville's Best Brunch Spots GVLtoday ABC’s of Greenville Southern Living 15 Best Restaurants In Greenville, South Carolina Greenville Journal Indaco manages modern Italian with grace, hospitality and a local touch Living Upstate SC Indaco brings a taste of Charleston to downtown Greenville Eater Carolinas 10 Hottest Restaurants in Greenville TOWN Indaco: Golden Era Growth SC Biz News Here’s a look at Greenville’s newest downtown restaurant Eater Carolinas Indaco Brings Wood-Fired Italian Favorites to Greenville, South Carolina The Local Palate A First Look at Indaco Greenville Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Atlanta Charleston Charlotte Greenville Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "ea52b0bb6605",
      "downloadedAt": "2026-01-18T16:54:16.509Z",
      "trimmedAt": "2026-01-18T17:11:13.028Z",
      "sizeReduction": "94.5%"
    },
    {
      "url": "https://www.indacorestaurant.com/location/alys-beach/",
      "text": "Main content starts here, tab to start navigating Indaco Alys Beach Slide 1 of 3 Slide 2 of 3 Slide 3 of 3 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Hours & Location 40 Mark Twain Lane Suite 101, Alys Beach, FL 32461 Hours Coming Soon Italian in Alys Beach Steps from the Gulf and at home in the heart of Alys Beach, Indaco brings the flavors of Italy to Florida’s Emerald Coast. The space blends coastal charm with Indaco’s signature warmth, inviting guests to linger over hand-crafted pastas, wood-fired pizzas, and shared plates best enjoyed with friends. Whether you’re joining us for a casual evening or a special occasion, the atmosphere is always one of community and connection. Stay Connected Be the first to know about opening updates, special dinners, and events unique to Alys Beach. Sign up for our emails and never miss a reason to gather at the table. Sign Up Get Directions Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Atlanta Charleston Charlotte Greenville Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "eca118393e84",
      "downloadedAt": "2026-01-18T16:54:14.392Z",
      "trimmedAt": "2026-01-18T17:11:13.034Z",
      "sizeReduction": "94.8%"
    },
    {
      "url": "https://www.indacorestaurant.com/location/nashville/",
      "text": "Main content starts here, tab to start navigating Indaco Nashville Coming Soon Slide 1 of 9 Slide 2 of 9 Slide 3 of 9 Slide 4 of 9 Slide 5 of 9 Slide 6 of 9 Slide 7 of 9 Slide 8 of 9 Slide 9 of 9 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Hours & Location 1408 Adams Street, Nashville, TN 37208 indaconashville@theindigoroad.com Hours Coming Soon Indaco Nashville At Indaco, we celebrate the spirit of Italian dining, bold flavors, shared plates, and a love for bringing people together. Our Nashville home carries that same energy, with a lively bar, an open kitchen framed by counter seating, and a patio made for lingering over cocktails and conversation. Set in the heart of Germantown, this location blends neighborhood charm with Indaco’s signature warmth. Whether you’re here for a quick spritz or a long, pasta-filled evening, you’re in the right place. Be the First to Know Get insider access to Indaco Nashville. Sign up for our mailing list and be the first to hear about our opening date, exclusive pre-opening events, and priority to our first reservations. Email Signup Get Directions Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location Atlanta Charleston Charlotte Greenville Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "ff65018bf1ef",
      "downloadedAt": "2026-01-18T16:54:17.035Z",
      "trimmedAt": "2026-01-18T17:11:13.041Z",
      "sizeReduction": "94.8%"
    }
  ],
  "sizeReduction": "93.9%"
}