{
  "venueId": "ChIJl_KQyvdx_ogR7drlqON6cFM",
  "venueName": "Grimaldi's Pizzeria",
  "venueArea": "Mount Pleasant",
  "website": "https://www.grimaldispizzeria.com/locations/mount-pleasant/",
  "scrapedAt": "2026-01-18T17:04:29.115Z",
  "trimmedAt": "2026-01-18T17:11:38.838Z",
  "pages": [
    {
      "url": "https://www.grimaldispizzeria.com/specials/",
      "text": "Specials What’s Cookin’ Check out Grimaldi’s promotions and specials, from our seasonal menu and promotions, to Tuesday Tastings, to our military / veteran discount and more! New – Winter Seasonal Menu! Festive Flavors The Duo Pizza Cherry Pecan Salad Black Cherry Cheesecake REESE’S® Peanut Butter Cup Cheesecake Cran-Cherry Twist (non-alcoholic) Black Cherry Spritz Rye On Time View Menu Order Now For a Limited time. Stoking Social Hour* is Back! 3pm-5pm Daily While we stoke our famous coal brick ovens, we invite you to come socialize and enjoy these exciting deals! Signature Cocktails $10 Starters & Salads $3 Off Beer, Spritzes, Mocktails, Wine** & Sangria** $2 Off Bottles of Wine** $10 Off *Not available in South Carolina or at the Palazzo in Las Vegas. Must be 21+ to purchase or consume alcohol. Offers valid for dine-in only. Price and selection may vary by location. **On Tuesdays, Enjoy 50% Off Wine & Sangria All Day! Reserve wines excluded from 50% off offer. Find a Location Slices ASAP! Join us Monday – Friday from 11am – 3pm for a delicious lunch with Grimaldi’s Slices ASAP! Perfect for a fast yet satisfying meal, our coal-fired slices are ready in a New York minute. Choose from a giant white or red slice, a house or Caesar salad, and a refreshing soda or iced tea to create your ideal lunch. Pick Your Perfect Lunch: – $10.99 Slice, Salad, & Drink Combo – $7.49 Slice & Drink Combo – $4 Slice Only Add your favorite toppings to any slice for just $0.75 each. Not Available at Brooklyn or Palazzo locations. ORDER ONLINE Find a Location New Game Alert: “Ready, Set, Dough!” Fulfill your pizza orders from hungry customers before time runs out and keep them coming back for more of Grimaldi’s famous Coal-fired, Brick-oven pizzas. Do you have what it takes to go from Cheese the Day to Mozzarella Millionaire? Time to find out! Climb your way to the top of the leaderboard by unlocking our endless challenge mode: “Brooklyn Blitz.” Play Now Tuesday Tastings Every Tuesday, guests 21+ can enjoy half off glasses and bottles of wine, as well as glasses of sangria at participating locations. Dine-in only. Find A Location Participating Locations only Thank You, Military Members! In support of our military service members and veterans, we offer 15% off every day of the year! Must show ID. Available for dine-in or call-in takeout only. Find A Location Participating Locations only Earn Points On Every Order Get The Grimaldi's Pizzeria Rewards App Learn More Learn more about rewards",
      "hash": "17b3dfec0ea2",
      "downloadedAt": "2026-01-18T16:56:22.489Z",
      "trimmedAt": "2026-01-18T17:11:38.734Z",
      "sizeReduction": "98.5%"
    },
    {
      "url": "https://www.grimaldispizzeria.com/locations/",
      "text": "Find a Grimaldi's Pizzeria location near you City, State or Zip Code AL AZ FL IA ID KS KY NV NY SC TX WI UAE Alabama Hoover - Stadium Trace Village 5225 Peridot Place, Suite 121 Hoover, AL 35244 directions for 205-739-2159 Open today: 11:00 am - 9:00 pm Until 3:00pm By The Slice Order Now for Hoover - Stadium Trace Village Directions for Hoover - Stadium Trace Village More Info for Hoover - Stadium Trace Village Huntsville - Valley Bend at Jones Farm 2724 Carl T Jones Dr SE Huntsville, AL 35802 directions for 256-672-3535 Open today: 11:00 am - 9:00 pm Until 3:00pm By The Slice Order Now for Huntsville - Valley Bend at Jones Farm Directions for Huntsville - Valley Bend at Jones Farm More Info for Huntsville - Valley Bend at Jones Farm Madison - Clift Farm Madison, AL 35758 Coming Soon! More Info for Madison - Clift Farm Arizona Casa Paloma 7131 W. Ray Rd Ste. 23 Chandler, AZ 85226 directions for 480-785-1600 Open today: 11:00 am - 9:00 pm Until 3:00pm By The Slice Order Now for Casa Paloma Directions for Casa Paloma More Info for Casa Paloma DC Ranch, Scottsdale 20715 N. Pima Rd Ste. F 115 Scottsdale, AZ 85255 directions for 480-515-5588 Open today: 11:00 am - 9:00 pm Until 3:00pm By The Slice Order Now for DC Ranch, Scottsdale Directions for DC Ranch, Scottsdale More Info for DC Ranch, Scottsdale Old Town, Scottsdale 4000 N. Scottsdale Rd Ste. 105 Scottsdale, AZ 85251 directions for 480-994-1100 Open today: 11:00 am - 10:00 pm Order Now for Old Town, Scottsdale Directions for Old Town, Scottsdale More Info for Old Town, Scottsdale Park West 9788 W. Northern Ave Ste. 1440 Peoria, AZ 85345 directions for 623-486-4455 Open today: 11:00 am - 10:00 pm Until 3:00pm By The Slice Order Now for Park West Directions for Park West More Info for Park West San Tan 2168 E. Williams Field Rd Ste .102 Gilbert, AZ 85295 directions for 480-814-7722 Open today: 11:00 am - 10:00 pm Until 3:00pm By The Slice Order Now for San Tan Directions for San Tan More Info for San Tan Scottsdale Quarter 15147 N. Scottsdale Rd Ste H-135 Scottsdale, AZ 85254 directions for 480-596-4070 Open today: 11:00 am - 10:00 pm Until 3:00pm By The Slice Order Now for Scottsdale Quarter Directions for Scottsdale Quarter More Info for Scottsdale Quarter Florida Downtown Palm Beach Gardens 11701 Lake Victoria Gardens Ave 3101 Palm Beach Gardens, FL 33410 directions for 561-625-4665 Open today: 11:00 am - 10:00 pm Until 3:00pm By The Slice Order Now for Downtown Palm Beach Gardens Directions for Downtown Palm Beach Gardens More Info for Downtown Palm Beach Gardens Fort Myers - Bell Tower 13499 S. Cleveland Ave Ste. 201 Fort Myers, FL 33907 directions for 239-432-9767 Open today: 11:00 am - 9:00 pm Until 3:00pm By The Slice Order Now for Fort Myers - Bell Tower Directions for Fort Myers - Bell Tower More Info for Fort Myers - Bell Tower Miramar Beach - Grand Boulevard 780 Grand Boulevard, Ste 100 Miramar Beach, FL 32550 directions for 850-837-3095 Open today: 11:00 am - 9:00 pm Until 3:00pm By The Slice Order Now for Miramar Beach - Grand Boulevard Directions for Miramar Beach - Grand Boulevard More Info for Miramar Beach - Grand Boulevard Tampa - Westshore 218 Westshore Plaza Tampa, FL 33609 directions for 813-287-2500 Open today: 11:00 am - 9:00 pm Until 3:00pm By The Slice Order Now for Tampa - Westshore Directions for Tampa - Westshore More Info for Tampa - Westshore Iowa Ankeny - The District at Prairie Trail 1450 SW Vintage Pkwy Ankeny, IA 50023 directions for (515) 635-1038 Open today: 11:00 am - 10:00 pm Until 3:00pm By The Slice Order Now for Ankeny - The District at Prairie Trail Directions for Ankeny - The District at Prairie Trail More Info for Ankeny - The District at Prairie Trail West Des Moines - West Glen Town Center 5485 Mills Civic Pkwy West Des Moines, IA 50266 directions for 515-414-8949 Open today: 11:00 am - 10:00 pm Until 3:00pm By The Slice Order Now for West Des Moines - West Glen Town Center Directions for West Des Moines - West Glen Town Center More Info for West Des Moines - West Glen Town Center Idaho Meridian 3573 Longwing Lane, Suite 130 Meridian, ID 83646 directions for 208-884-2031 Open today: 11:00 am - 9:00 pm Until 3:00pm By The Slice Order Now for Meridian Directions for Meridian More Info for Meridian Kansas Overland Park - Prairiefire 5601 W. 135th Street, Suite 2240 Overland Park, KS 66223 directions for 913-851-5062 Open today: 11:00 am - 9:00 pm Until 3:00pm By The Slice Order Now for Overland Park - Prairiefire Directions for Overland Park - Prairiefire More Info for Overland Park - Prairiefire Kentucky The Summit at Fritz Farm 118 Marion, Suite 110 Lexington, KY 40517 directions for 859-523-7503 Open today: 11:00 am - 9:00 pm Until 3:00pm By The Slice Order Now for The Summit at Fritz Farm Directions for The Summit at Fritz Farm More Info for The Summit at Fritz Farm Nevada Las Vegas - South Rainbow 7155 S. Rainbow Blvd Ste. 125 Las Vegas, NV 89118 directions for 702-207-6757 Open today: 11:00 am - 10:00 pm Until 3:00pm By The Slice Order Now for Las Vegas - South Rainbow Directions for Las Vegas - South Rainbow More Info for Las Vegas - South Rainbow Las Vegas / Henderson – Eastern Ave (Green Valley) 9595 S. Eastern Ave Ste. 100 Las Vegas, NV 89123 directions for 702-657-9400 Open today: 11:00 am - 10:00 pm Until 3:00pm By The Slice Order Now for Las Vegas / Henderson – Eastern Ave (Green Valley) Directions for Las Vegas / Henderson – Eastern Ave (Green Valley) More Info for Las Vegas / Henderson – Eastern Ave (Green Valley) Las Vegas / Summerlin - Boca Park 750 S. Rampart Blvd Ste. 7 Las Vegas, NV 89145 directions for 702-479-1351 Open today: 11:00 am - 10:00 pm Until 3:00pm By The Slice Order Now for Las Vegas / Summerlin - Boca Park Directions for Las Vegas / Summerlin - Boca Park More Info for Las Vegas / Summerlin - Boca Park Las Vegas Strip – Palazzo (Grand Canal Shoppes) 3327 Las Vegas Blvd Ste. 2710 Las Vegas, NV 89109 directions for 702-754-3450 Open today: 11:00 am - 11:00 pm Order Now for Las Vegas Strip – Palazzo (Grand Canal Shoppes) Directions for Las Vegas Strip – Palazzo (Grand Canal Shoppes) More Info for Las Vegas Strip – Palazzo (Grand Canal Shoppes) Sparks - Outlets at Legends 1180 Scheel's Dr Ste. B-117 Sparks, NV 89434 directions for 775-356-7373 Open today: 11:00 am - 10:00 pm Until 3:00pm By The Slice Order Now for Sparks - Outlets at Legends Directions for Sparks - Outlets at Legends More Info for Sparks - Outlets at Legends New York 1 Front Street Brooklyn 1 Front Street Brooklyn, NY 11201 directions for 718-858-4300 Open today: 11:00 am - 11:00 pm Order Now for 1 Front Street Brooklyn Directions for 1 Front Street Brooklyn More Info for 1 Front Street Brooklyn South Carolina Mount Pleasant 1244 Belk Dr. Mt. Pleasant, SC 29464 directions for 843-971-9368 Open today: 11:00 am - 9:00 pm Until 3:00pm By The Slice Order Now for Mount Pleasant Directions for Mount Pleasant More Info for Mount Pleasant Texas Baybrook Mall 700 Baybrook Mall, Ste 117 Friendswood, TX 77546 directions for 281-286-3942 Open today: 11:00 am - 10:00 pm Until 3:00pm By The Slice Order Now for Baybrook Mall Directions for Baybrook Mall More Info for Baybrook Mall Cinco Ranch - Katy 2643 Commercial Center Blvd. Ste. C390 Katy, TX 77494 directions for 281-574-0070 Open today: 11:00 am - 10:00 pm Until 3:00pm By The Slice Order Now for Cinco Ranch - Katy Directions for Cinco Ranch - Katy More Info for Cinco Ranch - Katy CityCentre 12848 Queensbury Lane, Suite 101 Houston, TX 77024 directions for 713-463-3730 Open today: 11:00 am - 10:00 pm Until 3:00pm By The Slice Order Now for CityCentre Directions for CityCentre More Info for CityCentre Dallas - Park Lane 8060 Park Lane N, Ste. 105 Dallas, TX 75231 directions for 214-987-1173 Open today: 11:00 am - 10:00 pm Until 3:00pm By The Slice Order Now for Dallas - Park Lane Directions for Dallas - Park Lane More Info for Dallas - Park Lane Dallas - West Village 3636 McKinney Ave Ste. 190 Dallas, TX 75204 directions for 214-559-4611 Open today: 11:00 am - 10:00 pm Until 3:00pm By The Slice Order Now for Dallas - West Village Directions for Dallas - West Village More Info for Dallas - West Village Domain NORTHSIDE 11700 Domain Blvd #148 Austin, TX 78758 directions for 512-853-9075 Open today: 11:00 am - 10:00 pm Until 3:00pm By The Slice Order Now for Domain NORTHSIDE Directions for Domain NORTHSIDE More Info for Domain NORTHSIDE El Paso 8889 Gateway Blvd. West Suite 1200 El Paso, TX 79925 directions for 915-594-4929 Open today: 11:00 am - 10:00 pm Until 3:00pm By The Slice Order Now for El Paso Directions for El Paso More Info for El Paso Grapevine 1401 William D. Tate Avenue Ste. 100 Grapevine, TX 76051 directions for 817-488-4547 Open today: 11:00 am - 10:00 pm Until 3:00pm By The Slice Order Now for Grapevine Directions for Grapevine More Info for Grapevine Highland Village 1101 Shoal Creek, Suite 110 Highland Village, TX 75077 directions for 972-317-1260 Open today: 11:00 am - 10:00 pm Until 3:00pm By The Slice Order Now for Highland Village Directions for Highland Village More Info for Highland Village La Cantera 15900 La Cantera Pkway st 25180 San Antonio, TX 78256 directions for 210-690-4949 Open today: 11:00 am - 10:00 pm Until 3:00pm By The Slice Order Now for La Cantera Directions for La Cantera More Info for La Cantera La Palmera 5488 S. Padre Island Ste.1202 Corpus Christi, TX 78411 directions for 361-980-8600 Open today: 11:00 am - 10:00 pm Until 3:00pm By The Slice Order Now for La Palmera Directions for La Palmera More Info for La Palmera Las Colinas - Toyota Music Factory 310 West Las Colinas Boulevard, Suite 100 Irving, TX 75039 directions for 214-496-0337 Open today: 11:00 am - 10:00 pm Until 3:00pm By The Slice Order Now for Las Colinas - Toyota Music Factory Directions for Las Colinas - Toyota Music Factory More Info for Las Colinas - Toyota Music Factory Quarry Village 330 E. Basse Rd Ste. 101 San Antonio, TX 78209 directions for 210-832-8288 Open today: 11:00 am - 10:00 pm Until 3:00pm By The Slice Order Now for Quarry Village Directions for Quarry Village More Info for Quarry Village Stone Oak 22810 US Hwy. 281 N. Suite 105 San Antonio, TX 78258 directions for 210-481-9236 Open today: 11:00 am - 10:00 pm Until 3:00pm By The Slice Order Now for Stone Oak Directions for Stone Oak More Info for Stone Oak Sugar Land - First Colony 16535 Southwest Freeway Ste. 2500 Sugar Land, TX 77479 directions for 281-265-2280 Open today: 11:00 am - 10:00 pm Until 3:00pm By The Slice Order Now for Sugar Land - First Colony Directions for Sugar Land - First Colony More Info for Sugar Land - First Colony The Shops at Clearfork 5276 Monahans Ave. Fort Worth, TX 76109 directions for 817-377-0642 Open today: 11:00 am - 9:00 pm Until 3:00pm By The Slice Order Now for The Shops at Clearfork Directions for The Shops at Clearfork More Info for The Shops at Clearfork The Shops at Legacy 5717 Legacy Dr, Suite 110 Plano, TX 75024 directions for 972-782-4212 Open today: 11:00 am - 10:00 pm Until 3:00pm By The Slice Order Now for The Shops at Legacy Directions for The Shops at Legacy More Info for The Shops at Legacy The Woodlands 20 Waterway Ave Ste. 100 Woodlands, TX 77380 directions for 281-465-3500 Open today: 11:00 am - 10:00 pm Until 3:00pm By The Slice Order Now for The Woodlands Directions for The Woodlands More Info for The Woodlands Watters Creek 836 Watters Creek Blvd, C-200 Allen, TX 75013 directions for 214-383-9703 Open today: 11:00 am - 10:00 pm Until 3:00pm By The Slice Order Now for Watters Creek Directions for Watters Creek More Info for Watters Creek United Arab Emirates Abu Dhabi - Forsan Central Mall Forsan Central Mall – F-42 1st floor 4 Abdulrahman Bin ‘Awf St Khalifa City – Sector 33 – Abu Dhabi, UAE 02 564 6273 Open today: 10:00 am - 11:00 pm Visit Website for Abu Dhabi - Forsan Central Mall More Info for Abu Dhabi - Forsan Central Mall Dubai - Silicon Central Mall Silicon Central Mall, 1st floor Dubai Rd - Dubai Silicon Oasis Dubai, UAE Open today: 11:00 am - 10:30 pm Visit Website for Dubai - Silicon Central Mall More Info for Dubai - Silicon Central Mall Wisconsin Brookfield - The Corners 20119 Lord Street, Space J-101 Brookfield, WI 53045 directions for 262-785-1115 Open today: 11:00 am - 9:00 pm Until 3:00pm By The Slice Order Now for Brookfield - The Corners Directions for Brookfield - The Corners More Info for Brookfield - The Corners Earn Points On Every Order Get The Grimaldi's Pizzeria Rewards App Learn More Learn more about rewards",
      "hash": "2c6406eb4997",
      "downloadedAt": "2026-01-18T16:56:21.821Z",
      "trimmedAt": "2026-01-18T17:11:38.802Z",
      "sizeReduction": "95.6%"
    },
    {
      "url": "https://www.grimaldispizzeria.com/locations/mount-pleasant/",
      "text": "Mount Pleasant Open today: 11:00 am - 9:00 pm Until 3:00pm By The Slice Address 1244 Belk Dr. Mt. Pleasant, SC 29464 843-971-9368 Store Hours Day Hours Sunday 11:00 am - 9:00 pm Monday 11:00 am - 9:00 pm Tuesday 11:00 am - 9:00 pm Wednesday 11:00 am - 9:00 pm Thursday 11:00 am - 9:00 pm Friday 11:00 am - 10:00 pm Saturday 11:00 am - 10:00 pm Available Services Pick-up Delivery via partner site Free Wifi Group Dining Patio Seating Weekday Lunch Combo Area Manager Howard Barishhbarish@grimaldispizzeria.com Order Now Join Waitlist View Menu Directions Directions About Grimaldi's - Mount Pleasant Grimaldi’s Pizzeria in Mount Pleasant, SC brings the rich tradition of New York-style pizza—made the Brooklyn way—to the heart of the Lowcountry. Conveniently located at the main entrance of Mount Pleasant Towne Centre, just minutes from Charleston, our restaurant offers an authentic taste of one of New York’s most iconic culinary treasures: coal-fired brick oven pizza. At Grimaldi’s, pizza isn’t just a meal—it’s an experience. Our hand-tossed dough is made fresh in-house every day, using our time-honored ‘secret recipe’ to achieve the perfect texture and flavor. Each pizza is topped with our signature sauce, premium mozzarella, and your favorite toppings, then baked to perfection in our coal-fired ovens. This unique cooking method creates a crisp yet chewy crust with that unmistakable, slightly smoky flavor that defines true Brooklyn-style pizza. Our Mount Pleasant location offers a welcoming and family-friendly atmosphere with a touch of New York nostalgia. Guests can choose to dine indoors beneath our signature wine bottle chandeliers or relax outside on our covered patio, which is pet-friendly and equipped with fans for warm summer days. We also feature a full-service bar with indoor and outdoor seating, perfect for pairing your pizza with a glass of wine or a craft cocktail. For those on the go, we make takeout easy with a convenient pick-up station located just inside our side entrance. Ample parking is available in both the front and rear of the building, making your visit as easy and enjoyable as possible. Whether you’re a local from Mount Pleasant or visiting from Charleston, Grimaldi’s is your destination for authentic New York-style pizza. Join us and discover why our coal-fired, brick oven pizzas are the best in the Charleston area! Let’s Plan Your Next Event Plan your next group dining event with Grimaldi’s Pizzeria. Whether you’re celebrating moms, dads, grads, birthdays or any special occasion, celebrate with pizza from Grimaldi’s. Minimum of 8 guests and 72 hour notice for booking. Group Dining Inquiries Location Menu Draft Source A.B.V. Peroni Italy 5.1% Blue Moon Belgian White Golden, CO 5.4% Miller Lite Milwaukee, WI 4.2% Coors Light Golden, CO 4.2% Michelob Ultra St. Louis, MO 4.2% Modelo Especial Mexico 4.4% Sam Adams Seasonal Boston, MA VARIES Stella Artois Belgium 5.0% Lagunitas IPA Petaluma, CA 6.2% New Belgium Voodoo Ranger Juicy Haze Fort Collins, CO 7.0% Bottle Source A.B.V. Angry Orchard Cider Cincinnati, OH 5.0% Corona Extra Mexico 5.0% New Belgium Voodoo Ranger Juicy Haze Fort Collins, CO 7.0% Topo Chico Strawberry Guava Hard Seltzer Milwaukee, WI 4.7% Truly Wild Berry Hard Seltzer Boston, MA 5.0% Earn Points On Every Order Get The Grimaldi's Pizzeria Rewards App Learn More Learn more about rewards",
      "hash": "4322f232d983",
      "downloadedAt": "2026-01-18T16:56:20.788Z",
      "trimmedAt": "2026-01-18T17:11:38.815Z",
      "sizeReduction": "98.0%"
    },
    {
      "url": "https://www.grimaldispizzeria.com/menu/",
      "text": "Menu Whether you’re looking to have lunch or dinner, Grimaldi’s has options for everyone! Our menu gives you a taste of our signature Coal Brick-Oven pizza and calzones baked to perfection. Pizzas Pizzas Starters Drinks Mille Gradi° Desserts Seasonal Coal Brick-Oven Pizza Sizes 12″ / 16″ / 18″* * Pizzas are hand-stretched to measurement. Overall size may shrink during cooking. Traditional Pizza Our classic pizza with secret recipe tomato sauce, fresh mozzarella and garnish of basil. Topped with our signature cheese and spice blend. Order Now Details about Traditional Pizza White with Garlic Pizza Extra fresh mozzarella, garlic, and an olive oil drizzle and garnish of basil. Topped with our signature cheese and spice blend. Order Now Details about White with Garlic Pizza Pesto Pizza Fresh mozzarella and basil pesto sauce drizzle and garnish of basil. Topped with our signature cheese and spice blend. (nut free) Order Now Details about Pesto Pizza Chef’s Selections Sizes 12″ / 16″ / 18″* * Pizzas are hand-stretched to measurement. Overall size may shrink during cooking. The Duo Two sauces, two meats, too incredible! It’s our traditional pizza featuring both our famous tomato sauce and pesto sauce, topped with pepperoni and spicy cup ‘n’ char sausage. Order Now Details about The Duo Exxtra Pepperoni & Hot Honey – Traditional Pizza Extra pepperoni and garlic on a Traditional pizza, drizzled with Mike's Hot Honey®. Pairs perfectly with Stemmari Nero D’Avola Order Now Details about Exxtra Pepperoni & Hot Honey – Traditional Pizza Exxtra Pepperoni & Hot Honey – White Pizza Extra pepperoni and garlic on white pizza, drizzled with Mike's Hot Honey®. Pairs perfectly with Stemmari Nero D’Avola Order Now Details about Exxtra Pepperoni & Hot Honey – White Pizza Margherita Traditional Pizza with extra famous sauce and fresh basil. Pairs perfectly with Poggiotondo Chianti Order Now Details about Margherita Brooklyn Bridge Roasted red peppers, creamy ricotta cheese and hand-pinched italian sausage, atop our Traditional Pizza. Pairs perfectly with Michael David “Freakshow” Zinfandel Order Now Details about Brooklyn Bridge Quattro Formaggi Mozzarella, asiago, parmesan, pecorino romano & gorgonzola cheese and garnish of basil. Pairs perfectly with Liberty School Cabernet Sauvignon Order Now Details about Quattro Formaggi Prosciutto Arugula Pizza Our classic white pizza topped with thinly sliced prosciutto, shaved cheese blend and fresh arugula. Pairs perfectly with Z. ALEXANDER BROWN PINOT NOIR Order Now Details about Prosciutto Arugula Pizza The Don Our Traditional Pizza topped with italian sausage, meatballs and pepperoni. Pairs perfectly with Mille Gradi Sangiovese Order Now Details about The Don Tuscan Veggie Pizza Traditional or white pizza, roasted red peppers, artichoke hearts, spinach, garlic & basil. Pairs perfectly with Mille Gradi° Pinot Grigio Order Now Details about Tuscan Veggie Pizza Barbecue Chicken Pizza BARBECUE CHICKEN Sweet Baby Ray’s® Barbecue Sauce, Chicken, Bacon, Red Onion and Fresh Cilantro Pairs perfectly with CHARLES & CHARLES ROSÉ Order Now Details about Barbecue Chicken Pizza Ivy Pizza Grimaldi’s White pizza with garlic, topped with pesto, mushrooms, white onions and jalapeño. Pairs perfectly with Michael David Sauvignon Blanc Order Now Details about Ivy Pizza Gluten Friendly** Sizes 12″* * Pizzas are hand-stretched to measurement. Overall size may shrink during cooking. 12″ Traditional Pizza Gluten Free Order Now Details about 12″ Traditional Pizza Gluten Free 12″ White With Garlic Pizza Gluten Free Order Now Details about 12″ White With Garlic Pizza Gluten Free 12″ Pesto Pizza Gluten Free Order Now Details about 12″ Pesto Pizza Gluten Free Cauliflower** Sizes 12″* * Pizzas are hand-stretched to measurement. Overall size may shrink during cooking. 12″ Traditional Pizza Cauliflower Order Now Details about 12″ Traditional Pizza Cauliflower 12″ White With Garlic Pizza Cauliflower Crust Order Now Details about 12″ White With Garlic Pizza Cauliflower Crust 12″ Pesto Pizza Cauliflower Crust Order Now Details about 12″ Pesto Pizza Cauliflower Crust Build Your Own Sizes 12″ / 16″ / 18″* * Pizzas are hand-stretched to measurement. Overall size may shrink during cooking. Toppings Artichoke Hearts Jalapeños Roasted Sweet Red Peppers Ricotta Cheese Pepperoni Sun Dried Tomatoes Onions Fresh Garlic Fresh Sliced Roma Tomatoes Kalamata Olives** Black Olives** Fresh Baby Spinach Anchovies Meatballs Italian Sausage Spicy Chicken Sausage Mushrooms Bacon Ham Prosciutto Grilled Chicken Green Peppers Pesto Extra Mozzarella Cheese Extra Grimaldi’s Famous Sauce Extra Basil Calzone Sauce Fresh Arugula Bases: Traditional (tomato) White with Garlic (no sauce) Pesto (nut-free) **Olives may contain pits. Pricing may vary per location. Order Now Details about Toppings Calzones Sizes 12″ / 16″ / 18″* * Pizzas are hand-stretched to measurement. Overall size may shrink during cooking. Calzone Hand tossed dough stuffed with ricotta cheese, oregano, black pepper, romano cheese and fresh parsley. Order Now Details about Calzone Gluten Friendly Crust **Our gluten-friendly and cauliflower crusts have a gluten content of less than 20ppm based on information provided by our ingredient suppliers; however, we cannot guarantee that pizzas made with these crusts will be gluten-free as we prepare all of our pizzas in a common kitchen with a risk of gluten exposure. In addition, certain toppings contain gluten. We do not recommend these pizzas for guests with Celiac Disease. Guests with gluten sensitivities should exercise judgment in consuming these pizzas. Nutritional Information Earn Points On Every Order Get The Grimaldi's Pizzeria Rewards App Learn More Learn more about rewards",
      "hash": "7b5a8a6f3afc",
      "downloadedAt": "2026-01-18T16:56:21.097Z",
      "trimmedAt": "2026-01-18T17:11:38.838Z",
      "sizeReduction": "97.1%"
    }
  ],
  "sizeReduction": "97.1%"
}