{
  "venueId": "ChIJTYmoaxJ6_ogR2ulErRQ_2O0",
  "venueName": "The Charleston Place",
  "venueArea": "Downtown Charleston",
  "website": "https://charlestonplace.com/?utm_source=google-gbp&utm_medium=organic&utm_campaign=none",
  "scrapedAt": "2026-01-18T17:04:26.613Z",
  "trimmedAt": "2026-01-18T17:08:02.491Z",
  "pages": [
    {
      "url": "https://charlestonplace.com/?utm_source=google-gbp&utm_medium=organic&utm_campaign=none",
      "text": "Skip to main content Close Mobile Menu 01 The Hotel 02 Accommodations 03 The Club 04 Dining 05 Spa & Wellness 06 Meetings & Events 07 Experiences 08 Offers & Delights 09 Contact Us 010 Tales from the Living Room Reserve The Charleston Place Accommodations Select Room Type Rooms Suites Club Level Access Arrival Departure Guests Availability An independent, iconic landmark in the heart of Charleston’s historic district. Captivating the hearts and imaginations of a new generation. Redefining the legendary service, experiences — and city — with renewed passion, purpose, and intention. Through sumptuous accommodations, delicious food and drink, shopping, restorative wellness services, and warm, generous hospitality, The Charleston Place stirs the senses and lives forever in the minds and souls of all who gather. Our Story Urban Haven Accommodations Rooms True Comfort, From Reading Nooks to Plush Beds Suites Room to Indulge, Entertain, and Rejuvenate Club Level Access Enhance Your Stay Previous Slide Next Slide Explore All From award-winning fine dining and Lowcountry favorites to gastropub cuisine, handcrafted cocktails, and must-have morning coffee and treats, every bite and sip promises to delight. Food & Beverage The Palmetto Cafe Meeting at Market Thoroughbred Club In-Room Dining Chef Daniel Humm x The Charleston Place Learn More Nurture & restore Spa & Wellness Find peace, pleasure, and pure bliss in spaces designed to enhance and nurture physical, emotional, and spiritual well-being. Self care Our Spa offers a range of bespoke services designed to elevate your self-care experience. From luxurious massages and skincare treatments to expert manicures and pedicures, each service is tailored to meet your individual needs. Learn More An Exciting New Chapter A remarkable revitalization is currently taking place at The Charleston Place, known as This phased initiative includes various interior and exterior enhancements aimed at enriching the guest experience for generations. Once complete, The Charleston Place will blend Southern hospitality with timeless European elegance, creating an inviting space that fosters connection and enriches lives. CP Reimagined. Learn More For all occasions Meetings & Events Renowned as a premier event destination, we take pride in making every gathering an opportunity to inspire and impress. With 40,000 square feet of versatile and a dedicated team of event planners, banquet staff, florists, and AV specialists, we deliver everything needed to create unforgettable moments. event space This is a carousel with manual-rotating slides. Use Next and Previous buttons to navigate, or jump to a slide using the slide dots. Slide 1 of 6 Ballrooms Slide 2 of 6 Boardrooms Slide 3 of 6 Hospitality Suites Slide 4 of 6 The Riviera Theater Slide 5 of 6 Unique Spaces Slide 6 of 6 Weddings Previous Slide Next Slide Meetings & Events Located in the vibrant heart of historic downtown Charleston, The Charleston Place is just steps from some of the city’s best independent shops, the City Market, antique stores, museums, historic sites, and art galleries. Getting Here Due to the of The Charleston Place, the Meeting Street driveway and main hotel entrance will be closed beginning Monday, July 21st. The arrival, drop-off and departure location will be Market Street Circle, located at Valet will be offered at this location. Reimagination 130 Market Street. If you plan to self-park, please refer to one of the City of Charleston garages, including Kindly Note: • Hasell Street Garage | 85 Hasell Street • Majestic Square Garage | 211 King Street If you choose to park in the Hassel Street garage, please follow the signage directing you to the hotel’s alternative entrance. If you choose to park at the Majestic Square garage, please proceed to . 130 Market Street View Map CHS. SC. Stay With Us RFP Form Thank you for your interest. \"\" indicates required fields * URL This field is for validation purposes and should be left unchanged. Name * First Last Email * Phone Name of Organization * Address What US state will the contract be signed from? * Objective of Event Where was your event last held? What is the budget for your event? City County/State/Province Number Country Arrival Date * MM slash DD slash YYYY Departure Date * MM slash DD slash YYYY Flexible Dates * Flexible Dates? Yes No Number of Attendees Per Night * Number of Rooms Per Night * Request for Proposal Max. file size: 50 MB. Get In Touch With Us We're always happy to help. \"\" indicates required fields * Comments This field is for validation purposes and should be left unchanged. Name * First Last Email * Phone Message Stay up to date Thank you for being a part of our exciting next chapter. Please sign up to receive news of special events and exclusive offers, so that we may continue to be the “Place” for traditions for years to come. \"\" indicates required fields * X/Twitter This field is for validation purposes and should be left unchanged. Name * Title Dr. Miss Mr. Mrs. Ms. Prof. Rev. Title First Name Last Name Email * By entering your details, you consent to be contacted via email by The Charleston Place and affiliates with offers and updates. To opt-out, use the unsubscribe link or email . View our Privacy Policy for details. unsubscribe@charlestonplace.com",
      "hash": "29cd47c6652a",
      "downloadedAt": "2026-01-18T16:54:54.771Z",
      "trimmedAt": "2026-01-18T17:08:02.409Z",
      "sizeReduction": "99.0%"
    },
    {
      "url": "https://charlestonplace.com/meetings-events/",
      "text": "Skip to main content Close Mobile Menu 01 The Hotel 02 Accommodations 03 The Club 04 Dining 05 Spa & Wellness 06 Meetings & Events 07 Experiences 08 Offers & Delights 09 Contact Us 010 Tales from the Living Room Reserve FOR ALL OCCASIONS Meetings & Events contact us Share your vision. We’ll do the rest. Whether you’re planning a corporate meeting, national conference, intimate wedding, or grand gala, we offer the spaces, amenities, and gracious service to create extraordinary bespoke experiences that build loyalty, nurture relationships, and create enduring impact. Your Event, Our Setting Venues Weddings BHC Events Ballrooms Unique Spaces Outdoor Spaces Outdoor Spaces Historic Homes Spotlight Venues DISCOVER CHARLESTON More to Offer Services Group Experiences Our Team Services Services Exclusive Services Warm and gracious, our talented team has deep experience in planning, design, food and beverage, logistics, and service from start to finish. Catering From delectable breakfast buffets to exquisite dinners, afternoon snacks, wine programs, and everything in between. Personalized Transportation Choose from an alluring array of motor coaches, sprinter vans, or luxury vehicles. Customized Airport Transfers Luxury SUVs and sprinter vans can all be at your beck and call. contact us Group Experiences Group Experiences Group Adventures, Collective Joy From boating, fishing, and beach adventures to historic, culinary, and cultural experiences, we craft enjoyable events that nurture healthy competition, create conversation, and build lasting bonds. Discover Our Team Our Team Gracious Spirit and a Dedicated Team With more than a century of collective experience, our award-winning meeting planners know what it takes to make events of all sizes and style successful and memorable. Feel confident knowing you’ll have the care and undivided attention of highly-skilled specialists to anticipate and meet every need and exceed every expectation. About us For any occasion 40,000 Square feet of ballroom, conference rooms, hospitality suites and more Charleston Praise From the folks we worked directly with to everyone we interacted with it was a TOP notch experience. Raynor Garage Doors Our meeting grew from 400 to 800 because of the draw of The Charleston Place. South Carolina School Boards Association I have been in the Continuing Education business for 25 years and have worked with many hotels. I have never had a better experience. American Motility Society Personable, not stuffy, five-diamond service. It’s a meeting planner’s dream since they are on top of everything. They are proactive and one step ahead of most other hotels. COBANK I have nothing but the best things to say about our experience. The customer service, food, and facilities were fantastic and our guests were extremely pleased with the accommodations. HUDSON AUTOMOTIVE I’ve been to many hotels, but never have I continued to reflect back on the professionalism and charm of the staff. FEDEX I literally haven’t ever been to a hotel where the fabric of the place just sang because of the people who just so obviously loved their own hotel and were so proud to work there. CONDE NAST TRAVELER Off-site events were great—the harbor cruise, plantation tours, carriage rides and Yorktown dinner were all spectacular. AMERIS Bank The program went on without any hitches and our Awards Banquet was knocked right out of the park… I truly appreciate all of you doing such an amazing job. It was flawless and well done. Everyone loved The Charleston Place! UNITED LABORATORIES, INC. Tell Us About Your Event Prefer to talk? Give us a call on 1+800.611.5549 \"\" indicates required fields * X/Twitter This field is for validation purposes and should be left unchanged. Name * First Last Email * Phone Name of Organization * Address What US state will the contract be signed from? * Objective of Event Where was your event last held? What is the budget for your event? City County/State/Province Number Country Arrival Date * MM slash DD slash YYYY Departure Date * MM slash DD slash YYYY Flexible Dates * Flexible Dates? Yes No Number of Attendees Per Night * Number of Rooms Per Night * Request for Proposal Max. file size: 50 MB. RFP Form Thank you for your interest. \"\" indicates required fields * Email This field is for validation purposes and should be left unchanged. Name * First Last Email * Phone Name of Organization * Address What US state will the contract be signed from? * Objective of Event Where was your event last held? What is the budget for your event? City County/State/Province Number Country Arrival Date * MM slash DD slash YYYY Departure Date * MM slash DD slash YYYY Flexible Dates * Flexible Dates? Yes No Number of Attendees Per Night * Number of Rooms Per Night * Request for Proposal Max. file size: 50 MB. Get In Touch With Us We're always happy to help. \"\" indicates required fields * Facebook This field is for validation purposes and should be left unchanged. Name * First Last Email * Phone Message",
      "hash": "29f0d5f3e293",
      "downloadedAt": "2026-01-18T16:54:54.848Z",
      "trimmedAt": "2026-01-18T17:08:02.461Z",
      "sizeReduction": "98.6%"
    },
    {
      "url": "https://charlestonplace.com/offers-delights/",
      "text": "Skip to main content Close Mobile Menu 01 The Hotel 02 Accommodations 03 The Club 04 Dining 05 Spa & Wellness 06 Meetings & Events 07 Experiences 08 Offers & Delights 09 Contact Us 010 Tales from the Living Room Reserve Offers & Delights in the best of Charleston’s food, drink, art, culture, and the pursuit of true relaxation with an array of exclusive offers. Indulge Charleston continues to wow visitors from around the world with its mix of natural beauty, storied history, and vibrant culture. Here, you’ll immerse yourself in it all. From rejuvenating spa services to historic adventures and culinary explorations, you’ll find something amazing for every taste, mood, and occasion. Made with joy in mind Exclusive Offers and Delights Arrive in Style Enjoy 10% off your stay, complimentary valet parking, and two nights of elevated comfort and convenience. With curated amenities and a seamless arrival, this offer makes it easy to experience Charleston in effortless style. Details Luxury accommodations Seamless arrival with complimentary valet parking Nightly turndown service In-room welcome amentity Valid for stays now through March 31. Two-night minimum required. Blackout dates apply, including . Offer is subject to availability and may include additional restrictions. Disclaimer: February 13-14, March 13-14, and March 27-28 Book Now Enhance Your Stay with Club Level Access Elevate your stay with exclusive access to our Club Lounge, now relocated to a refreshed floor plan for a limited time. Enjoy personalized service, dedicated staff, and complimentary culinary offerings, from breakfast to after-dinner indulgences, in a reimagined atmosphere of luxury. Details Luxury accommodations Club Lounge access Reserve Stay A Little Longer Why stay two nights when you can enjoy greater savings and even more time to explore Charleston by staying three consecutive nights? Extend your getaway and savor every moment of luxury, charm, and unforgettable experiences. Details Luxury accommodations Up to 15% off a three-night stay Reserve Breakfast in Charleston After a glorious night’s sleep, awaken to a delicious breakfast in bed or at The Palmetto Cafe, where fresh, locally inspired dishes start your day on a delightful note. Details Luxury accommodations Daily breakfast at The Palmetto Cafe Subject to availability. Restrictions may apply. Not combinable with any other packages or offers. Valid for new bookings only. Disclaimer: Reserve The Cooper I Experience Experience Charleston from the water with a private charter aboard our custom Hinckley yacht. Available only to guests of The Charleston Place, this experience offers a serene and sophisticated way to explore the city’s historic harbor, all from the comfort of a beautifully appointed vessel, Cooper I. Whether you’re celebrating something special or simply chasing the horizon, this package invites you to slow down, take in the sea breeze, and see the Holy City from a fresh perspective. Details Luxury accommodations two-hour A private, captain-led charter aboard The Cooper I , our custom Hinckley yacht Flexible sail time, arranged seamlessly through our Concierge team A bespoke welcome amenity awaits as you step aboard the Hinckley Disclaimer: Subject to availability. Restrictions may apply. Not combinable with any other packages or offers. Valid for new bookings only. Reserve The Suite Life Lounge in a luxurious and spacious suite and embrace the charm of our cosmopolitan hideaway as you savor breakfast in bed or in our garden cafe. Details Package includes: Daily breakfast at The Palmetto Cafe or in-room dining ($30 credit per person, per day) Daily valet parking for one vehicle : Two-night minimum stay required. Restrictions may apply. Subject to availability. Disclaimer Reserve Furry Friend in Residence All are welcome at The Charleston Place, including your furry companion. Let us make your pet feel like a VI-Pet in Residence with a selection of items to enhance your stay. Details Use of the following during your stay – food and water bowls for use during your stay Pet Custom Foggy Dog bed and bandanna for use during stay and to be taken home as a souvenir pet Not required for a stay. Subject to availability. Restrictions may apply. 7-day advance notice is required. Based on availability. Must be booked separately through the Concierge. Disclaimer: pet Reserve Stay With Us RFP Form Thank you for your interest. \"\" indicates required fields * X/Twitter This field is for validation purposes and should be left unchanged. Name * First Last Email * Phone Name of Organization * Address What US state will the contract be signed from? * Objective of Event Where was your event last held? What is the budget for your event? City County/State/Province Number Country Arrival Date * MM slash DD slash YYYY Departure Date * MM slash DD slash YYYY Flexible Dates * Flexible Dates? Yes No Number of Attendees Per Night * Number of Rooms Per Night * Request for Proposal Max. file size: 50 MB. Get In Touch With Us We're always happy to help. \"\" indicates required fields * Comments This field is for validation purposes and should be left unchanged. Name * First Last Email * Phone Message",
      "hash": "57c954270529",
      "downloadedAt": "2026-01-18T16:54:55.459Z",
      "trimmedAt": "2026-01-18T17:08:02.491Z",
      "sizeReduction": "98.2%"
    }
  ],
  "sizeReduction": "98.7%"
}