{
  "venueId": "ChIJqab4WR1x_ogRq9IBJ4JvHs4",
  "venueName": "Señor Tequila's",
  "venueArea": "Mount Pleasant",
  "website": "http://www.srtequilacharleston.com/",
  "scrapedAt": "2026-01-18T17:04:30.908Z",
  "trimmedAt": "2026-01-18T17:12:07.514Z",
  "pages": [
    {
      "url": "http://www.srtequilacharleston.com/charleston-senor-tequila-food-menu#",
      "text": "Our Menu Menu Lunch",
      "hash": "72a5ba70658d",
      "downloadedAt": "2026-01-18T16:57:09.517Z",
      "trimmedAt": "2026-01-18T17:12:07.471Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://www.srtequilacharleston.com/",
      "text": "× Let us host your special event! Whether a birthday party, office function or any other special occasion - we take care of all the fine details, bringing your event to life, just as you imagined. Host your next party or get together Book your party × Did you know we do catering? Whatever your occasion, however big or small, we have the perfect options to choose from. Cater your birthday party, holiday party, corporate events, wedding festivities and more! Call to Inquire Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! Job Listings Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! 1836 Ashley River Road, Charleston, 29407 Visit us at map marker pin About us Family Owned Mexican Restaurant Group Senor Tequila was built on the concept that great Mexican food can be fast and fresh and our customers have loved the fact that they can come in for a speedy, delicious and authentic meal. Senor Tequila has been a staple of Charleston for years and our customers are like family. our menu Order online Take us home with you Treat yourself to your favorites, wherever you are! Order private parties Authentic Mexican Restaurant Our love for Mexican food can be found in every dish. From the sizzling Texas Fajitas to the authentic Mexican tacos, every bit of what we do is inspired by Mexico. parties catering Delicious food Catering for all occasions! Whatever your event, we have the perfect catering options to choose from. catering slideshow start stop playing Slide 1 content Slide 2 content Slide 3 content previous slide next slide jobs Taking the next step in your career? We would love to hear from you. jobs drinks Senor Tequila prides itself on offering our customers delicious, affordable and authentic food and drinks with great service to match. our drinks menu Come see why Charleston loves Senor Tequila. Our Menu Skip Gallery Carousel Start stop gallery carousel Reviews Start stop reviews carousel Review by - Google Sara R: five star review by If you go here, you will not leave hungry. Amazing endless chips and salsa they refill very promptly. Service is fast and very nice. There's a pretty solid kids menu too. Review by - Google Emma H: five star review by The food and drinks were great! Fast and super friendly service. Best salsa I've had since moving to south Carolina. We will definitely be returning! Review by - Google Adam M: five star review by Our 1st visit here while on vacation. They were crazy busy and we were seated right away and the food, excellent! Will definitely come back! Review by - Google Duane M: five star review by We were in town and got a to go order. When I got there to pick it up there were people everywhere. It was a great atmosphere! Next time we'll dine in. Our food was great as well. Review by - Google Jason R: five star review by Have been to multiple locations never had a bad experience food was always great service was always good restaurant was clean fun environmente Newsletter Location 1836 Ashley River Road Charleston, 29407 Hours Mon, Tue, Wed, Thur 11:00 AM - 10:00 PM Fri, Sat 11:00 AM - 11:00 PM Sun 11:00 AM - 9:30 PM Find us on... Facebook page Instagram page Google page Contact us (843)-852-0561 Call us at senortequilachsw@gmail.com Write us at Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "995cd5a66bef",
      "downloadedAt": "2026-01-18T16:57:06.806Z",
      "trimmedAt": "2026-01-18T17:12:07.499Z",
      "sizeReduction": "98.4%"
    },
    {
      "url": "http://www.srtequilacharleston.com/charleston-senor-tequila-drink-menu",
      "text": "Our Drinks Beer Wine Cocktails Sodas and Drinks",
      "hash": "a688e9981648",
      "downloadedAt": "2026-01-18T16:57:07.573Z",
      "trimmedAt": "2026-01-18T17:12:07.503Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "http://www.srtequilacharleston.com/charleston-senor-tequila-drink-menu#",
      "text": "Our Drinks Beer Wine Cocktails Sodas and Drinks",
      "hash": "a97d97ded65a",
      "downloadedAt": "2026-01-18T16:57:08.867Z",
      "trimmedAt": "2026-01-18T17:12:07.506Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "http://www.srtequilacharleston.com/charleston-senor-tequila-events",
      "text": "Events Valentine's Day Saturday February 14th Join us on Valentine's Day for the perfect romantic evening! 11:00 AM - 11:00 PM National Margarita Day Sunday February 22nd Come celebrate National Margarita day with us on February 22nd. 11:00 AM - 09:30 PM",
      "hash": "b27c741d969e",
      "downloadedAt": "2026-01-18T16:57:08.219Z",
      "trimmedAt": "2026-01-18T17:12:07.509Z",
      "sizeReduction": "99.6%"
    },
    {
      "url": "http://www.srtequilacharleston.com/charleston-senor-tequila-food-menu",
      "text": "Our Menu Menu Lunch",
      "hash": "ff988815adde",
      "downloadedAt": "2026-01-18T16:57:06.928Z",
      "trimmedAt": "2026-01-18T17:12:07.514Z",
      "sizeReduction": "100.0%"
    }
  ],
  "sizeReduction": "99.5%"
}