{
  "venueId": "ChIJxw47qWl6_ogRlocIO1Jk6aM",
  "venueName": "Wine & Company",
  "venueArea": "North Charleston",
  "website": "http://chswine.com/",
  "scrapedAt": "2026-01-18T17:04:32.065Z",
  "trimmedAt": "2026-01-18T17:13:05.504Z",
  "pages": [
    {
      "url": "http://chswine.com/special-events-1",
      "text": "The Shop More than just a wine bar… At Wine & Company, we love helping you find the perfect wines for any occasion. Whether you're building a private cellar, looking to learn more about wine, or need the ideal bottles for an event, we’re here to help. We offer customized wine experiences for everyone, from beginners to seasoned wine lovers. Our sommelier-led sessions can be tailored for small gatherings or larger groups, making wine education fun and engaging for all. Let us help you discover amazing wines and make your wine journey unforgettable. At Wine & Company, your satisfaction is our priority, and we’re dedicated to providing top-notch service and expertise. Contact us Wine & Company was born in Charleston out of good friendships & warm memories made over a great bottle of wine, and we hope to extend this experience to you and yours here at our shop. Contact Us",
      "hash": "1982ffead9b7",
      "downloadedAt": "2026-01-18T17:01:45.864Z",
      "trimmedAt": "2026-01-18T17:13:05.447Z",
      "sizeReduction": "99.3%"
    },
    {
      "url": "http://chswine.com/private-wine-tastings",
      "text": "Private Wine Tastings Make it a night to remember with a private tasting at Wine & Company. Expand your palate and make delicious memories. Start your evening with bubbles and enjoy an intimate tasting of 5 hand-picked wines paired with the perfect cheeses and charcuterie. Grab seven or more of your favorite friends and get ready for an all-in experience at Wine & Co! How it works Prices start at $60 per person, plus tax and gratuity. (We can arrange elevated wine tastings featuring premium selections at an additional cost) Our private tastings are designed for intimate groups of 8-24 people. Due to high demand and our commitment to personalized experiences, we limit reservations to one group per day. Call or email us today to secure your spot. Your experience includes a warm welcome with sparkling wine upon arrival, an immersive tasting of 5 carefully selected wines guided by one of our expert sommeliers, and a curated assortment of perfectly paired cheeses and charcuterie. Email us today to start building your private tasting experience! Get Started",
      "hash": "5c20ab100e0e",
      "downloadedAt": "2026-01-18T17:01:47.180Z",
      "trimmedAt": "2026-01-18T17:13:05.461Z",
      "sizeReduction": "99.6%"
    },
    {
      "url": "http://chswine.com/tuesday-wine-tastings",
      "text": "Tuesday Wine Tastings The Details Join us every Tuesday from 5:30pm-7:30pm as we feature 5 standout wines highlighting a classic or new-on-the-scene winemaking region. $10, no reservations required! Wine & Company was born in Charleston out of good friendships & warm memories made over a great bottle of wine, and we hope to extend this experience to you and yours here at our shop. Contact Us",
      "hash": "ace250e41e4b",
      "downloadedAt": "2026-01-18T17:01:44.564Z",
      "trimmedAt": "2026-01-18T17:13:05.470Z",
      "sizeReduction": "99.7%"
    },
    {
      "url": "http://chswine.com/menu",
      "text": "Menus CHEESE CURED MEATS CAVIAR OTHER GOODIES WINES BY THE GLASS FLIGHTS BEER Cheese $9.5 per selection All items are served with a sliced French baguette WISCONSIN DEER CREEK 2 year aged white cheddar with sea salt potato chips FRENCH BELLETOILE Triple creme cow's milk cheese with four fruit jam and candied rose crystals SPANISH MANCHEGO Semi-firm sheep's milk cheese served with Peruvian sweet-drop peppers ITALIAN TALEGGIO Semi-soft cow's milk cheese from Lombardy served with Cabernet poached figs CALIFORNIA HUMBOLDT FOG Creamy goat's milk cheese with vegetable ash rind and served with Bourbon black cherries FRENCH FOURME D'AMBERT Classic & creamy blue cheese served with cocoa nibs",
      "hash": "bf9d9be20429",
      "downloadedAt": "2026-01-18T17:01:46.517Z",
      "trimmedAt": "2026-01-18T17:13:05.480Z",
      "sizeReduction": "99.5%"
    },
    {
      "url": "http://chswine.com/special-events",
      "text": "Host Your Special Event The Details Looking for the ideal venue for your next event? Our charming space is perfect for everything from intimate book clubs and company happy hours to larger wedding receptions and birthday celebrations. Contact us Wine & Company was born in Charleston out of good friendships & warm memories made over a great bottle of wine, and we hope to extend this experience to you and yours here at our shop. Contact Us",
      "hash": "c83e48c1d195",
      "downloadedAt": "2026-01-18T17:01:45.215Z",
      "trimmedAt": "2026-01-18T17:13:05.488Z",
      "sizeReduction": "99.7%"
    },
    {
      "url": "http://chswine.com/",
      "text": "Welcome to Wine & Company About us Who we are Whether you're savoring a glass of champagne and a bite to eat, picking out a special bottle for a friend, or restocking your wine cellar, Wine & Company is your perfect Midtown destination. Come and experience the warmth and charm that makes us a cherished spot for all your wine needs. Contact us Offerings Tuesday Wine Tastings Join us Tuesday evenings for special wine tastings from 5:30-7:30 | $10 No reservations required! Host Your Special Event Book your next party with us and let us curate the perfect event for you and your loved ones. The Shop Take home a bottle or three! We have everything from every day, easy-drinking wines to a large selection of rare and back vintage bottles. Private Wine Tastings Book a private wine tasting led by one of our staff sommeliers. Wine & Company was born in Charleston out of good friendships & warm memories made over a great bottle of wine, and we hope to extend this experience to you and yours here at our shop. Contact Us Reach out to us about using our space for your next party, or schedule a private wine tasting.",
      "hash": "db949e495575",
      "downloadedAt": "2026-01-18T17:01:44.357Z",
      "trimmedAt": "2026-01-18T17:13:05.504Z",
      "sizeReduction": "99.3%"
    }
  ],
  "sizeReduction": "99.5%"
}