{
  "venueId": "ChIJFbCKzFl8_ogRQaYgWTLtLkM",
  "venueName": "Rio Chico Mexican Restaurant - West Ashley",
  "venueArea": "West Ashley",
  "website": "http://riochicowestashley.com/",
  "scrapedAt": "2026-01-18T17:04:24.612Z",
  "trimmedAt": "2026-01-18T17:05:26.319Z",
  "pages": [
    {
      "url": "http://riochicowestashley.com/charleston-ashley-crossing-rio-chico-west-ashley-drink-menu",
      "text": "Our Drinks Cocktails Beverages",
      "hash": "044f36229b90",
      "downloadedAt": "2026-01-18T17:03:14.592Z",
      "trimmedAt": "2026-01-18T17:05:26.286Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://riochicowestashley.com/charleston-ashley-crossing-rio-chico-west-ashley-events",
      "text": "Events We are updating our events Please stay tuned",
      "hash": "387a4dc9ff27",
      "downloadedAt": "2026-01-18T17:03:15.877Z",
      "trimmedAt": "2026-01-18T17:05:26.288Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "http://riochicowestashley.com/charleston-ashley-crossing-rio-chico-west-ashley-food-menu",
      "text": "Our Menu Lunch Main Menu Dessert Menu",
      "hash": "d5bb08d411c6",
      "downloadedAt": "2026-01-18T17:03:13.965Z",
      "trimmedAt": "2026-01-18T17:05:26.294Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://riochicowestashley.com/charleston-ashley-crossing-rio-chico-west-ashley-happy-hours-specials",
      "text": "Specials We are updating our specials Please stay tuned",
      "hash": "d7d735f4ab90",
      "downloadedAt": "2026-01-18T17:03:15.246Z",
      "trimmedAt": "2026-01-18T17:05:26.297Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "http://riochicowestashley.com/",
      "text": "× Did you know we do catering? Whatever your occasion, however big or small, we have the perfect options to choose from. Cater your birthday party, holiday party, corporate events, wedding festivities and more! Catering Packages × We are taking online reservations! Let’s ensure you get a great table: Book today! We recommend making a reservation ahead of time. Book your table today! Book Table × Order your favorite dishes in seconds! Order Online Our traditional Mexican flavors, made from scratch to your plate! From savory tacos to sizzling Fajitas our menu showcases a delightful array of classic and contemporary Mexican delights. Complementing our delectable fare is a selection of handcraft Margaritas and cocktails that perfectly complement the flavors of our cuisine. Our dedicated team is committed to providing exceptional services, we look forward to welcoming you to our restaurant. The home of the most delicious Mexican Food in Charleston, and proud keeper of the best Mexican recipes, right in Ashley Crossing. Our menu catering Let us cater your next event When it comes to your next event, let us take care of the food with our delicious and expertly crafted catering options featuring a wide range of dishes that are sure to please any palate. catering Order Online Pick Up Your Favorite Food Our restaurant now offers the convenience of online ordering for our customers. This allows for easy pick-up or delivery options, making it simple to enjoy your favorite dishes from the comfort of your own home. Order Taste The Difference In a Family Friendly Atmosphere Our Menu Enjoy our excellent customer service Catering Discover our extensive menu with a variety of authentic Mexican dishes Indulge in our fabulous signature cocktails and a wide selection of tequilas Have fun at our special events Always have a good time at Rio Chico Dot slide navigation number 1 Dot slide navigation number 2 Dot slide navigation number 3 Dot slide navigation number 4 Dot slide navigation number 5 Dot slide navigation number 6 slideshow start stop playing Various food and drinks Rio Chico West Ashley Rio Chico West Ashley Rio Chico West Ashley Rio Chico West Ashley Rio Chico West Ashley Rio Chico West Ashley Rio Chico West Ashley Rio Chico West Ashley Rio Chico West Ashley Rio Chico West Ashley Flaming cocktail Rio Chico West Ashley Rio Chico West Ashley Reviews Review by - Google Ebony N: Great little eatery! Every time I come here the service is impeccable! The food is delicious. Review by - Google Joanna C: Sat outside. Great food, good flavors and fresh produce. I haven't gone anywhere else for Spanish dishes. Fresh chips made daily with a spicey red salsa sauce complementary. They have the best sweet tea and unsweetened tea. I get mine mixed 1/2 & 1/2. Review by - Google Najla W: Celebrated my birthday here on 10/14 with roughly 20 people. We were able to decorate and we had the time of your LIVESSS!! The staff was amazing and the food was great! We all enjoyed ourselves and we will definitely continuing coming back here Review by - Google Iarry S: The food is amazing I have never had a bad meal there. The carnitas, shrimp tacos to the chips and salsa you can't go wrong... All if it is delicious and the staff are amazing and friendly. Review by - Google Joseph R: The staff were super nice and very dog friendly on their outdoor tables! Stop reviews carousel Play reviews carousel Newsletter Location 1975 Magwood Drive Suite B Charleston, SC 29414 Hours Fri, Sat 11:00 AM - 11:00 PM Sun, Mon, Tue, Wed, Thur 11:00 AM - 10:00 PM Find us on... Facebook page Instagram page Google page Contact us (843)-766-1496 riochico3wa@gmail.com Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "eb9ef2a47ce9",
      "downloadedAt": "2026-01-18T17:03:13.843Z",
      "trimmedAt": "2026-01-18T17:05:26.316Z",
      "sizeReduction": "97.5%"
    },
    {
      "url": "http://riochicowestashley.com/charleston-ashley-crossing-rio-chico-west-ashley-menus",
      "text": "Catering",
      "hash": "fcfb272ecba7",
      "downloadedAt": "2026-01-18T17:03:16.511Z",
      "trimmedAt": "2026-01-18T17:05:26.319Z",
      "sizeReduction": "100.0%"
    }
  ],
  "sizeReduction": "99.3%"
}