{
  "venueId": "ChIJQXpftENz_ogRBk387--xDbM",
  "venueName": "SAVI Cucina + Wine Bar",
  "venueArea": "Mount Pleasant",
  "website": "https://www.savicucina.com/",
  "scrapedAt": "2026-01-18T17:04:26.047Z",
  "trimmedAt": "2026-01-18T17:07:19.790Z",
  "pages": [
    {
      "url": "https://www.savicucina.com/private-events/",
      "text": "Main content starts here, tab to start navigating Private Events Slide 1 of 4 Slide 2 of 4 Slide 3 of 4 Slide 4 of 4 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Book Your Event Whether you’re planning an intimate celebration, a milestone birthday, a corporate gathering, or a festive holiday party, our team will craft a warm, personalized experience with exceptional food, wine, and hospitality. Let us bring your vision to life—fill out the inquiry form below to start planning your event with us. Inquire Now Reservations Order Online Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location SAVI Cucina + Wine Bar | Upscale Italian Dining in Mount Pleasant, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "1559a339c9ce",
      "downloadedAt": "2026-01-18T16:57:09.723Z",
      "trimmedAt": "2026-01-18T17:07:19.686Z",
      "sizeReduction": "96.4%"
    },
    {
      "url": "https://www.savicucina.com/bene-cellars-wine-club-policies/",
      "text": "Main content starts here, tab to start navigating BENE Cellars Wine Club Terms of Agreement Members must be 21 years of age or older Club benefits are reserved for the named account member and are not transferable. In addition, to maintain the exclusivity of your membership, we are unable to extend member pricing to non-members. You may authorize someone else to pick up your wines by sending correspondence via the BENE Wine club email , and we will notate your account. wineclub@benehospitality.com We ask members to keep contact/billing information up to date in order to keep benefits active. Incorrect information can result in the cancellation of benefits if we are not able to contact the primary member. Please keep your account up to date by emailing or within the . wineclub@benehospitality.com Wine Club Xudle platform Monthly wine selections are limited, and subject to change based on availability. All Club members acknowledge that our sommelier selected monthly wines provided to our members are limited in quantities and thus may not be available at the time of your pick-up, especially in the event the wines have not been picked up in the month for which such wine selection was offered. In all cases and at our sole discretion, our sommelier team may substitute another wine for any wine selection which is no longer available, without any adjustment or refund. Members have 60 days following the monthly processing date, aka the 60-day monthly selection window, to select and either (1) pick up or (2) hold wine selections. Due to space limitations and logistics, we are unable to process wine selections for previous months past the 60-day selection window. If arrangements have not been made with our wine club director, selection benefits for previous months past the 60-day monthly selection window will be considered abandoned. If members are unable to come in to taste through the monthly wine selections, members may select and request a 72 hour hold via our online form which is linked within the monthly email or on our website. Holds will be packaged upon members arrival due to space limitations and security. To ensure accurate processing, any membership cancellations must be made 7 days prior to the monthly dues processing date and sent via email to . Verbal cancellations will not be honered. wineclub@benehospitality.com For avoidance of doubt, membership dues are processed on the first of each month. These above terms shall remain in effect while you are a member of the BENE Cellars Wine Club, and only BENE Hospitality Group, in its sole discretion, may modify, add or delete any of the membership rules at any time, with or without notice. Reservations Order Online Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location SAVI Cucina + Wine Bar | Upscale Italian Dining in Mount Pleasant, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "4305e5c42887",
      "downloadedAt": "2026-01-18T16:57:09.196Z",
      "trimmedAt": "2026-01-18T17:07:19.691Z",
      "sizeReduction": "91.8%"
    },
    {
      "url": "https://www.savicucina.com/menus/",
      "text": "Main content starts here, tab to start navigating Menus Slide 1 of 3 Slide 2 of 3 Slide 3 of 3 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Lunch Dinner Dessert Wines by the Glass + Cocktails Wines from the Cellar Happy Hour Lunch Download PDF Aperitivi Focaccia Del Giorno Italian EVOO, garlic confit vegetarian Olive E Formaggio Castelvetrano olives, sharp Italian provolone gluten free, vegetarian Antipasti Savi Meatballs Pomodoro, mozzarella, parmigiano Crispy Artichokes Parsley aioli, pepperoncini, parmigiano vegetarian Whipped Ricotta Pistachio crumble, Calabrian honey, fresh-baked focaccia gluten free, vegetarian Calamari Fritti* Pomodoro, lemon agresto, marinated hot pepper, fresh lemon Prosciutto Di Parma + Burrata 18-month aged Prosciutto di Parma, Italian handmade burrata, seasonal jam, focaccia gluten free Chicken | Shrimp | Salmon | Steak Insalata Classic Caesar* Half | Full Romaine, focaccia croutons, parmigiano gluten free Burrata & Arugula Heirloom tomato, basil, yellow tomato vinaigrette, EVOO gluten free, vegetarian The Mercato Grilled Chicken, spinach, arugula, seasonal fruit, pistachios, gorgonzola, pecorino vinaigrette gluten free Balsamic Bistecca Hanger steak, mixed greens, sundried tomatoes, shaved pecorino, pine nuts, balsamic vinaigrette gluten free Chophouse Italiano Gem lettuce, roasted tomatoes, olives, marinated chickpeas, red onion, salumi, mozzarella, pine nuts, parmigiano gluten free Sub gluten free pasta or zucchini noodles on any pasta dish House-made Pastas Rigatoni Bolognese Traditional ragù, garlic, cream, ricotta Orecchiette Barese Italian sausage, sautéed broccoli rabe, garlic, EVOO, chili flakes Eggplant Parmigiana Layers of thinly sliced fried eggplant, pomodoro, parmesan, fresh mozzarella vegetarian Served with fries or side Caesar salad | Gluten free bread available Focaccia Sandwiches Tuscan Caprese Grilled chicken breast, basil pesto, tomato, fresh mozzarella, arugula The Parmigiana Chicken or Meatball Pomodoro, fresh mozzarella, grated parmesan Grilled Portabella Pesto, arugula, fresh mozzarella, sundried tomato vegetarian The Italiano Prosciutto, salami, soppressata, burrata, pickled pepperoncini, pistachio cream, arugula, oil + vinegar 48-hour house-made dough | Gluten-free crust available SAVI Pizza The Margherita San Marzano, mozzarella, EVOO, Sicilian oregano, fresh basil vegetarian The Calabrese Hot capicola, pecorino, hot honey The Puglia Vodka sauce, local sausage, burrata, pesto The Ligurian Artichoke cream, feta, garlic confit, spinach, roasted tomatoes, olives vegetarian * CONSUMING RAW OR UNDERCOOKED MEATS, POULTRY, SEAFOOD, SHELLFISH OR EGGS MAY INCREASE YOUR RISK OF FOOD-BORNE ILLNESS. THESE ITEMS MAY BE COOKED TO ORDER OR OFFERED UNDERCOOKED. Dinner Download PDF Focaccia Focaccia Del Giorno Italian EVOO, garlic confit vegetarian Whipped Ricotta Pistachio crumble, Calabrian Wildflower Honey gluten free, vegetarian Prosciutto + Burrata 24-month aged Prosciutto, Italian Imported Artigiana gluten free Antipasti Olive E Amici Castelvetrano olives, sharp provolone gluten free, vegetarian Crispy Artichokes Parsley aioli, pepperoncini, parmigiano vegetarian Calamari Fritti* Pomodoro, lemon agresto, marinated hot pepper, fresh lemon Shrimp Calabria Miss Paula shrimp, chili butter, garlic, lemon zest, parsley oil, grilled focaccia gluten free Sicilian Octopus Summer squash, zucchini, smoked pecan romesco, aji verde, sweet pickled garlic gluten free Oyster Fiorentina* Baked oysters, spinach crema, pangrattato, guanciale Savi Meatballs Pomodoro, mozzarella, parmigiano Wagyu Carpaccio* Porcini dusted, garlic truffle aioli, parmesan crema, fried capers, grilled focaccia gluten free Chicken | Shrimp | Fish | Steak Insalata Classic Caesar* Half | Full Romaine, focaccia croutons, parmigiano gluten free Burrata & Arugula Heirloom tomato, basil, yellow tomato vinaigrette, EVOO gluten free, vegetarian Chophouse Italiano Gem lettuce, roasted tomatoes, olives, marinated chickpeas, red onion, salumi, mozzarella, pine nuts, parmigiano gluten free 48-hour house-made dough | Gluten-free crust available Pizza The Margherita San Marzano, mozzarella, EVOO, Sicilian oregano, fresh basil vegetarian The Ligurian Artichoke cream, feta, garlic confit, spinach, roasted tomatoes, olives vegetarian The Puglia Vodka sauce, local sausage, burrata, pesto The Calabrese Hot capicola, pecorino, hot honey Contorni Broccolini Wild Mushroom Al Forno Grilled Asparagus Garlic Potato Puree Italian Potatoes Italian Chophouse - Coastline Grilled Branzino Mediterranean sea bass, broccolini, Italian potatoes, artichokes, fresh herb oil, yellow tomato vinaigrette gluten free Grouper Piccata Charred lemon butter caper sauce, heirloom tomatoes, house-made pasta Blue Crab Raviolo Giant raviolo, artichokes, yellow tomatoes, Neonata, lemon butter, Italian herb oil Scallop Risotto* Fire roasted peppers, sweet corn, crispy pancetta, parmigiano gluten free Bianco Vongole* Littleneck clams, EVOO, white wine, shallots, garlic, butter, lemon, parsley, chili flakes, crispy pancetta, linguine Italian Chophouse - Farmland Scarpariello Joyce Farms seared chicken, Peculiar Farms sausage, Castelvetrano, roasted potatoes, tomato brodo gluten free Tuscan Pork Chop Seasoned Peculiar Farms pork chop, peperonata, Italian potatoes, broccolini, ham hock jus gluten free Barolo Braised Short Rib Chatel Farms, king trumpets, confit cipollinis, crispy brussels sprouts, garlic potato puree, Barolo jus gluten free Saltimbocca Catelli Farms veal cutlets, prosciutto, sage, asparagus, Marsala demi-glace Risotto Funghi Local wild mushrooms, Marsala butter, fried shallots, parmigiano frico, truffle salt gluten free Select your cut- served with lemon arugula, parmigiano, balsamic, EVOO Coastline Additions: Shrimp | Blue Crab | Seared Scallops Add Sauce: Salsa Verde | Gorgonzola Parmesan | Truffle Butter Italian Chophouse - Black Angus Bistecca 8oz Filet* gluten free 14oz Bone-In NY Strip* gluten free 16oz Bone-In Ribeye* gluten free Substitute gluten-free pasta or zucchini noodles on any pasta dish Italian Classics Rigatoni Bolognese Slow braised traditional beef and pork ragù, ricotta, parmigiano Orecchiette Barese Italian sausage, broccolini, garlic, EVOO, lemon, red chili flakes Bucatini Carbonara* Guanciale, pecorino romano, shaved Storey Farms cured yolk Parmigiana Eggplant | Chicken Pomodoro, parmigiano, fresh mozzarella, radiatore Sunday Lasagna Bolognese, stracciatella, vodka sauce, whipped ricotta, basil pesto All SAVI desserts are made in-house La Dolci Vita Tiramisu Limoncello Torta SAVI Cheesecake Peanut Butter Chocolate Mousse Bombolini Gelato Pistachio, Vanilla, Chocolate, Bourbon Caramel Affogato * CONSUMING RAW OR UNDERCOOKED MEATS, POULTRY, SEAFOOD, SHELLFISH OR EGGS MAY INCREASE YOUR RISK OF FOOD-BORNE ILLNESS. THESE ITEMS MAY BE COOKED TO ORDER OR OFFERED UNDERCOOKED. Download PDF Wine Bar SAVI celebrates a “1 size fits 1” philosophy offering 2 pour size options, 5oz & 8.5oz, of our 26 wines by the glass. Offering 26 sommelier selected wines by the glass and a full array of craft cocktails and spirits! Download PDF Wines from the Cellar At SAVI Cucina + Wine Bar we take great pride in curating and cellaring high quality wines, at all price points and palate preferences, so that you can always enjoy a memorable wine with our curated cuisine. Our staff of sommeliers, including our founder, a certified sommelier with the Court of Master Sommeliers, are here to help with selecting a 1 size fits 1 tasting flight, wine pairing for dinner, or crafting a customized wine club membership for our members. We're always adding new labels + vintages and below you'll find our most recent selection of 350+ wines from Italy and around the world. Download PDF Happy Hour Enjoy specially priced beverages and happy hour bites from 3:00 PM – 6:00 PM, seven days a week. Join us for Happy Hour at the Bar! Relax and unwind with us at SAVI! Download PDF Reservations Order Online Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location SAVI Cucina + Wine Bar | Upscale Italian Dining in Mount Pleasant, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "906b9233f1b8",
      "downloadedAt": "2026-01-18T16:57:07.078Z",
      "trimmedAt": "2026-01-18T17:07:19.724Z",
      "sizeReduction": "91.3%"
    },
    {
      "url": "https://www.savicucina.com/bene-cellars-wine-club-faqs/",
      "text": "Main content starts here, tab to start navigating BENE Cellars Wine Club FAQs How do I book a reservation? Tasting reservations can be made through our reservation partner Resy. BENE Cellars Wine Club Members will receive a VIP designation that allows them an exclusive booking channel where special reservations for only members are found. I am unable to book a reservation in the SAVI Wine Bar on Resy? VIP designations often will not show in Resy unless you are logged into Resy using the same phone number you used to sign up for the club. Do I have to make a reservation, or can I stop in for my tasting? While reservations are strongly encouraged, they are not required. However, a reservation will guarantee your table. Our guest experience team will do all they can to accommodate walk-ins, but we cannot guarantee space will be available. a I just signed up, when do my BENEfits start? BENEfits start upon sign up and your first month's membership dues will be charged within 24 hours. If you would like to defer your start date to the following month, please send correspondence to . wineclub@BENEhospitality.com When will my credit card be charged? Membership dues will are processed on the first day of the month. How long does it take to do a Wine Club tasting? Tastings are typically paced by the guests and while they traditionally take an hour to complete, we are more than happy to go as fast or as slow as you like. We offer express tastings to members looking to quickly go through the wines, these are offered as a flight. Can I eat dinner while doing my tasting and is it full service? All tasting reservations have full menu access and can be offered alongside dinner. Do you ship wine? Currently, we are not offering wine shipping, however we hope to in the future. Am I able to purchase wines from previous months? Previous months wine may be available in house, however that is not usually the case. If you loved a wine from a pervious month and would like to purchase more, we will happily reach out to our distributors and extend you half case or full case pricing. For an inquires of this nature please reach out to our Wine Club Director via . email Can I bring in friends or family that are not Wine Club members in for my tasting? Absolutely! All guests are welcome. If they would like to participate in the tasting with you we offer the flight for $19.95. Guest may also purchase any of the wine club selections at Non-Member pricing. What if I can’t make it in for my tasting? Simply send an email to with your selections. (Current month offerings and tasting notes can be found on our website.) This places an inventory hold on your selected bottles for 72 hours. We ask that members pick up their selections within the 72-hour time frame as storage is limited. wineclub@BENEhospitality.com I missed my tasting for the month, now what? Life gets busy, we get it, we can let you know what inventory remains from the prior month and you can arrange a time to pick up. Please send an email to to arrange your order. wineclub@BENEhospitality.com Can I send someone else to get my wines if I can’t make it in? Of course, please ensure that the person picking up your wines is 21 or older and let us know via the who will be obtaining your order so we can notate your account. Member wines will not be sent with other individuals without the proper correspondence. Wine Club inbox Can I share my Club privileges? We do not allow transferable membership privileges. Member must be present for BENEfit use. How do I update my contact or credit card information? Information can be updated via the page. It is the members responsibility to keep all information including billing information up to date. We are more than happy to make changes within your account for you, simply call our Guest Experience Team and ask for the Wine Club Director or an Assistant Sommelier. member’s account Can I gift a membership? Absolutely...and you can select how many months you would like to gift! One of our Sommeliers will load a gift card with the exact amount of the dues for each month. If a gift card is used for anything additional (dinner, etc) the card may not cover the cost of membership dues. This card can be used for regular dining although we do not suggest this. I am not receiving emails. How can I update my email on file? Information can be updated via the page. We are more than happy to make changes within your account for you, simply call our Guest Experience Team or send an email to . (Be sure to add us as a safe sender so we don't end up in your junk folder.) member’s account wineclub@BENEhospitality.com Can I skip shipments or suspend my membership? We do not offer to skip shipments or membership suspension. However, if you need to cancel for a month or two. We will happily reinstate your membership when you are ready. How do I cancel my membership? All membership cancellation requests must be made to the 7 days prior to the processing date. All cancelations made after the cut off will be honored the following month. Wine Club inbox What if I end up with a damaged or corked bottle of wine? Not a problem! We ask that you bring the bottle (full/partially full) with the tainted wine into the location it was received, and we will exchange the wine. We will send the wine to our distributor so in these cases the bottle itself is not sufficient for a refund/exchange. Can I purchase additional wines for the month? Of course! We offer all of our club selections for purchase at members only pricing. We also offer non-member pricing for non-members. Can I select two of the same wines? We ask that members select two different labels to preserve allocations for guest who have not yet come in that month. Can I enjoy one of my Wine Club selections while in the restaurant? We do allow members to enjoy their Wine Club selections in house. Corkage fees will apply. What if the wine I want is out of stock? While we strive to have all of the requested selections, availability and quantity of wines is always changing. We can always order the selections if in stock, or find an alternative that will suit your taste. Reservations Order Online Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location SAVI Cucina + Wine Bar | Upscale Italian Dining in Mount Pleasant, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "9a6cb2faa7ad",
      "downloadedAt": "2026-01-18T16:57:08.661Z",
      "trimmedAt": "2026-01-18T17:07:19.730Z",
      "sizeReduction": "85.7%"
    },
    {
      "url": "https://www.savicucina.com/menus",
      "text": "Main content starts here, tab to start navigating Menus Slide 1 of 3 Slide 2 of 3 Slide 3 of 3 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Lunch Dinner Dessert Wines by the Glass + Cocktails Wines from the Cellar Happy Hour Lunch Download PDF Aperitivi Focaccia Del Giorno Italian EVOO, garlic confit vegetarian Olive E Formaggio Castelvetrano olives, sharp Italian provolone gluten free, vegetarian Antipasti Savi Meatballs Pomodoro, mozzarella, parmigiano Crispy Artichokes Parsley aioli, pepperoncini, parmigiano vegetarian Whipped Ricotta Pistachio crumble, Calabrian honey, fresh-baked focaccia gluten free, vegetarian Calamari Fritti* Pomodoro, lemon agresto, marinated hot pepper, fresh lemon Prosciutto Di Parma + Burrata 18-month aged Prosciutto di Parma, Italian handmade burrata, seasonal jam, focaccia gluten free Chicken | Shrimp | Salmon | Steak Insalata Classic Caesar* Half | Full Romaine, focaccia croutons, parmigiano gluten free Burrata & Arugula Heirloom tomato, basil, yellow tomato vinaigrette, EVOO gluten free, vegetarian The Mercato Grilled Chicken, spinach, arugula, seasonal fruit, pistachios, gorgonzola, pecorino vinaigrette gluten free Balsamic Bistecca Hanger steak, mixed greens, sundried tomatoes, shaved pecorino, pine nuts, balsamic vinaigrette gluten free Chophouse Italiano Gem lettuce, roasted tomatoes, olives, marinated chickpeas, red onion, salumi, mozzarella, pine nuts, parmigiano gluten free Sub gluten free pasta or zucchini noodles on any pasta dish House-made Pastas Rigatoni Bolognese Traditional ragù, garlic, cream, ricotta Orecchiette Barese Italian sausage, sautéed broccoli rabe, garlic, EVOO, chili flakes Eggplant Parmigiana Layers of thinly sliced fried eggplant, pomodoro, parmesan, fresh mozzarella vegetarian Served with fries or side Caesar salad | Gluten free bread available Focaccia Sandwiches Tuscan Caprese Grilled chicken breast, basil pesto, tomato, fresh mozzarella, arugula The Parmigiana Chicken or Meatball Pomodoro, fresh mozzarella, grated parmesan Grilled Portabella Pesto, arugula, fresh mozzarella, sundried tomato vegetarian The Italiano Prosciutto, salami, soppressata, burrata, pickled pepperoncini, pistachio cream, arugula, oil + vinegar 48-hour house-made dough | Gluten-free crust available SAVI Pizza The Margherita San Marzano, mozzarella, EVOO, Sicilian oregano, fresh basil vegetarian The Calabrese Hot capicola, pecorino, hot honey The Puglia Vodka sauce, local sausage, burrata, pesto The Ligurian Artichoke cream, feta, garlic confit, spinach, roasted tomatoes, olives vegetarian * CONSUMING RAW OR UNDERCOOKED MEATS, POULTRY, SEAFOOD, SHELLFISH OR EGGS MAY INCREASE YOUR RISK OF FOOD-BORNE ILLNESS. THESE ITEMS MAY BE COOKED TO ORDER OR OFFERED UNDERCOOKED. Dinner Download PDF Focaccia Focaccia Del Giorno Italian EVOO, garlic confit vegetarian Whipped Ricotta Pistachio crumble, Calabrian Wildflower Honey gluten free, vegetarian Prosciutto + Burrata 24-month aged Prosciutto, Italian Imported Artigiana gluten free Antipasti Olive E Amici Castelvetrano olives, sharp provolone gluten free, vegetarian Crispy Artichokes Parsley aioli, pepperoncini, parmigiano vegetarian Calamari Fritti* Pomodoro, lemon agresto, marinated hot pepper, fresh lemon Shrimp Calabria Miss Paula shrimp, chili butter, garlic, lemon zest, parsley oil, grilled focaccia gluten free Sicilian Octopus Summer squash, zucchini, smoked pecan romesco, aji verde, sweet pickled garlic gluten free Oyster Fiorentina* Baked oysters, spinach crema, pangrattato, guanciale Savi Meatballs Pomodoro, mozzarella, parmigiano Wagyu Carpaccio* Porcini dusted, garlic truffle aioli, parmesan crema, fried capers, grilled focaccia gluten free Chicken | Shrimp | Fish | Steak Insalata Classic Caesar* Half | Full Romaine, focaccia croutons, parmigiano gluten free Burrata & Arugula Heirloom tomato, basil, yellow tomato vinaigrette, EVOO gluten free, vegetarian Chophouse Italiano Gem lettuce, roasted tomatoes, olives, marinated chickpeas, red onion, salumi, mozzarella, pine nuts, parmigiano gluten free 48-hour house-made dough | Gluten-free crust available Pizza The Margherita San Marzano, mozzarella, EVOO, Sicilian oregano, fresh basil vegetarian The Ligurian Artichoke cream, feta, garlic confit, spinach, roasted tomatoes, olives vegetarian The Puglia Vodka sauce, local sausage, burrata, pesto The Calabrese Hot capicola, pecorino, hot honey Contorni Broccolini Wild Mushroom Al Forno Grilled Asparagus Garlic Potato Puree Italian Potatoes Italian Chophouse - Coastline Grilled Branzino Mediterranean sea bass, broccolini, Italian potatoes, artichokes, fresh herb oil, yellow tomato vinaigrette gluten free Grouper Piccata Charred lemon butter caper sauce, heirloom tomatoes, house-made pasta Blue Crab Raviolo Giant raviolo, artichokes, yellow tomatoes, Neonata, lemon butter, Italian herb oil Scallop Risotto* Fire roasted peppers, sweet corn, crispy pancetta, parmigiano gluten free Bianco Vongole* Littleneck clams, EVOO, white wine, shallots, garlic, butter, lemon, parsley, chili flakes, crispy pancetta, linguine Italian Chophouse - Farmland Scarpariello Joyce Farms seared chicken, Peculiar Farms sausage, Castelvetrano, roasted potatoes, tomato brodo gluten free Tuscan Pork Chop Seasoned Peculiar Farms pork chop, peperonata, Italian potatoes, broccolini, ham hock jus gluten free Barolo Braised Short Rib Chatel Farms, king trumpets, confit cipollinis, crispy brussels sprouts, garlic potato puree, Barolo jus gluten free Saltimbocca Catelli Farms veal cutlets, prosciutto, sage, asparagus, Marsala demi-glace Risotto Funghi Local wild mushrooms, Marsala butter, fried shallots, parmigiano frico, truffle salt gluten free Select your cut- served with lemon arugula, parmigiano, balsamic, EVOO Coastline Additions: Shrimp | Blue Crab | Seared Scallops Add Sauce: Salsa Verde | Gorgonzola Parmesan | Truffle Butter Italian Chophouse - Black Angus Bistecca 8oz Filet* gluten free 14oz Bone-In NY Strip* gluten free 16oz Bone-In Ribeye* gluten free Substitute gluten-free pasta or zucchini noodles on any pasta dish Italian Classics Rigatoni Bolognese Slow braised traditional beef and pork ragù, ricotta, parmigiano Orecchiette Barese Italian sausage, broccolini, garlic, EVOO, lemon, red chili flakes Bucatini Carbonara* Guanciale, pecorino romano, shaved Storey Farms cured yolk Parmigiana Eggplant | Chicken Pomodoro, parmigiano, fresh mozzarella, radiatore Sunday Lasagna Bolognese, stracciatella, vodka sauce, whipped ricotta, basil pesto All SAVI desserts are made in-house La Dolci Vita Tiramisu Limoncello Torta SAVI Cheesecake Peanut Butter Chocolate Mousse Bombolini Gelato Pistachio, Vanilla, Chocolate, Bourbon Caramel Affogato * CONSUMING RAW OR UNDERCOOKED MEATS, POULTRY, SEAFOOD, SHELLFISH OR EGGS MAY INCREASE YOUR RISK OF FOOD-BORNE ILLNESS. THESE ITEMS MAY BE COOKED TO ORDER OR OFFERED UNDERCOOKED. Download PDF Wine Bar SAVI celebrates a “1 size fits 1” philosophy offering 2 pour size options, 5oz & 8.5oz, of our 26 wines by the glass. Offering 26 sommelier selected wines by the glass and a full array of craft cocktails and spirits! Download PDF Wines from the Cellar At SAVI Cucina + Wine Bar we take great pride in curating and cellaring high quality wines, at all price points and palate preferences, so that you can always enjoy a memorable wine with our curated cuisine. Our staff of sommeliers, including our founder, a certified sommelier with the Court of Master Sommeliers, are here to help with selecting a 1 size fits 1 tasting flight, wine pairing for dinner, or crafting a customized wine club membership for our members. We're always adding new labels + vintages and below you'll find our most recent selection of 350+ wines from Italy and around the world. Download PDF Happy Hour Enjoy specially priced beverages and happy hour bites from 3:00 PM – 6:00 PM, seven days a week. Join us for Happy Hour at the Bar! Relax and unwind with us at SAVI! Download PDF Reservations Order Online Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location SAVI Cucina + Wine Bar | Upscale Italian Dining in Mount Pleasant, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "bfad7752b59d",
      "downloadedAt": "2026-01-18T16:57:10.401Z",
      "trimmedAt": "2026-01-18T17:07:19.763Z",
      "sizeReduction": "91.3%"
    },
    {
      "url": "https://www.savicucina.com/location/savi-cucina-wine-bar/",
      "text": "Main content starts here, tab to start navigating Hours & Location 1324 Theater Drive, Mount Pleasant, SC 29464 843.606.1856 info@savicucina.com Conveniently located in Mount Pleasant Towne Centre ------------------------------ 3:00 pm - 9:00 pm Monday - Thursday Noon - 10:00 pm Friday - Saturday Noon - 9:00 pm Sunday ***Aperitivo Hour daily from 3 - 6 PM, Dinner service begins at 5 pm*** Get Directions Reservations Order Online Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location SAVI Cucina + Wine Bar | Upscale Italian Dining in Mount Pleasant, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "c9c98b057478",
      "downloadedAt": "2026-01-18T16:57:06.553Z",
      "trimmedAt": "2026-01-18T17:07:19.768Z",
      "sizeReduction": "96.5%"
    },
    {
      "url": "https://www.savicucina.com/benecellarswineclub/",
      "text": "Main content starts here, tab to start navigating BENE Cellars Wine Club Slide 1 of 5 Slide 2 of 5 Slide 3 of 5 Slide 4 of 5 Slide 5 of 5 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides Experience the World of Wine with BENE Cellars Wine Club Discover new wines from around the world with the BENE Cellars Wine Club. Our all-inclusive membership offers you the opportunity to explore the finest wines from across the globe, along with exclusive perks, including a monthly wine tasting tailored just for you. Monthly Premium Wine Selections Each month, our expert sommeliers handpick premium wines for you to savor. You can reserve your tasting at your convenience, any day of the month. Enjoy a personalized experience as you decide which bottles to take home. The is $49.95 per month and includes a tasting for you and a guest, along with of your choice to take home. standard BENE Cellars Wine Club membership two bottles The is $24.95 per month and includes a tasting for you and your choice of to take home. It’s the perfect option for best friends to share a wine experience together. BENE Cellars Wine Club for BFFs one bottle Flexible Selection Options Pressed for time? No problem. You can make your wine selections via email, or let us handle the details by choosing bottles that match your personal preferences. Simply pick up your selections whenever it’s convenient for you. Join BENE Cellars Wine Club Today Elevate your wine experience with personalized tastings, premium selections, and the perfect bottle to enjoy at home. Whether it’s a solo discovery, a fun outing with your best friend, or an experience for you and a guest, BENE Cellars Wine Club has a membership for every wine lover. to join! Click here BENE Cellars Wine Club Terms & Conditions Frequently Asked Questions Contact us: WineClub@BENEHospitality.com ________ If at any time you would like to cancel your membership, please send an email to WineClub@BENEHospitality.com one week prior to the end of the month to allow time to process your cancellation. January BENE Cellars Selections Make your selections via Email! Unable to make it in this month? No problem! Send us an email with your selections and we'll have them ready for pick-up within 24 hours. (Please pick up within 72 hours as storage space is extremely limited.) Reservations Order Online Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location SAVI Cucina + Wine Bar | Upscale Italian Dining in Mount Pleasant, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "cb708ca3c0b4",
      "downloadedAt": "2026-01-18T16:57:08.136Z",
      "trimmedAt": "2026-01-18T17:07:19.776Z",
      "sizeReduction": "93.2%"
    },
    {
      "url": "https://www.savicucina.com/wine-dinners/",
      "text": "Main content starts here, tab to start navigating Upcoming Wine Events Grgich Hills Estate Wine Dinner - January 22nd Load More Events Reservations Order Online Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location SAVI Cucina + Wine Bar | Upscale Italian Dining in Mount Pleasant, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "d2dbe6ad23a3",
      "downloadedAt": "2026-01-18T16:57:07.612Z",
      "trimmedAt": "2026-01-18T17:07:19.781Z",
      "sizeReduction": "97.2%"
    },
    {
      "url": "https://www.savicucina.com/",
      "text": "Home Main content starts here, tab to start navigating Slide 1 of 5 Slide 2 of 5 Slide 3 of 5 Slide 4 of 5 Slide 5 of 5 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides SAVI Cucina was born from a shared dream between husband and wife duo, Karen and Ty Raju—a dream rooted in a deep love for food, wine, and genuine hospitality. Named after Karen’s beloved grandmother, Savanelle, SAVI is a tribute to the warmth, tradition, and soulful connection that family meals bring. What started as a passion project has grown into a vibrant gathering place in Mt. Pleasant, where guests are treated like family and every detail is touched by intention. With Ty’s expertise as a certified sommelier and Karen’s heart for hospitality, SAVI brings an elevated yet approachable Italian dining experience to the Lowcountry—one that honors old-world charm with a fresh, modern spirit. View Menus Our Mission Whether you’re savoring a housemade pasta, discovering a hidden gem from our global wine list, or just soaking in the ambiance, we hope you leave with full hearts and lasting memories. Because at SAVI, it’s not just about what’s on the plate—it’s about how it makes you feel. In The News Wine Spectator SAVI Cucina + Wine Bar Wins the double glass Wine Spectator's 2025 \"Best of Award\" Mount Pleasant Magazine SAVI Cucina + Wine Bar wins its 6th consecutive Best Italian Restaurant Decanter Magazine SAVI Cucina + Wine Bar - One of Charleston's Wine Hotspots Follow Us Facebook Instagram Linkedin Reservations Order Online Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Reservations Location - Required Location SAVI Cucina + Wine Bar | Upscale Italian Dining in Mount Pleasant, SC Please, select a location Number of People - Optional Number of People 1 Person 2 People 3 People 4 People 5 People 6 People 7 People 8+ People Date - Required Time - Optional Time 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM Find A Table Submit the reservation form Please check errors in the form above Thanks! This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "e7dd51c1d47f",
      "downloadedAt": "2026-01-18T16:57:06.526Z",
      "trimmedAt": "2026-01-18T17:07:19.790Z",
      "sizeReduction": "95.9%"
    }
  ],
  "sizeReduction": "92.8%"
}