{
  "venueId": "ChIJg0TeylZj_ogRxzDwVq2XKeQ",
  "venueName": "Bonefish Grill",
  "venueArea": "North Charleston",
  "website": "https://locations.bonefishgrill.com/south-carolina/north-charleston/5041-international-blvd.?y_source=1_MTU1MDI4MTctNzE1LWxvY2F0aW9uLndlYnNpdGU%3D",
  "scrapedAt": "2026-01-18T17:04:28.613Z",
  "trimmedAt": "2026-01-18T17:11:23.224Z",
  "pages": [
    {
      "url": "https://locations.bonefishgrill.com/search",
      "text": "Skip to content Return to Nav Find A Location Search by city and state or ZIP code City, State/Province, Zip or City & Country Submit a search. Geolocate. Use our locator to find a location near you or browse our directory. Search this area Back to top",
      "hash": "5139b4925c47",
      "downloadedAt": "2026-01-18T16:58:17.437Z",
      "trimmedAt": "2026-01-18T17:11:23.189Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "https://locations.bonefishgrill.com/index.html",
      "text": "Skip to content Return to Nav All Bonefish Grill Locations in The United States Search by city and state or ZIP code City, State/Province, Zip or City & Country Submit a search. Alabama Arkansas Colorado Florida Georgia Illinois Indiana Kansas Kentucky Louisiana Maryland Michigan Missouri Nebraska Nevada New Jersey New York North Carolina Ohio Oklahoma Pennsylvania South Carolina Tennessee Texas Virginia Washington Wisconsin",
      "hash": "82de66088eb3",
      "downloadedAt": "2026-01-18T16:58:17.972Z",
      "trimmedAt": "2026-01-18T17:11:23.197Z",
      "sizeReduction": "99.7%"
    },
    {
      "url": "https://locations.bonefishgrill.com/south-carolina/north-charleston/5041-international-blvd.?y_source=1_MTU1MDI4MTctNzE1LWxvY2F0aW9uLndlYnNpdGU%3D",
      "text": "Skip to content JOIN US FOR OUR 4-COURSE WINE PAIRING DINNER ON FEB. 19 | RSVP NOW SEE MENU Close banner NOW OFFERING FOR EVERYDAY OCCASIONS AND SPECIAL EVENTS! CATERING Close banner Return to Nav Bonefish Grill North Charleston 11:00 AM - 10:30 PM 11:00 AM - 10:30 PM 11:00 AM - 10:30 PM 11:00 AM - 10:30 PM 11:00 AM - 11:00 PM 11:00 AM - 11:00 PM 11:00 AM - 9:00 PM Order Now Make Reservation Catering Event RSVP RESTAURANT DETAILS 5041 International Blvd. North Charleston , SC 29418 US Get Directions (843) 747-7735 (843) 747-7735 HOURS OF OPERATION Day of the Week Hours Monday 11:00 AM - 10:30 PM Tuesday 11:00 AM - 10:30 PM Wednesday 11:00 AM - 10:30 PM Thursday 11:00 AM - 10:30 PM Friday 11:00 AM - 11:00 PM Saturday 11:00 AM - 11:00 PM Sunday 11:00 AM - 9:00 PM Managing Partner: NATE SHAW Services at this location: Online Ordering Reservations Curbside Catch Wifi Outdoor Dining Lunch Catering Weekend Brunch Stay Hooked – Download the Bonefish App today Get it on Google Play Download on the App Store Order Delivery from our Partners Download North Charleston's Menus See Tonight's Specials Lunch Menu Dinner Menu Brunch Menu Family Bundles Kid's Menu Gluten Friendly Menu Catering Menu Social Hour Menu Courses & Cocktails Bonefish Grill Winter Specials GROUPER WITH CRAB CAKE & BANG HOLLANDAISE Wood-grilled grouper, paired with a lump crab cake, topped with a creamy spicy hollandaise sauce, finished with green onion, served with jasmine rice and asparagus. Order Now SHRIMP DIABLO LINGUINE Chef-crafted diablo cream sauce, red bell peppers, red onion, broccoli, topped with wood-grilled shrimp, parmesan, green onion, and diced tomato. Order Now CEDAR PLANK \"OLD-FASHIONED\" SALMON Cedar plank roasted salmon, brushed with a Jim Beam bourbon honey glaze, finished with Bordeaux cherry gastrique and fresh grated orange zest, served with asparagus and jasmine rice. Order Now Prices, product participation, restaurant hours, delivery and carryout services will vary by location. Please check with your local Bonefish Grill for details. WHAT'S BETTER THAN HAPPY HOUR? NEW SOCIAL HOUR! EVERY. SINGLE. DAY. Enjoy delicious new menu items and irresistible hand-crafted cocktails starting at $7, available every single day. Only at Bonefish Grill. Let's Go! Experience the flavors, taste the rewards. Join Dine Rewards Like us on Facebook FREQUENTLY ASKED QUESTIONS What time is happy hour? Happy Hour starts at 4pm daily. Times may vary some by location. Please call your local Bonefish Grill for details. Do you take reservations? Yes. Call your local Bonefish Grill or make reservations . here Where can I view menus with prices? To view menus with prices, . You can also view prices via . click here order.bonefishgrill.com Is your FAQ not listed here? To view a complete list of FAQs, . click here GIVE A GIFT IN GOOD TASTE Buy Gift Cards Now More about bonefish grill at North Charleston Your local North Charleston, SC Bonefish Grill® specializes in hand-cut, wood-grilled specialties and locally crafted Partner Selection dishes made with the freshest, highest-quality ingredients. The restaurant offers a selection of classic and signature hand-crafted cocktails, using just-squeezed juices, edible garnishes, and house infusions in addition to offering a distinct list of wines, which are the perfect match for any food pairing. Located near the Charleston International Airport on International Blvd and across from the Charleston Convention Center Managing Partner: NATE SHAW Instagram Facebook Twitter TikTok BonefishGrill.com Get directions to Bonefish Grill at 5041 International Blvd. North Charleston, SC Find a Location",
      "hash": "86987ee2a700",
      "downloadedAt": "2026-01-18T16:58:17.101Z",
      "trimmedAt": "2026-01-18T17:11:23.224Z",
      "sizeReduction": "95.2%"
    }
  ],
  "sizeReduction": "99.0%"
}