{
  "venueId": "ChIJtQBFdAB7_ogR1rRabEk7heQ",
  "venueName": "Wit’s End Comedy Lounge",
  "venueArea": "North Charleston",
  "website": "https://www.witsendcharleston.com/",
  "scrapedAt": "2026-01-18T17:04:31.540Z",
  "trimmedAt": "2026-01-18T17:12:50.667Z",
  "pages": [
    {
      "url": "https://www.witsendcharleston.com/events/121943",
      "text": "Sign up Login Event Description Biography January 26 Best of Charleston Comedy Best of Charleston Comedy ​Get ready for one powerhouse night of laughter as we bring together the absolute best comedians Charleston has to offer. All on one stage, one night only!From up-and-coming rising stars to seasoned local legends, this is your chance to see the funniest talent in the Lowcountry showing off their tightest sets. Expect a fast-paced, high-energy evening that celebrates the comedy scene that makes Charleston unique with a showcase of clever writing, bold performances, and laugh-out-loud moments you’ll be talking about all week. Comedians will be announced soon! Please take note of the following: VIP tickets are Preferred Tabletop Seating. General Admission tickets are General Seating which is first come first serve. Bar is open after events until midnight. Kitchen closes at 11:30. No refunds or exchanges. All patrons must be ages 21+ with valid ID. No exceptions!! No backpacks, all bags are subject to search. No outside food or drink allowed There WILL be adult content. No heckling, don’t be that person, you’ll be asked to leave and you will not get a refund NO VIDEO OR PHOTOGRAPHY IS ALLOWED DURING SHOWS We take pride in our drink minimum (which is zero!) so please be mindful of this as you tip your servers and enjoy your food and beverages during the show! 30 minute late arrivals will not be guaranteed their seats General Seating is first come first serve, we can not guarantee you will sit with a larger party together, but we will try! Get ready for one powerhouse night of laughter as we bring together the absolute best comedians Charleston has to offer. All on one stage, one night only!From up-and-coming rising stars to seasoned local legends, this is your chance to see the funniest talent in the Lowcountry showing off their tightest sets. Expect a fast-paced, high-energy evening that celebrates the comedy scene that makes Charleston unique with a showcase of clever writing, bold performances, and laugh-out-loud moments you’ll be talking about all week. Comedians will be announced soon! 01/26/2026 8:00 PM Door Time: 6:00 PM Other Showtimes ​Get ready for one powerhouse night of laughter as we bring together the absolute best comedians Charleston has to offer. All on one stage, one night only!From up-and-coming rising stars to seasoned local legends, this is your chance to see the funniest talent in the Lowcountry showing off their tightest sets. Expect a fast-paced, high-energy evening that celebrates the comedy scene that makes Charleston unique with a showcase of clever writing, bold performances, and laugh-out-loud moments you’ll be talking about all week. Comedians will be announced soon! Please take note of the following: VIP tickets are Preferred Tabletop Seating. General Admission tickets are General Seating which is first come first serve. Bar is open after events until midnight. Kitchen closes at 11:30. No refunds or exchanges. All patrons must be ages 21+ with valid ID. No exceptions!! No backpacks, all bags are subject to search. No outside food or drink allowed There WILL be adult content. No heckling, don’t be that person, you’ll be asked to leave and you will not get a refund NO VIDEO OR PHOTOGRAPHY IS ALLOWED DURING SHOWS We take pride in our drink minimum (which is zero!) so please be mindful of this as you tip your servers and enjoy your food and beverages during the show! 30 minute late arrivals will not be guaranteed their seats General Seating is first come first serve, we can not guarantee you will sit with a larger party together, but we will try! Get ready for one powerhouse night of laughter as we bring together the absolute best comedians Charleston has to offer. All on one stage, one night only!From up-and-coming rising stars to seasoned local legends, this is your chance to see the funniest talent in the Lowcountry showing off their tightest sets. Expect a fast-paced, high-energy evening that celebrates the comedy scene that makes Charleston unique with a showcase of clever writing, bold performances, and laugh-out-loud moments you’ll be talking about all week. Comedians will be announced soon!",
      "hash": "1e741257e131",
      "downloadedAt": "2026-01-18T17:01:58.168Z",
      "trimmedAt": "2026-01-18T17:12:50.490Z",
      "sizeReduction": "79.0%"
    },
    {
      "url": "https://www.witsendcharleston.com/#menu-mobile",
      "text": "Sign up Login Michael Clayton - Album Taping January 18 Buy Tickets Gabby Bryan January 22 - January 24 Buy Tickets And Then We Had Sex Podcast January 24 Buy Tickets Best of Charleston Comedy January 26 Buy Tickets Dustin Nickerson January 27 Buy Tickets Pauly Shore January 28 - January 31 Buy Tickets Late Night Cheap Show with Josh Bates January 30 Buy Tickets Mike Goodwin February 01 Buy Tickets Upcoming Shows Michael Clayton - Album Taping January 18 Buy Tickets Gabby Bryan Comedy Central January 22 - January 24 Buy Tickets And Then We Had Sex Podcast January 24 Buy Tickets Best of Charleston Comedy January 26 Buy Tickets Dustin Nickerson Comedy Central, Netflix January 27 Buy Tickets Pauly Shore HBO, Netflix, Amazon Prime Video January 28 - January 31 Buy Tickets Late Night Cheap Show with Josh Bates January 30 Buy Tickets Mike Goodwin America's Got Talent, Dry Bar February 01 Buy Tickets View Full Event List View Full Calendar",
      "hash": "565748ec3e05",
      "downloadedAt": "2026-01-18T17:01:54.449Z",
      "trimmedAt": "2026-01-18T17:12:50.506Z",
      "sizeReduction": "99.7%"
    },
    {
      "url": "https://www.witsendcharleston.com/pages/menu",
      "text": "Sign up Login",
      "hash": "88f24d1851d7",
      "downloadedAt": "2026-01-18T17:01:53.054Z",
      "trimmedAt": "2026-01-18T17:12:50.507Z",
      "sizeReduction": "99.8%"
    },
    {
      "url": "https://www.witsendcharleston.com/",
      "text": "Sign up Login Michael Clayton - Album Taping January 18 Buy Tickets Gabby Bryan January 22 - January 24 Buy Tickets And Then We Had Sex Podcast January 24 Buy Tickets Best of Charleston Comedy January 26 Buy Tickets Dustin Nickerson January 27 Buy Tickets Pauly Shore January 28 - January 31 Buy Tickets Late Night Cheap Show with Josh Bates January 30 Buy Tickets Mike Goodwin February 01 Buy Tickets Upcoming Shows Michael Clayton - Album Taping January 18 Buy Tickets Gabby Bryan Comedy Central January 22 - January 24 Buy Tickets And Then We Had Sex Podcast January 24 Buy Tickets Best of Charleston Comedy January 26 Buy Tickets Dustin Nickerson Comedy Central, Netflix January 27 Buy Tickets Pauly Shore HBO, Netflix, Amazon Prime Video January 28 - January 31 Buy Tickets Late Night Cheap Show with Josh Bates January 30 Buy Tickets Mike Goodwin America's Got Talent, Dry Bar February 01 Buy Tickets View Full Event List View Full Calendar",
      "hash": "8ddd1abf82c2",
      "downloadedAt": "2026-01-18T17:01:51.255Z",
      "trimmedAt": "2026-01-18T17:12:50.525Z",
      "sizeReduction": "99.7%"
    },
    {
      "url": "https://www.witsendcharleston.com/pages/corporate-events",
      "text": "Sign up Login Corporate Events Looking for a unique and memorable way to celebrate your company's achievements, reward your employees, or impress your clients? Look no further than the Wit’s End. Wit’s End is a premier venue that offers a variety of comedy shows featuring the best local and national comedians. Whether you prefer stand-up, improv, sketch, or musical comedy, we have something for everyone. You and your guests will enjoy a night of laughter and entertainment in a comfortable and classy setting. We can accommodate groups of any size and budget, and we offer flexible packages that include food, drinks, tickets, and our ultra sweet VIP Game Room! Wit’s End is more than just a comedy club, it's an experience. It's a great way to boost morale, foster teamwork, and create lasting memories. It's the perfect choice for your next corporate event! To book your event or to learn more, please . We look forward to hearing from you and making your event a success! email us",
      "hash": "a6d7b6942191",
      "downloadedAt": "2026-01-18T17:01:53.783Z",
      "trimmedAt": "2026-01-18T17:12:50.526Z",
      "sizeReduction": "89.5%"
    },
    {
      "url": "https://www.witsendcharleston.com/events/123155",
      "text": "Sign up Login Event Description Biography January 24 And Then We Had Sex Podcast And Then We Had Sex Podcast ​If you weren't aware, \"And Then We Had Sex\" is possibly the fastest growing podcast in your area! Each week, married couple and show hosts, comedian Kristen Sivills and writer J-Rod Tanner guide you into their unconventional world of sex, comedy, and uninhibited truth. Kristen has toured nationally with acts such as Anjelah Johnson, Tone Bell, and was one of the headliners for Wendy Williams, and Summer Theatre Tour, to name a few. J-Rod has written and worked with numerous comedians and actors including his partner, Jay Pharoah. Their hilarious takes on relationships, uncensored interviews, insightful and open sex talk, and willingness to put the spotlight on the most personal parts of their marriage will leave you laughing, blushing, and binging every single episode! Reaching more than 30 countries and amassing over thousands of weekly streams and downloads, this is the one podcast that you MUST subscribe to, whether you’re a regular pod listener or you’re interested in losing your pod-ginity! Please take note of the following: VIP tickets are Preferred Tabletop Seating. General Admission tickets are General Seating which is first come first serve. Bar is open after events until midnight. Kitchen closes at 11:30. No refunds or exchanges. All patrons must be ages 21+ with valid ID. No exceptions!! No backpacks, all bags are subject to search. No outside food or drink allowed There WILL be adult content. No heckling, don’t be that person, you’ll be asked to leave and you will not get a refund NO VIDEO OR PHOTOGRAPHY IS ALLOWED DURING SHOWS We take pride in our drink minimum (which is zero!) so please be mindful of this as you tip your servers and enjoy your food and beverages during the show! 30 minute late arrivals will not be guaranteed their seats General Seating is first come first serve, we can not guarantee you will sit with a larger party together, but we will try! Their hilarious takes on relationships, uncensored interviews, insightful and open sex talk, and willingness to put the spotlight on the most personal parts of their marriage will leave you laughing, blushing, and binging every single episode! Reaching more than 30 countries and amassing over thousands of weekly streams and downloads, this is the one podcast that you MUST subscribe to, whether you’re a regular pod listener or you’re interested in losing your pod-ginity! If you weren't aware, \"And Then We Had Sex\" is possibly the fastest growing podcast in your area! Each week, married couple and show hosts, comedian Kristen Sivills and writer J-Rod Tanner guide you into their unconventional world of sex, comedy, and uninhibited truth. Kristen has toured nationally with acts such as Anjelah Johnson, Tone Bell, and was one of the headliners for Wendy Williams, and Summer Theatre Tour, to name a few. J-Rod has written and worked with numerous comedians and actors including his partner, Jay Pharoah. 01/24/2026 4:00 PM Door Time: 2:00 PM Other Showtimes ​If you weren't aware, \"And Then We Had Sex\" is possibly the fastest growing podcast in your area! Each week, married couple and show hosts, comedian Kristen Sivills and writer J-Rod Tanner guide you into their unconventional world of sex, comedy, and uninhibited truth. Kristen has toured nationally with acts such as Anjelah Johnson, Tone Bell, and was one of the headliners for Wendy Williams, and Summer Theatre Tour, to name a few. J-Rod has written and worked with numerous comedians and actors including his partner, Jay Pharoah. Their hilarious takes on relationships, uncensored interviews, insightful and open sex talk, and willingness to put the spotlight on the most personal parts of their marriage will leave you laughing, blushing, and binging every single episode! Reaching more than 30 countries and amassing over thousands of weekly streams and downloads, this is the one podcast that you MUST subscribe to, whether you’re a regular pod listener or you’re interested in losing your pod-ginity! Please take note of the following: VIP tickets are Preferred Tabletop Seating. General Admission tickets are General Seating which is first come first serve. Bar is open after events until midnight. Kitchen closes at 11:30. No refunds or exchanges. All patrons must be ages 21+ with valid ID. No exceptions!! No backpacks, all bags are subject to search. No outside food or drink allowed There WILL be adult content. No heckling, don’t be that person, you’ll be asked to leave and you will not get a refund NO VIDEO OR PHOTOGRAPHY IS ALLOWED DURING SHOWS We take pride in our drink minimum (which is zero!) so please be mindful of this as you tip your servers and enjoy your food and beverages during the show! 30 minute late arrivals will not be guaranteed their seats General Seating is first come first serve, we can not guarantee you will sit with a larger party together, but we will try! Their hilarious takes on relationships, uncensored interviews, insightful and open sex talk, and willingness to put the spotlight on the most personal parts of their marriage will leave you laughing, blushing, and binging every single episode! Reaching more than 30 countries and amassing over thousands of weekly streams and downloads, this is the one podcast that you MUST subscribe to, whether you’re a regular pod listener or you’re interested in losing your pod-ginity! If you weren't aware, \"And Then We Had Sex\" is possibly the fastest growing podcast in your area! Each week, married couple and show hosts, comedian Kristen Sivills and writer J-Rod Tanner guide you into their unconventional world of sex, comedy, and uninhibited truth. Kristen has toured nationally with acts such as Anjelah Johnson, Tone Bell, and was one of the headliners for Wendy Williams, and Summer Theatre Tour, to name a few. J-Rod has written and worked with numerous comedians and actors including his partner, Jay Pharoah.",
      "hash": "ad9bb0c6b65c",
      "downloadedAt": "2026-01-18T17:01:57.137Z",
      "trimmedAt": "2026-01-18T17:12:50.531Z",
      "sizeReduction": "73.3%"
    },
    {
      "url": "https://www.witsendcharleston.com/events/125581",
      "text": "Sign up Login Gabby Bryan Event Description Biography Thu, Jan 22, 2026 8:00 PM Fri, Jan 23, 2026 7:00 PM 9:30 PM Sat, Jan 24, 2026 7:00 PM 9:30 PM Gabby Bryan GABBY BRYAN is a New York-based stand-up comedian, actress, Emmy-award winning producer, and overall girlie girl. Currently performing across the US and UK to sold out crowds with her tour Gabby Bryan is My Best Friend. Gabby recently brought her Fringe hit Billy and the Situation to Union Hall, garnering praise in the NYT. Her crowd work special Girl Town Hall is currently streaming on YouTube. She performed alongside Olivia Wilde and Oscar Isaac in the film “Life Itself” (Amazon Prime), appeared in the bilingual film “Ruta Viva” (HBO), and featured in Ilana Glazer’s special “Comedy on Earth” (Comedy Central). Gabby co-hosts \"L'Podcast\" with comedian Zack Signore, which has built a global audience, as well as \"Let Me Ask My Dad” Podcast with musician and composer David Bryan. She is wildly popular on social media with over 500K followers, sharing viral stand-up clips & comedy sketches. Follow her at @gabbyisbryan on all platforms! Please take note of the following: VIP tickets are Preferred Tabletop Seating. General Admission tickets are General Seating which is first come first serve. Bar is open after events until midnight. Kitchen closes at 11:30. No refunds or exchanges. All patrons must be ages 21+ with valid ID. No exceptions!! No backpacks, all bags are subject to search. No outside food or drink allowed There WILL be adult content. No heckling, don’t be that person, you’ll be asked to leave and you will not get a refund NO VIDEO OR PHOTOGRAPHY IS ALLOWED DURING SHOWS We take pride in our drink minimum (which is zero!) so please be mindful of this as you tip your servers and enjoy your food and beverages during the show! 30 minute late arrivals will not be guaranteed their seats General Seating is first come first serve, we can not guarantee you will sit with a larger party together, but we will try! GABBY BRYAN is a New York-based stand-up comedian, actress, Emmy-award winning producer, and overall girlie girl. Currently performing across the US and UK to sold out crowds with her tour Gabby Bryan is My Best Friend. Gabby recently brought her Fringe hit Billy and the Situation to Union Hall, garnering praise in the NYT. Her crowd work special Girl Town Hall is currently streaming on YouTube. She performed alongside Olivia Wilde and Oscar Isaac in the film “Life Itself” (Amazon Prime), appeared in the bilingual film “Ruta Viva” (HBO), and featured in Ilana Glazer’s special “Comedy on Earth” (Comedy Central). Gabby co-hosts \"L'Podcast\" with comedian Zack Signore, which has built a global audience, as well as \"Let Me Ask My Dad” Podcast with musician and composer David Bryan. She is wildly popular on social media with over 500K followers, sharing viral stand-up clips & comedy sketches. Follow her at @gabbyisbryan on all platforms!",
      "hash": "cedebf1b42eb",
      "downloadedAt": "2026-01-18T17:01:56.220Z",
      "trimmedAt": "2026-01-18T17:12:50.534Z",
      "sizeReduction": "89.8%"
    },
    {
      "url": "https://www.witsendcharleston.com/events",
      "text": "Sign up Login Upcoming Events January 18 Michael Clayton - Album Taping ​Michael Clayton is a comedian who originally hails from Charleston, South Carolina. With a style that blends observational comedy, a self-deprecating tone, and personal stories, Michael has been able to perform in comedy rooms across the country. He was a featured performer in the North Carolina Comedy Arts Festival, the Black Box Comedy Festival, the 5th Borough Comedy Festival, The Charleston Comedy Festival, and he was also showcased on “RISK! With Kevin Allison”. He’s also shared the stage with countless comedy favorites, including Mark Normand, Dan Soder, Katherine Blanford, Bobcat Goldthwait, Matthew Broussard, and Mick Foley. He is one of the passed comedians here at Wit’s End and can regularly be seen performing here. Please take note of the following: VIP tickets are Preferred Tabletop Seating. General Admission tickets are General Seating which is first come first serve. Bar is open after events until midnight. Kitchen closes at 11:30. No refunds or exchanges. All patrons must be ages 21+ with valid ID. No exceptions!! No backpacks, all bags are subject to search. No outside food or drink allowed There WILL be adult content. No heckling, don’t be that person, you’ll be asked to leave and you will not get a refund NO VIDEO OR PHOTOGRAPHY IS ALLOWED DURING SHOWS We take pride in our drink minimum (which is zero!) so please be mindful of this as you tip your servers and enjoy your food and beverages during the show! 30 minute late arrivals will not be guaranteed their seats General Seating is first come first serve, we can not guarantee you will sit with a larger party together, but we will try! more less Sun Jan 18 2026, 7:00 PM Buy Tickets January 21 - April 01 Open Mic Open Mic Comedy Night is a weekly event that takes place on Mondays and Wednesdays. Sign up starts at 7:30 pm and the mic starts at 8:00 pm. Each performer gets 5 minutes to showcase their talent and entertain the audience. Whether you are a seasoned comedian or a first timer, you are welcome to participate and enjoy the show. Don't be shy, just be yourself and have fun! You never know, you might discover a hidden talent or a new passion! So what are you waiting for? Grab your friends, bring your jokes, and join us at the Open Mic Comedy Night. It's a great way to relax, socialize, and laugh your worries away! Please take note of the following: Doors open for all events 2 hours before event start time. Bar is open after events until midnight. Kitchen closes at 11:30. All patrons must be age 21+ with valid ID. No exceptions!! more less Buy Tickets Wed, Jan 21, 2026 7:30 PM Wed, Feb 4, 2026 7:30 PM Wed, Feb 11, 2026 7:30 PM Wed, Feb 18, 2026 7:30 PM Wed, Feb 25, 2026 7:30 PM Wed, Mar 4, 2026 7:30 PM More Dates Available hide January 22 - January 24 Gabby Bryan GABBY BRYAN is a New York-based stand-up comedian, actress, Emmy-award winning producer, and overall girlie girl. Currently performing across the US and UK to sold out crowds with her tour Gabby Bryan is My Best Friend. Gabby recently brought her Fringe hit Billy and the Situation to Union Hall, garnering praise in the NYT. Her crowd work special Girl Town Hall is currently streaming on YouTube. She performed alongside Olivia Wilde and Oscar Isaac in the film “Life Itself” (Amazon Prime), appeared in the bilingual film “Ruta Viva” (HBO), and featured in Ilana Glazer’s special “Comedy on Earth” (Comedy Central). Gabby co-hosts \"L'Podcast\" with comedian Zack Signore, which has built a global audience, as well as \"Let Me Ask My Dad” Podcast with musician and composer David Bryan. She is wildly popular on social media with over 500K followers, sharing viral stand-up clips & comedy sketches. Follow her at @gabbyisbryan on all platforms! Please take note of the following: VIP tickets are Preferred Tabletop Seating. General Admission tickets are General Seating which is first come first serve. Bar is open after events until midnight. Kitchen closes at 11:30. No refunds or exchanges. All patrons must be ages 21+ with valid ID. No exceptions!! No backpacks, all bags are subject to search. No outside food or drink allowed There WILL be adult content. No heckling, don’t be that person, you’ll be asked to leave and you will not get a refund NO VIDEO OR PHOTOGRAPHY IS ALLOWED DURING SHOWS We take pride in our drink minimum (which is zero!) so please be mindful of this as you tip your servers and enjoy your food and beverages during the show! 30 minute late arrivals will not be guaranteed their seats General Seating is first come first serve, we can not guarantee you will sit with a larger party together, but we will try! more less Buy Tickets Thu, Jan 22, 2026 8:00 PM Fri, Jan 23, 2026 7:00 PM 9:30 PM Sat, Jan 24, 2026 7:00 PM 9:30 PM hide January 24 And Then We Had Sex Podcast ​If you weren't aware, \"And Then We Had Sex\" is possibly the fastest growing podcast in your area! Each week, married couple and show hosts, comedian Kristen Sivills and writer J-Rod Tanner guide you into their unconventional world of sex, comedy, and uninhibited truth. Kristen has toured nationally with acts such as Anjelah Johnson, Tone Bell, and was one of the headliners for Wendy Williams, and Summer Theatre Tour, to name a few. J-Rod has written and worked with numerous comedians and actors including his partner, Jay Pharoah. Their hilarious takes on relationships, uncensored interviews, insightful and open sex talk, and willingness to put the spotlight on the most personal parts of their marriage will leave you laughing, blushing, and binging every single episode! Reaching more than 30 countries and amassing over thousands of weekly streams and downloads, this is the one podcast that you MUST subscribe to, whether you’re a regular pod listener or you’re interested in losing your pod-ginity! Please take note of the following: VIP tickets are Preferred Tabletop Seating. General Admission tickets are General Seating which is first come first serve. Bar is open after events until midnight. Kitchen closes at 11:30. No refunds or exchanges. All patrons must be ages 21+ with valid ID. No exceptions!! No backpacks, all bags are subject to search. No outside food or drink allowed There WILL be adult content. No heckling, don’t be that person, you’ll be asked to leave and you will not get a refund NO VIDEO OR PHOTOGRAPHY IS ALLOWED DURING SHOWS We take pride in our drink minimum (which is zero!) so please be mindful of this as you tip your servers and enjoy your food and beverages during the show! 30 minute late arrivals will not be guaranteed their seats General Seating is first come first serve, we can not guarantee you will sit with a larger party together, but we will try! more less Sat Jan 24 2026, 4:00 PM Buy Tickets January 26 Best of Charleston Comedy ​Get ready for one powerhouse night of laughter as we bring together the absolute best comedians Charleston has to offer. All on one stage, one night only!From up-and-coming rising stars to seasoned local legends, this is your chance to see the funniest talent in the Lowcountry showing off their tightest sets. Expect a fast-paced, high-energy evening that celebrates the comedy scene that makes Charleston unique with a showcase of clever writing, bold performances, and laugh-out-loud moments you’ll be talking about all week. Comedians will be announced soon! Please take note of the following: VIP tickets are Preferred Tabletop Seating. General Admission tickets are General Seating which is first come first serve. Bar is open after events until midnight. Kitchen closes at 11:30. No refunds or exchanges. All patrons must be ages 21+ with valid ID. No exceptions!! No backpacks, all bags are subject to search. No outside food or drink allowed There WILL be adult content. No heckling, don’t be that person, you’ll be asked to leave and you will not get a refund NO VIDEO OR PHOTOGRAPHY IS ALLOWED DURING SHOWS We take pride in our drink minimum (which is zero!) so please be mindful of this as you tip your servers and enjoy your food and beverages during the show! 30 minute late arrivals will not be guaranteed their seats General Seating is first come first serve, we can not guarantee you will sit with a larger party together, but we will try! more less Mon Jan 26 2026, 8:00 PM Buy Tickets January 27 Dustin Nickerson A Seattle native now suffering in Southern California, Dustin Nickerson is an in demand comic on the rise. In 2020, he released his debut comedy special Overwhelmed which is currently one of the highest rated specials on Amazon Prime Video. In addition, he’s been featured on Comedy Central and Netflix by Kevin Hart, the Late Late Show with James Corden, Fox, Hulu and can regularly be heard on Sirius Radio XM. Online, his stand- up clips and jokes have received tens of millions of views and his podcast, Don’t Make Me Come Back There, has over a million downloads. He’s also the author of How to be Married be Married to Melissa, an Amazon #1 New Release published by Harper Collins in June 2022. Dustin describes himself as “the world’s most average person” but is far from it when on stage. He brings you into his life through his jokes about the struggles of parenting, marriage, and being generally annoyed by most people. Please take note of the following: VIP tickets are Preferred Tabletop Seating. General Admission tickets are General Seating which is first come first serve. Bar is open after events until midnight. Kitchen closes at 11:30. No refunds or exchanges. All patrons must be ages 21+ with valid ID. No exceptions!! No backpacks, all bags are subject to search. No outside food or drink allowed There WILL be adult content. No heckling, don’t be that person, you’ll be asked to leave and you will not get a refund NO VIDEO OR PHOTOGRAPHY IS ALLOWED DURING SHOWS We take pride in our drink minimum (which is zero!) so please be mindful of this as you tip your servers and enjoy your food and beverages during the show! 30 minute late arrivals will not be guaranteed their seats General Seating is first come first serve, we can not guarantee you will sit with a larger party together, but we will try! more less Tue Jan 27 2026, 8:00 PM Buy Tickets January 28 - January 31 Pauly Shore ​Pauly Shore tasted super-stardom in 1990 when his MTV show “Totally Pauly” hit the airwaves to major fan approval. The show ran for six years, leading Pauly to a one-hour HBO comedy special, “Pauly Does Dallas,” and starring roles in films like “Jury Duty,” “In the Army Now,” “Bio-Dome,” “Encino Man,” “Son In Law,” and “A Goofy Movie.” Pauly went on to produce and star in several of his own projects, including “Pauly Shore is Dead,” as well as the comedy specials “Vegas is My Oyster,” on Showtime starring Andy Dick, Tom Green, Bobby Lee, and “Pauly-Tics,” on Showtime starring Herman Cain and Larry King. In 2014, he released “Pauly Shore Stands Alone,” a true-life road documentary that follows Pauly as he performs in obscure towns throughout Wisconsin while dealing with his personal life. It appeared on Showtime and is available on Amazon Prime and YouTube. Other recent projects include Adam Sandler's \"Sandy Wexler,\" the short film \"Sin City Psycho” Dreamworks’ animated “The Big Trip,” Lionsgate’s animated film “The Little Penguin: Pororo's Dinosaur Island Adventure” and the indie feature “How it Ends” starring Whitney Cummings, Olivia Wilde, Nick Kroll and more. Pauly also starred in the movie “Guest House,” which is currently streaming on Netflix (digital and on-demand). In 2022, Pauly voices characters in Dreamworks’ “Pinocchio: A True Story” and “My Sweet Monster.”Pauly released a series of video interviews in 2017 called the “Pauly Shore Podcast Show.” His guests included Judd Apatow, Iliza Shlesinger, Bob Saget and more. Pauly also hosted a podcast called “Pauly Shore’s Random Rants” which you can find on Bill Burr's All Things Comedy, Apple Podcasts, Spotify, Stitcher and YouTube. Pauly also creates fun content for his fans, including a five minute workout show called Sweatin with the Wiez, recreation of iconic movie scenes called “Classic Scenes from Classic Movies” and music videos with his band “Pauly Shore and The Crustys” - all of which can be seen on YouTube, Instagram, and TikTok. The Crustys just released their first LP, available only at paulyshore.com. Apart from actively touring the country with his stand-up comedy, Pauly is currently the host of the Jam in the Van podcast and is working on a documentary of his life that spans the ’70s, ’80s and ’90s along with a memoir called \"How'd You Expect Me to Turn Out\" and a one man show about his life entitled \"Stick with the Dancing: Funny Stories From my Childhood\". Please take note of the following: VIP tickets are Preferred Tabletop Seating. General Admission tickets are General Seating which is first come first serve. Bar is open after events until midnight. Kitchen closes at 11:30. No refunds or exchanges. All patrons must be ages 21+ with valid ID. No exceptions!! No backpacks, all bags are subject to search. No outside food or drink allowed There WILL be adult content. No heckling, don’t be that person, you’ll be asked to leave and you will not get a refund NO VIDEO OR PHOTOGRAPHY IS ALLOWED DURING SHOWS We take pride in our drink minimum (which is zero!) so please be mindful of this as you tip your servers and enjoy your food and beverages during the show! 30 minute late arrivals will not be guaranteed their seats General Seating is first come first serve, we can not guarantee you will sit with a larger party together, but we will try! more less Buy Tickets Wed, Jan 28, 2026 8:00 PM Thu, Jan 29, 2026 8:00 PM Fri, Jan 30, 2026 8:00 PM Sat, Jan 31, 2026 7:00 PM 9:30 PM hide January 30 Late Night Cheap Show with Josh Bates It’s late. It’s cheap. It’s comedy. The cheapest show of the week! Sneak out, grab a drink, and join Josh Bates for the most unfiltered, anything-goes show of Comedy Week. Surprise comics, late-night laughs, and just enough chaos to make the next days brunch conversation awkward. You never know who’s gonna drop in... and that’s the fun. Did we mention it’s cheap? Josh Bates has been shaking up the comedy scene with his sharp wit and unfiltered storytelling. Known for his blend of raw honesty, dark humor, and clever observations about everyday absurdities, Josh’s style is as fearless as it is relatable, equal parts punchy and heartfelt, with a knack for finding the ridiculous in real life. His 2023 album, Pancake Carpet, debuted as the #1 comedy album on Apple and Billboard, solidifying his reputation as one of the South’s standout comedic voices. A fixture in multiple comedy festivals and has performed alongside heavy hitters like Sean Patton, Doug Stanhope, and Sam Tallent. When he’s not on stage, Josh hosts the Lowcountry Lowlifes Podcast and is one of the owners of Wit’s End Comedy Club. He’s also an unapologetic fan of cheese. Please take note of the following: VIP tickets are Preferred Tabletop Seating. General Admission tickets are General Seating which is first come first serve. Bar is open after events until midnight. Kitchen closes at 11:30. No refunds or exchanges. All patrons must be ages 21+ with valid ID. No exceptions!! No backpacks, all bags are subject to search. No outside food or drink allowed There WILL be adult content. No heckling, don’t be that person, you’ll be asked to leave and you will not get a refund NO VIDEO OR PHOTOGRAPHY IS ALLOWED DURING SHOWS We take pride in our drink minimum (which is zero!) so please be mindful of this as you tip your servers and enjoy your food and beverages during the show! 30 minute late arrivals will not be guaranteed their seats General Seating is first come first serve, we can not guarantee you will sit with a larger party together, but we will try! more less Fri Jan 30 2026, 10:30 PM Buy Tickets February 01 Mike Goodwin Mike is a refreshingly funny stand-up comedian, speaker, and leader. His signature bowtie is a nod to his expectation-defying brand of comedy that leaves a variety of audiences from comedy clubs to corporate events to swanky galas laughing hysterically and completely inspired, without a foul or vulgar word spoken.​A native of Camden, South Carolina, Mike holds a master’s degree in Education from the University of South Carolina, is a veteran of the U.S. Army, and a former primary and secondary education professional. He infuses his varied life experiences into his act, making him relatable to audiences from all walks of life.Using his ability to merge leadership and laughter, Mike is a powerful communicator whose primary goal is to leave places and people better than he found them. He’s appeared on America’s Got Talent, Dry Bar Comedy, Lifetime, BET, Amazon Prime, TBN, Daystar, USA, the Word Network and Circle TV, and been featured on SiriusXM, the That Sounds Fun Podcast Tour with Annie F. Downs and USO Europe Comedy Tour.A southern gentleman with a curious mind, love for people, and heart for God, Mike Goodwin is in a class all his own. He resides in Columbia, SC with his beautiful wife Rozalynn and their two children. Please take note of the following: VIP tickets are Preferred Tabletop Seating. General Admission tickets are General Seating which is first come first serve. Bar is open after events until midnight. Kitchen closes at 11:30. No refunds or exchanges. All patrons must be ages 21+ with valid ID. No exceptions!! No backpacks, all bags are subject to search. No outside food or drink allowed There WILL be adult content. No heckling, don’t be that person, you’ll be asked to leave and you will not get a refund NO VIDEO OR PHOTOGRAPHY IS ALLOWED DURING SHOWS We take pride in our drink minimum (which is zero!) so please be mindful of this as you tip your servers and enjoy your food and beverages during the show! 30 minute late arrivals will not be guaranteed their seats General Seating is first come first serve, we can not guarantee you will sit with a larger party together, but we will try! more less Buy Tickets Sun, Feb 1, 2026 4:00 PM 7:00 PM hide February 05 - February 07 Chris Porter Best known for his 3rd place appearance on season 4 of NBC's Last Comic Standing and his one-hour special 'Ugly & Angry' that was one of Netflix's top rated specials for three years, you may also know this Kansas City native from his very own Comedy Central Presents special, his comedy albums 'Lost & Alone' and 'Screaming From the Cosmos', his appearances on Tommy Chong's Comedy @ 420 on Showtime, the Arsenio Hall show, Comedy.TV, or your favorite local comedy club. Chris Porter is a simple man in a complicated world where dudes send pictures of their genitalia to women and burgers have a backstory. Born and raised in Kansas City, Chris brings a true stand-up experience to his live shows. There are no sound cues, no puppets, and no catch phrases. Just gut wrenching laughter drawn from his own experience and observations. Please take note of the following: VIP tickets are Preferred Tabletop Seating. General Admission tickets are General Seating which is first come first serve. Bar is open after events until midnight. Kitchen closes at 11:30. No refunds or exchanges. All patrons must be ages 21+ with valid ID. No exceptions!! No backpacks, all bags are subject to search. No outside food or drink allowed There WILL be adult content. No heckling, don’t be that person, you’ll be asked to leave and you will not get a refund NO VIDEO OR PHOTOGRAPHY IS ALLOWED DURING SHOWS We take pride in our drink minimum (which is zero!) so please be mindful of this as you tip your servers and enjoy your food and beverages during the show! 30 minute late arrivals will not be guaranteed their seats General Seating is first come first serve, we can not guarantee you will sit with a larger party together, but we will try! more less Buy Tickets Thu, Feb 5, 2026 8:00 PM Fri, Feb 6, 2026 7:00 PM 9:30 PM Sat, Feb 7, 2026 7:00 PM 9:30 PM hide February 10 Justin Silva Justin Silva was born and raised in New Haven, CT. He started doing comedy at age 21. Prior to comedy, he was an electrician full-time and a server at Chili's part-time. The workforce was not working out for him. After his first comedy show, he learned it was where he belonged. Justin fell in love with being on the stage and making people laugh. A year and a half later, he quit his jobs to pursue his dream. Justin got on stage as much as he could. Attending open mics, performing for free at comedy shows, and accepting hosting gigs for very little to no money. In efforts to share his comedy with the world, he began making content and posting on social media. Buzz, traffic, and popularity all grew up and blew up. He decided, with his fiancé Ashley Cotto, it was time to leave Connecticut and take the leap of faith and move to Florida. Justin continued to grind and work hard every day to become a bigger act. He wants to create people's favorite space to laugh and is currently touring in a 2025/2026 Worldwide tour. He believes what you put in this game is what you get out of it. Justin will continue to put in all that he can, with great faith that he gets everything he can out of it. Creating content, performing comedy year-round while providing for his family, and keeping the faith in making a living; his 5 children are his main inspiration and drive him every day to conquer his dreams. Please take note of the following: VIP tickets are Preferred Tabletop Seating. General Admission tickets are General Seating which is first come first serve. Bar is open after events until midnight. Kitchen closes at 11:30. No refunds or exchanges. All patrons must be ages 21+ with valid ID. No exceptions!! No backpacks, all bags are subject to search. No outside food or drink allowed There WILL be adult content. No heckling, don’t be that person, you’ll be asked to leave and you will not get a refund NO VIDEO OR PHOTOGRAPHY IS ALLOWED DURING SHOWS We take pride in our drink minimum (which is zero!) so please be mindful of this as you tip your servers and enjoy your food and beverages during the show! 30 minute late arrivals will not be guaranteed their seats General Seating is first come first serve, we can not guarantee you will sit with a larger party together, but we will try! more less Tue Feb 10 2026, 7:00 PM Buy Tickets February 13 - February 14 Dedrick Flynn Dedrick Flynn, the newest regular on Kill Tony, is bringing his explosive, no-rules comedy to Charleston for a Valentine’s week you’ll never forget. Whether you’re spending the 13th avoiding your ex, the 14th trying to impress a date, or just embracing the holiday as a spectator sport, Dedrick’s the perfect comic to laugh with on the most chaotic love week of the year.A fast-rising star originally from Atlanta, known for his electric energy, unfiltered honesty, and killer timing, Dedrick has quickly become a standout on the national stage. His sets swing from wildly vulnerable to completely unhinged, often in the same breath, making him one of the most exciting and unpredictable voices in comedy today. **A Cupid VIP ticket includes entry for two people, exclusive tabletop seating, and a complimentary welcome drink each)** Please take note of the following: VIP tickets are Preferred Tabletop Seating. General Admission tickets are General Seating which is first come first serve. Bar is open after events until midnight. Kitchen closes at 11:30. No refunds or exchanges. All patrons must be ages 21+ with valid ID. No exceptions!! No backpacks, all bags are subject to search. No outside food or drink allowed There WILL be adult content. No heckling, don’t be that person, you’ll be asked to leave and you will not get a refund NO VIDEO OR PHOTOGRAPHY IS ALLOWED DURING SHOWS We take pride in our drink minimum (which is zero!) so please be mindful of this as you tip your servers and enjoy your food and beverages during the show! 30 minute late arrivals will not be guaranteed their seats General Seating is first come first serve, we can not guarantee you will sit with a larger party together, but we will try! more less Buy Tickets Fri, Feb 13, 2026 7:00 PM 9:30 PM Sat, Feb 14, 2026 7:00 PM 9:30 PM hide February 19 Shapel Lacey ​Shapel Lacey is a Los Angeles based comedian born and raised in Mesa, Arizona. A diehard punk rocker and former award-winning competitive cheerleader, Shapel found ways to express himself and own his individuality at an early age. Shapel was cheerleading competitively for University of Louisville when someone dared him to take the stage as a comedian and he never looked back, dropping out shortly thereafter to pursue a career in stand up full-time. His unique life experiences such as being adopted by a Caucasian family at age 15, his punk rock mentality, and his stage presence make for a truly original voice in the comedy community. Diligence and the desire to grow led Shapel from the Phoenix open mic circuit onto main stages, where he regularly performed for comedians such as Bill Burr, Hannibal Buress, and Brendan Schaub, and is now headlining clubs across the country. Shapel was selected to be a “New Face” at the 2019 Just For Laughs Comedy Festival. Please take note of the following: VIP tickets are Preferred Tabletop Seating. General Admission tickets are General Seating which is first come first serve. Bar is open after events until midnight. Kitchen closes at 11:30. No refunds or exchanges. All patrons must be ages 21+ with valid ID. No exceptions!! No backpacks, all bags are subject to search. No outside food or drink allowed There WILL be adult content. No heckling, don’t be that person, you’ll be asked to leave and you will not get a refund NO VIDEO OR PHOTOGRAPHY IS ALLOWED DURING SHOWS We take pride in our drink minimum (which is zero!) so please be mindful of this as you tip your servers and enjoy your food and beverages during the show! 30 minute late arrivals will not be guaranteed their seats General Seating is first come first serve, we can not guarantee you will sit with a larger party together, but we will try! more less Thu Feb 19 2026, 8:00 PM Buy Tickets February 20 - February 21 Zac Townsend Zac Townsend is a Nashville-based comedian and writer who accidentally launched his stand-up career after engaging with Michael Blackson in an online roast battle so hard that Blackson invited him to his show and handed him a mic, since then Zac’s never looked back. He’s now a regular at Zanies Nashville and has opened for Shane Gillis, Andrew Santino, Joe List, Doug Stanhope, Big Jay Oakerson, Jessica Kirson, Steve-O, and Earthquake. Offstage, Zac co-created the viral sketch collective Paid Vacation which has amassed over 45 million views across tiktok and instagram. You’ve also seen him on Barstool Sports, at the Nashville Comedy Festival, LMAOF TV, and Bonnaroo Please take note of the following: VIP tickets are Preferred Tabletop Seating. General Admission tickets are General Seating which is first come first serve. Bar is open after events until midnight. Kitchen closes at 11:30. No refunds or exchanges. All patrons must be ages 21+ with valid ID. No exceptions!! No backpacks, all bags are subject to search. No outside food or drink allowed There WILL be adult content. No heckling, don’t be that person, you’ll be asked to leave and you will not get a refund NO VIDEO OR PHOTOGRAPHY IS ALLOWED DURING SHOWS We take pride in our drink minimum (which is zero!) so please be mindful of this as you tip your servers and enjoy your food and beverages during the show! 30 minute late arrivals will not be guaranteed their seats General Seating is first come first serve, we can not guarantee you will sit with a larger party together, but we will try! more less Buy Tickets Fri, Feb 20, 2026 8:00 PM Sat, Feb 21, 2026 7:00 PM hide February 27 - February 28 Jordan Rock You’ve seen him on Netflix’s Love, HBO’s All Def Comedy, Pete Davidson Presents: The Best Friends, and the Sundance favorite Big Time Adolescence—now catch Jordan Rock live and unfiltered on stage. Known for his sharp takes, cool delivery, and hilarious perspective on modern life, Jordan delivers the kind of stand-up that hits hard and sticks with you. Whether he’s roasting pop culture or digging into real-life experiences, every show is a fresh, can’t-miss night of comedy. Please take note of the following: VIP tickets are Preferred Tabletop Seating. General Admission tickets are General Seating which is first come first serve. Bar is open after events until midnight. Kitchen closes at 11:30. No refunds or exchanges. All patrons must be ages 21+ with valid ID. No exceptions!! No backpacks, all bags are subject to search. No outside food or drink allowed There WILL be adult content. No heckling, don’t be that person, you’ll be asked to leave and you will not get a refund NO VIDEO OR PHOTOGRAPHY IS ALLOWED DURING SHOWS We take pride in our drink minimum (which is zero!) so please be mindful of this as you tip your servers and enjoy your food and beverages during the show! 30 minute late arrivals will not be guaranteed their seats General Seating is first come first serve, we can not guarantee you will sit with a larger party together, but we will try! more less Buy Tickets Fri, Feb 27, 2026 8:00 PM Sat, Feb 28, 2026 7:00 PM hide March 01 Wit's End Presents.. You never know who’s going to walk through the door but you do know it’s going to be funny. Wit’s End Presents is our new flagship showcase for 2026: a curated, anything-can-happen night built around what we love most, great comedy and great surprises. One night might feature Charleston comedy legends and rising local killers, the next could include out-of-town favorites, a touring national headliner working out new material, or even a surprise musical guest passing through town. There’s no set formula and no two shows are ever the same. That’s the point. This is the kind of night where you lean forward in your seat because something special might happen and usually does. Good to know: • Lineups are intentionally unannounced but we may let you know sometimes ;) • Expect a mix of stand-up, surprises, and the unexpected • You’ll always leave laughing Tabletop Seating Update: Our tabletops are now sold as one table, and two tickets are included with each tabletop purchase—perfect for date night, friends, or anyone who likes a little extra elbow room while they laugh. Please take note of the following: VIP tickets are Preferred Tabletop Seating. General Admission tickets are General Seating which is first come first serve. Bar is open after events until midnight. Kitchen closes at 11:30. No refunds or exchanges. All patrons must be ages 21+ with valid ID. No exceptions!! No backpacks, all bags are subject to search. No outside food or drink allowed There WILL be adult content. No heckling, don’t be that person, you’ll be asked to leave and you will not get a refund NO VIDEO OR PHOTOGRAPHY IS ALLOWED DURING SHOWS We take pride in our drink minimum (which is zero!) so please be mindful of this as you tip your servers and enjoy your food and beverages during the show! 30 minute late arrivals will not be guaranteed their seats General Seating is first come first serve, we can not guarantee you will sit with a larger party together, but we will try! more less Sun Mar 1 2026, 8:00 PM Buy Tickets March 06 - March 08 AJ Wilkerson ​AJ Wilkerson is a stand-up comedian based out of a van, down by the retention pond, more than likely behind a truck stop. Don’t worry, he’s alive, he’s just from Florida, has parent-cousins, and he’s autistic. Not kidding, diagnosed and everything! With his nervous charm, endearing smile, appendix-bursting material (seriously, that happened!), AJ has become one of the most relevant young comedians in America, making appearances this year at Limestone Comedy Festival, Nashville Comedy Festival, Atlanta’s West End Comedy Festival, as well as in his videos which have reached millions of views on virtually every social media platform (except for Twitter, that place is a WARZONE). Wilkerson will also make his Silver Screen debut with a cameo appearance in Kevin Smith’s Clerks III, as well as his standup television debut on Circle Network’s Stand Up Nashville! Live from Zanie’s in 2022. AJ has worked with comedy veterans Ari Schaffer, Akaash Singh, Jeff Allen, and even the tater himself, the legendary Ron White. He is the regular feature act for Jason Mewes of Jay & Silent Bob (Clerks, Chasing Amy, Zack & Miri Make a Porno). He also recently opened for Bert Kreischer on the Berty Boy Relapse Tour. Just to add a little extra seasoning, AJ has also won a Roast Battle at The World Famous Comedy Store, a finalist in the World Series of Comedy and US Comedy Contest, and named the winner of the Portland Comedy Festival. Please take note of the following: VIP tickets are Preferred Tabletop Seating. General Admission tickets are General Seating which is first come first serve. Bar is open after events until midnight. Kitchen closes at 11:30. No refunds or exchanges. All patrons must be ages 21+ with valid ID. No exceptions!! No backpacks, all bags are subject to search. No outside food or drink allowed There WILL be adult content. No heckling, don’t be that person, you’ll be asked to leave and you will not get a refund NO VIDEO OR PHOTOGRAPHY IS ALLOWED DURING SHOWS We take pride in our drink minimum (which is zero!) so please be mindful of this as you tip your servers and enjoy your food and beverages during the show! 30 minute late arrivals will not be guaranteed their seats General Seating is first come first serve, we can not guarantee you will sit with a larger party together, but we will try! more less Buy Tickets Fri, Mar 6, 2026 7:00 PM 9:30 PM Sat, Mar 7, 2026 7:00 PM 9:30 PM Sun, Mar 8, 2026 8:00 PM hide March 08 Travis Holp ​Travis Holp is a renowned medium, author, and spiritual guide known for delivering heartfelt, evidential messages that reconnect people with loved ones in spirit and their own inner wisdom. A Forever Family Foundation–Certified Medium, Travis has conducted thousands of readings worldwide and has been featured in Entertainment Tonight, Us Weekly, Cosmopolitan, Today.com, The Daily Mail, and People. He is the author of Are You There Spirit? It’s Me, Travis (Spiegel & Grau), and is touring the country with his transformational live events that blend spirit communication, humor, healing, and hope—reminding audiences that love never dies and connection is always possible. Tabletop Seating Update: Our tabletops are now sold as one table, and two tickets are included with each tabletop purchase—perfect for date night, friends, or anyone who likes a little extra elbow room while they laugh. Please take note of the following: VIP tickets are Preferred Tabletop Seating. General Admission tickets are General Seating which is first come first serve. Bar is open after events until midnight. Kitchen closes at 11:30. No refunds or exchanges. All patrons must be ages 21+ with valid ID. No exceptions!! No backpacks, all bags are subject to search. No outside food or drink allowed There WILL be adult content. No heckling, don’t be that person, you’ll be asked to leave and you will not get a refund NO VIDEO OR PHOTOGRAPHY IS ALLOWED DURING SHOWS We take pride in our drink minimum (which is zero!) so please be mindful of this as you tip your servers and enjoy your food and beverages during the show! 30 minute late arrivals will not be guaranteed their seats General Seating is first come first serve, we can not guarantee you will sit with a larger party together, but we will try! more less Sun Mar 8 2026, 3:00 PM Buy Tickets March 13 - March 14 Rocky Dale Davis Rocky Dale Davis is a stand up comedian who’s videos on TikTok and Instagram have over 200 million views and 600,000 followers. Please take note of the following: VIP tickets are Preferred Tabletop Seating. General Admission tickets are General Seating which is first come first serve. Bar is open after events until midnight. Kitchen closes at 11:30. No refunds or exchanges. All patrons must be ages 21+ with valid ID. No exceptions!! No backpacks, all bags are subject to search. No outside food or drink allowed There WILL be adult content. No heckling, don’t be that person, you’ll be asked to leave and you will not get a refund NO VIDEO OR PHOTOGRAPHY IS ALLOWED DURING SHOWS We take pride in our drink minimum (which is zero!) so please be mindful of this as you tip your servers and enjoy your food and beverages during the show! 30 minute late arrivals will not be guaranteed their seats General Seating is first come first serve, we can not guarantee you will sit with a larger party together, but we will try! more less Buy Tickets Fri, Mar 13, 2026 7:00 PM 9:30 PM Sat, Mar 14, 2026 7:00 PM 9:30 PM hide March 19 Steve Hofstetter One of YouTube's most popular comics with over 225 million views and half a billion more on Facebook, Steve Hofstetter is also the host of Finding Babe Ruth on FS1. Hofstetter was the host and executive producer of Laughs (FOX) and he has been on CBS’ The Late Late Show, E! True Hollywood Story, Comics Unleashed, and more. He’s sold out shows in hundreds of cities and dozens of countries. Now is your chance to find out what the fuss is about during this no-holds-barred stand-up performance, featuring some of his unfiltered observations about life. Please take note of the following: VIP tickets are Preferred Tabletop Seating. General Admission tickets are General Seating which is first come first serve. Bar is open after events until midnight. Kitchen closes at 11:30. No refunds or exchanges. All patrons must be ages 21+ with valid ID. No exceptions!! There WILL be adult content. No heckling, don’t be that person, you’ll be asked to leave and you will not get a refund NO VIDEO OR PHOTOGRAPHY IS ALLOWED DURING SHOWS We take pride in our drink minimum (which is zero!) so please be mindful of this as you tip your servers and enjoy your food and beverages during the show! 30 minute late arrivals will not be guaranteed their seats General Seating is first come first serve, we can not guarantee you will sit with a larger party together, but we will try! more less Thu Mar 19 2026, 7:00 PM Buy Tickets March 20 - March 21 Emma Willmann Emma Willmann is a stand-up comedian, actress, and podcaster originally from Blue Hill, Maine. A comic who’s mastered chaos under control, Willmann’s vibrant presence, warmth, and unflinching honesty make her a comedian to be reckoned with. She was a part of the inaugural season of Netflix’s The Lineup, and has made memorable appearances in CW’s Crazy Ex-Girlfriend, Judd Apatow’s Crashing and The Good Fight on Paramount+. Willmann has also made multiple appearances on The Late Show with Stephen Colbert, and is a regular at the prestigious Comedy Cellar in New York City. Please take note of the following: VIP tickets are Preferred Tabletop Seating. General Admission tickets are General Seating which is first come first serve. Bar is open after events until midnight. Kitchen closes at 11:30. No refunds or exchanges. All patrons must be ages 21+ with valid ID. No exceptions!! No backpacks, all bags are subject to search. No outside food or drink allowed There WILL be adult content. No heckling, don’t be that person, you’ll be asked to leave and you will not get a refund NO VIDEO OR PHOTOGRAPHY IS ALLOWED DURING SHOWS We take pride in our drink minimum (which is zero!) so please be mindful of this as you tip your servers and enjoy your food and beverages during the show! 30 minute late arrivals will not be guaranteed their seats General Seating is first come first serve, we can not guarantee you will sit with a larger party together, but we will try! more less Buy Tickets Fri, Mar 20, 2026 7:00 PM 9:30 PM Sat, Mar 21, 2026 7:00 PM 9:30 PM hide March 26 Jay Hunter Raised in Cleveland Ohio, Jay Hunter joined the Navy to see the world. Nuclear electronics technician, a Homer J Simpson of the sea. What returned? A refreshingly goofy take on a life that is ready, willing and able to be laughed at. From dry wit to fly on the wall observations, Jay Hunter is a walking, talking inside job. Please take note of the following: VIP tickets are Preferred Tabletop Seating. General Admission tickets are General Seating which is first come first serve. Bar is open after events until midnight. Kitchen closes at 11:30. No refunds or exchanges. All patrons must be ages 21+ with valid ID. No exceptions!! No backpacks, all bags are subject to search. No outside food or drink allowed There WILL be adult content. No heckling, don’t be that person, you’ll be asked to leave and you will not get a refund NO VIDEO OR PHOTOGRAPHY IS ALLOWED DURING SHOWS We take pride in our drink minimum (which is zero!) so please be mindful of this as you tip your servers and enjoy your food and beverages during the show! 30 minute late arrivals will not be guaranteed their seats General Seating is first come first serve, we can not guarantee you will sit with a larger party together, but we will try! more less Thu Mar 26 2026, 8:00 PM Buy Tickets March 27 - March 28 Damon Darling Damon Darling has performed all over the country with some of the biggest names in the industry and is now headlining his own national “Gotta Dollar Tour”! He has over 978K followers on Tiktok with over 27 Million page Likes and over half a million on instagram! Damon’s ability to mix jokes with his true life stories and experiences while crowd working and making jokes on the spot through out his performances make him an absolute joy to watch! Tabletop Seating Update: Our tabletops are now sold as one table, and two tickets are included with each tabletop purchase—perfect for date night, friends, or anyone who likes a little extra elbow room while they laugh. Please take note of the following: VIP tickets are Preferred Tabletop Seating. General Admission tickets are General Seating which is first come first serve. Bar is open after events until midnight. Kitchen closes at 11:30. No refunds or exchanges. All patrons must be ages 21+ with valid ID. No exceptions!! No backpacks, all bags are subject to search. No outside food or drink allowed There WILL be adult content. No heckling, don’t be that person, you’ll be asked to leave and you will not get a refund NO VIDEO OR PHOTOGRAPHY IS ALLOWED DURING SHOWS We take pride in our drink minimum (which is zero!) so please be mindful of this as you tip your servers and enjoy your food and beverages during the show! 30 minute late arrivals will not be guaranteed their seats General Seating is first come first serve, we can not guarantee you will sit with a larger party together, but we will try! more less Buy Tickets Fri, Mar 27, 2026 7:00 PM 9:30 PM Sat, Mar 28, 2026 7:00 PM 9:30 PM hide April 03 - April 04 Liz Miele Liz Miele is a NYC comedian who has appeared on Comedy Central, FOX, AXS TV, Hulu, NPR’s Wait Wait Don’t Tell Me and CBS’s After Midnight. She's been featured in The New Yorker, NY Times, Runner's World, Psychology Today and The Guardian. She regularly tours internationally and has five albums with a combined 6+ million views on youtube. Her last special was listed on the New York Times, Paste Magazine and Interrobang “Best Comedy Specials of 2022” list. Her latest special “Murder Sheets” premiered April of 2024. Her book \"Why Cats Are A**holes\" was published March 2021. She has a weekly podcast with comedian Maria Shehata called 2 Non-Doctors. Please take note of the following: VIP tickets are Preferred Tabletop Seating. General Admission tickets are General Seating which is first come first serve. Bar is open after events until midnight. Kitchen closes at 11:30. No refunds or exchanges. All patrons must be ages 21+ with valid ID. No exceptions!! No backpacks, all bags are subject to search. No outside food or drink allowed There WILL be adult content. No heckling, don’t be that person, you’ll be asked to leave and you will not get a refund NO VIDEO OR PHOTOGRAPHY IS ALLOWED DURING SHOWS We take pride in our drink minimum (which is zero!) so please be mindful of this as you tip your servers and enjoy your food and beverages during the show! 30 minute late arrivals will not be guaranteed their seats General Seating is first come first serve, we can not guarantee you will sit with a larger party together, but we will try! more less Buy Tickets Fri, Apr 3, 2026 8:00 PM Sat, Apr 4, 2026 7:00 PM 9:30 PM hide April 10 - April 12 Sam Tallent Sam Tallent (\"the absurd voice of a surreal generation\" - The Denver Post) is a comedian, novelist and host of the Chubby Behemoth Podcast. For the last decade, he has performed more than 45 weekends per year in North America, Asia, Australia and Europe. His writing has appeared in VICE and and he's told jokes on Comedy Central, TruTV, and VICELAND. Birdy Magazine His acclaimed debut novel, , heralded as the definitive book on standup comedy, is soon to be a major motion picture (Dough Stanhope: \"the best fictional representation of comedy in any medium ever,\" Marc Maron: \"a beautiful rendering of a dark reality\"). His novella, , was published as an Audible Original. Running the Light ATTABOY Sam has two comedy specials. Waiting for Death to Claim Us, his debut, is available on Amazon Prime. His sophomore effort, The Toad's Morale, lives on YouTube where it is close to one million views. He is also the mastermind behind Sam Tallent's Wide World, the hit new travel show that has all the kids buzzing. He lives in Colorado and cooks dinner for his wife every night. Please take note of the following: VIP tickets are Preferred Tabletop Seating. General Admission tickets are General Seating which is first come first serve. Bar is open after events until midnight. Kitchen closes at 11:30. No refunds or exchanges. All patrons must be ages 21+ with valid ID. No exceptions!! No backpacks, all bags are subject to search. No outside food or drink allowed There WILL be adult content. No heckling, don’t be that person, you’ll be asked to leave and you will not get a refund NO VIDEO OR PHOTOGRAPHY IS ALLOWED DURING SHOWS We take pride in our drink minimum (which is zero!) so please be mindful of this as you tip your servers and enjoy your food and beverages during the show! 30 minute late arrivals will not be guaranteed their seats General Seating is first come first serve, we can not guarantee you will sit with a larger party together, but we will try! more less Buy Tickets Fri, Apr 10, 2026 7:00 PM 9:30 PM Sat, Apr 11, 2026 7:00 PM 9:30 PM Sun, Apr 12, 2026 8:00 PM hide April 17 - April 18 Mark Chalifoux Chalifoux has told jokes on FOX and IFC, and has written for ESPN, CBS Digital, The Baltimore Sun and The Dad. His comedy album, “Think Fast”, opened at #2 on Apple Music, has been streamed more than 1 million times on Pandora, and is played regularly on SiriusXM. His DryBar Comedy special “The Dad Jokes” has been seen millions of times across social media. Please take note of the following: VIP tickets are Preferred Tabletop Seating. General Admission tickets are General Seating which is first come first serve. Bar is open after events until midnight. Kitchen closes at 11:30. No refunds or exchanges. All patrons must be ages 21+ with valid ID. No exceptions!! There WILL be adult content. No heckling, don’t be that person, you’ll be asked to leave and you will not get a refund NO VIDEO OR PHOTOGRAPHY IS ALLOWED DURING SHOWS We take pride in our drink minimum (which is zero!) so please be mindful of this as you tip your servers and enjoy your food and beverages during the show! 30 minute late arrivals will not be guaranteed their seats General Seating is first come first serve, we can not guarantee you will sit with a larger party together, but we will try! more less Buy Tickets Fri, Apr 17, 2026 8:00 PM Sat, Apr 18, 2026 7:00 PM 9:30 PM hide April 24 - April 25 Jessica Michelle Singleton ​Comedian JESSICA MICHELLE SINGLETON is a powerhouse of comedy in a teeny tiny package - known for her high energy, overly honest, and always silly performances. A Comedy Store Paid Regular, her debut hour long special, ‘Hi Y’all’ was released in April 2025. Jessica is the breakout star of Iliza’s Locals (Hulu), a comedy special series produced by Iliza Shlesinger. Her Don’t Tell Comedy performance(s) have amassed millions of views online across multiple platforms. Singleton’s second comedy album ‘Horny for Death’ debuted at #1 on iTunes and Amazon, ahead of Bo Burnham. Singleton has toured across 4 continents alongside names like: Tom Segura, Theo Von, Mark Normand, Bobby Lee, Melisa Villasenor, Ari Shaffir, and Steph Tolev. Please take note of the following: VIP tickets are Preferred Tabletop Seating. General Admission tickets are General Seating which is first come first serve. Bar is open after events until midnight. Kitchen closes at 11:30. No refunds or exchanges. All patrons must be ages 21+ with valid ID. No exceptions!! No backpacks, all bags are subject to search. No outside food or drink allowed There WILL be adult content. No heckling, don’t be that person, you’ll be asked to leave and you will not get a refund NO VIDEO OR PHOTOGRAPHY IS ALLOWED DURING SHOWS We take pride in our drink minimum (which is zero!) so please be mindful of this as you tip your servers and enjoy your food and beverages during the show! 30 minute late arrivals will not be guaranteed their seats General Seating is first come first serve, we can not guarantee you will sit with a larger party together, but we will try! more less Buy Tickets Fri, Apr 24, 2026 7:00 PM 9:30 PM Sat, Apr 25, 2026 7:00 PM 9:30 PM hide April 30 - May 03 RACHEL SCANLON: A BIT MUCH TOUR ​Rachel Scanlon is an LA based stand-up comedian, host, writer, and podcaster from Minnesota. She is the co-host of the podcast and nationally touring live show TWO DYKES AND A MIC. Most recently, you've seen Rachel on DON’T TELL COMEDY, STRAIGHT UP, STAND UP on Just For Laughs’ digital platform, and Comedy Central. Her critically-acclaimed hour special GAY FANTASY was released in June. She is currently on a sold-out tour throughout the US performing her hour. Please take note of the following: VIP tickets are Preferred Tabletop Seating. General Admission tickets are General Seating which is first come first serve. Bar is open after events until midnight. Kitchen closes at 11:30. No refunds or exchanges. All patrons must be ages 21+ with valid ID. No exceptions!! No backpacks, all bags are subject to search. No outside food or drink allowed There WILL be adult content. No heckling, don’t be that person, you’ll be asked to leave and you will not get a refund NO VIDEO OR PHOTOGRAPHY IS ALLOWED DURING SHOWS We take pride in our drink minimum (which is zero!) so please be mindful of this as you tip your servers and enjoy your food and beverages during the show! 30 minute late arrivals will not be guaranteed their seats General Seating is first come first serve, we can not guarantee you will sit with a larger party together, but we will try! more less Buy Tickets Thu, Apr 30, 2026 8:00 PM Fri, May 1, 2026 7:00 PM 9:30 PM Sat, May 2, 2026 7:00 PM 9:30 PM Sun, May 3, 2026 8:00 PM hide May 07 - May 09 Caleb Synan Caleb Synan is one of the hottest young comics in the country. (Funny AND good looking!) His unique background as a preacher’s kid from a small southern town gives him the ability to relate to any and every crowd -- even though he’s a big old millennial who lives in LA. Want proof? He’s performed on CONAN (twice!), Last Comic Standing (once!), and his first Comedy Central special “30” in 2022 (You can watch it on YouTube!)He’s also entertained our troops in South Korea and Japan. What a guy! It’s no wonder he won the title of \"Wittiest\" in Franklin County High School’s 2009 Yearbook. He even wrote this bio himself. And he’ll have a margarita with you if you play your cards right. Please take note of the following: VIP tickets are Preferred Tabletop Seating. General Admission tickets are General Seating which is first come first serve. Bar is open after events until midnight. Kitchen closes at 11:30. No refunds or exchanges. All patrons must be ages 21+ with valid ID. No exceptions!! No backpacks, all bags are subject to search. No outside food or drink allowed There WILL be adult content. No heckling, don’t be that person, you’ll be asked to leave and you will not get a refund NO VIDEO OR PHOTOGRAPHY IS ALLOWED DURING SHOWS We take pride in our drink minimum (which is zero!) so please be mindful of this as you tip your servers and enjoy your food and beverages during the show! 30 minute late arrivals will not be guaranteed their seats General Seating is first come first serve, we can not guarantee you will sit with a larger party together, but we will try! more less Buy Tickets Thu, May 7, 2026 8:00 PM Fri, May 8, 2026 8:00 PM Sat, May 9, 2026 7:00 PM 9:30 PM hide May 15 - May 16 Leah Rudick ​is a Los Angeles based actor, writer, and comedian. Known for her viral original characters including “Wealthy Woman,” “Joannie,” and “Love Coach,” Rudick has built a devoted fanbase of nearly 2 million followers across socials with her signature “weird girl” comedy. Leah Rudick In addition to acting and developing her own projects, she is currently headlining a national tour. Festival credits include Moontower, Just For Laughs, SF Sketchfest, and Laughing Skull. In 2023 her debut comedy hour, , released on Amazon and Apple TV. Spiraling TV credits include (HBO), (IFC), and (Dropout TV). She co-wrote and co-starred in the critically acclaimed web series , featured in , , and the . High Maintenance Commuters Crowd Control Made to Order Marie Claire IndieWire New York Observer On the big screen, she co-wrote and co-starred in the indie feature which took home top prizes at Brooklyn International Film Festival, Montreal World Film Festival and The Lower East Side Film Festival. Sweet Parents Rudick began her comedy career in New York with her sketch duo Skinny Bitch Jesus Meeting, earning praise in , , and , which named her one of “25 Funny People Who Should Have Their Own TV Show.” Time Out NY Washington Post Complex Magazine Please take note of the following: VIP tickets are Preferred Tabletop Seating. General Admission tickets are General Seating which is first come first serve. Bar is open after events until midnight. Kitchen closes at 11:30. No refunds or exchanges. All patrons must be ages 21+ with valid ID. No exceptions!! No backpacks, all bags are subject to search. No outside food or drink allowed There WILL be adult content. No heckling, don’t be that person, you’ll be asked to leave and you will not get a refund NO VIDEO OR PHOTOGRAPHY IS ALLOWED DURING SHOWS We take pride in our drink minimum (which is zero!) so please be mindful of this as you tip your servers and enjoy your food and beverages during the show! 30 minute late arrivals will not be guaranteed their seats General Seating is first come first serve, we can not guarantee you will sit with a larger party together, but we will try! more less Buy Tickets Fri, May 15, 2026 7:00 PM 9:30 PM Sat, May 16, 2026 7:00 PM 9:30 PM hide May 22 - May 23 Andrew Rudick ​Andrew Rudick is a nationally touring stand up comedian, writer and actor. One of the fastest rising comedians in the Midwest, Rudick has been featured on “The Bob and Tom” national radio show and his comedy can be heard regularly on SiriusXM. His debut comedy album opened at the top of the Apple Music charts. His latest special, “Not a Boy, Not Yet a Man,” was recently picked up by Comedy Dynamics and is set to premiere on Amazon next month. He also filmed a Dry Bar special, slated for release in late 2025. Combining a midwestern charm and high-energy absurdism, Rudick’s stand-up is a frequent hit both on stage and across social media. His videos have amassed tens of millions of views and garnered him over 200,000 followers across social media platforms. Rudick’s relatable energy earned him an appearance on HGTV’s “Design Fails.” He has shared the stage with some of the best comics in the world including Nikki Glaser, Mark Normand, Kyle Kinane, Kevin Nealon, Preacher Lawson and his big sister Leah Rudick, to name a few.Rudick was a featured performer for Limestone, North Carolina Comedy Festival, Alternating Currents, Whiskey Bear, Let’s Fest, Crossroads, Brew HaHa and Devil’s Cup Comedy Festivals.He also loves Fleetwood Mac and doesn’t care who knows it. Please take note of the following: VIP tickets are Preferred Tabletop Seating. General Admission tickets are General Seating which is first come first serve. Bar is open after events until midnight. Kitchen closes at 11:30. No refunds or exchanges. All patrons must be ages 21+ with valid ID. No exceptions!! No backpacks, all bags are subject to search. No outside food or drink allowed There WILL be adult content. No heckling, don’t be that person, you’ll be asked to leave and you will not get a refund NO VIDEO OR PHOTOGRAPHY IS ALLOWED DURING SHOWS We take pride in our drink minimum (which is zero!) so please be mindful of this as you tip your servers and enjoy your food and beverages during the show! 30 minute late arrivals will not be guaranteed their seats General Seating is first come first serve, we can not guarantee you will sit with a larger party together, but we will try! more less Buy Tickets Fri, May 22, 2026 8:00 PM Sat, May 23, 2026 7:00 PM 9:30 PM hide May 29 - May 31 Deric Cahill Fresh off the release of his debut comedy special, , Deric Cahill is back and bolder than ever with his new tour \"Unfortunate Son\". This time, he's diving deep into the chaos of his past and that's influencing how he's keeping up with the present. With his signature sharp wit, no topic is off-limits as he talks shit about everything that's shaped him—from childhood trauma to everyday struggles. Get ready for a raw and hilarious ride. Toxic Papa Tabletop Seating Update: Our tabletops are now sold as one table, and two tickets are included with each tabletop purchase—perfect for date night, friends, or anyone who likes a little extra elbow room while they laugh. Please take note of the following: VIP tickets are Preferred Tabletop Seating. General Admission tickets are General Seating which is first come first serve. Bar is open after events until midnight. Kitchen closes at 11:30. No refunds or exchanges. All patrons must be ages 21+ with valid ID. No exceptions!! No backpacks, all bags are subject to search. No outside food or drink allowed There WILL be adult content. No heckling, don’t be that person, you’ll be asked to leave and you will not get a refund NO VIDEO OR PHOTOGRAPHY IS ALLOWED DURING SHOWS We take pride in our drink minimum (which is zero!) so please be mindful of this as you tip your servers and enjoy your food and beverages during the show! 30 minute late arrivals will not be guaranteed their seats General Seating is first come first serve, we can not guarantee you will sit with a larger party together, but we will try! more less Buy Tickets Fri, May 29, 2026 7:00 PM 9:30 PM Sat, May 30, 2026 7:00 PM 9:30 PM Sun, May 31, 2026 7:00 PM 9:30 PM hide June 12 - June 13 Lace Larrabee If you haven’t heard of Lace Larrabee, you will soon. Lace is a nationally touring comedian, actress, and host whose debut comedy album, White Trash Cinderella, produced by 800 Pound Gorilla Records, sealed the number one spot on the comedy charts. The amassed over 1.9 million views and counting. accompanying YouTube special A former southern beauty queen, Lace ditched the pageants but kept her dominant stage presence, unrivaled timing and trademark sass. As a season 17 semifinalist on America’s Got Talent, America loved her charming wit so much, NBC brought her back to roast Simon Cowell alongside Roastmaster General himself, Jeff Ross. Lace turned her appearance on AGT into a Vegas residency as host of America’s Got Talent Superstars Live. For over 13 years, Lace has been honing her self-deprecating humor and hilarious personal anecdotes into a style that is fiercely her own. Lace can captivate a room and garner laughs as big as her personality. From tales of growing up in a trailer to relatable observations on friends, family, love and aging, Lace turns life’s humiliating moments into an indomitable act of comedy. Lace’s candor, perspicacity, and refreshingly real takes on life make comedians want to be her, audiences want to be best friends with her. Please take note of the following: VIP tickets are Preferred Tabletop Seating. General Admission tickets are General Seating which is first come first serve. Bar is open after events until midnight. Kitchen closes at 11:30. No refunds or exchanges. All patrons must be ages 21+ with valid ID. No exceptions!! No backpacks, all bags are subject to search. No outside food or drink allowed There WILL be adult content. No heckling, don’t be that person, you’ll be asked to leave and you will not get a refund NO VIDEO OR PHOTOGRAPHY IS ALLOWED DURING SHOWS We take pride in our drink minimum (which is zero!) so please be mindful of this as you tip your servers and enjoy your food and beverages during the show! 30 minute late arrivals will not be guaranteed their seats General Seating is first come first serve, we can not guarantee you will sit with a larger party together, but we will try! more less Buy Tickets Fri, Jun 12, 2026 8:00 PM Sat, Jun 13, 2026 7:00 PM 9:30 PM hide July 09 Chris Higgins ​Chris Higgins is a nationally touring comedian from Colorado, now based in Chicago, who brings a unique blend of stoner wisdom, masterful impressions, and outdoorsy sensibilities to stages across the country. Known for his viral stand-up clips that have amassed millions of views, his online sketch series \"God n Angel\" (1.6M followers), and his comedy special \"Live at the Fort,\" Chris is quickly establishing himself as one of comedy's most distinctive rising voices. A festival favorite, Chris has performed at the New York Comedy Festival, Netflix is a Joke Comedy Festival, and High Plains Comedy Festival, while taking home \"Best of the Fest\" honors at both Westend Comedy Festival and 10,000 Laughs Comedy Festival. His comedy has been featured on Don't Tell Comedy, ViceTV, Bob & Tom, and he's currently selling out stops nationwide.Chris's comedy attracts fans of comics like Rory Scovel, Kyle Kinane, and Mitch Hedberg - audiences who appreciate clever wordplay, unexpected perspectives, and a comedian who proves you can be both laid-back and razor-sharp. Chris combines Colorado's outdoor spirit with Chicago's comedy hustle to create something entirely his own.Chris would list more credits, but it's generally frowned upon to claim you're the host of the Tonight Show without being Jimmy Fallon. Please take note of the following: VIP tickets are Preferred Tabletop Seating. General Admission tickets are General Seating which is first come first serve. Bar is open after events until midnight. Kitchen closes at 11:30. No refunds or exchanges. All patrons must be ages 21+ with valid ID. No exceptions!! No backpacks, all bags are subject to search. No outside food or drink allowed There WILL be adult content. No heckling, don’t be that person, you’ll be asked to leave and you will not get a refund NO VIDEO OR PHOTOGRAPHY IS ALLOWED DURING SHOWS We take pride in our drink minimum (which is zero!) so please be mindful of this as you tip your servers and enjoy your food and beverages during the show! 30 minute late arrivals will not be guaranteed their seats General Seating is first come first serve, we can not guarantee you will sit with a larger party together, but we will try! more less Thu Jul 9 2026, 8:00 PM Buy Tickets",
      "hash": "e8cbeb1f813c",
      "downloadedAt": "2026-01-18T17:01:51.462Z",
      "trimmedAt": "2026-01-18T17:12:50.634Z",
      "sizeReduction": "86.7%"
    },
    {
      "url": "https://www.witsendcharleston.com/calendar",
      "text": "Sign up Login January February March April May June July August September October November December 2026 2027 2028 Go monday tuesday wednesday thursday friday saturday sunday 1 2 3 The New Year Hangover Show 8:00 PM (Sold Out) 4 5 6 7 Wednesday Open Mic with Liv 7:30 PM 8 Wit's End Presents.. 8:00 PM 9 Wit's End Presents.. 8:00 PM 10 Wit's End Presents.. 8:00 PM 11 12 13 Carter Anderson 7:30 PM 14 Wednesday Open Mic with Liv 7:30 PM 15 Phil Hanley 8:00 PM 16 Phil Hanley 7:00 PM 9:30 PM 17 Phil Hanley 7:00 PM (Sold Out) 9:30 PM 18 Michael Clayton 7:00 PM (Sold Out) 19 20 21 Wednesday Open Mic with Liv 7:30 PM 22 Gabby Bryan 8:00 PM 23 Gabby Bryan 7:00 PM 9:30 PM 24 And Then We Had Sex Podcast 4:00 PM Gabby Bryan 7:00 PM 9:30 PM 25 26 Best of Charleston Comedy 8:00 PM 27 Dustin Nickerson 8:00 PM 28 Pauly Shore 8:00 PM 29 Pauly Shore 8:00 PM 30 Pauly Shore 8:00 PM (Sold Out) Late Night Cheap Show with Josh Bates 10:30 PM 31 Pauly Shore 7:00 PM (Sold Out) 9:30 PM (Sold Out)",
      "hash": "ebb3a6b310c5",
      "downloadedAt": "2026-01-18T17:01:52.332Z",
      "trimmedAt": "2026-01-18T17:12:50.658Z",
      "sizeReduction": "99.7%"
    },
    {
      "url": "https://www.witsendcharleston.com/events/127190",
      "text": "Sign up Login Event Description Biography January 27 Dustin Nickerson Dustin Nickerson A Seattle native now suffering in Southern California, Dustin Nickerson is an in demand comic on the rise. In 2020, he released his debut comedy special Overwhelmed which is currently one of the highest rated specials on Amazon Prime Video. In addition, he’s been featured on Comedy Central and Netflix by Kevin Hart, the Late Late Show with James Corden, Fox, Hulu and can regularly be heard on Sirius Radio XM. Online, his stand- up clips and jokes have received tens of millions of views and his podcast, Don’t Make Me Come Back There, has over a million downloads. He’s also the author of How to be Married be Married to Melissa, an Amazon #1 New Release published by Harper Collins in June 2022. Dustin describes himself as “the world’s most average person” but is far from it when on stage. He brings you into his life through his jokes about the struggles of parenting, marriage, and being generally annoyed by most people. Please take note of the following: VIP tickets are Preferred Tabletop Seating. General Admission tickets are General Seating which is first come first serve. Bar is open after events until midnight. Kitchen closes at 11:30. No refunds or exchanges. All patrons must be ages 21+ with valid ID. No exceptions!! No backpacks, all bags are subject to search. No outside food or drink allowed There WILL be adult content. No heckling, don’t be that person, you’ll be asked to leave and you will not get a refund NO VIDEO OR PHOTOGRAPHY IS ALLOWED DURING SHOWS We take pride in our drink minimum (which is zero!) so please be mindful of this as you tip your servers and enjoy your food and beverages during the show! 30 minute late arrivals will not be guaranteed their seats General Seating is first come first serve, we can not guarantee you will sit with a larger party together, but we will try! A Seattle native now suffering in Southern California, Dustin Nickerson is an in demand comic on the rise. In 2020, he released his debut comedy special Overwhelmed which is currently one of the highest rated specials on Amazon Prime Video. In addition, he’s been featured on Comedy Central and Netflix by Kevin Hart, the Late Late Show with James Corden, Fox, Hulu and can regularly be heard on Sirius Radio XM. Online, his stand- up clips and jokes have received tens of millions of views and his podcast, Don’t Make Me Come Back There, has over a million downloads. He’s also the author of How to be Married be Married to Melissa, an Amazon #1 New Release published by Harper Collins in June 2022. Dustin describes himself as “the world’s most average person” but is far from it when on stage. He brings you into his life through his jokes about the struggles of parenting, marriage, and being generally annoyed by most people. 01/27/2026 8:00 PM Door Time: 6:00 PM Other Showtimes A Seattle native now suffering in Southern California, Dustin Nickerson is an in demand comic on the rise. In 2020, he released his debut comedy special Overwhelmed which is currently one of the highest rated specials on Amazon Prime Video. In addition, he’s been featured on Comedy Central and Netflix by Kevin Hart, the Late Late Show with James Corden, Fox, Hulu and can regularly be heard on Sirius Radio XM. Online, his stand- up clips and jokes have received tens of millions of views and his podcast, Don’t Make Me Come Back There, has over a million downloads. He’s also the author of How to be Married be Married to Melissa, an Amazon #1 New Release published by Harper Collins in June 2022. Dustin describes himself as “the world’s most average person” but is far from it when on stage. He brings you into his life through his jokes about the struggles of parenting, marriage, and being generally annoyed by most people. Please take note of the following: VIP tickets are Preferred Tabletop Seating. General Admission tickets are General Seating which is first come first serve. Bar is open after events until midnight. Kitchen closes at 11:30. No refunds or exchanges. All patrons must be ages 21+ with valid ID. No exceptions!! No backpacks, all bags are subject to search. No outside food or drink allowed There WILL be adult content. No heckling, don’t be that person, you’ll be asked to leave and you will not get a refund NO VIDEO OR PHOTOGRAPHY IS ALLOWED DURING SHOWS We take pride in our drink minimum (which is zero!) so please be mindful of this as you tip your servers and enjoy your food and beverages during the show! 30 minute late arrivals will not be guaranteed their seats General Seating is first come first serve, we can not guarantee you will sit with a larger party together, but we will try! A Seattle native now suffering in Southern California, Dustin Nickerson is an in demand comic on the rise. In 2020, he released his debut comedy special Overwhelmed which is currently one of the highest rated specials on Amazon Prime Video. In addition, he’s been featured on Comedy Central and Netflix by Kevin Hart, the Late Late Show with James Corden, Fox, Hulu and can regularly be heard on Sirius Radio XM. Online, his stand- up clips and jokes have received tens of millions of views and his podcast, Don’t Make Me Come Back There, has over a million downloads. He’s also the author of How to be Married be Married to Melissa, an Amazon #1 New Release published by Harper Collins in June 2022. Dustin describes himself as “the world’s most average person” but is far from it when on stage. He brings you into his life through his jokes about the struggles of parenting, marriage, and being generally annoyed by most people.",
      "hash": "ef69c4ca81a1",
      "downloadedAt": "2026-01-18T17:01:59.015Z",
      "trimmedAt": "2026-01-18T17:12:50.662Z",
      "sizeReduction": "73.9%"
    },
    {
      "url": "https://www.witsendcharleston.com/events/123034",
      "text": "Sign up Login Event Description Biography January 18 Michael Clayton - Album Taping Michael Clayton - Album Taping ​Michael Clayton is a comedian who originally hails from Charleston, South Carolina. With a style that blends observational comedy, a self-deprecating tone, and personal stories, Michael has been able to perform in comedy rooms across the country. He was a featured performer in the North Carolina Comedy Arts Festival, the Black Box Comedy Festival, the 5th Borough Comedy Festival, The Charleston Comedy Festival, and he was also showcased on “RISK! With Kevin Allison”. He’s also shared the stage with countless comedy favorites, including Mark Normand, Dan Soder, Katherine Blanford, Bobcat Goldthwait, Matthew Broussard, and Mick Foley. He is one of the passed comedians here at Wit’s End and can regularly be seen performing here. Please take note of the following: VIP tickets are Preferred Tabletop Seating. General Admission tickets are General Seating which is first come first serve. Bar is open after events until midnight. Kitchen closes at 11:30. No refunds or exchanges. All patrons must be ages 21+ with valid ID. No exceptions!! No backpacks, all bags are subject to search. No outside food or drink allowed There WILL be adult content. No heckling, don’t be that person, you’ll be asked to leave and you will not get a refund NO VIDEO OR PHOTOGRAPHY IS ALLOWED DURING SHOWS We take pride in our drink minimum (which is zero!) so please be mindful of this as you tip your servers and enjoy your food and beverages during the show! 30 minute late arrivals will not be guaranteed their seats General Seating is first come first serve, we can not guarantee you will sit with a larger party together, but we will try! Michael Clayton is a comedian who originally hails from Charleston, South Carolina. With a style that blends observational comedy, a self-deprecating tone, and personal stories, Michael has been able to perform in comedy rooms across the country. He was a featured performer in the North Carolina Comedy Arts Festival, the Black Box Comedy Festival, the 5th Borough Comedy Festival, The Charleston Comedy Festival, and he was also showcased on “RISK! With Kevin Allison”. He’s also shared the stage with countless comedy favorites, including Mark Normand, Dan Soder, Katherine Blanford, Bobcat Goldthwait, Matthew Broussard, and Mick Foley. He is one of the passed comedians here at Wit’s End and can regularly be seen performing here. Other Showtimes ​Michael Clayton is a comedian who originally hails from Charleston, South Carolina. With a style that blends observational comedy, a self-deprecating tone, and personal stories, Michael has been able to perform in comedy rooms across the country. He was a featured performer in the North Carolina Comedy Arts Festival, the Black Box Comedy Festival, the 5th Borough Comedy Festival, The Charleston Comedy Festival, and he was also showcased on “RISK! With Kevin Allison”. He’s also shared the stage with countless comedy favorites, including Mark Normand, Dan Soder, Katherine Blanford, Bobcat Goldthwait, Matthew Broussard, and Mick Foley. He is one of the passed comedians here at Wit’s End and can regularly be seen performing here. Please take note of the following: VIP tickets are Preferred Tabletop Seating. General Admission tickets are General Seating which is first come first serve. Bar is open after events until midnight. Kitchen closes at 11:30. No refunds or exchanges. All patrons must be ages 21+ with valid ID. No exceptions!! No backpacks, all bags are subject to search. No outside food or drink allowed There WILL be adult content. No heckling, don’t be that person, you’ll be asked to leave and you will not get a refund NO VIDEO OR PHOTOGRAPHY IS ALLOWED DURING SHOWS We take pride in our drink minimum (which is zero!) so please be mindful of this as you tip your servers and enjoy your food and beverages during the show! 30 minute late arrivals will not be guaranteed their seats General Seating is first come first serve, we can not guarantee you will sit with a larger party together, but we will try! Michael Clayton is a comedian who originally hails from Charleston, South Carolina. With a style that blends observational comedy, a self-deprecating tone, and personal stories, Michael has been able to perform in comedy rooms across the country. He was a featured performer in the North Carolina Comedy Arts Festival, the Black Box Comedy Festival, the 5th Borough Comedy Festival, The Charleston Comedy Festival, and he was also showcased on “RISK! With Kevin Allison”. He’s also shared the stage with countless comedy favorites, including Mark Normand, Dan Soder, Katherine Blanford, Bobcat Goldthwait, Matthew Broussard, and Mick Foley. He is one of the passed comedians here at Wit’s End and can regularly be seen performing here.",
      "hash": "fca5808422ad",
      "downloadedAt": "2026-01-18T17:01:55.413Z",
      "trimmedAt": "2026-01-18T17:12:50.667Z",
      "sizeReduction": "74.1%"
    }
  ],
  "sizeReduction": "94.1%"
}