{
  "venueId": "ChIJEyY9A7F5_ogR5o8JEDlGHG4",
  "venueName": "Paisano's Pizza Grill",
  "venueArea": "James Island",
  "website": "http://paisanospizzaji.com/",
  "scrapedAt": "2026-01-18T17:04:24.544Z",
  "trimmedAt": "2026-01-18T17:05:24.880Z",
  "pages": [
    {
      "url": "http://paisanospizzaji.com/charleston-paisano-s-pizza-grill-james-island-catering",
      "text": "Catering Menu Your request has been sent to the restaurant. We will contact you soon. {{reservations.serverError}}",
      "hash": "0fface88844f",
      "downloadedAt": "2026-01-18T16:55:42.432Z",
      "trimmedAt": "2026-01-18T17:05:24.846Z",
      "sizeReduction": "99.8%"
    },
    {
      "url": "http://paisanospizzaji.com/",
      "text": "× Order your favorite dishes in seconds! Order Online × Did you know we do catering? Whatever your occasion, however big or small, we have the perfect options to choose from. Cater your birthday party, holiday party, corporate events, wedding festivities and more! Catering Packages × We are taking online reservations! Let’s ensure you get a great table: Book today! We recommend making a reservation ahead of time. Book your table today! Book Table × Turn moments into memories! Choose us for your next special occasion or get-together. Got a birthday party, rehearsal dinner, corporate or other event coming up? We're a great option for your gathering! Inquire today and let us know how we can make your special occasion perfect! Book your party Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! Job Listings Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! 1246 camp rd, Charleston, SC 29412 map marker pin ORDER NOW PICK UP OR DELIVERY Order Online Catering Let us cater your next event Paisano's Pizza Grill James Island would be honored to provide our services for your next event. Each event is bespoke to your tastes and needs, to provide the best experience possible for you and your guests. Catering Parties Book your next party with us! Need the space for your event? Search no more, we have a perfect place for you! Parties Reservations Join us today Click the button below to make a reservation Reserve The best dough + The best sauce + The best cheese = The best pizza Our Menu Made by friends, for friends Catering Full selection of Draft/Bottled beer and Italian Wines Drinks Dot slide navigation number 1 Dot slide navigation number 2 Dot slide navigation number 3 slideshow start stop playing Specials 2 Large 1 Topping Pizzas and a 2 Liter for $30.99 11:00 AM - 12:00 AM ALL SPECIALS Reviews Review by - Yelp Taryn W.: Cannot recommend Paisano's enough! We lived on James Island for 3 years and ordered from here at least once a month, and everything was always delicious. My favorite menu items are the chicken parm pizza and Italian hot sub. My husband loves the chicken parm sub and hot wings. But honestly, you can't go wrong with anything on the menu. Review by - Yelp Cara H.: This little pizza place was very delicious and quick. I ordered pizza Togo for me and my family and the pizza was a great price and the staff was very nice and got me my order and side sauces to go. Definitely recommend this pizza. They had other items that I would have loved to try but didn't have time while on vacation. Will definitely go back to try the wings. Review by - Yelp Remi Louise F.: I always tell my friends that they can only tell if I like the pizza if I ate the bone. This is surely one of the pizza where I ate the bone. It is fresh out of the oven. I love how it is not salty or overly oily. The toppings are perfect amount and spread out. Will surely be back! I'll edit this review once I tried their wings. Review by - Yelp Grace P.: The BEST pizza on James Island for sure! This place does it right. Really affordable and can feed a lot of people. Every time I order, my food comes out perfectly. Placing a pickup order is simple and quick. I always go for a classic cheese pizza - the seasoning they use is fantastic! Review by - Yelp Jesse J.: Best delivery I've had in along time. And we use Uber eats at the office all the time. Gyros are awesome, Taziki sauce is better than Athens was. Fries were great and still crispy even in the storm and their wings are always great. Best blue cheese maybe best in Charleston Stop reviews carousel Play reviews carousel Newsletter Location 1246 camp rd Charleston, SC 29412 Hours Sun, Mon, Tue, Wed, Thur, Fri, Sat 11:00 AM - 12:00 AM Find us on... Facebook page Instagram page Yelp page Contact us (843)-762-1135 nvskover@yahoo.com Powered by: Website design, Social Media marketing and Email marketing provided by SpotHopper. × Newsletter",
      "hash": "1002b1f0dff2",
      "downloadedAt": "2026-01-18T16:55:40.477Z",
      "trimmedAt": "2026-01-18T17:05:24.867Z",
      "sizeReduction": "97.4%"
    },
    {
      "url": "http://paisanospizzaji.com/charleston-paisano-s-pizza-grill-james-island-drink-menu",
      "text": "Our Drinks Beverages",
      "hash": "69daae06f048",
      "downloadedAt": "2026-01-18T16:55:41.195Z",
      "trimmedAt": "2026-01-18T17:05:24.870Z",
      "sizeReduction": "100.0%"
    },
    {
      "url": "http://paisanospizzaji.com/charleston-paisano-s-pizza-grill-james-island-happy-hours-specials",
      "text": "Specials Sunday January 18th 2 Large 1 Topping Pizzas and a 2 Liter for $30.99 11:00 AM - 12:00 AM Monday January 19th Supersize Monday! 11:00 AM - 12:00 AM Tuesday January 20th $9.00 Calzones (2 Meats and Two Veggies). 11:00 AM - 12:00 AM Wednesday January 21st $15.00 FatBoy (One Topping). 11:00 AM - 12:00 AM Saturday January 24th 1 Large 1 Topping Pizza and 10 Wings for $25.99 11:00 AM - 12:00 AM",
      "hash": "911171f69b7d",
      "downloadedAt": "2026-01-18T16:55:41.808Z",
      "trimmedAt": "2026-01-18T17:05:24.874Z",
      "sizeReduction": "99.4%"
    },
    {
      "url": "http://paisanospizzaji.com/charleston-paisano-s-pizza-grill-james-island-food-menu",
      "text": "Our Menu Order Online Download Menu Menu Catering",
      "hash": "af34206646ab",
      "downloadedAt": "2026-01-18T16:55:40.571Z",
      "trimmedAt": "2026-01-18T17:05:24.880Z",
      "sizeReduction": "100.0%"
    }
  ],
  "sizeReduction": "99.1%"
}