{
  "venueId": "ChIJJxlYSGp6_ogRyfL8KDjhLkg",
  "venueName": "Events at 495 + Satellite Rooftop Bar",
  "venueArea": "Downtown Charleston",
  "website": "http://eventsat495.com/",
  "scrapedAt": "2026-01-18T17:04:25.269Z",
  "trimmedAt": "2026-01-18T17:07:07.776Z",
  "pages": [
    {
      "url": "http://eventsat495.com/location/events-at-495-satellite-bar/",
      "text": "Main content starts here, tab to start navigating Location&Parking 495 King Street, Charleston, SC 29403 843.577.0100 inquires@eventsat495.com Get Directions Call 843.577.0100 Book an Event Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "15de7c5228ff",
      "downloadedAt": "2026-01-18T16:53:59.008Z",
      "trimmedAt": "2026-01-18T17:07:07.723Z",
      "sizeReduction": "98.0%"
    },
    {
      "url": "http://eventsat495.com/events-at-495/",
      "text": "Main content starts here, tab to start navigating History + Vision With an impressive 10,000 square footage, 495 is a multi-level Event Venue located in Downtown Charleston on Historic King Street with two levels of dedicated private event space and third level Rooftop Bar. 495 blends modern sophistication with the charm of historic architecture. The first level floor-to-ceiling glass exterior provides abundant natural light, accentuating the buildings original art deco architectural elements and complementing the heritage of 495 King Street. The Walnut Room is a grandeur space with soaring ceilings and expansive floor plan for a variety of configurations steps from King Street. On the second level, two dedicated private rooms provide intimate dining and reception space. Maplewood wainscoting and artisan lighting provide a warm ambiance to any occasion. Perched on the third level, the rooftop Satellite Bar offers 360 degree views of downtown Charleston's skyline. The vibrant rooftop bar extends the entire building providing an oasis above the hustle and bustle of Upper King Street. Boasting a unique concept of event space Open Daily for cocktails and light bites, Satellite Bar can be privately reserved for events up to 150 guests or partially reserved for up to 75 guests. At the heart of Events at 495 is an unwavering commitment to hospitality, detail, and passion for creating unforgettable memories through life's celebrations. For more information and capacities on each space, click on the images below. Venue Highlights Four Unique Spaces Within One LocationAccommodates up to 350 Tables, Chairs, Glassware and Serviceware Included ADA Accesible with Elevator Located on King Street in Downtown CharlestonRooftop Bar Open Daily Late Night Access Until 2 am In-House Catering and Bar Event Spaces Satellite Bar Walnut Bar + Grill Wilkinson Room Vintage Room For more information or to book your event click the link below Let's Start Planning! Call 843.577.0100 Book an Event Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service Contact Us For More Information Please, enter a valid email Email - Required Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid phone number Phone Number - Required Please, enter a valid company Company - Required Please, enter a valid address 1 Address 1 - Required Address 2 - Optional Please, enter a valid city City - Required Please, enter a valid state State - Required State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware District Of Columbia Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington West Virginia Wisconsin Wyoming Please, enter a valid zip code Zip Code - Required Event Date - Required Please, enter a valid start time Start Time - Required Start Time 11:30 PM 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM 6:30 AM 6:00 AM 5:30 AM 5:00 AM 4:30 AM 4:00 AM 3:30 AM 3:00 AM 2:30 AM 2:00 AM 1:30 AM 1:00 AM 12:30 AM 12:00 AM Please, enter a valid end time End Time - Required End Time 11:30 PM 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM 6:30 AM 6:00 AM 5:30 AM 5:00 AM 4:30 AM 4:00 AM 3:30 AM 3:00 AM 2:30 AM 2:00 AM 1:30 AM 1:00 AM 12:30 AM 12:00 AM Please, enter a valid type of event Type of Event - Required Type of Event Alumni Bachelor / Bachelorette Birthday Cocktail Reception Corporate Lunch Engagement Fundraiser Graduation Holiday Meeting / Presentation Photo / Film Shoot Private Dinner Rehearsal Dinner Shower Sporting Event Wedding Other Please, enter a valid number of people Number of People - Required Additional Information - Optional Submit Please check errors in the form above Thank you for your inquiry. We’ll be in touch shortly. Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "26c1eb4176e6",
      "downloadedAt": "2026-01-18T16:53:56.867Z",
      "trimmedAt": "2026-01-18T17:07:07.742Z",
      "sizeReduction": "91.7%"
    },
    {
      "url": "http://eventsat495.com/satellite-bar/",
      "text": "Main content starts here, tab to start navigating Charleston’s Premier Rooftop Bar Menu Things to Know The rooftop is open to guests of all ages before 9:00 PM. After 9 PM, admittance is restricted to guests aged 21+ The Satellite Bar does not take reservations. Light Bites served until 7:00 PM. Hours MONDAY - THURSDAY 4:00 PM to CLOSE FRIDAY 12:00 PM to CLOSE SATURDAY - SUNDAY 12:00 PM to CLOSE Come Sip with Us Private Parties and Events Satellite Bar can be reserved for private events up to 150 guests For more information and pricing inquire below Let's Start Planning! Call 843.577.0100 Book an Event Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "50b0c6a95076",
      "downloadedAt": "2026-01-18T16:53:57.578Z",
      "trimmedAt": "2026-01-18T17:07:07.747Z",
      "sizeReduction": "97.5%"
    },
    {
      "url": "http://eventsat495.com/menus/",
      "text": "Main content starts here, tab to start navigating Satellite Bar Menus Satellite Bar Drinks Satellite Bar Food Satellite Bar Drinks Beer Draft Coors Lt 6 $ Miller Lite 6 $ Michelob Ultra 6 $ Estuary Noche De Mar Mexican Lager 9 $ Wicked Weed Perni Haze IPA 9 $ Rotating Local Selection 9 $ Canned Michelob Ultra 6 $ Stella Artois 7 $ Heineken Zero / NA 7 $ Heineken 7 $ Tecate 6 $ Corona 7 $ Allagash White 8 $ Local Seasonal 9 $ High Noon Seltzer 11 $ Sun Cruiser 11 $ Cocktails Pressure Drop 15 $ Lavender-Infused Vodka, Blueberry Lemonade Eternal Flame 15 $ Firefly Sweet Tea Vodka, Guava, Watermelon Ring of Fire 15 $ Tequila, Chili Peppers, Jalapeno, Passionfruit, Citrus Solo Dancer 15 $ Bulleit Bourbon, Lemon, Cointreau, Lychee Shooters Shadow Dancing 10 $ Jameson, Peach, Passionfruit, Lemon Strange Romance 10 $ Vodka, Watermelon, Lemon Zero Proof Cocktails Silver Lining 9 $ Lavender, Blueberry, Fresh Lemonade Midnight Train to Georgia 9 $ Passionfruit, Ginger Beer, Bitters Wines Sparkling Prosecco, Jeio, Veneto, Italy Glass 13 $ Bottle 52 $ BRUT, Piper Sonoma, CA Glass 15 $ Bottle 60 $ Rosé, Piper Sonoma, CA Glass 15 $ Bottle 60 $ House Whites Pinot Grigio, California 12 $ Sauvignon Blanc, New Zealand 12 $ Chardonnay, California 12 $ Riesling, Winzer von Erbach, Rheingau, Germany 14 $ Gamay Rose, Guy Allion, Loire Valley, France 14 $ House Reds Pinot Noir, California 12 $ Cabernet, California 12 $ Frozen Froze 12 $ Dry Rose & Citrus Satellite Bar Food Download PDF Starters and Sharables Warm Pretzel Bites 10 $ Beer Cheese & Spicy Honey Mustard French Fries & Garlic Aioli 7 $ Pimento Cheese Dip 10 $ Toasted Focaccia & Veggies Caesar Salad 10 $ Romaine, Parmesan and Croutons +Chicken 5 $ +Shrimp 7 $ +Mushroom & Spinach 4 $ Cheese Quesadilla 12 $ Cheddar & Monterey Cheese Blend, Sour Cream, Salsa, Scallions +Chicken 5 $ +Shrimp 7 $ +Mushroom & Spinach 4 $ Handhelds, Flatbreads & More Smash Burger 18 $ Two 4oz burgers, Cheddar Cheese, House Aioli, Pickles, Lettuce, Tomato Turkey Club Wrap 16 $ Turkey, Romaine, Bacon, Cheddar, Homemade Ranch Crispy Chicken Sliders 15 $ Hot Honey, Coleslaw (two per order) Crab Cake Sliders 17 $ Cajun Remoulade, Butter Lettuce, Roma Tomato (two per order) Steak Frites 32 $ 10oz Skirt Steak, Chimichurri, Fries Call 843.577.0100 Book an Event Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "5e999e057d99",
      "downloadedAt": "2026-01-18T16:53:58.305Z",
      "trimmedAt": "2026-01-18T17:07:07.773Z",
      "sizeReduction": "95.9%"
    },
    {
      "url": "http://eventsat495.com/",
      "text": "Home Main content starts here, tab to start navigating Charleston's Premier Rooftop Bar and Event Venue located in the heart of downtown Charleston. Call 843.577.0100 Book an Event Email Signup Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google and apply. Privacy Policy Terms of Service",
      "hash": "72c99fbbcbd2",
      "downloadedAt": "2026-01-18T16:53:56.647Z",
      "trimmedAt": "2026-01-18T17:07:07.776Z",
      "sizeReduction": "98.2%"
    }
  ],
  "sizeReduction": "95.6%"
}