{
  "venueId": "ChIJTYmoaxJ6_ogRq_Lj5CYD0h8",
  "venueName": "Thoroughbred Club",
  "venueArea": "Downtown Charleston",
  "website": "https://charlestonplace.com/dining/?utm_source=google-gbp&utm_medium=organic&utm_campaign=gbp",
  "scrapedAt": "2026-01-19T16:12:33.082Z",
  "trimmedAt": "2026-01-19T16:13:02.817Z",
  "pages": [
    {
      "url": "https://charlestonplace.com/meetings-events/",
      "text": "[Page Title: Meetings and Events at The Charleston PlaceThe Charleston Place HomeCP logoInstagram LogoFacebook Logo]\n\nSkip to main content Close \nMobile Menu\n01 The Hotel 02 Accommodations 03 The Club 04 Dining 05 Spa & Wellness 06 Meetings & Events 07 Experiences 08 Offers & Delights 09 Contact Us 010 Tales from the Living Room Reserve \nFOR ALL OCCASIONS\n\nMeetings & Events\ncontact us \nShare your vision.\nWe’ll do the rest. \nWhether you’re planning a corporate meeting, national conference, intimate wedding, or grand gala, we offer the spaces, amenities, and gracious service to create extraordinary bespoke experiences that build loyalty, nurture relationships, and create enduring impact.\n\nYour Event, Our Setting\n\nVenues\n\nWeddings\n\nBHC Events\n\nBallrooms\n\nUnique Spaces\n\nOutdoor Spaces\n\nOutdoor Spaces\n\nHistoric Homes\n\nSpotlight Venues\n\nDISCOVER CHARLESTON\n\nMore to Offer\n\nServices\n\nGroup Experiences\n\nOur Team\n\nServices\n\nServices\n\nExclusive Services\nWarm and gracious, our talented team has deep experience in planning, design, food and beverage, logistics, and service from start to finish. \nCatering\nFrom delectable breakfast buffets to exquisite dinners, afternoon snacks, wine programs, and everything in between. \nPersonalized Transportation\nChoose from an alluring array of motor coaches, sprinter vans, or luxury vehicles. \nCustomized Airport Transfers\nLuxury SUVs and sprinter vans can all be at your beck and call. contact us \nGroup Experiences\n\nGroup Experiences\n\nGroup Adventures,\nCollective Joy\n\nFrom boating, fishing, and beach adventures to historic, culinary, and cultural experiences, we craft enjoyable events that nurture healthy competition, create conversation, and build lasting bonds.\nDiscover \nOur Team\n\nOur Team\n\nGracious Spirit and a\nDedicated Team\n\nWith more than a century of collective experience, our award-winning meeting planners know what it takes to make events of all sizes and style successful and memorable. Feel confident knowing you’ll have the care and undivided attention of highly-skilled specialists to anticipate and meet every need and exceed every expectation.\nAbout us For any occasion 40,000 Square feet of ballroom, conference rooms, hospitality suites and more Charleston Praise \nFrom the folks we worked directly with to everyone we interacted with it was a TOP notch experience.\nRaynor Garage Doors \nOur meeting grew from 400 to 800 because of the draw of The Charleston Place.\nSouth Carolina School Boards Association \nI have been in the Continuing Education business for 25 years and have worked with many hotels. I have never had a better experience.\nAmerican Motility Society \nPersonable, not stuffy, five-diamond service. It’s a meeting planner’s dream since they are on top of everything. They are proactive and one step ahead of most other hotels.\nCOBANK \nI have nothing but the best things to say about our experience. The customer service, food, and facilities were fantastic and our guests were extremely pleased with the accommodations.\nHUDSON AUTOMOTIVE \nI’ve been to many hotels, but never have I continued to reflect back on the professionalism and charm of the staff.\nFEDEX \nI literally haven’t ever been to a hotel where the fabric of the place just sang because of the people who just so obviously loved their own hotel and were so proud to work there.\nCONDE NAST TRAVELER \nOff-site events were great—the harbor cruise, plantation tours, carriage rides and Yorktown dinner were all spectacular.\nAMERIS Bank \nThe program went on without any hitches and our Awards Banquet was knocked right out of the park… I truly appreciate all of you doing such an amazing job.  It was flawless and well done.  Everyone loved The Charleston Place!\nUNITED LABORATORIES, INC. \nTell Us About Your Event\nPrefer to talk? Give us a call on 1+800.611.5549 \n\"\" indicates required fields\n* X/Twitter \nThis field is for validation purposes and should be left unchanged.\nName * First Last Email * Phone Name of Organization * Address What US state will the contract be signed from? * Objective of Event Where was your event last held? What is the budget for your event? City County/State/Province Number Country Arrival Date * MM slash DD slash YYYY Departure Date * MM slash DD slash YYYY Flexible Dates * Flexible Dates? Yes No Number of Attendees Per Night * Number of Rooms Per Night * Request for Proposal Max. file size: 50 MB. \nRFP Form\nThank you for your interest. \n\"\" indicates required fields\n* Comments \nThis field is for validation purposes and should be left unchanged.\nName * First Last Email * Phone Name of Organization * Address What US state will the contract be signed from? * Objective of Event Where was your event last held? What is the budget for your event? City County/State/Province Number Country Arrival Date * MM slash DD slash YYYY Departure Date * MM slash DD slash YYYY Flexible Dates * Flexible Dates? Yes No Number of Attendees Per Night * Number of Rooms Per Night * Request for Proposal Max. file size: 50 MB. \nGet In Touch With\nUs We're always happy to help. \n\"\" indicates required fields\n* LinkedIn \nThis field is for validation purposes and should be left unchanged.\nName * First Last Email * Phone Message",
      "hash": "29f0d5f3e293",
      "downloadedAt": "2026-01-19T16:12:20.700Z",
      "trimmedAt": "2026-01-19T16:13:02.742Z",
      "sizeReduction": "98.6%"
    },
    {
      "url": "https://charlestonplace.com/offers-delights/",
      "text": "[Page Title: Special Offers and Packages at The Charleston PlaceThe Charleston Place HomeCP logoInstagram LogoFacebook Logo]\n\nSkip to main content Close \nMobile Menu\n01 The Hotel 02 Accommodations 03 The Club 04 Dining 05 Spa & Wellness 06 Meetings & Events 07 Experiences 08 Offers & Delights 09 Contact Us 010 Tales from the Living Room Reserve \nOffers & Delights\n\nin the best of Charleston’s food, drink, art, culture, and the pursuit of true relaxation with an array of exclusive offers.\nIndulge \nCharleston continues to wow visitors from around the world with its mix of natural beauty, storied history, and vibrant culture. Here, you’ll immerse yourself in it all. From rejuvenating spa services to historic adventures and culinary explorations, you’ll find something amazing for every taste, mood, and occasion.\n\nMade with joy in mind\n\nExclusive Offers and Delights\n\nArrive in Style\n\nEnjoy 10% off your stay, complimentary valet parking, and two nights of elevated comfort and convenience. With curated amenities and a seamless arrival, this offer makes it easy to experience Charleston in effortless style.\nDetails Luxury accommodations Seamless arrival with complimentary valet parking Nightly turndown service \nIn-room welcome amentity\n\nValid for stays now through March 31. Two-night minimum required. Blackout dates apply, including . Offer is subject to availability and may include additional restrictions.\nDisclaimer: February 13-14, March 13-14, and March 27-28 Book Now \nEnhance Your Stay with Club Level Access\n\nElevate your stay with exclusive access to our Club Lounge, now relocated to a refreshed floor plan for a limited time. Enjoy personalized service, dedicated staff, and complimentary culinary offerings, from breakfast to after-dinner indulgences, in a reimagined atmosphere of luxury.\nDetails \nLuxury accommodations\n\nClub Lounge access\nReserve \nStay A Little Longer\n\nWhy stay two nights when you can enjoy greater savings and even more time to explore Charleston by staying three consecutive nights? Extend your getaway and savor every moment of luxury, charm, and unforgettable experiences.\nDetails \nLuxury accommodations\n\nUp to 15% off a three-night stay\nReserve \nBreakfast in Charleston\n\nAfter a glorious night’s sleep, awaken to a delicious breakfast in bed or at The Palmetto Cafe, where fresh, locally inspired dishes start your day on a delightful note.\nDetails \nLuxury accommodations\n\nDaily breakfast at The Palmetto Cafe\nSubject to availability. Restrictions may apply. Not combinable with any other packages or offers. Valid for new bookings only. Disclaimer: Reserve \nThe Cooper I Experience\n\nExperience Charleston from the water with a private charter aboard our custom Hinckley yacht. Available only to guests of The Charleston Place, this experience offers a serene and sophisticated way to explore the city’s historic harbor, all from the comfort of a beautifully appointed vessel, Cooper I. \n\nWhether you’re celebrating something special or simply chasing the horizon, this package invites you to slow down, take in the sea breeze, and see the Holy City from a fresh perspective.\nDetails Luxury accommodations \ntwo-hour\nA private, captain-led charter aboard The Cooper I , our custom Hinckley yacht Flexible sail time, arranged seamlessly through our Concierge team \nA bespoke welcome amenity awaits as you step aboard the Hinckley\nDisclaimer: Subject to availability. Restrictions may apply. Not combinable with any other packages or offers. Valid for new bookings only. Reserve \nThe Suite Life\n\nLounge in a luxurious and spacious suite and embrace the charm of our cosmopolitan hideaway as you savor breakfast in bed or in our garden cafe.\nDetails \nPackage includes:\n\nDaily breakfast at The Palmetto Cafe or in-room dining ($30 credit per person, per day)\n\nDaily valet parking for one vehicle\n\n: Two-night minimum stay required. Restrictions may apply. Subject to availability.\nDisclaimer Reserve \nFurry Friend in Residence\n\nAll are welcome at The Charleston Place, including your furry companion. Let us make your pet feel like a VI-Pet in Residence with a selection of items to enhance your stay.\nDetails \nUse of the following during your stay –\n\nfood and water bowls for use during your stay\nPet \nCustom Foggy Dog bed and bandanna for use during stay and to be taken home as a souvenir\npet \nNot required for a stay. Subject to availability. Restrictions may apply. 7-day advance notice is required. Based on availability. Must be booked separately through the Concierge.\nDisclaimer: pet Reserve \nStay With Us\n\nRFP Form\nThank you for your interest. \n\"\" indicates required fields\n* Email \nThis field is for validation purposes and should be left unchanged.\nName * First Last Email * Phone Name of Organization * Address What US state will the contract be signed from? * Objective of Event Where was your event last held? What is the budget for your event? City County/State/Province Number Country Arrival Date * MM slash DD slash YYYY Departure Date * MM slash DD slash YYYY Flexible Dates * Flexible Dates? Yes No Number of Attendees Per Night * Number of Rooms Per Night * Request for Proposal Max. file size: 50 MB. \nGet In Touch With\nUs We're always happy to help. \n\"\" indicates required fields\n* URL \nThis field is for validation purposes and should be left unchanged.\nName * First Last Email * Phone Message",
      "hash": "57c954270529",
      "downloadedAt": "2026-01-19T16:12:20.704Z",
      "trimmedAt": "2026-01-19T16:13:02.775Z",
      "sizeReduction": "98.1%"
    },
    {
      "url": "https://charlestonplace.com/dining/?utm_source=google-gbp&utm_medium=organic&utm_campaign=gbp",
      "text": "[Page Title: Best Restaurants in Charleston SC | The Charleston Place DiningThe Charleston Place HomeCP logoInstagram LogoFacebook Logo]\n\nSkip to main content Close \nMobile Menu\n01 The Hotel 02 Accommodations 03 The Club 04 Dining 05 Spa & Wellness 06 Meetings & Events 07 Experiences 08 Offers & Delights 09 Contact Us 010 Tales from the Living Room Reserve \nDining\nRestaurant Chef Daniel Humm The Palmetto Cafe Date Guests Check Availability \n—From award-winning fine dining, handcrafted cocktails, and Lowcountry favorites to casual poolside fare, gastropub cuisine, and must-have morning coffee and treats, delicious experiences await you.\nWe invite you \nCulinary Arts\n\nFood & Beverage\nChef Daniel Humm x The Charleston Place Get in Touch Chef Daniel Humm of New York City’s renowned Eleven Madison Park comes to Charleston this October to launch a year-long pop-up at The Charleston Place, Presented by Resy. Showcasing Chef Humm’s world-class culinary vision through the lens of local Charleston ingredients and traditions, the menu will highlight vibrant seasonal produce and seafood, alongside some of Chef Humm’s signature dishes. Discover The Palmetto Cafe Get in touch \nStep inside the garden-inspired Palmetto Cafe, where the finest local and regional ingredients celebrate the bounty of the area. From Lowcountry classics to French-inspired dishes, linger over a sophisticated breakfast or brunch in this light-filled cafe.\n\nHours\nMonday – Friday: \nBreakfast 7AM – 11AM\n\nLunch 12PM – 3PM\nSaturday: \nBreakfast 7AM – 11AM\n\nLunch 12PM – 3PM\nSunday: \nBreakfast 7AM – 11AM\n\nBrunch 10AM – 3PM\nDISCOVER Menus Breakfast Lunch Thoroughbred Club Get in touch \nThe Charleston Place’s very own living room lounge, reminiscent of some of the finest clubs in the world, with nightly live music and a well-traveled spirit selection. Our talented mixologists will guide you through our legendary list of labels, including our own house-made batches. Paired with bespoke bites or desserts, it’s the perfect way to begin or end your evening. Seeking a delightful afternoon indulgence? Join us for Afternoon Tea every Wednesday through Saturday at 2pm.\n\nHours\n\n: Sunday — Thursday 12PM — 11PM\nFriday & Saturday 12PM — 12AM\nLunch: Daily 12PM-4PM\nTapas & Desserts: Daily 4PM — 10:30PM\nLive music: Daily 6PM — 9PM\nGeneral DISCOVER Menus Beverage Lunch Dinner Meeting at Market Get in touch \nMeeting at Market, the city’s cherished gathering place, we invite you to unwind with a pint, relish in delightful pub fare, and cheer for your beloved sports teams. Our vibrant space harmoniously blends the warmth of a classic pub with the exhilaration of a sports enthusiast’s haven. Come immerse yourself in an atmosphere where every moment is savored, every game is celebrated, and every visit becomes a joyful memory.\n\nHours\n\n11AM — 11PM\nOpen Daily DISCOVER Menu \nExplore Dining Experiences\n\nExperiences & Special Events\nUp next \n Afternoon Tea Afternoon Tea Up Prev Afternoon Tea Up next \nSunday Brunch\n\nStep inside the garden-inspired Palmetto Cafe, where the finest local and regional ingredients celebrate the area’s bounty. From Lowcountry classics to French-inspired dishes, linger over a sophisticated Sunday brunch as you sip and savor with those who mean the most.\nBook Now Up next \n Sunday Brunch Sunday Brunch Up Prev Sunday Brunch Up next \nAfternoon Tea\n\nSavor traditional afternoon tea with a Southern twist from our sophisticated English-inspired lounge, the Thoroughbred Club. Join us for a selection of sweet and savory treats paired with your choice of tea or Champagne.\nWednesday through Saturday at 2 pm Learn More \nDISCOVER CHARLESTON\n\nCasual Bites & Drink\n\nCommunity Perk\n\nIn-Room Dining\n\nCommunity Perk\n\nCommunity Perk\nGet In Touch \nThe perfect pick-me-up. Coffee and cold brew, light bites, and house-made pastries.\n\nA new is now open inside Community Perk. Stop by for a curated selection of issues and seasonal reads—perfect to pair with your coffee.\nnewsstand pop-up Garden & Gun \nHours\n\nDaily 7AM — 3PM\n\nIn-Room Dining\n\nIn-Room Dining\nGet in touch \nWhatever the occasion or craving, we have something delicious in mind. Allow our culinary team to surprise and delight you.\n\nHours\nServing Daily \nBreakfast 6:30AM to 11AM\n\nLunch 11:30AM to 3PM\n\nDinner 3PM to 11PM\nMenu \nOur Collection\nSorelle Get In Touch \nSouthern Italy meets Southern hospitality at Sorelle, a restaurant, bar, and market located in the heart of Historic Downtown Charleston. As BHC’s first stand-alone fine dining restaurant, guests can anticipate the same level of extraordinary service at Sorelle, our sister property, as they do here at The Charleston Place.\n\nHours\n\n| Open Daily 8AM — 4PM\n | Monday – Sunday 4:30 PM — 10PM\n4:30PM — Close\nMercato Restaurant Bar | \nSaturday & Sunday 10AM – 2PM\nNow Serving Brunch | Discover INSPIRED CUISINE \nA Taste of The South\n\nThis is a carousel with manual-rotating slides. Use Next and Previous buttons to navigate, or jump to a slide using the slide dots.\n\nSlide 1 of 5\n\nSlide 2 of 5\n\nSlide 3 of 5\n\nSlide 4 of 5\n\nSlide 5 of 5\nPrevious Slide Next Slide \nexperiences\nawait you.\nDelicious Inquire About Group Dining Inquire About Private Dining \nRFP Form\nThank you for your interest. \n\"\" indicates required fields\n* LinkedIn \nThis field is for validation purposes and should be left unchanged.\nName * First Last Email * Phone Name of Organization * Address What US state will the contract be signed from? * Objective of Event Where was your event last held? What is the budget for your event? City County/State/Province Number Country Arrival Date * MM slash DD slash YYYY Departure Date * MM slash DD slash YYYY Flexible Dates * Flexible Dates? Yes No Number of Attendees Per Night * Number of Rooms Per Night * Request for Proposal Max. file size: 50 MB. \nGet In Touch With\nUs We're always happy to help. \n\"\" indicates required fields\n* X/Twitter \nThis field is for validation purposes and should be left unchanged.\nName * First Last Email * Phone Message",
      "hash": "cd0b7e72f7ff",
      "downloadedAt": "2026-01-19T16:12:20.714Z",
      "trimmedAt": "2026-01-19T16:13:02.817Z",
      "sizeReduction": "97.2%"
    }
  ],
  "sizeReduction": "98.1%"
}