{
  "venueId": "ChIJX8avtWt6_ogRNJ5zuZUv5GU",
  "venueName": "Charleston Beer Works",
  "venueArea": "Downtown Charleston",
  "website": "http://www.charlestonbeerworks.com/",
  "scrapedAt": "2026-01-19T16:12:33.321Z",
  "trimmedAt": "2026-01-19T16:13:04.428Z",
  "pages": [
    {
      "url": "http://www.charlestonbeerworks.com/",
      "text": "[Page Title: Charleston Beer Works – Upper King's Original Sports Bar]\n\nCheck out our !\nweekly specials \nMonday - Friday\nHappy Hour \nHouse Liquor, House Wine and Local Draughts all $6 each\n\nWednesday\nRUN CBW \nEvery Wednesday at 7pm$5 Local Brews for all runners\n\nThursday\nBar + Music Bingo \nBar Bingo Every 3rd Thursday + Music Bingo on Last Thursday\n\nFriday\nLive Music \nSam Adams Music Series$5 Sam Lager and Sam Seasonal\nSaturday & SUnday Pitcher Specials \n$12 Bud Light$15 Michelob Ultra$15 Sam Adams\n\nOver 1,250,000 Pints\nand Counting! \nIt’s simple. We created Charleston Beer Works with these things in mind...friends, cold beer, best friends, fresh food, more friends and an extra helping of sports.\n\nWe are a come as you are Charleston bar- a craft beer bar, a modern sports bar and a fresh kitchen wrapped into one great place. A place where the Charleston locals and our friends that are visiting want to comeback for more. Enjoy the downstairs bar, the upstairs bar or a great seat on the patio...whatever vibe you’re feeling!\n\nAt CBW, our team works hard everyday so you can relax and enjoy your free time. Our Certified Beer Servers are here to guide you across a long list of local and regional craft beers, updated weekly. We have over 48 beers on tap, in addition to the classic favorites, plenty more in bottles and cans - and yes, a growing, impressive list of premium spirits and wines. Charleston Beer Works features made from scratch bar foods, with a daily special or two, and live entertainment Thursday through Saturday to keep the good times rolling!\n\nLively, Uncomplicated...and yes, beer is always the answer. What was the question?\nCBW: \nVisit Us\n\n480 King Street\nCharleston, SC 29403\n(843) 577-5885",
      "hash": "6f5ba7e3a6d5",
      "downloadedAt": "2026-01-19T16:12:21.211Z",
      "trimmedAt": "2026-01-19T16:13:04.428Z",
      "sizeReduction": "98.6%"
    }
  ],
  "sizeReduction": "98.6%"
}