{
  "venueId": "ChIJeUV1DJd5_ogR8Jq-VTJakBc",
  "venueName": "Flat and Drum Wings",
  "venueArea": "James Island",
  "website": "http://www.flatanddrum.com/",
  "scrapedAt": "2026-01-19T16:12:34.221Z",
  "trimmedAt": "2026-01-19T16:13:24.384Z",
  "pages": [
    {
      "url": "http://www.flatanddrum.com/food-menu",
      "text": "[Page Title: Flat and Drum Wings - Food Menu]\n\nOur Menu\nMenu See MENU & Order",
      "hash": "12801539c2c5",
      "downloadedAt": "2026-01-19T16:12:24.478Z",
      "trimmedAt": "2026-01-19T16:13:24.363Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "http://www.flatanddrum.com/specials",
      "text": "[Page Title: Flat and Drum Wings - Specials]\n\nSpecials\n\nMonday January 19th\n\nHappy Hour! $20 for 20 wings or $40 for 40 wings\n\n03:00 PM - 05:00 PM\n\nTuesday January 20th\n\nHappy Hour! $20 for 20 wings or $40 for 40 wings\n\n03:00 PM - 05:00 PM\n\nWednesday January 21st\n\nHappy Hour! $20 for 20 wings or $40 for 40 wings\n\n03:00 PM - 05:00 PM\n\nThursday January 22nd\n\nHappy Hour! $20 for 20 wings or $40 for 40 wings\n\n03:00 PM - 05:00 PM\n\nFriday January 23rd\n\nHappy Hour! $20 for 20 wings or $40 for 40 wings\n\n03:00 PM - 05:00 PM",
      "hash": "7fa56379cd76",
      "downloadedAt": "2026-01-19T16:12:24.481Z",
      "trimmedAt": "2026-01-19T16:13:24.367Z",
      "sizeReduction": "99.2%"
    },
    {
      "url": "http://www.flatanddrum.com/",
      "text": "[Page Title: Flat and Drum Wings - Charleston, SC]\n\n× \nWe're hiring! Call, email, or submit an inquiry today to learn more!\nJob Listings × \nDid you know we do catering?\n\nWhatever your occasion, however big or small, we have the perfect options to choose from.\n\nCater your birthday party, holiday party, corporate events, wedding festivities and more!\nCatering Packages \nMartin Luther King Day - We just wanted to wish everyone happy MLK day!\nUpcoming Events Martin Luther King Day - We just wanted to wish everyone happy MLK day! Flat and Drum Wings \nWhere Flavor Takes Flight\n\nis a fast-casual restaurant located on James Island in Charleston, South Carolina, specializing in authentic, flavor-packed chicken wings served in both traditional and boneless styles. Our concept celebrates the classic debate of “flats vs. drums” by offering a wide variety of signature sauces, dry rubs, and specialty flavors inspired by Southern, Caribbean, African, and global cuisines.\nFlat and Drum Wings read more about us Flat and Drum Catering \nBring the flavor to your event\n\nTurn any occasion into a flavor-packed celebration with Flat and Drum Wings catering. From office lunches and family gatherings to game-day spreads and special events, we've got you covered with wings, smash burgers, sandwiches, salads, and Southern-inspired sides. Choose from our wide variety of sauces, dry rubs, and specialty flavors to create the perfect lineup for your guests. Fresh, bold, and ready to share—our catering makes it easy to serve food everyone will love.\ncatering slideshow start stop playing Slide 1 content Slide 2 content previous slide next slide \nFundraising Nights at Flat and Drum\n\nwe're proud to support the families in our community\nmore info about fundraising nights \nFlavors Beyond Ordinary\n\nExplore the Flat and Drum Menu\nOur Menu \nOrder Flat and Drum\n\nYour wings, your way—anytime\n\nCraving bold flavors on the go? Order online from Flat and Drum Wings for quick pickup or convenient delivery. From signature wings and smash burgers to fresh salads and Southern-inspired sides, our full menu is just a few clicks away. Whether it's lunch, dinner, or a late-night craving, we'll bring the flavor straight to you.\nSee MENU & Order Order Skip Photo Gallery \nReviews\nStart stop reviews carousel \nReview by - Google\n\nNastassja T:\nfive star review by \nSoooo good I had the loaded mac and cheese today and it was soo good. I initially came in for wings but I heard another customer ordering and saying how they were just there last week and how good the Mac and cheese so I switched my order to try something new and it didn't disappoint! I was shocked at how many other options were on the menu. The place was nice and clean. Staff was friendly. I'll be back to try other options\n\nReview by - Google\n\nGraham G:\nfive star review by \nI have ordered from this spot on two separate occasions: once was the smash burger and the other time I tried their 10 piece lemon pepper wings and they both were honestly outstanding. Smash burger was huge! And the wings were outstanding! Fries were super tasty—don't even need ketchup. But I like to dip them in their ranch!!\n\nReview by - Google\n\nCourtney S:\nfive star review by \nI ordered the catfish sandwich, a variety of wings, and the loaded mac & cheese with honey hot sauce, and everything was absolutely delicious! The food came out in about 15 minutes. It was hot, fresh, and full of flavor. The customer service was excellent as well. 10/10 would definitely recommend!\n\nNewsletter\n\nLocation\n\n807 Folly Road\n\nCharleston, SC\n\n29412\n\nHours\n\nFri, Sat\n\n11:00 AM - 11:00 PM\n\nSun, Mon, Tue, Wed, Thur\n\n11:00 AM - 10:00 PM\n\nFind us on...\nFacebook page Instagram page Google page \nContact us\n(843)-517-8007 Call us at drumsandflatssc@gmail.com Write us at \nPowered by:\nWebsite design, Social Media marketing and Email marketing provided by SpotHopper. × \nNewsletter",
      "hash": "a994e8d2b0d5",
      "downloadedAt": "2026-01-19T16:12:24.484Z",
      "trimmedAt": "2026-01-19T16:13:24.384Z",
      "sizeReduction": "97.5%"
    }
  ],
  "sizeReduction": "98.5%"
}