{
  "venueId": "ChIJpdk3O1R-_ogRsimGiDMjNNM",
  "venueName": "Krazy Owls",
  "venueArea": "West Ashley",
  "website": "http://www.krazyowls.com/",
  "scrapedAt": "2026-01-19T16:12:34.893Z",
  "trimmedAt": "2026-01-19T16:13:30.186Z",
  "pages": [
    {
      "url": "http://www.krazyowls.com/",
      "text": "[Page Title: Krazy Owls - Johns Island, Johns Island, SC]\n\n× \nLet us host your special event!\n\nWhether a birthday party, office function or any other special occasion - we take care of all the fine details, bringing your event to life, just as you imagined.\n\nHost your next party or get together\nBook your party × \nWe are taking online reservations!\n\nLet’s ensure you get a great table: Book today!\n\nWe recommend making a reservation ahead of time. Book your table today!\nBook Table \nJob Listings - We're hiring! Call, email or submit an inquiry today to learn more!\nJob Listings Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! \nNFL Playoffs - Come watch the NFL Playoffs with us!\nUpcoming Events NFL Playoffs - Come watch the NFL Playoffs with us! \n3157A Maybank Hwy, Johns Island, SC 29455\n\nTHE KRAZY OWLS\nOUR STORY \nSome people know when to give up. Others know when they are beaten. Krazy owls founder Al Thompson isn’t that smart, in fact, his nickname, “Crazy Al” (and all those two words stand for,) is the reason for the name of this place. Who else could gain a type of fame for a thing like pushing a hospital bed 1,900+  miles to break a Guinness World Record? Who else would break the biggest strings learning to tune a bass guitar, then a few days later have figured out how to actually play the thing? He’s won marketing  and advertising award for a major fast food chain, though he’s never in his life taken a marketing class. Really, who does that kind of thing? Well, Al, it seems. He’s one of those people who do things because he doesn’t know they can’t be done. The word “impossible” makes his eyebrow twitch, mostly in a downward position. Maybe he doesn’t know what it means.\n\nThe story of Krazy Owls began when, after thirty seven years in the fast food business, things changed.  Al found himself faced with the prospect of a leisurely retirement or working his tail off creating a fun place to enjoy a great meal or drink. Never a person to sit around and relax, Al’s crazy brain juggled several ideas as he searched for a different concept in the realm of restaurant excellence.\nRead more \nWHAT IS STEAMPUNK?\nsteampunk \nWhat is Steampunk? This has been debated for many years, but essentially, it is a fantasy world based in the Victorian Age where steam powered machines provide energy and enormous dirigibles, along with many other outlandish devices provide transportation. It would be a world where one would find hats with goggles, gears everywhere, and everything would be slightly different...\nRead more \nWHAT IS STEAMPUNK?\n\nSpecials\nCheck them out \nReviews\n\nreview by - Yelp\n\nAdam H.:\n\nThis has just become my new favorite brunch/lunch spot. The food is incredible. The steampunk motif is a lot of fun. I will definitely be a regular here and highly recommend it to anyone looking for amazing food and atmosphere. The chicken biscuit and biscuits and gravy were both incredible.\n\nreview by - Yelp\n\nDanielle C.:\n\nJut tried this for the first time and really enjoyed it. The decor is super funky (think gears and lava lamps) and the food is classic but well done. Staff was very friend!!! We will for sure go back!!\n\nreview by - Yelp\n\nDanielle C.:\n\nJut tried this for the first time and really enjoyed it. The decor is super funky (think gears and lava lamps) and the food is classic but well done. Staff was very friend!!! We will for sure go back!!\n\nreview by - Yelp\n\nBrittany B.:\n\nGreat experience! We loved the live music, delicious food and tasty drink. The owner even was our server showing that it's an all hands on deck restaurant. Just what Johns island needs!\n\nNewsletter\n\nstay tuned for updates\n\nSign up for our newsletter & get a Free order of Mad Hatter Fries with purchase of an entree.Dine in only, not available with other offers or discounts.\n\nLocation\n\n3157A Maybank Hwy\n\nJohns Island, SC\n\n29455\n\nHours\n\nClosed on Mondays\n\nClosed 4th of July\n\nClosed Thanksgiving\n\nClosed Christmas Day\n\nClosed Easter\n\nFind us on...\n\nContact us\n(843)-640-3844 krazyowls@yahoo.com \nPowered by:\nWebsite design, Social Media marketing and Email marketing provided by SpotHopper. × \nNewsletter\n\nSign up for our newsletter & get a Free order of Mad Hatter Fries with purchase of an entree.Dine in only, not available with other offers or discounts.",
      "hash": "0f7c968679af",
      "downloadedAt": "2026-01-19T16:12:26.758Z",
      "trimmedAt": "2026-01-19T16:13:30.145Z",
      "sizeReduction": "96.5%"
    },
    {
      "url": "http://www.krazyowls.com/johns-island-johns-island-krazy-owls-events",
      "text": "[Page Title: Krazy Owls - events]\n\nEvents\n\nSaturday February 14th\n\nValentine's Day\n\n11:00 AM - 12:00 AM\n\nJoin us on Valentine's Day for the perfect romantic evening!\n\nTuesday March 17th\n\nSt. Patrick's Day\n\n11:00 AM - 07:00 PM\n\nGrab your best green garb and join us for St. Patrick's Day!",
      "hash": "28f0212e9656",
      "downloadedAt": "2026-01-19T16:12:26.761Z",
      "trimmedAt": "2026-01-19T16:13:30.148Z",
      "sizeReduction": "99.5%"
    },
    {
      "url": "http://www.krazyowls.com/johns-island-johns-island-krazy-owls-drink-menu",
      "text": "[Page Title: Krazy Owls - Drink Menu]\n\nbeers wines cocktails \nDraft\n\nPorter - Blue Point\n\n$5.95\n\nPorter. 5.2% ABV\n\nCans/Bottles\n\nGuinness - Guinness\n\n$5.50\n\nDark brown opaque with a medium size and medium lasting not that creamy a beige head. Faint roasted malt and bready aroma with hints of sweet smokey varnish, charcoal and bitumen. Lighter in body palate and flavours than the draught. Stout. 4.1% ABV\n\nFat Tire - New Belgium\n\n$5.50\n\nBeerAdvocate Bros: \"Nothing stellar, but it is what it is and does a good job at that.\". Amber Ale. 5.2% ABV\n\nSamuel Adams Pale Ale - Boston Beer Company - Samuel Adams\n\n$5.95\n\nEnglish Pale Ale. 5.4% ABV\n\nYuengling Lager - Yuengling Brewery\n\n$4.50\n\nAn iconic American lager famous for its rich amber color and medium-bodied flavor - with a roasted caramel malt for a subtle sweetness and a combination of cluster and cascade hops, this true original delivers a well-balanced taste with very distinct character. Lager. 4.4% ABV\n\nIPA - Stone\n\n$5.95\n\nA classic. Ridiculously flavorful considering the low ABV, Stone IPA features fresh pine tree and grapefruit hops with a solid caramel malt backbone to balance. IPA. 6.9% ABV\n\nStellar - Greenpoint Beer & Ale Co. (Dirck the Norseman)\n\n$5.95\n\nIndia Pale Ale. 6.8% ABV\n\nAngry Orchard - Angry Orchard\n\n$5.95\n\nThis crisp and refreshing cider mixes the sweetness of the apples with a subtle dryness for a balanced cider taste. The fresh apple aroma and slightly sweet, ripe apple flavor make this cider hard to resist. Cider. 5.0% ABV\n\nLandShark Lager - Anheuser-Busch\n\n$4.95\n\nPale Lager. 4.7% ABV\n\nCorona - Corona\n\n$4.50\n\nPabst Blue Ribbon - Pabst\n\n$2.95\n\nPours light, clear yellow with white head. Aroma is very lagerish, hay, floral, honey. Taste is light, crisp, dirty, yeasty. Lager. 5.0% ABV\n\nMiller High Life Light - Miller-Coors\n\n$2.95\n\nPale Lager. 4.2% ABV\n\nMiller Lite - Miller-Coors\n\n$3.50\n\nMiller Lite is the great tasting, less filling beer that created the American light beer category in 1975. Triple-hops brewed for great pilsner taste, Miller Lite is the only beer to win four gold awards in the World Beer Cup for best American-Style light lager (2006, 2002, 1998 and 1996). It also won the gold medal for best American-style Lager or Light Lager at the 2010 Great American Beer Festival. Ingredients: Water, Barley Malt, Corn Syrup (Dextrose), Yeast, Hops and Hop Extract. Lager. 4.2% ABV\n\nMichelob Ultra - Anheuser-Busch\n\n$3.50\n\n. Light lager. 4.0% ABV\n\nCoors Light - Miller-Coors\n\n$3.50\n\nCoors Light's unique frost-brewing process locks in a taste as cold as the Rockies. Coors Light is constantly bringing innovation to its bottles and cans, with recent features including the Cold Activated Bottle, Super Cold Draft, the Vented Wide Mouth Can with Frost Brew Liner, the Cold Activated Can and Two-Stage Cold Activation bottles and cans. Ingredients: Water, Barley Malt, Corn Syrup (Dextrose),. Lager. 4.2% ABV\n\nBudweiser - Anheuser-Busch\n\n$3.50\n\nFresh and subtle fruit notes, a delicate malt sweetness and \nbalanced bitterness for a clean, snappy finish. Budweiser is a \nmedium-bodied, flavorful, crisp and pure beer with blended \nlayers of premium American and European hop aromas,\nbrewed for the perfect balance of flavor and refreshment. Lager. 5.0% ABV\n\nBud Light - Anheuser-Busch\n\n$3.50\n\nLager. 4.1% ABV\n\nSparkling\n\nProsecco\n\n$6.95/1/2 Carafe\n\nDolcetto\n\nWhite\n\nMoscato, Mezza Corona\n\n$6.95/Glass\n\n$24.95/Bottle\n\nMoscato\n\n2015 Standing Stone Vineyards Riesling, Seneca Lake, USA - Standing Stone Vineyards\n\n$6.95/Glass\n\n$24.95/Bottle\n\nRiesling. 12.0% ABV\n\nCoastal Sauvignon Blanc - Callaway Vineyard & Winery\n\n$6.95/Glass\n\n$24.95/Bottle\n\nSauvignon Blanc. 13.0% ABV\n\nPinot Blanc - Foris\n\n$6.50/Glass\n\n$23.95/Bottle\n\nPinot Blanc. 13.3% ABV\n\nHidden Crush Chardonnay, Central Coast - Hidden Crush\n\n$8.50/Glass\n\n$28.95/Bottle\n\nChardonnay. 14.0% ABV\n\nSycamore Lane - Trinchero Family Estates\n\n$5.50/Glass\n\n$20.95/Bottle\n\nChardonnay. 12.9% ABV\n\nRed\n\nPinot Noir, Santa Rita Hills - Foley Estates\n\n$6.95/Glass\n\n$24.95/Bottle\n\nPinot Noir. 14.1% ABV\n\nMalbec - Mountain Door\n\n$6.95/Glass\n\n$24.95/Bottle\n\nMalbec. 13.0% ABV\n\nRed Diamond Merlot - Red Diamond\n\n$6.50/Glass\n\n$23.95/Bottle\n\nMerlot. 13.5% ABV\n\nCabernet Sauvignon - Robert Mondavi\n\n$8.95/Glass\n\n$28.95/Bottle\n\nCabernet Sauvignon. 14.5% ABV\n\nSycamore Lane Cabernet Sauvignon, California, USA - The Sycamore Winery\n\n$5.50/Glass\n\n$20.95/Bottle\n\nCabernet Sauvignon. 13.0% ABV\n\nCommon Cocktails\n\nRon Collins\n\n$5.95\n\nTequila Sunrise\n\n$5.50\n\nSea Breeze\n\n$5.50\n\nIrish Coffee\n\n$7.95\n\nWhiskey Old Fashioned\n\n$7.95\n\nMimosa\n\n$3.95\n\nVodka Martini\n\n$6.95\n\nBlack Russian\n\n$7.95\n\nBay Breeze\n\n$5.50\n\nBloody Mary\n\n$5.95\n\nMargarita\n\n$5.95\n\nWhiskey Manhattan\n\n$7.95\n\nPina Colada\n\nMai Tai\n\n$7.25\n\nTom Collins\n\n$6.25\n\nWhite Russian\n\n$7.95\n\nFuzzy Navel\n\nScrewdriver\n\n$5.50\n\nSalty Dog\n\n$5.50\n\nLong Island Iced Tea\n\n$7.95/Tall\n\nCosmopolitan\n\n$6.50/Glass\n\nHouse Cocktails\n\nKrazy Owl\n\n$7.95\n\nVodka, Rum, Tequila, Triple Sec and Sprite with a floater of Chambord and Blue Curacao\n\nHootie Fruity\n\n$7.95\n\nMalibu, Bacardi, pineapple and orange juice, grenadine, Myers floater with an orange garnish\n\nNight Owl\n\n$5.95\n\nPeach Schnapps, Malibu, Coconut Rum, pineapple juice, splash of grenadine and blue curacao",
      "hash": "8a74de9c1051",
      "downloadedAt": "2026-01-19T16:12:26.763Z",
      "trimmedAt": "2026-01-19T16:13:30.177Z",
      "sizeReduction": "93.6%"
    },
    {
      "url": "http://www.krazyowls.com/johns-island-johns-island-krazy-owls-food-menu",
      "text": "[Page Title: Krazy Owls - Food Menu]\n\nOur Menu\nMenu Brunch Kids Menu",
      "hash": "9ca438a8ab42",
      "downloadedAt": "2026-01-19T16:12:26.767Z",
      "trimmedAt": "2026-01-19T16:13:30.183Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "http://www.krazyowls.com/johns-island-johns-island-krazy-owls-happy-hours-specials",
      "text": "[Page Title: Krazy Owls - all specials]\n\nSpecials\n\nTuesday January 20th\n\nTwo Tacos $7.95\nChoice of : chicken, beef, shrimp or BBQ pork\n\n11:00 AM - 09:00 PM\n\nTrivia\n\n07:00 PM - 09:00 PM\n\nWednesday January 21st\n\nOwl- Talian Wednesdays\n1/2 price bottle wine\nSpaghetti $10.95\n\n11:00 AM - 09:00 PM\n\nThursday January 22nd\n\n$5 .95Burgers\n\n11:00 AM - 10:00 PM\n\nFriday January 23rd\n\nFish and Chips $10.95\n\n11:00 AM - 10:00 PM",
      "hash": "fc11fc01d523",
      "downloadedAt": "2026-01-19T16:12:26.769Z",
      "trimmedAt": "2026-01-19T16:13:30.186Z",
      "sizeReduction": "99.3%"
    }
  ],
  "sizeReduction": "97.6%"
}