{
  "venueId": "ChIJCRdV9sV5_ogR8IRccKbEeEk",
  "venueName": "Edison James Island",
  "venueArea": "James Island",
  "website": "http://www.edisonjamesisland.com/",
  "scrapedAt": "2026-01-19T15:41:55.790Z",
  "trimmedAt": "2026-01-19T15:42:50.120Z",
  "pages": [
    {
      "url": "https://www.edisonjamesisland.com/valentines-day",
      "text": "[Page Title: Valentines Day | Edison James Island]\n\ntop of page Valentine's Day 2026 - Satur day, February 14 - ​ four course p rix fixe menu $100++/person seatings ava ilable 5:00 - 9:00 ​ RESERVATIONS REQUIRED ​ ​ questions? email info@edisonjamesisland.com reservations EDISON JAMES ISLAND presents VALENTINE'S DAY PRIX FIXE MENU SATURDAY, FEBRUARY 14, 2026 please make one selection for each course ​ ​ ​ FIRST COURSE ​ SHE CRAB SOUP​ blue crab, sherry, cream​ ​ MISO TUNA SASHIMI ​+ white miso aioli, sweet & sour cucumbers, daikon, sesame​ ​ ESCARGOT smoked bacon-wrapped medjool dates, whipped feta cheese, crispy kale, balsamic reduction, herb oil​ ¤​ ​ SECOND COURSE ​ SCARLETT KALE​ + blackberries, goat cheese, red onion, shaved almonds, red wine vinaigrette ​ ​ AVOCADO +​ cucumber, baby tomato, shaved onion, romaine, charred tomato vinaigrette, fresh grilled croutons ​ BARTLETT PEAR o​ Danish blue cheese, baby greens, red onion, pancetta lardons, dijon-balsamic vinaigrette​ ¤​ ​ THIRD COURSE​ ​ * LONDON BROIL silverside eye filet, horseradish whipped potatoes, stone ground mustard & malt sauce, braised leeks add lobster tail +26 ​ * DUCK A LA HANNIBAL pistachio dusted pan roasted duck breast, mushroom mélange & fava bean risotto, chianti reduction ​ SWEET CORN & LOBSTER GNOCCHI sweet corn, smoked bacon, New Zealand cold water lobster, baby heirloom tomatoes, lobster-parmesan broth ​ ¤​ ​ FOURTH COURSE ​ ​ SACHERTORTE Viennese chocolate cake, dark chocolate glaze, apricot jam, whipped cream ​ PEAR TART​ brown sugar + anise roasted pears, puff pastry, frangipane cream, almonds ​ BLACKBERRY-KEY LIME PIE graham cracker crust, silky key lime pie, blackberry coulis ​ ​ ​ + gluten free O a vailable gluten free ​ ​ * Contains ingredients that are raw or undercooked. Consuming raw ​or undercooked meats, seafood, shellfish, or eggs may increase your ​risk of foodborne illness. ​ - menu subject to ch ange based on availability of local product - ​ book now click for reservations bottom of page",
      "hash": "3a05b821f588",
      "downloadedAt": "2026-01-19T15:30:39.087Z",
      "trimmedAt": "2026-01-19T15:42:50.012Z",
      "sizeReduction": "99.6%"
    },
    {
      "url": "http://www.edisonjamesisland.com/",
      "text": "[Page Title: Home | Edison James Island]\n\ntop of page EDISON JAMES ISLAND CREATIVE CULINARY INVENTIONS CHARLESTON, SC MENUS RESERVE GALLERY CONTACT JOBS valentine's day 2026 Saturday, Feb. 14, 2026 Four Course Prix Fixe Dinner Menu \nw/ optional wine pairings MENU - dinner service - wednesday - sunday\n4p - 9p\n\nclosed\nmonday + tuesday Edison James Island ​ Upscale casual restaurant located on beautiful James Island in Charleston, SC; owned and operated by Chef Joel Lucas and his wife, Chelsea Lucas.  Opened in April 2017, Edison features a unique, seasonal menu with a wide variety of carefully curated dishes, showcasing local ingredients and highlighting the abundance of flavorful produce, seafood, and local ingredients available in the Lowcountry. Edison offers local craft beers, and an extensive wine list. Outdoor dining is available on Edison's secluded patio; indoor seating is offered in the restaurant's tastefully decorated dining room. Seating is available at the bar and our community table on a first-come, first-serve basis. Reservations are highly recommended, and you can book on Resy or email us at . info@edisonjamesisland.com Walk-ins are always welcome, but space is subject to availability. There is plenty of free parking available in Edison's private lot. ​ We can't wait to serve you! - hours - wednesday - sunday 4:00 - 9:00\n\nclosed monday + tuesday - contact - info@edisonjamesisland.com 843.872.5500 future bookings on Resy - sit - - indoor dining - - bar seating - - patio dining - -carryout - - sip - - wine wednesdays -\n- all bottles half price - - follow - instagram: edison.jamesisland\nfacebook: edisonjamesisland - inquire - - large parties/private events - chelsea@edisonjamesisland.com bottom of page",
      "hash": "be78434ba402",
      "downloadedAt": "2026-01-19T15:30:38.430Z",
      "trimmedAt": "2026-01-19T15:42:50.077Z",
      "sizeReduction": "99.7%"
    },
    {
      "url": "https://www.edisonjamesisland.com/menu",
      "text": "[Page Title: Menus | Edison James Island]\n\ntop of page EDISON CREATIVE CULINARY INVENTIONS DINNER SERVICE 4:00-9:00 \nwednesday - sunday indoor/outdoor dining (weather permitting)/carryout - reservations are strongly recommended for patio or indoor dining - the Edison Bar is available for walk-in guests on a first come, first serve basis reservations for parties of 6 or less: find us on Resy!\nfor large parties: please email info@edisonjamesisland.com to order carryout: 843.872.5500 CHEF'S DAILY SPECIAL SHRIMP N'DUJA PASTA ​ \nsautéed shrimp, Calabrian spiced salumi sauce, scarlet kale,\n\nbaby tomatoes, campanella pasta, crumbled goat cheese\n​ ​ 26 dinner libation sweets - join us - wine night at edison every wednesday - all wine bottles half price - kids menu reserve bottom of page",
      "hash": "d4d288b7c86c",
      "downloadedAt": "2026-01-19T15:30:38.516Z",
      "trimmedAt": "2026-01-19T15:42:50.120Z",
      "sizeReduction": "99.9%"
    }
  ],
  "sizeReduction": "99.7%"
}