{
  "venueId": "ChIJv49FSRB6_ogRSeBPUs9dyLw",
  "venueName": "Gaulart & Maliclet Fast and French Inc.",
  "venueArea": "Downtown Charleston",
  "website": "https://www.fastandfrenchcharleston.com/",
  "scrapedAt": "2026-01-19T16:12:35.348Z",
  "trimmedAt": "2026-01-19T16:13:34.825Z",
  "pages": [
    {
      "url": "https://www.fastandfrenchcharleston.com/charleston-gaulart-and-maliclet-fast-and-french-inc-menus",
      "text": "[Page Title: Gaulart & Maliclet Fast and French Inc. - Menus]\n\nSpecials",
      "hash": "6f7d198dbd6a",
      "downloadedAt": "2026-01-19T16:12:28.290Z",
      "trimmedAt": "2026-01-19T16:13:34.796Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "https://www.fastandfrenchcharleston.com/menu",
      "text": "[Page Title: Gaulart & Maliclet Fast and French Inc. - Food Menu]\n\nOur Menu\nBreakfast Lunch Soup Dinner Drinks Dessert MERCH BAR",
      "hash": "9891816b2911",
      "downloadedAt": "2026-01-19T16:12:28.294Z",
      "trimmedAt": "2026-01-19T16:13:34.808Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "https://www.fastandfrenchcharleston.com/",
      "text": "[Page Title: Gaulart & Maliclet - Authentic French Café & Restaurant in Charleston]\n\n× \nLet us host your special event!\n\nWhether a birthday party, office function or any other special occasion - we take care of all the fine details, bringing your event to life, just as you imagined.\n\nHost your next party or get together\nBook your party \nJob Listings - We're hiring! Call, email or submit an inquiry today to learn more!\nJob Listings Job Listings - We're hiring! Call, email or submit an inquiry today to learn more! \n98 Broad Street, Charleston, SC 29401\nmap marker pin Our Mission Is \nTo provide fresh, affordable, healthy, global cuisine with French flair in a social environment that encourages community and the Arts.\nPrivate Parties \nWhatever the occasion, our tailored service will bring your vision to life. Search no more we have a perfect place for you!\nparties book now About Us \nGaulart & Maliclet French Café opened its door during the summer of 1984 in Charleston, SC by artists Gwylene Gallimard & Jean-Marie Mauclet as a tool to build community through food. They remain advisors to the longtime employees that carry on their legacy. The shared tables that bring the height of the customer to the same height of the staff, the open kitchen, the focus on simple, fresh ingredients and our commitment to making fresh soups and specials daily are just as important today as they were when we opened. Charleston continues to expand outward and change demographically but the Café remains a place where people of all walks of life can gather, communicate, and enjoy a home cooked meal and an affordable glass of French Wine!\nour menu food menu \nGallery\n\nReviews\n\nreview by - Yelp\n\nMarty M:\n\nHave visited this great place for over 20 years, always outstanding. Be warned it is small, no reservations, friendly helpful staff and food that is delightful. My favorite lunch place in Charleston!\n\nreview by - Yelp\n\nShawna W:\n\nGreat service and excellent food. We were in from out of town and needed a quick bite to eat after walking all over all day. We were seated right away and our server popped right over. The food was delicious and quick. Definitely recommend!\n\nreview by - Yelp\n\nNicolas A:\n\nGreat place to eat! Their logo doesn't lie -Fast and French- because it really is. Food is amazing especially for the low price you're paying. I always order take out so don't know how to service is, but just based off the food, its spectacular!\n\nreview by - Yelp\n\nDavid Q:\n\nThis place is a hidden gem and known as a locals spot. We go to this place at least once a week. You can't find a better deal in downtown and the staff is always amazing. Specials change daily and then they have a rotating ethic cuisine weekly special. These reasons keep us coming back over and over.\n\nreview by - Yelp\n\nSarah B:\n\nGaulart & Maliclet is the best local eatery in Charleston. The menu features authentic French cuisine that is fresh and delicious. I've never had a bad meal here and it is the one restaurant I make sure to visit every time I come to town...\nStop reviews carousel Play reviews carousel \nA Love Affair Since 1984!\nOur Menu \nLife is Too Short to Drink Bad Wine\nOrder \nRoam Around the World at G&M\nOur Menu \nIt's Good Everyday!\n\nFondue Rendezvous Nightly!\n\nA Tree. A Rock. A Cloud. The Cafe.\nDot slide navigation number 1 Dot slide navigation number 2 Dot slide navigation number 3 Dot slide navigation number 4 Dot slide navigation number 5 Dot slide navigation number 6 slideshow start stop playing \nNewsletter\n\nLocation\n\n98 Broad Street\n\nCharleston, SC\n\n29401\n\nHours\n\nOur hours are:\n\nSunday 8am to 8pm\n\nMonday 8am to 8pm\n\nTuesday 8am to 8pm\n\nWednesday 8am to 8pm\n\nThursday 8am to 9pm\n\nFriday 8am to 9pm\n\nSaturday 8am to 9pm\n\nWhat are yours?\n\nFind us on...\nFacebook page Instagram page Yelp page \nContact us\n(843)-577-9797 info@fastandfrenchcharleston.com \nPowered by:\nWebsite design, Social Media marketing and Email marketing provided by SpotHopper. × \nNewsletter",
      "hash": "d8bfe9023e74",
      "downloadedAt": "2026-01-19T16:12:28.297Z",
      "trimmedAt": "2026-01-19T16:13:34.825Z",
      "sizeReduction": "97.4%"
    }
  ],
  "sizeReduction": "99.1%"
}