{
  "venueId": "ChIJT-MalXB5_ogRNURlvxHjO7U",
  "venueName": "Jiang’s Asian Kitchen",
  "venueArea": "West Ashley",
  "website": "http://www.jiangsasiankitchen.com/",
  "scrapedAt": "2026-01-19T16:12:33.008Z",
  "trimmedAt": "2026-01-19T16:13:01.735Z",
  "pages": [
    {
      "url": "http://www.jiangsasiankitchen.com/",
      "text": "[Page Title: Jiang's Asian Kitchen Restaurant, Charleston, SC 29412, Online Order, Take Out]\n\nWelcome\n\nto Jiang's Asian Kitchen Restaurant\n\nLocated at 520 Folly Rd, Charleston, SC 29412. Our restaurant offers a wide of authentic Chinese & Japanese dishes such as Kung Pao Chicken, Moo Shu Pork, Pepper Steak, Eel Cucumber Roll, Hibachi Steak.\n Try our food and service today. Come in for a Chinese or Japanese Lunch Special or during evenings for a delicious dinner. You can also online order your favorite Food. If you have any suggestion to our food or service, please go to the customer feedback page and leave us your suggestion or review.\n\nMonday: 10:30 am - 9:00 pm\nTuesday: 10:30 am - 2:00 pm\nWed. - Sun.: 11:00 am - 9:00 pm\n\n 520 Folly Rd, James Island, Charleston, SC 29412\n Tel.: (843) 406-0508   (843) 406-0078\nOpen Hour Address",
      "hash": "695d07cb4875",
      "downloadedAt": "2026-01-19T16:12:20.539Z",
      "trimmedAt": "2026-01-19T16:13:01.599Z",
      "sizeReduction": "94.4%"
    },
    {
      "url": "http://www.jiangsasiankitchen.com/catalog.aspx?cid=37",
      "text": "[Page Title: Jiang's Asian Kitchen Restaurant, Charleston, SC 29412, Menu, Dine In, Take Out, Coupon discount]\n\nHot & Spicy   \n Price May Change without Notice\n\nAppetizers\n1. Pork Egg Roll Pork & Cabbage 2.00 2. Shrimp Egg Roll Shrimp & Cabbage 2.00 3. Spring Rolls (2) Shrimp, Pork and Vegetable 3.90 4. Edamame Steamed Young Soybean 5.95 5. Fresh Local Wrap Crab, Shrimp, Lettuce, Carrots, Cucumber with Spicy Mayo 7.95 6. Gyoza Pan Fried Pork Dumpling 7.95 7. Steamed or Fried Dumplings 8.95 8. Fried Chicken Wings 8.95 9. Shrimp Tempura 9.95 10. Crispy Cheese Wonton 8.95 11. Chicken Skewers 8.95 12. Fried Chinese Shrimp 9.95 13. BBQ Boneless Ribs 18.95 14. BBQ Spare Ribs 19.95 \nSoup and Salad\n15. Miso Soup (S) 3.00 (L) 6.00 16. Hot and Sour Soup Mushroom, tofu, pork (S) 4.00 (L) 6.95 17. Garden Salad w. Ginger Sauce 5.95 18. Seaweed Salad 6.95 19. Wonton Soup (S) 4.00 (L) 6.95 20. Egg Drop soup (S) 4.00 (L) 6.95 21. Spicy Kani Salad 7.95 22. Spicy Blue Fin Tuna Avocado Salad 13.95 \nMaki Rolls\n23. Cucumber Maki Roll 5.95 24. Avocado Maki Roll 5.95 25. Kani Maki Roll 5.95 26. Spicy Kani Maki Roll 5.95 27. Salmon Maki Roll 6.95 28. Tuna Maki Roll 7.95 29. Eel Maki Roll 7.95 30. Spicy Salmon Maki Roll 7.95 31. Spicy Tuna Maki Roll 7.95 \nClassic Rolls\n32. California Roll 7.95 33. Salmon Roll 8.95 34. Tuna Roll 8.95 35. Eel Roll 8.95 36. Crunch Crab Roll 8.95 37. Tempura Shrimp Roll 8.95 38. Philadelphia Roll 8.95 39. Spicy Salmon Roll 8.95 40. Spicy Tuna Roll 8.95 \nSashimi or Nigiri\n\nSashimi\n41. Crab 6.95 42. Ebi (Shrimp) 6.95 43. Salmon 7.95 44. Bluefin Tuna 9.95 45. Eel 8.95 \nNigiri\n46. Crab 6.95 47. Masago 6.95 48. Eel 8.95 49. Ebi (Shrimp) 6.95 50. Spicy Crab 6.95 51. Salmon 7.95 52. Bluefin Tuna 9.95 \nSpecialty Rolls\n53. Dragon Roll Tempura shrimp and cucumber, topped with avocado, masago and eel sauce and spicy mayo 12.95 54. Mango Salmon Roll Salmon, avocado, cucumber, and mango, topped with mango, salmon, masago and spicy mayo 13.95 55. Futomaki Salmon, bluefin tuna, crab, avocado, cucumber, topped with spicy mayo 14.95 56. Rainbow Roll Crab and cucumber, topped with avocado, salmon, tuna, shrimp and crispy onions, eel sauce and spicy mayo 15.95 57. Volcano Roll Crab, avocado, and cream cheese, topped with spicy crab and spicy mayo 14.95 58. Tiger Roll Tempura shrimp, avocado and cucumber, topped with mango, crab and spicy mayo and eel sauce 14.95 59. Sunset Roll Tempura shrimp, cucumber, and avocado, topped with avocado, salmon, eel sauce and spicy mayo 15.95 60. Local Roll Soft shell crab, crab salad, avocado, cucumber, topped with masago, eel sauce and spicy mayo 15.95 61. Stuffed Tempura Shrimp Roll Tempura shrimp, crab, cucumber and avocado, topped with more crab, tempura flakes, spicy mayo and eel sauce 14.95 62. Salmon Delight Spicy salmon, avocado and cream cheese topped with salmon, avocado, tempura flakes and spicy mayo 15.95 63. Koi Eel Roll Tempura shrimp, avocado and cucumber, topped with sliced eel, masago, spicy mayo and eel sauce. 16.95 64. Tuna Lovers Roll Bluefin tuna, avocado, and cucumber, topped with extra bluefin tuna, avocado, crispy onions, spicy mayo and eel sauce 16.95 65. Triple Crunch Roll Tempura shrimp, spicy crab and cucumber, topped with avocado, salmon, tuna, crunch tempura flakes, spicy mayo and eel sauce 16.95 \nSushi Platter\n52 Pieces Classic Platter Assorted classic rolls, maki rolls, and nigiri 69.95 52 Pieces (Specialty) Platter Assorted specialty rolls, classic rolls, maki rolls and nigiri 79.95 56 Pieces Combo Platter Assorted specialty rolls, classic rolls, edamame, and seaweed salad 89.95 \nHibachi Entree\nAll Served with Fried Rice, Shrimp Sauce and Vegetables A1. Hibachi Tofu 12.95 A2. Teriyaki Chicken 12.95 A3. Hibachi Shrimp 14.95 A4. Hibachi Steak 14.95 A5. Hibachi Scallop 15.95 A6. Hibachi Salmon 16.95 A7. Combination Dinner Choice of Two Items: Steak, Shrimp, Chicken or Scallop 17.95 \nBento Box\nAll Served with Miso Soup 78. Bento Box 1 Teriyaki Chicken or Shrimp, Spicy Kani Roll, Gyoza, Fried Rice, Egg Roll 17.95 79. Bento Box 2 6 pcs of any Classic Roll, 3 pcs Sashimi, Edamame, 2 pcs Tempura Shrimp, Edamame or Seaweed Salad, Spring Roll\nPlease fill your Classic Roll choice in the Text area Special Cooking Request 18.95 \nKitchen Entrees\nAll Served with White Rice or Fried Rice \nPoultry\n1. General Tso's Chicken 14.95 2. Orange Chicken 14.95 3. Sesame Chicken 14.95 4. Sweet & Sour Chicken 13.95 5. Moo Goo Gai Pan 13.95 6. Chicken w. Broccoli 13.95 7. Chicken w. Mixed Vegetable 13.95 8. Chicken w. Cashew Nuts 13.95 9. Curry Chicken 13.95 10. Mongolian Chicken 13.95 11. Chicken w. Garlic Sauce 13.95 12. Hunan Chicken 13.95 13. Szechuan Chicken 13.95 \nBeef\n14. Pepper Steak 14.95 15. Beef with Broccoli 14.95 16. Beef with Mixed Vegetable 14.95 17. Beef with Mushroom 14.95 18. Curry Beef 14.95 19. Mongolian Beef 14.95 20. Beef with Garlic Sauce 14.95 21. Hunan Beef 14.95 22. Szechuan Beef 14.95 \nSeafood\n23. Shrimp with Lobster Sauce 15.95 24. Shrimp with Broccoli 15.95 25. Shrimp with Mixed Vegetables 15.95 26. Curry Shrimp 15.95 27. Kung Pao Shrimp 15.95 28. Shrimp with Garlic Sauce 15.95 29. Hunan Shrimp 15.95 30. Szechuan Shrimp 15.95 \nKitchen Dinner Combination\nServed with Pork Fried Rice and Egg Roll D1. Pork or Chicken Lo Mein 12.95 D2. Pepper Steak 12.95 D3. Sweet & Sour Chicken 12.95 D4. Chicken w. Broccoli 12.95 D5. Chicken or Shrimp w. Mixed Vegetables 12.95 D6. Chicken or Beef w. Mushroom 12.95 D7. Chicken or Beef w. Curry Sauce 12.95 D8. Chicken or Beef w. Garlic Sauce 12.95 D9. Hunan Chicken or Beef 12.95 D10. Szechuan Chicken or Beef 12.95 D11. General Tso's Chicken 12.95 D12. Sesame Chicken 12.95 \nRice and Noodle Dishes\n\nFried Rice\n31. Vegetable Fried Rice 9.95 32. Roast Pork Fried Rice 9.95 33. Chicken Fried Rice 9.95 34. Beef Fried Rice 10.95 35. Shrimp Fried Rice 10.95 36. House Special Fried Rice 12.95 \nLo Mein or Mei Fun\nB1. Chicken, Pork or Shrimp Lo Mein Shrimp $1 extra 11.95 B2. Chicken, Pork or Shrimp Mei Fun Shrimp $1 extra 11.95 B3. Singapore Mei Fun Combination of Chicken, Pork, and Shrimp with Curry Sauce 13.95 \nVegetarian Entrees\nAll Served with White Rice or Fried Rice 37. Vegetarian's Delight 11.95 38. Bean Curd w. Mixed Vegetables 12.95 39. Steamed Mixed Vegetables 11.95 40. Mixed Vegetables with Garlic Sauce 11.95 41. Bean Curd w. Garlic Sauce 12.95 42. General Tso's Tofu 13.95 \nEgg Foo Young\nAll Served with White Rice or Fried Rice 43. Vegetable Egg Foo Young 11.95 44. Roast Pork Egg Foo Young 11.95 45. Chicken Egg Foo Young 11.95 46. Shrimp Egg Foo Young 12.95 \nKitchen Chef s Specialty\nServed with White Rice or Fried Rice S1. Happy Family 17.95 S2. Seafood Delight 17.95 S3. Kung Pao Delight 16.95 S4. Hot & Spicy Delight 16.95 S5. Triple Delight Garlic Style 16.95 S6. Hunan Triple Delight 16.95 S7. Szechuan Triple Delight 16.95 \nRice Combinations\nChoice of Chicken, Pork or (Shrimp Fried Rice $1) L1. Chicken Wings w. Fried Rice 12.95 L2. B.B.Q. Spare Ribs 13.95 L3. B.B.Q. Boneless Ribs 13.95 L4. Fried Chinese Shrimp 13.95 L5. Chicken Skewers 13.95 \nBeverages\nSoda 2.50 Tea 2.50 Hot Tea 2.00 \nChinese Party Tray\nFried Rice 34.95 Lo Mein 35.95 30 Egg Rolls 40.95 Wings (20 pcs) 40.95 Chicken w. Mixed Vegetable 40.95 General Tso's Chicken 48.95 \nMy Order\n\nSubtotal:\n$0.00 \nChange Order\n\nCategories\nAll Day Menu Lunch Menu Appetizers Soup and Salad Maki Rolls Classic Rolls Sashimi or Nigiri Specialty Rolls Sushi Platter Hibachi Entree Bento Box Kitchen Entrees Kitchen Dinner Combination Vegetarian Entrees Egg Foo Young Kitchen Chef s Specialty Rice and Noodle Dishes Rice Combinations Beverages Chinese Party Tray",
      "hash": "c8696c3562c6",
      "downloadedAt": "2026-01-19T16:12:20.541Z",
      "trimmedAt": "2026-01-19T16:13:01.735Z",
      "sizeReduction": "94.0%"
    }
  ],
  "sizeReduction": "94.0%"
}