{
  "venueId": "ChIJvdDJE7h7_ogRhXpsg8WMFCo",
  "venueName": "Hugh-Baby's BBQ & Burger Shop",
  "venueArea": "West Ashley",
  "website": "https://www.hughbabys.com/",
  "scrapedAt": "2026-01-19T16:12:35.407Z",
  "trimmedAt": "2026-01-19T16:13:35.177Z",
  "pages": [
    {
      "url": "https://www.hughbabys.com/",
      "text": "[Page Title: Hugh Baby's | Discover & Enjoy Now]\n\n0 \nSCRATCH MADE GOODNESS.\nSCRATCH MADE GOODNESS. SCRATCH MADE GOODNESS. Learn more \nTreat yourself in the New Year with our Cookies & Cream Milkshake!\n\nHand-spun with pieces of Oreo® cookies and layered with even more on top, its the perfect way to keep the post holiday blues away.\nOrder Now WELCOME TO HUGH-BABY’S Hugh-Baby’s brings people together from all over to enjoy some of life’s simplest pleasures. We take great care in preparing signature items that are scratch-made, cooked to order, and speak to our mid-South roots. We’re all about celebrating the classics, delivering value, and throwing back to the beloved local barbecue andburger spots of our youth. ORDER ONLINE Y’ALL COME VISIT Visit Hugh-Baby’s in Nashville, TN, or Charleston, SC. Open Daily 11AM - 9PM Charlotte Ave. Nashville 4816 Charlotte Avenue,Nashville, TN 37209 Order Online Learn More Order Catering Hunters Station EAST Nashville 975 Main Street,Nashville, TN 37206 Order Online Learn More Order Catering BERRY HILLNashville 718 Thompson Lane,Nashville, TN 37204 Order Online Learn More Order Catering CharlestonSouth Carolina 1028 St. Andrews Blvd,Charleston, SC 29407 Order Online Learn More Order Catering \nMade from scratch, Daily\nHugh-Baby’s burgers feature a proprietary blend of premium beef, ground fresh daily. Our slow-smoked Pulled Pork, Turkey, and Bologna follow the time-honored traditions of Memphis barbecue, and we smoke all the meat for our BBQ Sandwiches in-house every single day. Crispy, golden French Fries, gas station-style Hot Dogs, a killer house-made Veggie Burger, the Depression-era “Slugburger” (made famous in Corinth, Mississippi!), and hand-spun Milkshakes round out our intentionally small, straightforward menu. Our Menu \nFOLLOW HUGH-BABY’S ON INSTAGRAM\nFOLLOW US",
      "hash": "231a7bcf0233",
      "downloadedAt": "2026-01-19T16:12:28.467Z",
      "trimmedAt": "2026-01-19T16:13:35.128Z",
      "sizeReduction": "99.6%"
    },
    {
      "url": "https://www.hughbabys.com/visit",
      "text": "[Page Title: Visit | Dine, Order, Enjoy Today — Hugh Baby's]\n\n0 Dine-In, PICK UP, and Delivery All Of Our Locations Offer Enjoy from anywhere you’d like! Warm, genuine Southern hospitality is at the heart of what we do. We welcome you to enjoy our food in our dining rooms, patios, or in the comfort of your own home. We offer multiple ways to order: at the Counter, Drive-Thru, Walk-Up Windows, Online, and via Delivery Partners. We hope to see you soon! Open Daily 11AM - 9PM \nCHARLOTTE AVE.\n\n4816 Charlotte AvenueNashville, TN 37209\nMenu & More Order Catering Order Pickup Order Delivery \nEAST NASHVILLE\n\n975 Main StreetNashville, TN 37206\nOrder Pickup Order Delivery Order Catering Menu & More \nBERRY HILL, NASHVILLE\n\n718 Thompson Ln.Nashville, TN 37204\nMenu & More Order Catering Order Pickup Order Delivery \nCHARLESTON, SOUTH CAROLINA\n\n1028 Saint Andrews BoulevardCharleston, SC 29407\nOrder Catering Menu & More Order Delivery Order Pickup",
      "hash": "64710c63955c",
      "downloadedAt": "2026-01-19T16:12:28.472Z",
      "trimmedAt": "2026-01-19T16:13:35.153Z",
      "sizeReduction": "99.7%"
    },
    {
      "url": "https://www.hughbabys.com/menu",
      "text": "[Page Title: Menu | Order Delicious Burgers and More Today — Hugh Baby's]\n\n0 OUR MENU BURGERS \nHugh-Baby’s burgers feature a custom blend of premium beef.Ground fresh daily & cooked to order.+\nAdd bacon or sliced cheese to any burger+Add an extra patty*Heirloom tomatoes only available while in season. CHEESEBURGER \nBeef Patty, American Cheese, Pickles, Lettuce, Onion, Heirloom Tomato, Comeback Sauce\nDOUBLE CHEESEBURGER \nDouble Beef Patty, Double American Cheese, Pickles, Lettuce, Onion, Heirloom Tomato, Comeback Sauce\nBBQ BURGER \nBeef Patty, American Cheese, Slow-Smoked Pulled Pork, Grilled Onions, Hugh-Baby’s BBQ Sauce\nSHROOM & SWISS BURGER \nSwiss Cheese, Smoked Mushrooms, Yellow Mustard, Mayo\nVEGGIE BURGER* \nHousemade Veggie Patty with Smoked Black Beans, Mushrooms, & Cashews Patty, Swiss Cheese, Pickles, Lettuce, Onion, Heirloom Tomato, Comeback Sauce\n*Contains eggs & nuts! THE WORLD FAMOUS SLUGBURGER \nMade famous in Corinth, MS! Deep-Fried Ground Pork & Soy Meal, Pickles, Chopped Onions, Yellow Mustard\nOnly available on Fridays! BBQ \nWe follow the time-honored traditions of slow-smokingour pulled pork, turkey, and bologna over hickory coals every single day.\nPULLED PORK SANDWICH \nCole Slaw, Hugh-Baby’s BBQ Sauce\nSMOKED TURKEY CLUB \nSwiss Cheese, Bacon, Lettuce, Heirloom Tomato, Honey Mustard\nBOLOGNA SANDWICH \nYellow Mustard, Pickles, Onion\nSANDWICHES \nSouthern Fried Goodness\nFRIED CHICKEN SANDWICH \nCrispy, Hand-Breaded Fried Chicken Thigh, Pickles,Comeback Sauce\nFRIED CATFISH SANDWICH \nCornmeal-Breaded Fried Catfish Filet, Pickles, Coleslaw,Sliced Onions, Comeback Sauce\nOnly offered at Charleston location! HOT DOGS \nAn ode to the quintessential gas station hot dogs of our youth.\nBALL PARK DOG \nSweet Relish, Yellow Mustard\nSLAW DOG \nCole Slaw, Chopped Onions, Yellow Mustard,Chili Sauce\nCHILI CHEESE DOG \nChili Sauce, Chopped Onions, Yellow Mustard,American Cheese\nPICKWICK DOG \nGrilled Onions and Jalapeños, Yellow Mustard, Mayo,Hugh-Baby’s BBQ Sauce\nFRIES FRENCH FRIES \nCrispy, Golden French Fries\nCHILI CHEESE FRIES \nFrench Fries, American Cheese, Chili Sauce\nSHAKES & DRINKS \nHand-spun milkshakes featuring scratch-made chocolate, vanilla, strawberry, & seasonal flavors.\nMILKSHAKES \nHouse-made Vanilla, Chocolate, or Strawberry topped with Whipped Cream and a Cherry\nFRESH-SQUEEZED LEMONADE \nFresh-Squeezed Daily\nICED TEA \nSweet or Unsweet\nCO'-COLAS \nCoca-Cola, Diet Coke, Sprite, Dr. Pepper, Powerade, Mello Yello, Orange Drink, Barq’s Root Beer\nKIDS DRINKS \nSoft Drink Choice or Iced Tea\nBOTTLED WATER Our menu is subject to change. Please alert our team to any allergies. View our Allergy Menu here . Our kitchen uses peanuts, tree nuts, soy, milk, eggs and wheat. While we take steps to minimize ingredient crossover, we're unable to guarantee our entire menu is safe for people with these allergies. Thank you!",
      "hash": "9f5cb6cae324",
      "downloadedAt": "2026-01-19T16:12:28.475Z",
      "trimmedAt": "2026-01-19T16:13:35.177Z",
      "sizeReduction": "98.5%"
    }
  ],
  "sizeReduction": "99.4%"
}