{
  "venueId": "ChIJQXTj_0l6_ogRZIeXJcNIPvA",
  "venueName": "Aqua Terrace Roof-Top Bar",
  "venueArea": "Downtown Charleston",
  "website": "https://www.marriott.com/en-us/dining/restaurant-bar/chsmc-charleston-marriott/5180521-aqua-terrace-roof-top-bar.mi",
  "scrapedAt": "2026-01-19T16:12:32.692Z",
  "trimmedAt": "2026-01-19T16:12:58.830Z",
  "pages": [
    {
      "url": "https://www.marriott.com/meeting-event-hotels/meeting-planning.mi",
      "text": "[Page Title: Meetings & Events | Hotel Event Spaces | Marriott Bonvoy]\n\nSkip To Content Close Dialog Close Dialog Close Dialog \nPlease select your preferred language\n\nTHE AMERICAS\nEnglish Español Français Português \nASIA and OCEANIA\nEnglish Bahasa Indonesia 简体中文 繁體中文 日本語 한국어 ภาษาไทย Tiếng Việt हिंदी \nINTERNATIONAL\nEnglish العربية \nEUROPE\nDansk Deutsch Español Français Ελληνικά Italiano Nederlands Norsk Русский Português Polski Suomi Svenska Türkçe English Close Dialog 0 Points Buy Points Opens a new window Overview Activity My Trips Favorites Promotions Profile Member Benefits SIGN OUT \nMarriott Bonvoy™ Credit Cards\n\nMarriott Bonvoy™ Credit Cards\n​​​​​​ \nEvent Experiences That Stay With You\n\nDiscover inspiring venues and curated details that make meetings memorable—plan your next event at our hotel brands.\n\nConnect with Confidence\nElevate your event with our expert services and innovative tools and technology. \nPlanning Tips\n\nSustainability\n\nEarn Points\n\nWhy Marriott Bonvoy?\nOffers \nMake Your Events More Rewarding with Marriott Bonvoy\nExplore Offers \nBusiness Meetings\nTransform your meeting with our extensive resources and tools. Explore Now Standout Events \nPlan Your Meeting\nTHINK BIG \nConferences & Conventions\nSMALL BUT MIGHTY \nSmall Meetings\nVISIONARY VENUES \nSpaces & Venues\nCATER TO ALL TASTES \nFood & Drink\nSTAY CONNECTED \nTechnology & Tools\n\nWeddings\nNo one does “I do” like we do. Explore Now Out of This World \nDazzling Destinations\nYour Big Day \nStart Planning\nFind Your Match \nSpaces & Venues\nSavor Every Moment \nFood & Drink\nSeal Your Love Story \nCeremonies\nRaise a Toast \nReceptions\n\nSocial Events\nCelebrate special moments, big and small. Explore Now RISE TO THE OCCASION \nPlan Your Social Event\nBON APPETIT \nFood & Drink\nGET FESTIVE \nFamily Gatherings & More\nIN STYLE \nSpaces & Venues\nGO GLOBAL OR LOCAL \nDestinations\nGET COMFORTABLE \nAccommodations\n\nGroup Travel\nGreat times are waiting to happen. Explore Now GET TOGETHER \nPlan Your Group Travel\nTEAMWORK \nSports Teams\nGROUP GETAWAYS \nAssociations & Students\nTRAVEL INSPIRES \nDestinations\nROOM FOR ALL \nAccommodations\n\nHow to Book Your Event\nPlan seamlessly with our innovative tools and resources. Explore Now EXPERT PLANNING \nSubmit a Request for Proposal (RFP)\nBOOK INSTANTLY \nExplore Our Tools & Resources\n\nTrends & Highlights\nGet inspired: Trends, tips and more. Explore Now Connect Responsibly \nSustainable Meetings\nTop Tips \nPlan Small Events\nNew Strategies \nBleisure Business Travel\nNews You Can Use \nMarriott Bonvoy Events\n\nExplore Curated Experiences\n\nOptimize your next meeting and event with a space and style that’s just right.\nMarriott Hotels \nEvery Detail Counts\n\nAll your needs are taken care of by our dedicated planners from start to finish.\nExplore Now Westin \nWellness Meets Business\n\nDiscover meetings designed to inspire well-being and increase productivity.\nExplore Now Sheraton \nGather Together\n\nFlexible meeting and public spaces designed for productivity and collaboration.\nExplore Now JW Marriott \nMindful Meetings & Events\n\nCreating experiences so attendees feel fulfilled, connected and nourished.\nExplore Now Renaissance Hotels \nMeet the Unexpected\n\nGo beyond ordinary and embrace meetings infused with local flavor and flair.\nExplore Now Gaylord Hotels \nStep Into Wonder\n\nWith decades of expertise in meetings, we deliver moments that engage, inspire and build lasting relationships.\nExplore Now \nMarriott Bonvoy\n\nMarriott Bonvoy\nMarriott Bonvoy Overview Member Benefits Earn Points Redeem Points Marriott Bonvoy Credit Card Marriott Bonvoy Moments Opens a new window Marriott Bonvoy Insiders Opens a new window \nMeetings & Events\n\nMeetings & Events\nMeetings & Events Overview Business Meetings Weddings Social Events Group Travel \nDeals & Packages\n\nDeals & Packages\nDeals Hotel & Flight Packages Opens a new window Cars, Tours, Activities Opens a new window All-Inclusive Resorts & Vacations Opens a new window Marriott Vacation Club Offers Opens a new window Travel Experiences The Ritz-Carlton Yacht Collection Opens a new window Resorts Marriott Bonvoy Traveler Opens a new window \nOur Company\nAbout Marriott International Careers Investor Relations News CEO Tony Capuano’s Blog Our Stories Digital Accessibility \nWork With Us\nSmall & Midsize Business Program Travel Professionals Group Partners Hotel Development Affiliates \nFind Help\nHelp & Contact Us Look Up Reservation Global Reservation Phone Numbers Best Rate Guarantee Missing Stay Form Site Map \nPrivacy & Terms\nPrivacy Center Your Privacy Choices Terms of Use Program Terms & Conditions Sustainability in the Supply Chain Top Destinations Top Destinations Las Vegas Hotels Miami Hotels Chicago Hotels Tokyo Hotels Orlando Hotels Key West Hotels London Hotels New York Hotels San Diego Hotels Boston Hotels Myrtle Beach Hotels Austin Hotels Nashville Hotels Denver Hotels Maui Hotels San Francisco Hotels New Orleans Hotels San Juan Hotels Seattle Hotels Santa Barbara Hotels Palm Springs Hotels Paris Hotels Rome Hotels Amsterdam Hotels Virginia Beach Hotels Ocean City Hotels Kauai Hotels View All Hotels \nFollow Marriott Bonvoy\n\n© 1996 - 2025 Marriott International, Inc. All rights reserved. Marriott Proprietary Information\n\nEnglish\n\nSelect your language\n\nThe Americas\nEnglish Español Français Português \nAsia and Oceania\nEnglish Bahasa Indonesia 简体中文 繁體中文 日本語 한국어 ภาษาไทย Tiếng Việt हिंदी \nInternational\nEnglish العربية \nEurope\nDansk Deutsch Español Français Ελληνικά Italiano Nederlands Norsk Русский Português Polski Suomi Svenska Türkçe English",
      "hash": "3eff9ee9f405",
      "downloadedAt": "2026-01-19T16:12:19.558Z",
      "trimmedAt": "2026-01-19T16:12:58.110Z",
      "sizeReduction": "99.4%"
    },
    {
      "url": "https://www.marriott.com/loyalty/promotionCentral.mi",
      "text": "[Page Title: Welcome to Marriott Bonvoy]\n\nSkip to Content Close Dialog Close Dialog Close Dialog \nPlease select your preferred language\n\nTHE AMERICAS\nEnglish Español Français Português \nASIA and OCEANIA\nEnglish Bahasa Indonesia 简体中文 繁體中文 日本語 한국어 ภาษาไทย Tiếng Việt हिंदी \nINTERNATIONAL\nEnglish العربية \nEUROPE\nDansk Deutsch Español Français Ελληνικά Italiano Nederlands Norsk Русский Português Polski Suomi Svenska Türkçe English Close Dialog 0 Points Buy Points Opens a new window Overview Activity My Trips Favorites Promotions Profile Member Benefits SIGN OUT \nMarriott Bonvoy™ Credit Cards\n\nMarriott Bonvoy™ Credit Cards\n​​​​​​ \nWelcome to Marriott Bonvoy\n\nSign In\nEmail or Member Number Password Remember me \nSign In\nForgot password Activate online account \nJoin Marriott Bonvoy\n\nMembers receive complimentary Wi-Fi plus other exclusive benefits\n\nEARN FREE NIGHTS\n\nFREE WI-FI\n\nMEMBER RATES\n\nEXCLUSIVE OFFERS\nJoin for Free \nGet the app for the easiest way to book trips and track points\nTop Destinations Las Vegas Hotels Miami Hotels Chicago Hotels Tokyo Hotels Orlando Hotels Key West Hotels London Hotels New York Hotels San Diego Hotels Boston Hotels Myrtle Beach Hotels Austin Hotels Nashville Hotels Denver Hotels Maui Hotels San Francisco Hotels New Orleans Hotels San Juan Hotels Seattle Hotels Santa Barbara Hotels Palm Springs Hotels Paris Hotels Rome Hotels Amsterdam Hotels Virginia Beach Hotels Ocean City Hotels Pigeon Forge Hotels Lake Tahoe Hotels Los Angeles Hotels Gatlinburg Hotels Kauai Hotels Savannah Hotels Galveston Hotels Charleston Hotels Moab Hotels Lisbon Hotels Traverse City Hotels Waikiki Hotels Mexico City Hotels For Guests Best Rate Guarantee Marriott Bonvoy Moments Opens a new window Activities Opens a new window Marriott Insiders Opens a new window Marriott Bonvoy Traveler Opens a new window Travel Experiences Travel Insurance Opens a new window Shop Marriott Opens a new window Shop Westin Opens a new window Gift Cards Opens a new window Our Company About Marriott Careers Opens a new window Small & Midsize Business Program Travel Professionals Opens a new window Group Partners Opens a new window Developers Opens a new window Affiliates Investors Opens a new window News Opens a new window David Marriott's Blog Opens a new window Tony Capuano’s Blog Opens a new window Heart of the House Opens a new window Follow us Facebook Instagram Twitter Linkedin Youtube \n© 1996 – 2025 Marriott International, Inc. All rights reserved. Marriott Proprietary Information\nEnglish Careers Opens a new window Terms of Use Program Terms & Conditions Privacy Center Digital Accessibility Sustainability in the Supply Chain Site Map Hotel Site Map Help Opens a new window Close Dialog \nPlease select your preferred language\n\nTHE AMERICAS\nEnglish Español Français Português \nASIA and OCEANIA\nEnglish Bahasa Indonesia 简体中文 繁體中文 日本語 한국어 ภาษาไทย Tiếng Việt हिंदी \nINTERNATIONAL\nEnglish العربية \nEUROPE\nDansk Deutsch Español Français Ελληνικά Italiano Nederlands Norsk Русский Português Polski Suomi Svenska Türkçe English",
      "hash": "4bc60be91070",
      "downloadedAt": "2026-01-19T16:12:19.564Z",
      "trimmedAt": "2026-01-19T16:12:58.182Z",
      "sizeReduction": "99.3%"
    },
    {
      "url": "https://www.marriott.com/en-us/destinations/united-states/california/santa-barbara.mi",
      "text": "[Page Title: Hotels in Santa Barbara, CA | Marriott Bonvoy]\n\nSkip to Content Close Dialog Close Dialog Close Dialog \nPlease select your preferred language\n\nTHE AMERICAS\nEnglish Español Français Português \nASIA and OCEANIA\nEnglish Bahasa Indonesia 简体中文 繁體中文 日本語 한국어 ภาษาไทย Tiếng Việt हिंदी \nINTERNATIONAL\nEnglish العربية \nEUROPE\nDansk Deutsch Español Français Ελληνικά Italiano Nederlands Norsk Русский Português Polski Suomi Svenska Türkçe English Close Dialog 0 Points Buy Points Opens a new window Overview Activity My Trips Favorites Promotions Profile Member Benefits SIGN OUT \nMarriott Bonvoy™ Credit Cards\n\nMarriott Bonvoy™ Credit Cards\n​​​​​​ Destinationcombobox Destination 1 Night Find Hotels Destination Dates Home United States California Santa Barbara \nHotels in Santa Barbara, CA\n\nSanta Barbara, the epitome of the American Riviera, is a city that effortlessly marries the elegance of Spanish colonial architecture with the relaxed ambiance of a beach town. Its natural beauty, ranging from the pristine beaches to the breathtaking Santa Ynez Mountains, is simply unparalleled. Whether you're meandering through the charming downtown area, discovering the rich history of the Santa Barbara Mission, or immersing yourself in the vibrant arts and culture scene, there's something to captivate every visitor. The hotels of Marriott Bonvoy in Santa Barbara are strategically located to serve as your perfect retreat, offering amenities designed to enhance your comfort and enjoyment during your stay.\n\nA stay at a Marriott Bonvoy hotel in Santa Barbara places you within reach of the city’s celebrated wine country, lively farmer’s markets, and a variety of dining experiences. Many of our hotels are located near popular attractions such as Stearns Wharf, the Santa Barbara Zoo, and the historic Presidio. Whether you're visiting for a romantic retreat, a family vacation, or a business trip, our properties offer the services you need and the locations you want, ensuring that your time in Santa Barbara is nothing short of exceptional.\nSearch All Hotels in Santa Barbara, CA All Filters Price Amenities Brands \nShowing 1-8 of 19 hotels\n\nSort by:\n\nDistance\nDrift Santa Barbara, a Member of Design Hotels™ 0.3 mi from destination View Details 251 USD / night Book Now Moxy Santa Barbara 3.6 (205 reviews) \n|\n0.5 mi from destination \nExperience the Ultimate Blend of Funk and Fun at Moxy Santa Barbara!\nView Details 244 USD / night Book Now Courtyard by Marriott Santa Barbara Downtown 4 (302 reviews) \n|\n0.8 mi from destination \nSanta Barbara Downtown: walk to dozens of restaurants, theaters, museums and local attractions.\nView Details 264 USD / night Book Now The Steward, Santa Barbara, a Tribute Portfolio Hotel 3.7 (275 reviews) \n|\n6.8 mi from destination \nAll-suites hotel within lush garden setting with local fare at Terra and near SBA Airport and UCSB.\nView Details 244 USD / night Book Now Residence Inn by Marriott Santa Barbara Goleta 4.5 (663 reviews) \n|\n8.4 mi from destination \nEnjoy modern suites with full kitchens at Residence Inn Santa Barbara Goleta near UCSB\nView Details 273 USD / night Book Now Courtyard by Marriott Santa Barbara Goleta 4.2 (818 reviews) \n|\n9.8 mi from destination \nRelax at Marriott Goleta near Santa Barbara Airport with Wi-Fi, pool and The Bistro cafe.\nView Details 254 USD / night Book Now \nFULLY RENOVATED\nThe Ritz-Carlton Bacara, Santa Barbara 3.9 (3245 reviews) \n|\n12.7 mi from destination \nSanta Barbara hotel with unmatched luxury featuring breathtaking ocean views along the Gaviota Coast\nView Details 755 USD / night Includes 60 USD / night Resort Fee Book Now Ventura Beach Marriott 4 (1646 reviews) \n|\n26.4 mi from destination \nPet-friendly hotel in Ventura, CA that is walking distance from San Buenaventura State Beach.\nView Details 195 USD / night Book Now Previous 1 2 3 Next \nExplore Santa Barbara\n\nCheck out our travel tips before booking your hotel.\n\nNature\n\nCulture\n\nClimate\n\nTransport\n\nKids\n\nFor those who appreciate the great outdoors, Santa Barbara is a dream come true. The city's coastline is a vision of beauty, complemented by the majestic mountains that serve as a backdrop. A short boat ride to the Channel Islands National Park presents a unique opportunity to explore five untouched islands, each with its own network of trails, wildlife, and breathtaking vistas. For a more serene adventure, the Santa Barbara Botanic Garden is a haven of peace, with its indigenous plants and meandering paths offering a perfect escape. The city's beaches, from East Beach to Arroyo Burro Beach, are ideal for sunbathing, swimming, and beachcombing, while the more adventurous can try their hand at surfing or paddleboarding.\n\nIf you're more of a hill person, the Los Padres National Forest is a stone's throw away, with a vast trail network for hikers, bikers, and equestrians. Its landscape, from chaparral to oak woodlands, is a scenic playground. In town, the Alice Keck Park Memorial Garden is a local secret, ideal for a tranquil bird-watching and picnic spot. Whether you're after a day of beachside bliss or a mountain trail adventure, Santa Barbara's natural charm is bound to captivate and energize you.\nThis page uses AI-generated content, which may contain inaccuracies. Please verify key details as needed. \nSanta Barbara's allure lies in its seamless fusion of Spanish colonial heritage and a relaxed coastal ambiance, creating a destination that is both distinctive and delightful. A stay at one of our Santa Barbara hotels is an invitation to immerse yourself in the city's rich tapestry, from the grandeur of the Mission Santa Barbara to the time-honored El Paseo district, where art galleries, boutiques, and eateries are nestled in historic adobe structures. Our hotels are the perfect launchpad to explore the city's dynamic arts scene, with convenient proximity to the Santa Barbara Museum of Art and the vibrant Funk Zone, renowned for its mix of galleries, tasting rooms, and creative spaces.\n\nSanta Barbara’s commitment to sustainability and the arts is evident in the city’s many festivals and events. The Santa Barbara International Film Festival and the Summer Solstice Celebration are just two examples of the many events that bring the community together to celebrate film, music, and the environment. After a day of exploring the city’s cultural offerings, return to your Marriott Bonvoy hotel and relax in the comfort of your guest room or suite. Many of our hotels offer amenities such as outdoor pools, beautiful gardens, and on-site dining that capture the essence of this sun-soaked city.\nThis page uses AI-generated content, which may contain inaccuracies. Please verify key details as needed. \nWith its Mediterranean climate, Santa Barbara is a year-round destination, offering warm, dry summers and mild, wet winters. From June through August, the city sees plenty of sunshine and temperatures in the 70s to 80s, providing the perfect conditions for beach days and outdoor adventures. While the mornings may start with a marine layer, it typically burns off by midday, leaving you with the ideal weather to explore. Our Marriott Bonvoy hotels in Santa Barbara offer a variety of amenities, including pools and beachfront access, so you can make the most of the summer sun.\n\nSanta Barbara's winters, from December to February, are mild and enjoyable, with daytime temperatures hovering around 60 and nighttime temperatures dropping to around 40. This season brings more rain, which helps keep the city's landscapes green and vibrant. Spring and fall, from March to May and September to November, respectively, are characterized by beautiful, temperate weather with temperatures in the 60s to 70s. These seasons are perfect for exploring the city's many parks, gardens and coastal trails, as well as attending festivals and events. Marriott Bonvoy hotels are conveniently located to provide easy access to all of Santa Barbara's seasonal highlights, ensuring a memorable visit no matter when you come.\nThis page uses AI-generated content, which may contain inaccuracies. Please verify key details as needed. \nWhen you visit Santa Barbara, you have a wealth of transportation options to choose from, ensuring that getting around the city is both convenient and enjoyable. Santa Barbara Airport is a popular entry point, offering flights from major hubs and connecting travelers to the heart of the city via taxis, ride-sharing services, and the Santa Barbara Airporter shuttle. For those arriving by land, the city is accessible via Amtrak and Greyhound, with stations centrally located. Driving into Santa Barbara is also a breeze, thanks to the well-maintained coastal highways and scenic routes.\n\nOnce in Santa Barbara, you'll find a variety of transportation options to help you explore the city. The Santa Barbara Metropolitan Transit District (MTD) offers an extensive network of bus routes that can take you to the beach, downtown, and other popular areas and attractions. Taxis and ride-sharing services like Uber and Lyft are also available for a more direct route. Many travelers also choose to rent a car, with several rental agencies located at the airport and throughout the city. Santa Barbara's compact and walkable downtown area makes it easy to explore local shops, restaurants, and attractions on foot, and many of our Marriott Bonvoy properties are located in prime areas for walking. Whether you're planning a leisurely stroll or a more adventurous day trip, Santa Barbara has a transportation option to fit your needs.\nThis page uses AI-generated content, which may contain inaccuracies. Please verify key details as needed. \nSanta Barbara is a haven for families seeking to craft cherished memories. Begin your journey at the Santa Barbara Zoo, where your little ones can marvel at over 500 animals, from the playful otters to the majestic giraffes, and even partake in the Junior Zoologist Program. Then, for some beachside fun, make your way to Leadbetter Beach, where the gentle waves and powdery sand are an invitation to build sandcastles and paddle in the shallows. The beachfront also boasts a playground, ensuring hours of entertainment for your children.\n\nFor a blend of fun and education, the Santa Barbara Museum of Natural History is a must-see, with its interactive exhibits like the Dinosaur Hall and the sea life touch tank. The Ty Warner Sea Center is another great place for kids to learn about marine life, with its hands-on activities and educational programs. In the evening, take the family to the Arlington Theatre for a movie under the stars, or enjoy a peaceful walk through the Santa Barbara Botanic Garden, where you’ll find nature trails and picnic areas.\nThis page uses AI-generated content, which may contain inaccuracies. Please verify key details as needed. \nOur Company\nAbout Marriott International Careers Investor Relations News CEO Tony Capuano’s Blog Our Stories Digital Accessibility \nWork With Us\nSmall & Midsize Business Program Travel Professionals Group Partners Hotel Development Affiliates \nFind Help\nHelp & Contact Us Look Up Reservation Global Reservation Phone Numbers Best Rate Guarantee Missing Stay Form Site Map \nPrivacy & Terms\nPrivacy Center Your Privacy Choices Terms of Use Program Terms & Conditions Sustainability in the Supply Chain Top Destinations Top Destinations Las Vegas Hotels Miami Hotels Chicago Hotels Tokyo Hotels Orlando Hotels Key West Hotels London Hotels New York Hotels San Diego Hotels Boston Hotels Myrtle Beach Hotels Austin Hotels Nashville Hotels Denver Hotels Maui Hotels San Francisco Hotels New Orleans Hotels San Juan Hotels Seattle Hotels Santa Barbara Hotels Palm Springs Hotels Paris Hotels Rome Hotels Amsterdam Hotels Virginia Beach Hotels Ocean City Hotels Kauai Hotels View All Hotels \nFollow Marriott Bonvoy\n\n© 1996 - 2025 Marriott International, Inc. All rights reserved. Marriott Proprietary Information\n\nEnglish\n\nSelect your language\n\nThe Americas\nEnglish Español Français Português \nAsia and Oceania\nEnglish Bahasa Indonesia 简体中文 繁體中文 日本語 한국어 ภาษาไทย Tiếng Việt हिंदी \nInternational\nEnglish العربية \nEurope\nDansk Deutsch Español Français Ελληνικά Italiano Nederlands Norsk Русский Português Polski Suomi Svenska Türkçe English",
      "hash": "766c651207de",
      "downloadedAt": "2026-01-19T16:12:19.573Z",
      "trimmedAt": "2026-01-19T16:12:58.325Z",
      "sizeReduction": "98.3%"
    },
    {
      "url": "https://www.marriott.com/offers.mi",
      "text": "[Page Title: Hotel Deals & Promotions | Marriott Bonvoy]\n\nSkip to Content Close Dialog Close Dialog Close Dialog \nPlease select your preferred language\n\nTHE AMERICAS\nEnglish Español Français Português \nASIA and OCEANIA\nEnglish Bahasa Indonesia 简体中文 繁體中文 日本語 한국어 ภาษาไทย Tiếng Việt हिंदी \nINTERNATIONAL\nEnglish العربية \nEUROPE\nDansk Deutsch Español Français Ελληνικά Italiano Nederlands Norsk Русский Português Polski Suomi Svenska Türkçe English Close Dialog 0 Points Buy Points Opens a new window Overview Activity My Trips Favorites Promotions Profile Member Benefits SIGN OUT \nMarriott Bonvoy™ Credit Cards\n\nMarriott Bonvoy™ Credit Cards\n​​​​​​ Destinationcombobox Destination 1 night Find Offers Destination Dates Marriott Bonvoy Offers™ \nBundle Up Big Savings\n\nDiscover exclusive offers at over 30 hotel brands and 10,000 destinations.\nView All Offers Sign In \nHere's the deal: the offer you're looking for is not available, in the meantime please check our other current offers.\n\nThis offer is limited to qualified Marriott Bonvoy members, but the more you stay the faster you’ll qualify for this exclusive offer and more.\n\nWe're sorry, but you are not eligible for this promotion at this time. Please check out the offers below as you plan your next trip.\n\nBig Savings in Top Cities\n\nUnited States\n\nHotel Deals in New York City\n\nHotel Deals in Hawaii\n\nHotel Deals in Las Vegas\n\nHotel Deals in Miami Beach\n\nHotel Deals in Austin\n\nHotel Deals in Nashville\n\nHotel Deals in Washington D.C.\n\nHotel Deals in New Orleans\n\nHotel Deals in San Francisco\n\nHotel Deals in San Diego\n\nHotel Deals in Chicago\n\nHotel Deals in Boston\n\nEurope\n\nHotel Deals in Barcelona\n\nHotel Deals in Paris\n\nHotel Deals in London\n\nHotel Deals in Berlin\n\nHotel Deals in Edinburgh\n\nHotel Deals in Amsterdam\n\nHotel Deals in Warsaw\n\nHotel Deals in Rome\n\nHotel Deals in Athens\n\nHotel Deals in Brussels\n\nHotel Deals in Lisbon\n\nHotel Deals in Salzburg\n\nCaribbean\n\nHotel Deals in Jamaica\n\nHotel Deals in St. Lucia\n\nHotel Deals in Dominican Republic\n\nHotel Deals in Puerto Rico\n\nHotel Deals in St Kitts and Nevis\n\nHotel Deals in Aruba\n\nHotel Deals in Cayman Islands\n\nHotel Deals in U.S. Virgin Islands\n\nHotel Deals in Curaçao\n\nHotel Deals in Bahamas\n\nAsia\n\nHotel Deals in Tokyo\n\nHotel Deals in Bangkok\n\nHotel Deals in Hong Kong\n\nHotel Deals in Mumbai\n\nHotel Deals in Beijing\n\nHotel Deals in Manilla\n\nHotel Deals in Taiwan\n\nHotel Deals in Malaysia\n\nHotel Deals in Singapore\n\nHotel Deals in Shanghai\n\nHotel Deals in Vietnam\n\nHotel Deals in Australia\n\nLatin America\n\nHotel Deals in Mexico\n\nHotel Deals in Brazil\n\nHotel Deals in Colombia\n\nHotel Deals in Ecuador\n\nHotel Deals in Peru\n\nHotel Deals in Guatemala\n\nHotel Deals in Mexico City\n\nHotel Deals in Bogotá\n\nHotel Deals in São Paulo\n\nCanada\n\nHotel Deals in Vancouver\n\nHotel Deals in Montreal\n\nHotel Deals in Quebec City\n\nHotel Deals in Victoria\n\nHotel Deals in Toronto\n\nHotel Deals in Niagara Falls\n\nHotel Deals in Winnipeg\n\nHotel Deals in Banff\n\nHotel Deals in Whistler\n\nHotel Deals in Edmonton\n\nHotel Deals in Ottawa\n\nHotel Deals in Halifax\n\nMiddle East & Africa\n\nHotel Deals in Dubai\n\nHotel Deals in Abu Dhabi\n\nHotel Deals in Cairo\n\nHotel Deals in South Africa\n\nHotel Deals in Oman\n\nHotel Deals in Qatar\n\nHotel Deals in Morocco\n\nHotel Deals in Mauritius\n\nCity Deals You’ll Love\nBrowse more offers in popular destinations. \nHotel Deals in Hawaii\n\nHotel Deals in New York City\n\nHotel Deals in Las Vegas\n\nHotel Deals in Paris\n\nHotel Deals in Miami Beach\n\nHotel Deals in Tokyo\n\nHotel Deals in London\n\nHotel Deals in Rome\n\nHotel Deals in San Francisco\n\nHotel Deals in Dubai\n\nHotel Deals in Toronto\n\nHotel Deals in Boston\n\nFrequently Asked Questions\n\nWhat is Marriott Bonvoy Offers™?\n\nLooking for unbeatable hotel deals? Discover exclusive offers at over 30 hotel brands and 10,000 global destinations within the Marriott Bonvoy Offers Hub.\n\nHow can I find the best hotel discounts?\n\nfor access to exclusive member rates and benefits at participating properties worldwide.\nJoin Marriott Bonvoy® \nHow do I redeem an offer?\n\nTo redeem a stay-based offer, complete a reservation using the correct Promotional Code (if applicable) with the necessary stay requirements that can be found within the offer landing page. Each offer has unique requirements, so please be sure to review all necessary details and terms and conditions before completing a reservation. To redeem a non-stay-based offer, please follow the instructions on the offer landing page.\n\nWhat are Member Exclusive offers?\n\nMember Exclusive Offers are offers only available to Marriott Bonvoy members. Members must be signed in to their Marriott Bonvoy account to take advantage of Member Exclusive Offers. Not yet a member?  today to unlock access to exclusive offers including member rates, bonus points, travel & dining packages, and more. Plus, as a Marriott Bonvoy member, you can enjoy special benefits such as complimentary Wi-Fi and earning points on stays.\nJoin Marriott Bonvoy \nWhat are Elite Exclusive offers?\n\nElite Exclusive Offers are offers only available to Marriott Bonvoy Elite members, ranging from Silver Elite and above, Gold Elite and above, and Platinum Elite and above. Marriott Bonvoy Elite members must be logged into their Marriott Bonvoy accounts to take advantage of Elite Exclusive Offers. Each Elite Exclusive Offer is different, so be sure to read through the offer details and terms & conditions on the offer landing page for the full details.\n\nWhat are Bonus Point offers?\n\nBonus Point offers are Member Exclusive Offers or Elite Exclusive Offers that include bonus points for eligible stays or other actions such as dining. Bonus points for stay-based offers can be awarded on a per night or per stay basis. Bonus points may be deposited up to 10 business days after check-out. Be sure to read through the offer details and terms & conditions on the offer landing page for the full details.\n\nOur Company\nAbout Marriott International Careers Investor Relations News CEO Tony Capuano’s Blog Our Stories Digital Accessibility \nWork With Us\nSmall & Midsize Business Program Travel Professionals Group Partners Hotel Development Affiliates \nFind Help\nHelp & Contact Us Look Up Reservation Global Reservation Phone Numbers Best Rate Guarantee Missing Stay Form Site Map \nPrivacy & Terms\nPrivacy Center Your Privacy Choices Terms of Use Program Terms & Conditions Sustainability in the Supply Chain Top Destinations Top Destinations Las Vegas Hotels Miami Hotels Chicago Hotels Tokyo Hotels Orlando Hotels Key West Hotels London Hotels New York Hotels San Diego Hotels Boston Hotels Myrtle Beach Hotels Austin Hotels Nashville Hotels Denver Hotels Maui Hotels San Francisco Hotels New Orleans Hotels San Juan Hotels Seattle Hotels Santa Barbara Hotels Palm Springs Hotels Paris Hotels Rome Hotels Amsterdam Hotels Virginia Beach Hotels Ocean City Hotels Kauai Hotels View All Hotels \nFollow Marriott Bonvoy\n\n© 1996 - 2025 Marriott International, Inc. All rights reserved. Marriott Proprietary Information\n\nEnglish\n\nSelect your language\n\nThe Americas\nEnglish Español Français Português \nAsia and Oceania\nEnglish Bahasa Indonesia 简体中文 繁體中文 日本語 한국어 ภาษาไทย Tiếng Việt हिंदी \nInternational\nEnglish العربية \nEurope\nDansk Deutsch Español Français Ελληνικά Italiano Nederlands Norsk Русский Português Polski Suomi Svenska Türkçe English",
      "hash": "a86ec1f70f56",
      "downloadedAt": "2026-01-19T16:12:19.591Z",
      "trimmedAt": "2026-01-19T16:12:58.622Z",
      "sizeReduction": "99.5%"
    },
    {
      "url": "https://www.marriott.com/meeting-event-hotels/events.mi",
      "text": "[Page Title: Events | Hotel Event Rooms, Halls & Venues | Marriott Bonvoy]\n\nSkip To Content Close Dialog Close Dialog Close Dialog \nPlease select your preferred language\n\nTHE AMERICAS\nEnglish Español Français Português \nASIA and OCEANIA\nEnglish Bahasa Indonesia 简体中文 繁體中文 日本語 한국어 ภาษาไทย Tiếng Việt हिंदी \nINTERNATIONAL\nEnglish العربية \nEUROPE\nDansk Deutsch Español Français Ελληνικά Italiano Nederlands Norsk Русский Português Polski Suomi Svenska Türkçe English Close Dialog 0 Points Buy Points Opens a new window Overview Activity My Trips Favorites Promotions Profile Member Benefits SIGN OUT \nMarriott Bonvoy™ Credit Cards\n\nMarriott Bonvoy™ Credit Cards\n​​​​​​ \nSocial Events\n\nCelebrate special moments, big and small.\nThe Clancy, Autograph Collection, San Francisco, California \nExplore Social Events\n\nGet festive with us: Make the most of your next gathering.\nOffers \nMake Your Events More Rewarding with Marriott Bonvoy\nExplore Offers \nPlan Your Social Event\n\nMix, mingle, make memories: From reunions to anniversaries, celebrate at one of our 30+ extraordinary hotel brands.\nLearn More \nFamily Gatherings & More\n\nFood & Drink\n\nSpaces & Venues\nGo far or stay near \nDestinations\nRoom for all \nAccommodations\n\nConnect with Confidence\nElevate your next meeting with our expert services and innovative tools and technology. \nPlanning Tips\n\nSustainability\n\nEarn Points\n\nWhy Marriott Bonvoy?\n\nMarriott Bonvoy\n\nMarriott Bonvoy\nMarriott Bonvoy Overview Member Benefits Earn Points Redeem Points Marriott Bonvoy Credit Card Marriott Bonvoy Moments Opens a new window Marriott Bonvoy Insiders Opens a new window \nMeetings & Events\n\nMeetings & Events\nMeetings & Events Overview Business Meetings Weddings Social Events Group Travel \nDeals & Packages\n\nDeals & Packages\nDeals Hotel & Flight Packages Opens a new window Cars, Tours, Activities Opens a new window All-Inclusive Resorts & Vacations Opens a new window Marriott Vacation Club Offers Opens a new window Travel Experiences The Ritz-Carlton Yacht Collection Opens a new window Resorts Marriott Bonvoy Traveler Opens a new window \nOur Company\nAbout Marriott International Careers Investor Relations News CEO Tony Capuano’s Blog Our Stories Digital Accessibility \nWork With Us\nSmall & Midsize Business Program Travel Professionals Group Partners Hotel Development Affiliates \nFind Help\nHelp & Contact Us Look Up Reservation Global Reservation Phone Numbers Best Rate Guarantee Missing Stay Form Site Map \nPrivacy & Terms\nPrivacy Center Your Privacy Choices Terms of Use Program Terms & Conditions Sustainability in the Supply Chain Top Destinations Top Destinations Las Vegas Hotels Miami Hotels Chicago Hotels Tokyo Hotels Orlando Hotels Key West Hotels London Hotels New York Hotels San Diego Hotels Boston Hotels Myrtle Beach Hotels Austin Hotels Nashville Hotels Denver Hotels Maui Hotels San Francisco Hotels New Orleans Hotels San Juan Hotels Seattle Hotels Santa Barbara Hotels Palm Springs Hotels Paris Hotels Rome Hotels Amsterdam Hotels Virginia Beach Hotels Ocean City Hotels Kauai Hotels View All Hotels \nFollow Marriott Bonvoy\n\n© 1996 - 2025 Marriott International, Inc. All rights reserved. Marriott Proprietary Information\n\nEnglish\n\nSelect your language\n\nThe Americas\nEnglish Español Français Português \nAsia and Oceania\nEnglish Bahasa Indonesia 简体中文 繁體中文 日本語 한국어 ภาษาไทย Tiếng Việt हिंदी \nInternational\nEnglish العربية \nEurope\nDansk Deutsch Español Français Ελληνικά Italiano Nederlands Norsk Русский Português Polski Suomi Svenska Türkçe English",
      "hash": "d57529fa3858",
      "downloadedAt": "2026-01-19T16:12:19.599Z",
      "trimmedAt": "2026-01-19T16:12:58.714Z",
      "sizeReduction": "99.4%"
    },
    {
      "url": "https://www.marriott.com/en-us/dining/restaurant-bar/chsmc-charleston-marriott/5180521-aqua-terrace-roof-top-bar.mi#",
      "text": "[Page Title: Aqua Terrace Roof-Top Bar | Charleston Bar | Marriott Bonvoy]\n\nSkip to Content Close Dialog Close Dialog Close Dialog \nPlease select your preferred language\n\nTHE AMERICAS\nEnglish Español Français Português \nASIA and OCEANIA\nEnglish Bahasa Indonesia 简体中文 繁體中文 日本語 한국어 ภาษาไทย Tiếng Việt हिंदी \nINTERNATIONAL\nEnglish العربية \nEUROPE\nDansk Deutsch Español Français Ελληνικά Italiano Nederlands Norsk Русский Português Polski Suomi Svenska Türkçe English Close Dialog 0 Points Buy Points Opens a new window Overview Activity My Trips Favorites Promotions Profile Member Benefits SIGN OUT \nMarriott Bonvoy™ Credit Cards\n\nMarriott Bonvoy™ Credit Cards\n​​​​​​ RESTAURANTS + BARS Update Search \nSorry, we can't find the page you requested\n\nYou may have received this message because the page you requested is no longer available on the Marriott website.\n\nOur Company\nAbout Marriott International Careers Investor Relations News CEO Tony Capuano’s Blog Our Stories Digital Accessibility \nWork With Us\nSmall & Midsize Business Program Travel Professionals Group Partners Hotel Development Affiliates \nFind Help\nHelp & Contact Us Look Up Reservation Global Reservation Phone Numbers Best Rate Guarantee Missing Stay Form Site Map \nPrivacy & Terms\nPrivacy Center Your Privacy Choices Terms of Use Program Terms & Conditions Sustainability in the Supply Chain Top Destinations Top Destinations Las Vegas Hotels Miami Hotels Chicago Hotels Tokyo Hotels Orlando Hotels Key West Hotels London Hotels New York Hotels San Diego Hotels Boston Hotels Myrtle Beach Hotels Austin Hotels Nashville Hotels Denver Hotels Maui Hotels San Francisco Hotels New Orleans Hotels San Juan Hotels Seattle Hotels Santa Barbara Hotels Palm Springs Hotels Paris Hotels Rome Hotels Amsterdam Hotels Virginia Beach Hotels Ocean City Hotels Kauai Hotels View All Hotels \nFollow Marriott Bonvoy\n\n© 1996 - 2025 Marriott International, Inc. All rights reserved. Marriott Proprietary Information\n\nEnglish\n\nSelect your language\n\nThe Americas\nEnglish Español Français Português \nAsia and Oceania\nEnglish Bahasa Indonesia 简体中文 繁體中文 日本語 한국어 ภาษาไทย Tiếng Việt हिंदी \nInternational\nEnglish العربية \nEurope\nDansk Deutsch Español Français Ελληνικά Italiano Nederlands Norsk Русский Português Polski Suomi Svenska Türkçe English",
      "hash": "db0541206755",
      "downloadedAt": "2026-01-19T16:12:19.606Z",
      "trimmedAt": "2026-01-19T16:12:58.772Z",
      "sizeReduction": "99.4%"
    },
    {
      "url": "https://www.marriott.com/en-us/dining/restaurant-bar/chsmc-charleston-marriott/5180521-aqua-terrace-roof-top-bar.mi",
      "text": "[Page Title: Aqua Terrace Roof-Top Bar | Charleston Bar | Marriott Bonvoy]\n\nSkip to Content Close Dialog Close Dialog Close Dialog \nPlease select your preferred language\n\nTHE AMERICAS\nEnglish Español Français Português \nASIA and OCEANIA\nEnglish Bahasa Indonesia 简体中文 繁體中文 日本語 한국어 ภาษาไทย Tiếng Việt हिंदी \nINTERNATIONAL\nEnglish العربية \nEUROPE\nDansk Deutsch Español Français Ελληνικά Italiano Nederlands Norsk Русский Português Polski Suomi Svenska Türkçe English Close Dialog 0 Points Buy Points Opens a new window Overview Activity My Trips Favorites Promotions Profile Member Benefits SIGN OUT \nMarriott Bonvoy™ Credit Cards\n\nMarriott Bonvoy™ Credit Cards\n​​​​​​ RESTAURANTS + BARS Update Search \nSorry, we can't find the page you requested\n\nYou may have received this message because the page you requested is no longer available on the Marriott website.\n\nOur Company\nAbout Marriott International Careers Investor Relations News CEO Tony Capuano’s Blog Our Stories Digital Accessibility \nWork With Us\nSmall & Midsize Business Program Travel Professionals Group Partners Hotel Development Affiliates \nFind Help\nHelp & Contact Us Look Up Reservation Global Reservation Phone Numbers Best Rate Guarantee Missing Stay Form Site Map \nPrivacy & Terms\nPrivacy Center Your Privacy Choices Terms of Use Program Terms & Conditions Sustainability in the Supply Chain Top Destinations Top Destinations Las Vegas Hotels Miami Hotels Chicago Hotels Tokyo Hotels Orlando Hotels Key West Hotels London Hotels New York Hotels San Diego Hotels Boston Hotels Myrtle Beach Hotels Austin Hotels Nashville Hotels Denver Hotels Maui Hotels San Francisco Hotels New Orleans Hotels San Juan Hotels Seattle Hotels Santa Barbara Hotels Palm Springs Hotels Paris Hotels Rome Hotels Amsterdam Hotels Virginia Beach Hotels Ocean City Hotels Kauai Hotels View All Hotels \nFollow Marriott Bonvoy\n\n© 1996 - 2025 Marriott International, Inc. All rights reserved. Marriott Proprietary Information\n\nEnglish\n\nSelect your language\n\nThe Americas\nEnglish Español Français Português \nAsia and Oceania\nEnglish Bahasa Indonesia 简体中文 繁體中文 日本語 한국어 ภาษาไทย Tiếng Việt हिंदी \nInternational\nEnglish العربية \nEurope\nDansk Deutsch Español Français Ελληνικά Italiano Nederlands Norsk Русский Português Polski Suomi Svenska Türkçe English",
      "hash": "f843ef06f8bb",
      "downloadedAt": "2026-01-19T16:12:19.612Z",
      "trimmedAt": "2026-01-19T16:12:58.830Z",
      "sizeReduction": "99.4%"
    }
  ],
  "sizeReduction": "99.3%"
}