{
  "venueId": "ChIJg1a0Zuli_ogRQoQli-XkgJg",
  "venueName": "Stoner's Pizza Joint",
  "venueArea": "North Charleston",
  "website": "https://www.stonerspizzajoint.com/",
  "scrapedAt": "2026-01-19T15:42:02.405Z",
  "trimmedAt": "2026-01-19T15:49:02.717Z",
  "pages": [
    {
      "url": "https://www.stonerspizzajoint.com/",
      "text": "[Page Title: Stoner's Pizza Joint]\n\n0 \n〰️\n\nGet a Free Small Pizza after your First Purchase\n〰️ Get a Free Small Pizza after your First Purchase 〰️ Get a Free Small Pizza after your First Purchase GAME DAY FUEL Order Now NATIONWIDE SPECIALS Order Now \nVALUE MENU\nOrder Now \nPick 2 for $6.99 each\nplug you need The Pizza Get Your Perfect Slice! Order Online! SPECIALTY PIZZAS Order Now QUALITY GREENS Order Now SWEET STUFF Order Now SMOKED WINGS Order Now \nCraving something delicious?\n\n•\n\nGet the Pizza Plug You Need!\n\n•\nCraving something delicious? • Get the Pizza Plug You Need! • Craving something delicious? • Get the Pizza Plug You Need! • Flavor at your fingertips Download the Stoner’s Pizza App today to start earning rewards \nAt Stoner's Pizza Joint, your satisfaction is of the utmost importance to us. All of our food is prepared when ordered with only the freshest ingredients. Our pizza dough is made daily & we use the freshest vegetables & spices in all of our food. We know you'll taste the difference!\nDownload from Google Play Download from Apple Store Own a Pizza Joint! Join the excitement at Stoner’s Pizza Joint! As a rapidly expanding brand on the rise, we're on a mission to transform our local favorite into a beloved national chain. Own a slice of this thriving pizza empire and be a part of something big. Embrace the opportunity to bring Stoner’s Pizza Joint to your community! WHAT’S COOKIN’? Slice into Bliss with Our Valued Partners! OFFICIAL PIZZA OF THE FLORIDA PANTHERS",
      "hash": "4629d521196a",
      "downloadedAt": "2026-01-19T15:35:44.605Z",
      "trimmedAt": "2026-01-19T15:49:02.717Z",
      "sizeReduction": "99.6%"
    }
  ],
  "sizeReduction": "99.6%"
}