{
  "venueId": "ChIJyc03ZQB9_ogR6rTHm-ebn1M",
  "venueName": "Mazal",
  "venueArea": "West Ashley",
  "website": "https://mazaleat.com/",
  "scrapedAt": "2026-01-19T16:12:35.660Z",
  "trimmedAt": "2026-01-19T16:13:37.516Z",
  "pages": [
    {
      "url": "https://mazaleat.com/pages/our-menu-mazal-shawarma-grill",
      "text": "[Page Title: MAZAL Menu - Mediterranean Street Food in Charleston\n – Mazal Mediterranean Street Food]\n\nSkip to content \nItem added to your cart\nView cart Check out Continue shopping STARTERS SALADS HUMMUS MAINS \nSTARTERS\n\nSEASONED FRIES\n(V,GF) $10 \nCrispy fries tossed in our house Mediterranean seasoning blend\n\nFALAFEL PLATE\n(V) $10 \nFive falafel balls, fried to perfection and served with smooth tahini. A classic Middle Eastern favorite that embodies authentic Mediterranean flavor.\n\nSALAD PLATE\n(GF, V option) $12 \nChoose four fresh salads from our vibrant Mediterranean salad bar. A light, colorful, and healthy way to taste the best of Mazal Charleston.\n\nROASTED CABBAGE STEAK\n(V, GF) $12 \nOven-roasted cabbage with tahini mustard drizzle - smoky, nutty, and perfectly tender.\n\nBAKED CAULIFLOWER\n(V, GF) $16 \nRoasted cauliflower with lemon, garlic, and parsley sauce - a fresh Mediterranean favorite.\n\nSALADS\n\nFALAFEL SALAD\n(V option) $16.9 \nFresh tomato, cucumber, parsley, pickles, za’atar, and crispy pita chips. A refreshing Mediterranean salad with bold Israeli flavors.\n\nCHICKEN SALAD\n(GF) $18.9 \nGrilled chicken breast served over lettuce, tomato, cucumber, and red onion. A healthy, protein-packed choice from Mazal Charleston.\n\nSCHNITZEL SALAD\n$18.9 \nCrispy chicken schnitzel on a bed of cabbage, cucumber, and carrot, tossed with house pickled seasoning. A modern twist on an Israeli street food classic.\n\nHUMMUS\n\nServerd with 1 pita\n\nCLASSIC\n(V, GF) $12.4 \nCreamy, house-made hummus topped with olive oil and whole chickpeas. Smooth, rich, and comforting.\n\nWITH TAHINI & CHICKPEAS\n(V, GF) $13.4 \nRich hummus topped with tahini and warm chickpeas. A Charleston favorite for Mediterranean food lovers.\n\nWITH GRILLED CHICKEN BREAST\n(GF) $16.9 \nA hearty hummus bowl topped with juicy grilled chicken breast and olive oil drizzle - flavorful, filling, and healthy.\n\nWITH GROUND BEEF KEBAB\n(GF) $18.9 \nClassic hummus topped with spiced ground beef kebab and fresh herbs.\n\nWITH SHAWARMA\n(GF) $18.9 \nSmooth hummus paired with tender chicken shawarma, tahini, and house seasoning - one of Mazal’s signature Mediterranean dishes.\n\nMAINS\n\nFALAFEL\n(V option) Pita $13 Baguette $15 Bowl $19 \nCrispy falafel made fresh daily, served with your choice of Mediterranean salads and sauces. Light, flavorful, and full of authentic taste. Available in pita, baguette, or bowl.\n(Vegetarian, Vegan)\n\nSABICH [ EGGPLANT & EGG ]\n(V,GF option) Pita $13 Baguette $15 Bowl $19 \nSABICH [ EGGPLANT & EGG ]\nA Mediterranean favorite with fried eggplant, boiled egg, tahini, and fresh vegetables. Creamy, hearty, and satisfying. Served in pita, baguette, or bowl.\n\nCRISPY SCHNITZEL\nPita $15 Baguette $18 Bowl $20 \nCrispy breaded chicken schnitzel, golden and flavorful, served with your choice of salads and sauces. Comfort food with a Mediterranean twist. Available in pita, baguette, or bowl.\n\nGRILLED CHICKEN BREAST\n(GF Option) Pita $15 Baguette $18 Bowl $20 \nMarinated chicken breast grilled to perfection and paired with your choice of fresh Mediterranean salads and sauces. A clean, healthy option with rich flavor. Served in pita, baguette, or bowl.\n\nSHAWARMA\n(GF Option) Pita $18 Baguette $20 Bowl $22 \nTender chicken shawarma slow-roasted on a vertical spit, carved fresh to order, and served with your choice of salads and sauces. Juicy, aromatic, and perfectly seasoned. Available in pita, baguette, or bowl.\n\nSMASH KEBAB\n(GF option) Pita $18 Baguette $20 Bowl $22 \nJuicy ground beef kebab grilled with Mediterranean spices and fresh herbs. Served with your choice of salads and sauces for a smoky, hearty, and bold flavor. Available in pita, baguette, or bowl.\n\nMAZAL Menu - Mediterranean Street Food\n\nMAZAL brings authentic Mediterranean street food to Charleston. Our menu includes shawarma, falafel, hummus, salads and classic Middle Eastern flavors made fresh daily. Explore bold, fresh and handmade dishes crafted with Mediterranean tradition.\n\nVISIT US\nlocation_on 1901 Ashley River Rd, Charleston, SC 29407, United States schedule \nSun-Fri: 11am - 8pm\n\nSITE MAP\nOur Menu About Contact \nQUICK LINKS\nPrivacy policy Terms of service Refund and Return Allergen Disclaimer Accessibility Statement \nCONTACT\nmazalrsc@gmail.com (843) 425-8551",
      "hash": "56aa0d91dd50",
      "downloadedAt": "2026-01-19T16:12:29.110Z",
      "trimmedAt": "2026-01-19T16:13:37.505Z",
      "sizeReduction": "96.1%"
    },
    {
      "url": "https://mazaleat.com/",
      "text": "[Page Title: Mazal Mediterranean Street Food]\n\nSkip to content \nItem added to your cart\nView cart Check out Continue shopping \n[ 1901 Ashley River Rd, Charleston, SC 29407, United States ]\n\n[ 1901 Ashley River Rd, Charleston, SC 29407, US ]\n\nAuthentic Yet Contemporary Mediterranean Street Food.From a Quick Street Bite to an Overflowing Table.\nWe Serve It Juicy, Fresh, and Bold. \nFrom a Quick Street Biteto an Overflowing Table.\nWe Serve It Juicy, Fresh, and Bold. LET’S EAT > \nOUR DINING OPTIONS\n\nIN A BOX\nOrder Online > \n\"ON THE TABLE\"\nMake a Reservation > \nMEDITERRANEAN FEAST\n\nComing Soon!\n\nABOUT MAZAL\n\nFor us, food was never just food.It’s our way of celebrating life, bringing people together, and creating memories.\n\nFor us, food was never just food.It’s our way of celebrating life, bringing people together, and creating memories.\n\nis inspired by our grandmother Mazal - the heart of our family,a legendary hostess whose kitchen was always open, warm, and full of flavor.We bring that same spirit to Charleston: authentic Mediterranean street food,From quick shawarma and falafel to vibrant, shareable plates -all made fresh, bold, and full of soul.\nMAZAL \nis inspired by our grandmother Mazal - the heart of our family,a legendary hostess whose kitchen was always open, warm, and full of flavor.We bring that same spirit to Charleston: authentic Mediterranean street food, From quick shawarma and falafel to vibrant, shareable plates - all made fresh, bold, and full of soul.\nMAZAL OUR MENU > \nVISIT US\nlocation_on 1901 Ashley River Rd, Charleston, SC 29407, United States schedule \nSun-Fri: 11am - 8pm\n\nSITE MAP\nOur Menu About Contact \nQUICK LINKS\nPrivacy policy Terms of service Refund and Return Allergen Disclaimer Accessibility Statement \nCONTACT\nmazalrsc@gmail.com (843) 425-8551",
      "hash": "e48d60a1e88b",
      "downloadedAt": "2026-01-19T16:12:29.113Z",
      "trimmedAt": "2026-01-19T16:13:37.516Z",
      "sizeReduction": "98.5%"
    }
  ],
  "sizeReduction": "97.3%"
}