{
  "venueId": "ChIJn2oOz91x_ogRqoktKJnWsmk",
  "venueName": "Amalfi's Italian Restaurant & Pizzeria",
  "venueArea": "Mount Pleasant",
  "website": "http://www.amalfisofmountpleasant.com/",
  "scrapedAt": "2026-01-19T15:42:03.587Z",
  "trimmedAt": "2026-01-19T15:49:28.331Z",
  "pages": [
    {
      "url": "http://www.amalfisofmountpleasant.com/",
      "text": "[Page Title: Home | Amalfi's]\n\ntop of page TAKE OUT CLICK HERE! Benvenuto! Welcome to our restaurant. We specialize in Italian cuisine. Our recipes stem from our roots in Napoli, Italy.  Here at Amalfi's we use only the finest ingredients and the freshest products available.  Pizza, pasta, strombolis, calzones, subs, traditional Italian entrees and more! From our delicious homemade sauces to our wonderful homemade dough and breads, you find them all superb.  We hope to see you soon.  A presto!  Grazie! Call Now! Order TAKE OUT HERE! bottom of page",
      "hash": "60f82b5c3c70",
      "downloadedAt": "2026-01-19T15:30:48.518Z",
      "trimmedAt": "2026-01-19T15:49:28.024Z",
      "sizeReduction": "99.9%"
    },
    {
      "url": "https://www.amalfisofmountpleasant.com/menu",
      "text": "[Page Title: Menu | Amalfi's]\n\ntop of page TAKE OUT CLICK HERE! Menu Antipasti Caprese Fresh sliced tomato and fresh buffalo mozzarella on a bed of our homemade balsamic house dressing, Topped with basil, oregano and olive oil, $12.50 Impepata Di Cozze Traditional Neapolitan dish. Mussels cooked in with fresh garlic, Italian parsley, black pepper, white wine, EVOO, & lemon. $14.25 Vesuvio 3 Homemade arancini, 3 homemade meatballs, and a side of fresh fried calamari. $15.50 Bruschetta Marinated tomatoes with garlic, olive oil, and fresh herbs served over homemade crusted bread. $11.95 Calamari Lightly breaded fresh cut calamari served with side of homemade marinara. $12.95 Antipasto Thin sliced prosciutto, soppressata, buffalo mozzarella, asiago cheese, kalamata olives, and fresh marinated vegetables. $15.50 Pizza Appetizers Chicken Wings Spicy wings served with ranch or blue cheese. $10.75 Mozzarella Sticks 8 breaded mozzarella sticks served with marinara. $10.50 Garlic Knots 12 garlic knots served with marinara. $8.50 Arancini Homemade rolled balls of rice, spicy sausage, parmigiana cheese and homemade sauce $11.95 Soup and Salads Fiorentina Soup Fresh chicken, spinach, and parmigiana cheese in a homemade chicken broth. $6.25 Tomato Bisque Creamy homemade blanched tomato bisque flavored with with fresh herbs. $6.25 Crab bisque Fresh blue crab meat in a creamy bisque flavored with garlic and fresh herbs. $8.25 Caesar Salad Romaine lettuce, homemade croutons, parmigiana cheese. $5.95 My New Option Large $10.95 Add Chicken $15.95 Add Shrimp $15.95 Garden Salad Romaine lettuce, Roma tomatoes, cucumbers, and red onion. $5.95 My New Option Large $10.95 Add Chicken $15.95 Add Shrimp $15.95 Greek Salad Romaine lettuce, Roma tomatoes, cucumber, red onion, kalamata olives, and feta cheese. $6.95 My New Option Large $11.95 Add Chicken $16.95 Add Shrimp $16.95 Grilled Chicken Salad Romaine lettuce, Roma tomatoes, cucumber, mozzarella cheese, topped with fresh grilled chicken. $15.95 My New Option extra topping $0.75 Amalfi's Salad Romaine lettuce, roast red peppers, kalamata olives, red onion, parmigiano cheese $11.95 My New Option Add Chicken $3.50 Add Shrimp $5 extra topping $0.75 Sapori Del Mare (Seafood) All entrees are served with your choice of GARDEN, CAESAR, FIORENTINA or TOMATO soup. CRAB soup will be $2.50 added charge. GREEK salad will have a $1 added charge. 1/2 CAPRESE will have a $3.50 added charge. Amalfi's Seafood Combination Fresh shrimp, clams, mussels, and calamari sautéed with fresh garlic, white wine, EVOO, a touch of peperoncino rosso,fresh Italian parsley and fresh marinara sauce. Served over linguine. $21.50 \nGluten free\nMy New Option GLUTEN FREE OPTION $3 Linguine Con Le Vongole Fresh local clams sautéed in a fresh garlic, EVOO, Italian parsley and white wine, with a touch of peperoncini Rosso. Served over linguine. $18.50 Lobster Ravioli Lobster filled ravioli served in a delicious creamy crab meat sauce $20.50 \nGluten free\nMy New Option GLUTEN FREE OPTION $3 Gamberi & Vongole Fra'diavolo Fresh local shrimp and little neck clams sautéed in a fresh garlic, EVOO, white wine, and fresh marinara, with a touch of peperoncini Rosso served over linguine. $20.50 \nGluten free\nMy New Option GLUTEN FREE OPTION $3 Traditional Italian All entrees are served with your choice of GARDEN, CAESAR, FIORENTINA or TOMATO soup. CRAB soup will be $2.50 added charge. GREEK salad will have a $1 added charge. 1/2 CAPRESE will have a $3.50 added charge. Lasagna Fresh layered pasta with seasoned variety of meats, tomato, and cheese baked in homemade tomato sauce. $16.50 Baked Ziti Penne pasta tossed with ricotta cheese and homemade tomato sauce, topped with mozzarella cheese and baked. $16.50 \nVegetarian\nStuffed Shells 4 Large pasta shells filled with spinach and ricotta cheese. Topped with mozzarella cheese and baked in our tomato sauce. $16.50 \nVegetarian\nTortellini alla Panna Cheese filled tortellini served in our homemade alfredo sauce with diced ham. $16.50 Spaghetti with Meatballs Spaghetti tossed in our homemade sauce topped with our delicious meatballs. $16.50 Fettuccine alla Bolognese Fettuccine pasta served with our fresh homemade meat sauce. $16.50 \nGluten free\nMy New Option GLUTEN FREE OPTION $3 Spaghetti with Spicy Italian Sausage Spaghetti tossed with hot Italian Sausage in our homemade tomato sauce. $16.50 \nMild\nSpaghetti Spaghetti served with choice of homemade tomato or homemade marinara sauce. $14.50 \nGluten free\n\nVegetarian\nMy New Option GLUTEN FREE OPTION $3 Ravioli Your choice of Meat or Cheese filled ravioli served in our homemade sauce. $16.50 My New Option Meat Cheese Fettuccini Alfredo alfredo $16.50 chicken $21.50 chicken and broccoli $23 shrimp $21.95 shrimp and broccoli $23 Boscaiola A tasty combination of hot Italian sausage, mushrooms, onion, green peppers, sautéed in our homemade marinara served over penne. $16.50 \nMild\nMy New Option GLUTEN FREE OPTION $3 Spaghetti Aglio e Olio Garlic, extra virgin olive oil, anchovies, parmigiana cheese, and crushed red pepper sautéed and served over spaghetti. $16.50 \nGluten free\n\nMild\nMy New Option GLUTEN FREE OPTION $3 Gnocchi alla Sorrentino Potato dumplings with homemade tomato sauce and topped with buffalo mozzarella. $16.50 Pesto alla Genovese Fresh crushed basil, garlic, pine nuts, parmigiana cheese, and extra virgin olive oil served over spaghetti. $16.50 \nGluten free\n\nVegetarian\nMy New Option GLUTEN FREE OPTION $3 Arrabiata Diced mushroom, ham, and crushed red pepper sautéed in our homemade tomato sauce with a touch of alfredo. $16.50 \nGluten free\n\nMild\nMy New Option GLUTEN FREE OPTION $3 *NEW* Penne Quattro Formaggi Our take on the popular Vodka sauce. 4 cheese pink sauce served over penne. $16.50 Pollo (Chicken) All entrees are served with your choice of GARDEN, CAESAR, FIORENTINA or TOMATO soup. CRAB soup will be $2.50 added charge. GREEK salad will have a $1 added charge. 1/2 CAPRESE will have a $3.50 added charge. Chicken Parmigiana Breaded chicken breast baked I a tomato sauce topped with mozzarella and served with side of spaghetti. $18.50 Parmigiana Alfredo Breaded chicken breast served in our homemade alfredo sauce with penne pasta $18.50 Chicken Amalfi (Cacciatore) Chicken breast sautéed with onions, peppers, and mushrooms in homemade marinara served over spaghetti. $18.50 \nGluten free\nMy New Option GLUTEN FREE OPTION $3 Chicken Marsala Chicken breast touched with flout sautéed with mushrooms in a marsala wine and served over spaghetti. $18.50 Chicken Piccata Chicken breast lightly floured then sautéed in garlic, lemon, and capers sauce served over spaghetti. $18.50 Vitello (Veal) All entrees are served with your choice of GARDEN, CAESAR, FIORENTINA or TOMATO soup. CRAB soup will be $2.50 added charge. GREEK salad will have a $1 added charge. 1/2 CAPRESE will have a $3.50 added charge. Veal Parmigiana Fresh breaded veal cutlet baked in homemade tomato sauce topped with mozzarella served with side of spaghetti. $20.50 Veal Piccata Fresh veal cutlet tenderized, lightly floured, then sautéed in garlic, lemon, and capers sauce served over spaghetti. $20.50 My New Option GLUTEN FREE OPTION $3 Veal Marsala Veal cutlet lightly breaded and sautéed with mushrooms in a marsala wine served on top of spaghetti. $20.50 Ossobuco Veal shank prepared in a white wine and caramelized onion sauce served over spaghetti pasta $28.50 Melanzana (eggplant) All entrees are served with your choice of GARDEN, CAESAR, FIORENTINA or TOMATO soup. CRAB soup will be $2.50 added charge. GREEK salad will have a $1 added charge. 1/2 CAPRESE will have a $3.50 added charge. Eggplant Parmigiana Fresh thin sliced, lightly breaded, topped with mozzarella and our homemade tomato sauce and baked to perfection. $18.50 \nVegetarian\nEggplant Rolliniti Fresh eggplant rolled with spinach and ricotta, topped with mozzarella and tomato sauce and baked. Served with side of spaghetti and tomato sauce. $18.50 \nVegetarian\nPenne alla Siciliana Fresh diced eggplant, fresh garlic, extra virgin olive oil, sautéed in our homemade marinara sauce. Baked with mozzarella cheese. $18.50 \nGluten free\n\nVegetarian\nMy New Option GLUTEN FREE OPTION $3 Subs 8\" Subs served with potato chips Cheese steak sub Steak, cheese, onions, peppers, mushrooms, lettuce, tomato, mayonnaise. $12 Meatball Parmigiana Homemade meatballs in our fresh tomato sauce topped with mozzarella and baked. $12 Neapolitan Sub Hot Italian sausage grilled with onions and green peppers, topped with mozzarella and baked. $12 Chicken Parmigiana Breaded chicken breast topped with fresh tomato sauce and mozzarella cheese and baked. $12 Italian Sub Salami,ham, cheese, onion, lettuce, tomato, and oil and vinegar. $12 Prosciutto Sub Imported thin sliced proscuitto, fresh mozzarella,tomato, red peppers, EVOO, red wine vinegar and oregano $12 Eggplant Parmigiana Sub Thin slices of eggplant prepared and topped with mozzarella and baked in a homemade sub roll. $12 Children's Menu 12 and under.\nServed with kids drink. Child Ravioli Choose of meat or cheese ravioli. $8.75 My New Option Meat Cheese Spaghetti with sauce Spaghetti with tomato sauce. $8.75 Fettuccini Alfredo Fettuccini pasta with homemade alfredo. $8.75 My New Option Add Chicken $5 Add Shrimp $5 Chicken Tenders Breaded chicken tenders served with fries. $8.75 Spaghetti with butter Spaghetti with butter and parmigiana served with drink $8.75 Side Orders Meatballs Meatballs in our tomato sauce. $7.50 Sausage Sausage in our homemade tomato sauce. $7.50 \nMild\nGrilled Vegetables Grilled variety of fresh vegetables. $7 French Fries $5 Large side of sauce Tomato, marinara, meat, alfredo $5 Desserts Homemade desserts. Please ask for daily dessert specials. Tiramisu Homemade tiramisu. Prepared with mascarpone cheese, espresso, lady fingers, along with our own added touches. $8.25 Cannoli Two our our delicious cannoli. $8.25 Limoncello Tiramisu Our delicious limoncello tiramisu is a customer favorite. This delicious dessert will have you coming back for more! $8.25 Amaretto Cake $8.25 Drinks and coffee Sodas, tea, and coffee. Coke $2.75 Diet Coke $2.75 Mr. Pibb $2.50 Sprite $2.75 Pink Lemonade $2.75 Tea $2.75 My New Option Sweet Unsweet Coffee $2.75 Coke Zero $2.75 bottom of page",
      "hash": "9a01472c7075",
      "downloadedAt": "2026-01-19T15:30:48.606Z",
      "trimmedAt": "2026-01-19T15:49:28.331Z",
      "sizeReduction": "99.2%"
    }
  ],
  "sizeReduction": "99.4%"
}