{
  "venueId": "ChIJJeHx3Ol7_ogRrCtrfhV6HCQ",
  "venueName": "Triangle Char & Bar",
  "venueArea": "West Ashley",
  "website": "https://www.trianglecharandbar.com/",
  "scrapedAt": "2026-01-19T16:12:32.101Z",
  "trimmedAt": "2026-01-19T16:12:53.033Z",
  "pages": [
    {
      "url": "https://www.trianglecharandbar.com/menus/brunch-menu/",
      "text": "[Page Title: Brunch Menu - Triangle Char + Bar]\n\nBrunch Menu Download Brunch Menu To Lunch and Dinner Menu \nBrunch Menu",
      "hash": "825535eeb895",
      "downloadedAt": "2026-01-19T16:12:18.183Z",
      "trimmedAt": "2026-01-19T16:12:53.017Z",
      "sizeReduction": "99.8%"
    },
    {
      "url": "https://www.trianglecharandbar.com/",
      "text": "[Page Title: Grass Fed Burgers - Charleston - Triangle Char & Bar]\n\nVoted Best Sunday Brunch Again By The Charleston City Paper Readers for 2015! \nWe were voted Best Sunday Brunch again by the Charleston City Paper readers for 2015! ...\n06 April, 2015 Triangle Dazzles At The Lowcountry Jazz Brunch For Charleston Wine + Food! \nFrom the health product distributors… Put on by The Post and Courier and Motley Rice LLC, Sunday’s Lowcountry Jazz Brunch was a feast for the ey...\n03 March, 2014 Triangle Voted “Best Sunday Brunch” Third Year in a Row by Charleston City Paper Readers! \n“Even with two locations, Triangle has diners lining up for Sunday brunch. It could be because of the six different kinds of eggs benedict, or it migh...\n14 March, 2013 \nWe believe to be a great restaurant in Charleston, you need to have Charleston’s best grass fed burger. We continuously make great strides to be inventive and spunky in the kitchen while sourcing as much as we can locally. Our local, grass fed beef comes from cattle herds that are raised in South Carolina grass pasture as well as regional pastures. Our grain-finished beef is also raised on grass but spends the last few of months of life eating grains to add more fat to the meat. All our beef has been vegetarian-fed, humanely raised and given no hormones or antibiotics. This is important to us and important to you to have Charleston’s best burger.",
      "hash": "9dba43590210",
      "downloadedAt": "2026-01-19T16:12:18.185Z",
      "trimmedAt": "2026-01-19T16:12:53.033Z",
      "sizeReduction": "98.6%"
    }
  ],
  "sizeReduction": "99.1%"
}