{
  "venueId": "ChIJ2z_fQId7_ogRoxp_7evokOU",
  "venueName": "Matador Charleston",
  "venueArea": "Downtown Charleston",
  "website": "https://www.matadorrestaurants.com/locations/charleston-sc",
  "scrapedAt": "2026-01-19T16:12:31.137Z",
  "trimmedAt": "2026-01-19T16:12:42.071Z",
  "pages": [
    {
      "url": "https://www.matadorrestaurants.com/become-a-matador?location=Charleston%20SC",
      "text": "[Page Title: Matador | Become A Matador]\n\nBecome A Matador\n\nWe are always looking for amazing people to join our team! If you are passionate about people and want to be a part of our family, feel free to fill in the information below or call any one of our restaurants and ask about their next open interview! We hope to see you soon!\nFirst Name Last Name Email Phone Address What position are you applying for? Location to which you are applying Availability (part-time, full-time, seasonal) When can you start? What is your current employment status? Why would you like to work for the Matador? Your resume \nWhen you visit the Site, we automatically collect certain information about your device, including information about your web browser, IP address, time zone, and some of the cookies that are installed on your device.\nPrivacy Policy Ok. I Agree",
      "hash": "5c01a55ab857",
      "downloadedAt": "2026-01-19T16:12:14.178Z",
      "trimmedAt": "2026-01-19T16:12:42.041Z",
      "sizeReduction": "97.4%"
    },
    {
      "url": "https://www.matadorrestaurants.com/private-events?venue=charleston-event-spaces-charleston#private-events-form",
      "text": "[Page Title: Private Events]\n\nPrivate Events\n\nTucked away from the crowd, the Matador offers several unique private spaces for you and your group. We’ll help you with all the details for a perfect event, whether you’re planning a gathering of friends and family, a business luncheon, a professional workshop, or even a tequila tasting seminar.\n\nWe have many wonderful options in the Seattle, Portland, Boise and South Carolina areas. See the venues available near you, and inquire about hosting your event with us!\n\nMezcaleria & Ballroom\n• Ballard (Seattle, WA) \n5410 Ballard Ave NW, Seattle, WA 98107 | (206) 297-2855\n\nWhether you’re planning a private dinner with friends, a surprise birthday party for your loved ones or a meeting luncheon with AV capability, Ballard has the perfect space for you. The Ballroom and the Mezcaleria each offer their own unique style and amenities, providing the perfect backdrop for any occasion from meetings to celebrations. Choose from our many customized menus for sit-down dinners and buffet-style entertaining. We provide one or more servers for every gathering, so you can relax and enjoy the company of your guests, our delicious food and drinks, and the intimate, exciting and fun atmosphere of our Ballard location.\nBOOK WITH US ON TRIPLESEAT Book Mezcaleria & Ballroom, Ballard \nCharleston Event Spaces\n• Charleston, SC \n235 Meeting St, Charleston, SC 29401 | (843)-789-4747\n\nThe Matador Charleston is the perfect place to host your next event, no matter the size or type. With our unique atmosphere and versatile event spaces, we can help you create a memorable and enjoyable experience for your guests.\n\nOur spaces can accommodate groups of all sizes, from intimate gatherings to large corporate parties. We offer a private bar, an outdoor patio, catering, and TVs to ensure that your event has everything you need.\n\nFrom appetizers and entrees to desserts and drinks, we offer a wide range of customizable menu options to suit any need or budget. Whether you're planning a small gathering or a large-scale event, we can work with you to create a food and beverage menu that your guests will love. We also happily work with any dietary preferences or restrictions you may have so that everyone can enjoy.\n\nWe look forward to helping you create a truly unforgettable event at The Matador Charleston!\nBOOK WITH US ON TRIPLESEAT Book Charleston Event Spaces, Charleston \nThe Añejo Room\n• Portland, OR \n1438 NW 23rd Ave, Portland, OR 97210 | 503-228-2855\n\nWhether you’re planning a private dinner with friends, a surprise birthday party for your loved ones, or a meeting luncheon--NW Matador has the perfect space for you. Our room can accommodate up to 30 guests, and when the weather is right, the large garage door opens to create a beautiful indoor-outdoor experience. Choose from our many customized menus for sit-down dinners and buffet-style entertaining. We provide one or more servers for every gathering, so you can relax and enjoy the company of your guests, our delicious food and drinks, and the intimate, exciting and fun atmosphere of our NW 23rd Avenue location. Please note that we are unable to rent out the Añejo room for dinner on Fridays and Saturdays.\nBook The Añejo Room, NW Portland \nThe Blanco Room\n• Portland, OR \n2424 E Burnside St. Portland, OR 97214 | 503-719-5757\n\nWhether you’re planning a business meeting, celebration, or a surprise event, our private party room in East Portland is a comfortable venue for hosting up to 35 guests, ages 21 and over. Easily accessible for those with physical limitations, this modern, romantic space is an extension of our restaurant’s intimate, yet casual atmosphere. For an indoor-outdoor feel, the room’s large window installations can be opened like a garage door, giving your guests access to the side patio. Whether you prefer sit-down or buffet-style service, our staff is happy to help you plan every detail, from special bar items or individually ordered beverages, to appetizer, entree and dessert options curated by our house chef.\nBook The Blanco Room, East Portland \nThe Mezzanine\n• Meridian, ID \n3690 E Monarch Sky Ln #140, Meridian, ID 83646 | 208-893-6120\n\nThe Casa Del Matador in The Village at Meridian invites you to hold your gathering in a private Mezzanine space, up above the dining area and bar. Artisan-forged metal dividers, Spanish-style wallpaper, brickwork and handcrafted tables define this unique room, illuminated by flickering candlelight through hand-wrought sconces. An ideal venue for business meetings, parties, celebrations, and events of any kind, the mezzanine is above expectations, offering a very special point of view. Enjoy the openness and the view over the restaurant, or draw the curtains and revel in your privacy.\nBook The Mezzanine, Meridian \nReposado Room\n• Portland, OR \n4111 N Williams Ave, Portland, OR 97217 | (503) 841-6326\n\nThe North Williams location is sophisticated, yet casual and welcoming: the warm open fire pits, heavy red velvet drapes, candlelight, and handmade woodwork all make for a unique and comforting ambiance. This spacious room can be arranged to your liking and has the option of being closed off to provide a private setting or left open for a more casual gathering. The room is equipped with a high-definition television that can be turned to the channel of your choice. The Matador is ideal for your next corporate offsite meeting, wedding rehearsal dinner, birthday, sporting event party or any other occasion. Come join us and make your next party one to remember!\nBook Reposado Room, North Portland \nBook an Event\nLocation* Please Select Mezcaleria & Ballroom (Ballard) Charleston Event Spaces (Charleston) The Añejo Room (NW Portland) The Blanco Room (East Portland) The Mezzanine (Meridian) Reposado Room (North Portland) Date of Event* Start Time Please Select 10:00 AM 10:30 AM 11:00 AM 11:30 AM 12:00 PM 12:30 PM 1:00 PM 1:30 PM 2:00 PM 2:30 PM 3:00 PM 3:30 PM 4:00 PM 4:30 PM 5:00 PM 5:30 PM 6:00 PM 6:30 PM 7:00 PM 7:30 PM 8:00 PM 8:30 PM 9:00 PM 9:30 PM 10:00 PM 10:30 PM 11:00 PM 11:30 PM 12:00 AM 12:30 AM 1:00 AM 1:30 AM End Time Please Select 10:00 AM 10:30 AM 11:00 AM 11:30 AM 12:00 PM 12:30 PM 1:00 PM 1:30 PM 2:00 PM 2:30 PM 3:00 PM 3:30 PM 4:00 PM 4:30 PM 5:00 PM 5:30 PM 6:00 PM 6:30 PM 7:00 PM 7:30 PM 8:00 PM 8:30 PM 9:00 PM 9:30 PM 10:00 PM 10:30 PM 11:00 PM 11:30 PM 12:00 AM 12:30 AM 1:00 AM 1:30 AM First Name* Last Name* Email* Company Phone Number* Extension Nature of Event Please Select Birthday Party Wedding Related Business Dinner/Lunch Presentation Other Style of Event Please Select Sit Down Dining Standup Cocktail Other Preferred Method of Communication Please Select Telephone Email Number of Guests (Max ) 60 Notes and Requests \nWhen you visit the Site, we automatically collect certain information about your device, including information about your web browser, IP address, time zone, and some of the cookies that are installed on your device.\nPrivacy Policy Ok. I Agree",
      "hash": "a3952ca95c86",
      "downloadedAt": "2026-01-19T16:12:14.207Z",
      "trimmedAt": "2026-01-19T16:12:42.071Z",
      "sizeReduction": "91.7%"
    }
  ],
  "sizeReduction": "93.3%"
}