{
  "venueId": "ChIJY8eG9Qt6_ogR8_CLUdaHByk",
  "venueName": "Fleet Landing Restaurant & Bar",
  "venueArea": "Downtown Charleston",
  "website": "http://www.fleetlanding.net/",
  "scrapedAt": "2026-01-19T16:12:33.491Z",
  "trimmedAt": "2026-01-19T16:13:16.734Z",
  "pages": [
    {
      "url": "http://www.fleetlanding.net/",
      "text": "[Page Title: Fleet Landing Restaurant ⋆ Waterfront Dining & Bar]\n\nSkip to content \nSeven Days A Week\n\nWelcome to Charleston'sBest Waterfront Dining & Raw Bar!\nReservations Menus Now available: The Fleet Landing Cookbook\nThis collection contains over 60 carefully-crafted recipes that have been fan favorites at Fleet Landing for two decades. With stunning full-color photographs along with stories about our historic building and the journey of our restaurant, this cookbook is more than just recipes, it's a slice of Charleston history.\nAvailable for purchase in store or on our website - click SHOP above! \nOur Location\n\nFleet Landing is located at 186 Concord Street at the foot of the City Market in Historic Downtown Charleston.\n\nHOURS OF OPERATION: Seven Days a Week 11am-3:30pm Seven Days a Week 5pm-10pm\nLunch: Dinner: Both the main and raw bars are open for drinks and snacks during the transition from lunch to dinner! \nReservations are recommended, especially for nights and weekends, and we are unable to accept reservations via email as it reaches an offsite office. The largest group that we are able to accommodate is 10 guests.\nFor information on reservations click here! strongly \nThere is a parking garage across the street at the corner of Cumberland and Concord Streets. There is also street parking on Concord Street.\nToday is the day!! Reopening at 11 am with a fresh It’s a beautiful day to start a clean! Our annual Cheers to 2025! Wishing you a wonderful, healthy, Actually experiencing winter weather 🙅🏼‍♀️\nRemembe We are looking forward to seeing you on this gorge Happy National Fried Shrimp Day! With a sunny high Whether you shop in store or online, we’ve got all It may be a little chilly outside, but it’s nice a Don’t forget about the best gift (ever!) for a fri Check out Fleet on Instagram \nSite Menu\n\nHours\n\nEvery day 11am-3:30pm Every day 5pm-10pm\nLunch Dinner \nBoth bars are open during the transition from lunch to dinner!\n\nLocation\n\n186 Concord St.Charleston, SC 29401\n\nPhone: (843) 722-8100\n\nConnect\nFacebook Instagram \n© 2020  | All Rights Reserved\nFleet Landing The owner of this website has made a commitment to accessibility and inclusion, please report any problems that you encounter using the contact form on this website. This site uses the WP ADA Compliance Check plugin to enhance accessibility. LARGE PARTIES GIFT CARD EVENTS",
      "hash": "d0e94586b6da",
      "downloadedAt": "2026-01-19T16:12:22.874Z",
      "trimmedAt": "2026-01-19T16:13:16.734Z",
      "sizeReduction": "98.3%"
    }
  ],
  "sizeReduction": "98.3%"
}