{
  "venueId": "ChIJxw47qWl6_ogRlocIO1Jk6aM",
  "venueName": "Wine & Company",
  "venueArea": "North Charleston",
  "website": "http://chswine.com/",
  "scrapedAt": "2026-01-19T16:12:35.584Z",
  "trimmedAt": "2026-01-19T16:13:37.067Z",
  "pages": [
    {
      "url": "http://chswine.com/special-events-1",
      "text": "[Page Title: The Shop — Wine Shop]\n\nThe Shop\n\nMore than just a wine bar…\n\nAt Wine & Company, we love helping you find the perfect wines for any occasion. Whether you're building a private cellar, looking to learn more about wine, or need the ideal bottles for an event, we’re here to help.\n\nWe offer customized wine experiences for everyone, from beginners to seasoned wine lovers. Our sommelier-led sessions can be tailored for small gatherings or larger groups, making wine education fun and engaging for all.\n\nLet us help you discover amazing wines and make your wine journey unforgettable. At Wine & Company, your satisfaction is our priority, and we’re dedicated to providing top-notch service and expertise.\nContact us \nWine & Company was born in Charleston out of good friendships & warm memories made over a great bottle of wine, and we hope to extend this experience to you and yours here at our shop.\nContact Us",
      "hash": "1982ffead9b7",
      "downloadedAt": "2026-01-19T16:12:28.939Z",
      "trimmedAt": "2026-01-19T16:13:37.050Z",
      "sizeReduction": "99.3%"
    },
    {
      "url": "http://chswine.com/private-wine-tastings",
      "text": "[Page Title: General 4 — Wine Shop]\n\nPrivate Wine Tastings\n\nMake it a night to remember with a private tasting at Wine & Company. Expand your palate and make delicious memories. Start your evening with bubbles and enjoy an intimate tasting of 5 hand-picked wines paired with the perfect cheeses and charcuterie. Grab seven or more of your favorite friends and get ready for an all-in experience at Wine & Co!\n\nHow it works\n\nPrices start at $60 per person, plus tax and gratuity. (We can arrange elevated wine tastings featuring premium selections at an additional cost)\n\nOur private tastings are designed for intimate groups of 8-24 people. Due to high demand and our commitment to personalized experiences, we limit reservations to one group per day. Call or email us today to secure your spot.\n\nYour experience includes a warm welcome with sparkling wine upon arrival, an immersive tasting of 5 carefully selected wines guided by one of our expert sommeliers, and a curated assortment of perfectly paired cheeses and charcuterie.\n\nEmail us today to start building your private tasting experience!\nGet Started",
      "hash": "5c20ab100e0e",
      "downloadedAt": "2026-01-19T16:12:28.943Z",
      "trimmedAt": "2026-01-19T16:13:37.059Z",
      "sizeReduction": "99.1%"
    },
    {
      "url": "http://chswine.com/special-events",
      "text": "[Page Title: Special Events — Wine Shop]\n\nHost Your Special Event\n\nThe Details\n\nLooking for the ideal venue for your next event? Our charming space is perfect for everything from intimate book clubs and company happy hours to larger wedding receptions and birthday celebrations.\nContact us \nWine & Company was born in Charleston out of good friendships & warm memories made over a great bottle of wine, and we hope to extend this experience to you and yours here at our shop.\nContact Us",
      "hash": "c83e48c1d195",
      "downloadedAt": "2026-01-19T16:12:28.953Z",
      "trimmedAt": "2026-01-19T16:13:37.067Z",
      "sizeReduction": "99.6%"
    }
  ],
  "sizeReduction": "99.4%"
}