{
  "venueId": "ChIJl_KQyvdx_ogR7drlqON6cFM",
  "venueName": "Grimaldi's Pizzeria",
  "venueArea": "Mount Pleasant",
  "website": "https://www.grimaldispizzeria.com/locations/mount-pleasant/",
  "scrapedAt": "2026-01-19T16:12:34.616Z",
  "trimmedAt": "2026-01-19T16:13:28.013Z",
  "pages": [
    {
      "url": "https://www.grimaldispizzeria.com/specials/",
      "text": "[Page Title: Grimaldi's Pizzeria - Specials & Promotions - Brick-Oven Pizza]\n\nSpecials\n\nWhat’s Cookin’\n\nCheck out Grimaldi’s promotions and specials, from our seasonal menu and promotions, to Tuesday Tastings, to our military / veteran discount and more!\n\nNew – Winter Seasonal Menu!\n\nFestive Flavors\n\nThe Duo Pizza\n\nCherry Pecan Salad\n\nBlack Cherry Cheesecake\n\nREESE’S® Peanut Butter Cup Cheesecake\n\nCran-Cherry Twist (non-alcoholic)\n\nBlack Cherry Spritz\n\nRye On Time\nView Menu Order Now \nFor a Limited time.\n\nStoking Social Hour* is Back!\n\n3pm-5pm Daily\n\nWhile we stoke our famous coal brick ovens, we invite you to come socialize and enjoy these exciting deals!\n\nSignature Cocktails\n$10 \nStarters & Salads\n$3 Off \nBeer, Spritzes, Mocktails, Wine** & Sangria**\n$2 Off \nBottles of Wine**\n$10 Off \n*Not available in South Carolina or at the Palazzo in Las Vegas. Must be 21+ to purchase or consume alcohol. Offers valid for dine-in only. Price and selection may vary by location.\n\n**On Tuesdays, Enjoy 50% Off Wine & Sangria All Day! Reserve wines excluded from 50% off offer.\nFind a Location \nSlices ASAP!\n\nJoin us Monday – Friday from 11am – 3pm for a delicious lunch with Grimaldi’s Slices ASAP! Perfect for a fast yet satisfying meal, our coal-fired slices are ready in a New York minute. Choose from a giant white or red slice, a house or Caesar salad, and a refreshing soda or iced tea to create your ideal lunch.\n\nPick Your Perfect Lunch:\n\n– $10.99\nSlice, Salad, & Drink Combo \n– $7.49\nSlice & Drink Combo \n– $4\nSlice Only \nAdd your favorite toppings to any slice for just $0.75 each.\n\nNot Available at Brooklyn or Palazzo locations.\nORDER ONLINE Find a Location \nNew Game Alert: “Ready, Set, Dough!”\n\nFulfill your pizza orders from hungry customers before time runs out and keep them coming back for more of Grimaldi’s famous Coal-fired, Brick-oven pizzas. Do you have what it takes to go from Cheese the Day to Mozzarella Millionaire? Time to find out! Climb your way to the top of the leaderboard by unlocking our endless challenge mode: “Brooklyn Blitz.”\nPlay Now \nTuesday Tastings\n\nEvery Tuesday, guests 21+ can enjoy half off glasses and bottles of wine, as well as glasses of sangria at participating locations.\n\nDine-in only.\nFind A Location \nParticipating Locations only\n\nThank You, Military Members!\n\nIn support of our military service members and veterans, we offer 15% off every day of the year!\n\nMust show ID. Available for dine-in or call-in takeout only.\nFind A Location \nParticipating Locations only\n\nEarn Points On Every Order\n\nGet The Grimaldi's Pizzeria Rewards App\nLearn More Learn more about rewards",
      "hash": "17b3dfec0ea2",
      "downloadedAt": "2026-01-19T16:12:25.529Z",
      "trimmedAt": "2026-01-19T16:13:27.907Z",
      "sizeReduction": "98.4%"
    },
    {
      "url": "https://www.grimaldispizzeria.com/locations/",
      "text": "[Page Title: Find a Grimaldi’s Pizzeria near me - Grimaldi’s To-Go]\n\nFind a Grimaldi's Pizzeria location near you\nCity, State or Zip Code AL AZ FL IA ID KS KY NV NY SC TX WI UAE \nAlabama\n\nHoover - Stadium Trace Village\n5225 Peridot Place, Suite 121 Hoover, AL 35244 directions for 205-739-2159 \nOpen today: 11:00 am - 9:00 pm\n\nUntil 3:00pm\n\nBy The Slice\nOrder Now for Hoover - Stadium Trace Village Directions for Hoover - Stadium Trace Village More Info for Hoover - Stadium Trace Village \nHuntsville - Valley Bend at Jones Farm\n2724 Carl T Jones Dr SE Huntsville, AL 35802 directions for 256-672-3535 \nOpen today: 11:00 am - 9:00 pm\n\nUntil 3:00pm\n\nBy The Slice\nOrder Now for Huntsville - Valley Bend at Jones Farm Directions for Huntsville - Valley Bend at Jones Farm More Info for Huntsville - Valley Bend at Jones Farm \nMadison - Clift Farm\n\nMadison, AL 35758\n\nComing Soon!\nMore Info for Madison - Clift Farm \nArizona\n\nCasa Paloma\n7131 W. Ray Rd Ste. 23 Chandler, AZ 85226 directions for 480-785-1600 \nOpen today: 11:00 am - 9:00 pm\n\nUntil 3:00pm\n\nBy The Slice\nOrder Now for Casa Paloma Directions for Casa Paloma More Info for Casa Paloma \nDC Ranch, Scottsdale\n20715 N. Pima Rd Ste. F 115 Scottsdale, AZ 85255 directions for 480-515-5588 \nOpen today: 11:00 am - 9:00 pm\n\nUntil 3:00pm\n\nBy The Slice\nOrder Now for DC Ranch, Scottsdale Directions for DC Ranch, Scottsdale More Info for DC Ranch, Scottsdale \nOld Town, Scottsdale\n4000 N. Scottsdale Rd Ste. 105 Scottsdale, AZ 85251 directions for 480-994-1100 \nOpen today: 11:00 am - 10:00 pm\nOrder Now for Old Town, Scottsdale Directions for Old Town, Scottsdale More Info for Old Town, Scottsdale \nPark West\n9788 W. Northern Ave Ste. 1440 Peoria, AZ 85345 directions for 623-486-4455 \nOpen today: 11:00 am - 10:00 pm\n\nUntil 3:00pm\n\nBy The Slice\nOrder Now for Park West Directions for Park West More Info for Park West \nSan Tan\n2168 E. Williams Field Rd Ste .102 Gilbert, AZ 85295 directions for 480-814-7722 \nOpen today: 11:00 am - 10:00 pm\n\nUntil 3:00pm\n\nBy The Slice\nOrder Now for San Tan Directions for San Tan More Info for San Tan \nScottsdale Quarter\n15147 N. Scottsdale Rd Ste H-135 Scottsdale, AZ 85254 directions for 480-596-4070 \nOpen today: 11:00 am - 10:00 pm\n\nUntil 3:00pm\n\nBy The Slice\nOrder Now for Scottsdale Quarter Directions for Scottsdale Quarter More Info for Scottsdale Quarter \nFlorida\n\nDowntown Palm Beach Gardens\n11701 Lake Victoria Gardens Ave 3101 Palm Beach Gardens, FL 33410 directions for 561-625-4665 \nOpen today: 11:00 am - 10:00 pm\n\nUntil 3:00pm\n\nBy The Slice\nOrder Now for Downtown Palm Beach Gardens Directions for Downtown Palm Beach Gardens More Info for Downtown Palm Beach Gardens \nFort Myers - Bell Tower\n13499 S. Cleveland Ave Ste. 201 Fort Myers, FL 33907 directions for 239-432-9767 \nOpen today: 11:00 am - 9:00 pm\n\nUntil 3:00pm\n\nBy The Slice\nOrder Now for Fort Myers - Bell Tower Directions for Fort Myers - Bell Tower More Info for Fort Myers - Bell Tower \nMiramar Beach - Grand Boulevard\n780 Grand Boulevard, Ste 100 Miramar Beach, FL 32550 directions for 850-837-3095 \nOpen today: 11:00 am - 9:00 pm\n\nUntil 3:00pm\n\nBy The Slice\nOrder Now for Miramar Beach - Grand Boulevard Directions for Miramar Beach - Grand Boulevard More Info for Miramar Beach - Grand Boulevard \nTampa - Westshore\n218 Westshore Plaza Tampa, FL 33609 directions for 813-287-2500 \nOpen today: 11:00 am - 9:00 pm\n\nUntil 3:00pm\n\nBy The Slice\nOrder Now for Tampa - Westshore Directions for Tampa - Westshore More Info for Tampa - Westshore \nIowa\n\nAnkeny - The District at Prairie Trail\n1450 SW Vintage Pkwy Ankeny, IA 50023 directions for (515) 635-1038 \nOpen today: 11:00 am - 10:00 pm\n\nUntil 3:00pm\n\nBy The Slice\nOrder Now for Ankeny - The District at Prairie Trail Directions for Ankeny - The District at Prairie Trail More Info for Ankeny - The District at Prairie Trail \nWest Des Moines - West Glen Town Center\n5485 Mills Civic Pkwy West Des Moines, IA 50266 directions for 515-414-8949 \nOpen today: 11:00 am - 10:00 pm\n\nUntil 3:00pm\n\nBy The Slice\nOrder Now for West Des Moines - West Glen Town Center Directions for West Des Moines - West Glen Town Center More Info for West Des Moines - West Glen Town Center \nIdaho\n\nMeridian\n3573 Longwing Lane, Suite 130 Meridian, ID 83646 directions for 208-884-2031 \nOpen today: 11:00 am - 9:00 pm\n\nUntil 3:00pm\n\nBy The Slice\nOrder Now for Meridian Directions for Meridian More Info for Meridian \nKansas\n\nOverland Park - Prairiefire\n5601 W. 135th Street, Suite 2240 Overland Park, KS 66223 directions for 913-851-5062 \nOpen today: 11:00 am - 9:00 pm\n\nUntil 3:00pm\n\nBy The Slice\nOrder Now for Overland Park - Prairiefire Directions for Overland Park - Prairiefire More Info for Overland Park - Prairiefire \nKentucky\n\nThe Summit at Fritz Farm\n118 Marion, Suite 110 Lexington, KY 40517 directions for 859-523-7503 \nOpen today: 11:00 am - 9:00 pm\n\nUntil 3:00pm\n\nBy The Slice\nOrder Now for The Summit at Fritz Farm Directions for The Summit at Fritz Farm More Info for The Summit at Fritz Farm \nNevada\n\nLas Vegas - South Rainbow\n7155 S. Rainbow Blvd Ste. 125 Las Vegas, NV 89118 directions for 702-207-6757 \nOpen today: 11:00 am - 10:00 pm\n\nUntil 3:00pm\n\nBy The Slice\nOrder Now for Las Vegas - South Rainbow Directions for Las Vegas - South Rainbow More Info for Las Vegas - South Rainbow \nLas Vegas / Henderson – Eastern Ave (Green Valley)\n9595 S. Eastern Ave Ste. 100 Las Vegas, NV 89123 directions for 702-657-9400 \nOpen today: 11:00 am - 10:00 pm\n\nUntil 3:00pm\n\nBy The Slice\nOrder Now for Las Vegas / Henderson – Eastern Ave (Green Valley) Directions for Las Vegas / Henderson – Eastern Ave (Green Valley) More Info for Las Vegas / Henderson – Eastern Ave (Green Valley) \nLas Vegas / Summerlin - Boca Park\n750 S. Rampart Blvd Ste. 7 Las Vegas, NV 89145 directions for 702-479-1351 \nOpen today: 11:00 am - 10:00 pm\n\nUntil 3:00pm\n\nBy The Slice\nOrder Now for Las Vegas / Summerlin - Boca Park Directions for Las Vegas / Summerlin - Boca Park More Info for Las Vegas / Summerlin - Boca Park \nLas Vegas Strip – Palazzo (Grand Canal Shoppes)\n3327 Las Vegas Blvd Ste. 2710 Las Vegas, NV 89109 directions for 702-754-3450 \nOpen today: 11:00 am - 11:00 pm\nOrder Now for Las Vegas Strip – Palazzo (Grand Canal Shoppes) Directions for Las Vegas Strip – Palazzo (Grand Canal Shoppes) More Info for Las Vegas Strip – Palazzo (Grand Canal Shoppes) \nSparks - Outlets at Legends\n1180 Scheel's Dr Ste. B-117 Sparks, NV 89434 directions for 775-356-7373 \nOpen today: 11:00 am - 10:00 pm\n\nUntil 3:00pm\n\nBy The Slice\nOrder Now for Sparks - Outlets at Legends Directions for Sparks - Outlets at Legends More Info for Sparks - Outlets at Legends \nNew York\n\n1 Front Street Brooklyn\n1 Front Street Brooklyn, NY 11201 directions for 718-858-4300 \nOpen today: 11:00 am - 11:00 pm\nOrder Now for 1 Front Street Brooklyn Directions for 1 Front Street Brooklyn More Info for 1 Front Street Brooklyn \nSouth Carolina\n\nMount Pleasant\n1244 Belk Dr. Mt. Pleasant, SC 29464 directions for 843-971-9368 \nOpen today: 11:00 am - 9:00 pm\n\nUntil 3:00pm\n\nBy The Slice\nOrder Now for Mount Pleasant Directions for Mount Pleasant More Info for Mount Pleasant \nTexas\n\nBaybrook Mall\n700 Baybrook Mall, Ste 117 Friendswood, TX 77546 directions for 281-286-3942 \nOpen today: 11:00 am - 10:00 pm\n\nUntil 3:00pm\n\nBy The Slice\nOrder Now for Baybrook Mall Directions for Baybrook Mall More Info for Baybrook Mall \nCinco Ranch - Katy\n2643 Commercial Center Blvd. Ste. C390 Katy, TX 77494 directions for 281-574-0070 \nOpen today: 11:00 am - 10:00 pm\n\nUntil 3:00pm\n\nBy The Slice\nOrder Now for Cinco Ranch - Katy Directions for Cinco Ranch - Katy More Info for Cinco Ranch - Katy \nCityCentre\n12848 Queensbury Lane, Suite 101 Houston, TX 77024 directions for 713-463-3730 \nOpen today: 11:00 am - 10:00 pm\n\nUntil 3:00pm\n\nBy The Slice\nOrder Now for CityCentre Directions for CityCentre More Info for CityCentre \nDallas - Park Lane\n8060 Park Lane N, Ste. 105 Dallas, TX 75231 directions for 214-987-1173 \nOpen today: 11:00 am - 10:00 pm\n\nUntil 3:00pm\n\nBy The Slice\nOrder Now for Dallas - Park Lane Directions for Dallas - Park Lane More Info for Dallas - Park Lane \nDallas - West Village\n3636 McKinney Ave Ste. 190 Dallas, TX 75204 directions for 214-559-4611 \nOpen today: 11:00 am - 10:00 pm\n\nUntil 3:00pm\n\nBy The Slice\nOrder Now for Dallas - West Village Directions for Dallas - West Village More Info for Dallas - West Village \nDomain NORTHSIDE\n11700 Domain Blvd #148 Austin, TX 78758 directions for 512-853-9075 \nOpen today: 11:00 am - 10:00 pm\n\nUntil 3:00pm\n\nBy The Slice\nOrder Now for Domain NORTHSIDE Directions for Domain NORTHSIDE More Info for Domain NORTHSIDE \nEl Paso\n8889 Gateway Blvd. West Suite 1200 El Paso, TX 79925 directions for 915-594-4929 \nOpen today: 11:00 am - 10:00 pm\n\nUntil 3:00pm\n\nBy The Slice\nOrder Now for El Paso Directions for El Paso More Info for El Paso \nGrapevine\n1401 William D. Tate Avenue Ste. 100 Grapevine, TX 76051 directions for 817-488-4547 \nOpen today: 11:00 am - 10:00 pm\n\nUntil 3:00pm\n\nBy The Slice\nOrder Now for Grapevine Directions for Grapevine More Info for Grapevine \nHighland Village\n1101 Shoal Creek, Suite 110 Highland Village, TX 75077 directions for 972-317-1260 \nOpen today: 11:00 am - 10:00 pm\n\nUntil 3:00pm\n\nBy The Slice\nOrder Now for Highland Village Directions for Highland Village More Info for Highland Village \nLa Cantera\n15900 La Cantera Pkway st 25180 San Antonio, TX 78256 directions for 210-690-4949 \nOpen today: 11:00 am - 10:00 pm\n\nUntil 3:00pm\n\nBy The Slice\nOrder Now for La Cantera Directions for La Cantera More Info for La Cantera \nLa Palmera\n5488 S. Padre Island Ste.1202 Corpus Christi, TX 78411 directions for 361-980-8600 \nOpen today: 11:00 am - 10:00 pm\n\nUntil 3:00pm\n\nBy The Slice\nOrder Now for La Palmera Directions for La Palmera More Info for La Palmera \nLas Colinas - Toyota Music Factory\n310 West Las Colinas Boulevard, Suite 100 Irving, TX 75039 directions for 214-496-0337 \nOpen today: 11:00 am - 10:00 pm\n\nUntil 3:00pm\n\nBy The Slice\nOrder Now for Las Colinas - Toyota Music Factory Directions for Las Colinas - Toyota Music Factory More Info for Las Colinas - Toyota Music Factory \nQuarry Village\n330 E. Basse Rd Ste. 101 San Antonio, TX 78209 directions for 210-832-8288 \nOpen today: 11:00 am - 10:00 pm\n\nUntil 3:00pm\n\nBy The Slice\nOrder Now for Quarry Village Directions for Quarry Village More Info for Quarry Village \nStone Oak\n22810 US Hwy. 281 N. Suite 105 San Antonio, TX 78258 directions for 210-481-9236 \nOpen today: 11:00 am - 10:00 pm\n\nUntil 3:00pm\n\nBy The Slice\nOrder Now for Stone Oak Directions for Stone Oak More Info for Stone Oak \nSugar Land - First Colony\n16535 Southwest Freeway Ste. 2500 Sugar Land, TX 77479 directions for 281-265-2280 \nOpen today: 11:00 am - 10:00 pm\n\nUntil 3:00pm\n\nBy The Slice\nOrder Now for Sugar Land - First Colony Directions for Sugar Land - First Colony More Info for Sugar Land - First Colony \nThe Shops at Clearfork\n5276 Monahans Ave. Fort Worth, TX 76109 directions for 817-377-0642 \nOpen today: 11:00 am - 9:00 pm\n\nUntil 3:00pm\n\nBy The Slice\nOrder Now for The Shops at Clearfork Directions for The Shops at Clearfork More Info for The Shops at Clearfork \nThe Shops at Legacy\n5717 Legacy Dr, Suite 110 Plano, TX 75024 directions for 972-782-4212 \nOpen today: 11:00 am - 10:00 pm\n\nUntil 3:00pm\n\nBy The Slice\nOrder Now for The Shops at Legacy Directions for The Shops at Legacy More Info for The Shops at Legacy \nThe Woodlands\n20 Waterway Ave Ste. 100 Woodlands, TX 77380 directions for 281-465-3500 \nOpen today: 11:00 pm - 10:00 pm\n\nUntil 3:00pm\n\nBy The Slice\nOrder Now for The Woodlands Directions for The Woodlands More Info for The Woodlands \nWatters Creek\n836 Watters Creek Blvd, C-200 Allen, TX 75013 directions for 214-383-9703 \nOpen today: 11:00 am - 10:00 pm\n\nUntil 3:00pm\n\nBy The Slice\nOrder Now for Watters Creek Directions for Watters Creek More Info for Watters Creek \nUnited Arab Emirates\n\nAbu Dhabi - Forsan Central Mall\n\nForsan Central Mall – F-42 1st floor 4 Abdulrahman Bin ‘Awf St Khalifa City – Sector 33 – Abu Dhabi, UAE\n02 564 6273 \nOpen today: 10:00 am - 11:00 pm\nVisit Website for Abu Dhabi - Forsan Central Mall More Info for Abu Dhabi - Forsan Central Mall \nDubai - Silicon Central Mall\n\nSilicon Central Mall, 1st floor Dubai Rd - Dubai Silicon Oasis Dubai, UAE\n\nOpen today: 11:00 am - 10:30 pm\nVisit Website for Dubai - Silicon Central Mall More Info for Dubai - Silicon Central Mall \nWisconsin\n\nBrookfield - The Corners\n20119 Lord Street, Space J-101 Brookfield, WI 53045 directions for 262-785-1115 \nOpen today: 11:00 am - 9:00 pm\n\nUntil 3:00pm\n\nBy The Slice\nOrder Now for Brookfield - The Corners Directions for Brookfield - The Corners More Info for Brookfield - The Corners \nEarn Points On Every Order\n\nGet The Grimaldi's Pizzeria Rewards App\nLearn More Learn more about rewards",
      "hash": "2c6406eb4997",
      "downloadedAt": "2026-01-19T16:12:25.534Z",
      "trimmedAt": "2026-01-19T16:13:27.974Z",
      "sizeReduction": "95.5%"
    },
    {
      "url": "https://www.grimaldispizzeria.com/locations/mount-pleasant/",
      "text": "[Page Title: Grimaldi's Pizzeria Mt. Pleasant - Charleston]\n\nMount Pleasant\n\nOpen today: 11:00 am - 9:00 pm\n\nUntil 3:00pm\n\nBy The Slice\n\nAddress\n\n1244 Belk Dr. Mt. Pleasant, SC 29464\n843-971-9368 \nStore Hours\nDay Hours Sunday 11:00 am - 9:00 pm Monday 11:00 am - 9:00 pm Tuesday 11:00 am - 9:00 pm Wednesday 11:00 am - 9:00 pm Thursday 11:00 am - 9:00 pm Friday 11:00 am - 10:00 pm Saturday 11:00 am - 10:00 pm \nAvailable Services\n\nPick-up\n\nDelivery via partner site\n\nFree Wifi\n\nGroup Dining\n\nPatio Seating\n\nWeekday Lunch Combo\n\nArea Manager\nHoward Barishhbarish@grimaldispizzeria.com Order Now Join Waitlist View Menu Directions Directions \nAbout Grimaldi's - Mount Pleasant\n\nGrimaldi’s Pizzeria in Mount Pleasant, SC brings the rich tradition of New York-style pizza—made the Brooklyn way—to the heart of the Lowcountry. Conveniently located at the main entrance of Mount Pleasant Towne Centre, just minutes from Charleston, our restaurant offers an authentic taste of one of New York’s most iconic culinary treasures: coal-fired brick oven pizza.\n\nAt Grimaldi’s, pizza isn’t just a meal—it’s an experience. Our hand-tossed dough is made fresh in-house every day, using our time-honored ‘secret recipe’ to achieve the perfect texture and flavor. Each pizza is topped with our signature sauce, premium mozzarella, and your favorite toppings, then baked to perfection in our coal-fired ovens. This unique cooking method creates a crisp yet chewy crust with that unmistakable, slightly smoky flavor that defines true Brooklyn-style pizza.\n\nOur Mount Pleasant location offers a welcoming and family-friendly atmosphere with a touch of New York nostalgia. Guests can choose to dine indoors beneath our signature wine bottle chandeliers or relax outside on our covered patio, which is pet-friendly and equipped with fans for warm summer days. We also feature a full-service bar with indoor and outdoor seating, perfect for pairing your pizza with a glass of wine or a craft cocktail.\n\nFor those on the go, we make takeout easy with a convenient pick-up station located just inside our side entrance. Ample parking is available in both the front and rear of the building, making your visit as easy and enjoyable as possible.\n\nWhether you’re a local from Mount Pleasant or visiting from Charleston, Grimaldi’s is your destination for authentic New York-style pizza. Join us and discover why our coal-fired, brick oven pizzas are the best in the Charleston area!\n\nLet’s Plan Your Next Event\n\nPlan your next group dining event with Grimaldi’s Pizzeria. Whether you’re celebrating moms, dads, grads, birthdays or any special occasion, celebrate with pizza from Grimaldi’s.\n\nMinimum of 8 guests and 72 hour notice for booking.\nGroup Dining Inquiries \nLocation Menu\nDraft Source A.B.V. \nPeroni\nItaly 5.1% \nBlue Moon Belgian White\nGolden, CO 5.4% \nMiller Lite\nMilwaukee, WI 4.2% \nCoors Light\nGolden, CO 4.2% \nMichelob Ultra\nSt. Louis, MO 4.2% \nModelo Especial\nMexico 4.4% \nSam Adams Seasonal\nBoston, MA VARIES \nStella Artois\nBelgium 5.0% \nLagunitas IPA\nPetaluma, CA 6.2% \nNew Belgium Voodoo Ranger Juicy Haze\nFort Collins, CO 7.0% Bottle Source A.B.V. \nAngry Orchard Cider\nCincinnati, OH 5.0% \nCorona Extra\nMexico 5.0% \nNew Belgium Voodoo Ranger Juicy Haze\nFort Collins, CO 7.0% \nTopo Chico Strawberry Guava Hard Seltzer\nMilwaukee, WI 4.7% \nTruly Wild Berry Hard Seltzer\nBoston, MA 5.0% \nEarn Points On Every Order\n\nGet The Grimaldi's Pizzeria Rewards App\nLearn More Learn more about rewards",
      "hash": "4322f232d983",
      "downloadedAt": "2026-01-19T16:12:25.537Z",
      "trimmedAt": "2026-01-19T16:13:27.988Z",
      "sizeReduction": "98.0%"
    },
    {
      "url": "https://www.grimaldispizzeria.com/menu/",
      "text": "[Page Title: Pizzas Menu - Grimaldi's Pizzeria - Dine-in or Order Online]\n\nMenu\n\nWhether you’re looking to have lunch or dinner, Grimaldi’s has options for everyone! Our menu gives you a taste of our signature Coal Brick-Oven pizza and calzones baked to perfection.\nPizzas Pizzas Starters Drinks Mille Gradi° Desserts Seasonal \nCoal Brick-Oven Pizza\n\nSizes\n\n12″ / 16″ / 18″*\n\n* Pizzas are hand-stretched to measurement. Overall size may shrink during cooking.\n\nTraditional Pizza\n\nOur classic pizza with secret recipe tomato sauce, fresh mozzarella and garnish of basil. Topped with our signature cheese and spice blend.\nOrder Now Details about Traditional Pizza \nWhite with Garlic Pizza\n\nExtra fresh mozzarella, garlic, and an olive oil drizzle and garnish of basil. Topped with our signature cheese and spice blend.\nOrder Now Details about White with Garlic Pizza \nPesto Pizza\n\nFresh mozzarella and basil pesto sauce drizzle and garnish of basil. Topped with our signature cheese and spice blend. (nut free)\nOrder Now Details about Pesto Pizza \nChef’s Selections\n\nSizes\n\n12″ / 16″ / 18″*\n\n* Pizzas are hand-stretched to measurement. Overall size may shrink during cooking.\n\nThe Duo\n\nTwo sauces, two meats, too incredible! It’s our traditional pizza featuring both our famous tomato sauce and pesto sauce, topped with pepperoni and spicy cup ‘n’ char sausage.\nOrder Now Details about The Duo \nExxtra Pepperoni & Hot Honey – Traditional Pizza\n\nExtra pepperoni and garlic on a Traditional pizza, drizzled with Mike's Hot Honey®.\n\nPairs perfectly with\n\nStemmari Nero D’Avola\nOrder Now Details about Exxtra Pepperoni & Hot Honey – Traditional Pizza \nExxtra Pepperoni & Hot Honey – White Pizza\n\nExtra pepperoni and garlic on white pizza, drizzled with Mike's Hot Honey®.\n\nPairs perfectly with\n\nStemmari Nero D’Avola\nOrder Now Details about Exxtra Pepperoni & Hot Honey – White Pizza \nMargherita\n\nTraditional Pizza with extra famous sauce and fresh basil.\n\nPairs perfectly with\n\nPoggiotondo Chianti\nOrder Now Details about Margherita \nBrooklyn Bridge\n\nRoasted red peppers, creamy ricotta cheese and hand-pinched italian sausage, atop our Traditional Pizza.\n\nPairs perfectly with\n\nMichael David “Freakshow” Zinfandel\nOrder Now Details about Brooklyn Bridge \nQuattro Formaggi\n\nMozzarella, asiago, parmesan, pecorino romano & gorgonzola cheese and garnish of basil.\n\nPairs perfectly with\n\nLiberty School Cabernet Sauvignon\nOrder Now Details about Quattro Formaggi \nProsciutto Arugula Pizza\n\nOur classic white pizza topped with thinly sliced prosciutto, shaved cheese blend and fresh arugula.\n\nPairs perfectly with\n\nZ. ALEXANDER BROWN PINOT NOIR\nOrder Now Details about Prosciutto Arugula Pizza \nThe Don\n\nOur Traditional Pizza topped with italian sausage, meatballs and pepperoni.\n\nPairs perfectly with\n\nMille Gradi Sangiovese\nOrder Now Details about The Don \nTuscan Veggie Pizza\n\nTraditional or white pizza, roasted red peppers, artichoke hearts, spinach, garlic & basil.\n\nPairs perfectly with\n\nMille Gradi° Pinot Grigio\nOrder Now Details about Tuscan Veggie Pizza \nBarbecue Chicken Pizza\n\nBARBECUE CHICKEN Sweet Baby Ray’s® Barbecue Sauce, Chicken, Bacon, Red Onion and Fresh Cilantro\n\nPairs perfectly with\n\nCHARLES & CHARLES ROSÉ\nOrder Now Details about Barbecue Chicken Pizza \nIvy Pizza\n\nGrimaldi’s White pizza with garlic, topped with pesto, mushrooms, white onions and jalapeño.\n\nPairs perfectly with\n\nMichael David Sauvignon Blanc\nOrder Now Details about Ivy Pizza \nGluten Friendly**\n\nSizes\n\n12″*\n\n* Pizzas are hand-stretched to measurement. Overall size may shrink during cooking.\n\n12″ Traditional Pizza\nGluten Free Order Now Details about 12″ Traditional Pizza Gluten Free \n12″ White With Garlic Pizza\nGluten Free Order Now Details about 12″ White With Garlic Pizza Gluten Free \n12″ Pesto Pizza\nGluten Free Order Now Details about 12″ Pesto Pizza Gluten Free \nCauliflower**\n\nSizes\n\n12″*\n\n* Pizzas are hand-stretched to measurement. Overall size may shrink during cooking.\n\n12″ Traditional Pizza\nCauliflower Order Now Details about 12″ Traditional Pizza Cauliflower \n12″ White With Garlic Pizza\nCauliflower Crust Order Now Details about 12″ White With Garlic Pizza Cauliflower Crust \n12″ Pesto Pizza\nCauliflower Crust Order Now Details about 12″ Pesto Pizza Cauliflower Crust \nBuild Your Own\n\nSizes\n\n12″ / 16″ / 18″*\n\n* Pizzas are hand-stretched to measurement. Overall size may shrink during cooking.\n\nToppings\n\nArtichoke Hearts\n\nJalapeños\n\nRoasted Sweet Red Peppers\n\nRicotta Cheese\n\nPepperoni\n\nSun Dried Tomatoes\n\nOnions\n\nFresh Garlic\n\nFresh Sliced Roma Tomatoes\n\nKalamata Olives**\n\nBlack Olives**\n\nFresh Baby Spinach\n\nAnchovies\n\nMeatballs\n\nItalian Sausage\n\nSpicy Chicken Sausage\n\nMushrooms\n\nBacon\n\nHam\n\nProsciutto\n\nGrilled Chicken\n\nGreen Peppers\n\nPesto\n\nExtra Mozzarella Cheese\n\nExtra Grimaldi’s Famous Sauce\n\nExtra Basil\n\nCalzone Sauce\n\nFresh Arugula\n\nBases:\n\nTraditional (tomato)\n\nWhite with Garlic (no sauce)\n\nPesto (nut-free)\n\n**Olives may contain pits.\nPricing may vary per location.\nOrder Now Details about Toppings \nCalzones\n\nSizes\n\n12″ / 16″ / 18″*\n\n* Pizzas are hand-stretched to measurement. Overall size may shrink during cooking.\n\nCalzone\n\nHand tossed dough stuffed with ricotta cheese, oregano, black pepper, romano cheese and fresh parsley.\nOrder Now Details about Calzone \nGluten Friendly Crust\n\n**Our gluten-friendly and cauliflower crusts have a gluten content of less than 20ppm based on information provided by our ingredient suppliers; however, we cannot guarantee that pizzas made with these crusts will be gluten-free as we prepare all of our pizzas in a common kitchen with a risk of gluten exposure. In addition, certain toppings contain gluten. We do not recommend these pizzas for guests with Celiac Disease. Guests with gluten sensitivities should exercise judgment in consuming these pizzas.\nNutritional Information \nEarn Points On Every Order\n\nGet The Grimaldi's Pizzeria Rewards App\nLearn More Learn more about rewards",
      "hash": "7b5a8a6f3afc",
      "downloadedAt": "2026-01-19T16:12:25.541Z",
      "trimmedAt": "2026-01-19T16:13:28.013Z",
      "sizeReduction": "97.0%"
    }
  ],
  "sizeReduction": "97.0%"
}