{
  "venueId": "ChIJoZ9CqpZw_ogRY_lj-v2WlcM",
  "venueName": "Charleston Harbor Fish House - Southern Fare from the Land and Sea",
  "venueArea": "Mount Pleasant",
  "website": "http://www.charlestonharborfishhouse.com/",
  "scrapedAt": "2026-01-19T16:12:34.859Z",
  "trimmedAt": "2026-01-19T16:13:30.002Z",
  "pages": [
    {
      "url": "http://www.charlestonharborfishhouse.com/",
      "text": "[Page Title: Charleston Harbor Fish House | Fresh Local Seafood]\n\nThe Charleston Harbor Fish House\n\nSouthern Fare from the Land and Sea\n\nWe’re located conveniently on Patriots Point for easy access by land or sea. Serving South Carolina Coastal cuisine featuring dishes from the land and sea with local favorites like Shrimp & Grits, Surf and Turf and more. The views from the Fish House are like none other in Charleston; views of the historic Charleston skyline, the USS Yorktown and Marina from every table in the restaurant. The restaurant is divided into 3 distinct seating areas with the porch offering an Indoor/ Outdoor experience with custom surround garage doors, the main dining room offers a lively atmosphere with the bar and a brick fireplace and the Harbor Room is the smallest dining room ideal for parties or a more intimate experience. Come in the evening to view the most spectacular sunsets from the Bridge Bar, located on the rooftop of the Fish House for the unparalleled views.\n\nWe are open daily from 7:00am to 9:00pm.  Patrons are encouraged to make reservations for dinner.  Parking is conveniently located in the lot adjacent to the restaurant and parking vouchers are validated with a meal purchase.  You may also come by boat, please call the Charleston Harbor Marina at 843-284-7067 or hail us by VHF on Channel 16.\nBook a Reservation Online \nMenus\n\nClick a menu below to learn more.\n\nBreakfast Buffet Friday, Saturday, SUNDAY\nAdults $22.00 Per Person Children under 12 $11.00 Per Person \nBreakfast Served Daily 7:00 am – 10:30 am\nWaffle or French Toast Scrambled Eggs with Cheddar Cheese Bacon Sausage Breakfast Potatoes Toast, Pastries & Muffins Caprese Avocado Toast Brisket Hash Pancakes Pancake of the day (Varies Plain, Blueberry, Chocolate Chip) Grits Smoked Salmon Seasonal Fruit Yogurt & Granola A 20% gratuity and 3% service fee will be added to parties of 8 or more. To expedite service, no separate checks for parties of 8 or more. Menu subject to change at any time. Please call 843-284-7019 to have the most up to date menu emailed to you \nYour content goes here. Edit or remove this text inline or in the module Content settings. You can also style every aspect of this content in the module Design settings and even apply custom CSS to this text in the module Advanced settings.\n\nLunch\nLunch Served Daily 11:00 am – 3:00 pm Chilled Seafood Shrimp Cocktail                                                       18/35 1/2 or Full Pound of Shrimp, Cocktail Sauce, Cajun Remoulade, Lemon Tuna Tartare                                                                 16 Ahi Tuna, Pickled Okra and Tomato Relish, Lemon Zest, Garlic, Shallots, served with Baguette Lobster, Shrimp, Blue Crab, Lemon Aioli served with Sliced Baguette Lobster & Seafood Salad                                           18 Starters Oysters Rockefeller                                                      20 Creamed Spinach, Bearnaise Sauce, Parmesan Cheese, Panko Dip Platter                                                                       15 Hummus, Pimento Cheese, Pita Chips, Crudites Crispy Fried Calamari                                                   15 Spicy Marinara Peach Hot Honey Shrimp                                             16 Grilled Shrimp, Peach Hot Honey Sauce, Garden Slaw Soup & Salad She Crab Soup                                                                 12 Double Cream, Sherry, Fresh Crab Meat Southern Caesar Salad                                                   12 Romaine Hearts, Caesar Dressing, Freshly Shaven Parmesan, Rustic Croutons Garden Salad                                                                    12 Mixed Greens, Cherry Tomatoes, Cucumbers, Red Onion, Dried Cranberries, Citrus-Mustard Vinaigrette Burrata Salad                                                                    16 Citrus-roasted Red and Golden Beets, Burrata, Heirloom Carrots, Pecan Crumble, Baby Arugula, Pomegranate Molasses Chicken 8  /  Shrimp 9 / Salmon 12 Salad Add Ons: Sandwiches Double Burger 18 Double Smashed Patty, Lettuce Tomato, Caramelized Onion, Bacon, American Cheese, Fancy Sauce, Fries Grilled Chicken Sandwich 16 Lettuce, Tomato, Guacamole, Sundried Tomato Aioli, Brioche Bun, Kettle Chips Mahi Tacos 15 Grilled Mahi Mahi, Lettuce, M Cilantro Cream Sauce, Kettle Chips Shrimp Tacos 15 Grilled Shrimp, Cilantro– Lime Slaw, Sriracha Aioli, Kettle Chips Sliced BBQ Brisket, Garden Slaw, Jalapeno Chutney, Caramelized Onions on a Brioche Bun, French Fries BBQ Brisket Sandwich                                                       20 Fried Grouper, Bacon, Lettuce, Tomato, Remoulade, Sourdough Bread, Kettle Chips Fried Grouper BLT                                                                23 Main Course Honey-Garlic Salmon                                                            26 Seared Salmon, Green Onion and Cheddar Grits, Grilled Asparagus, Honey–Garlic Glaze Fried Fish n Chips 25 Fried Cod, Tartar sauce, French Fries, Garden Slaw Wild Mushroom Fettuccine                                                26 Cremini and Porcini Mushroom Cream Sauce with Crispy Fried Shallots Lobster Ravioli 31 Spicy Tomato Cream Sauce, Shaved Parmesan, Wilted Arugula, Lobster Meat, Served with Charred Baguette Slices Fried Shrimp & Oyster Platter 25 Cocktail Sauce, Fries, Garden Slaw Premium Sides \nGraden Slaw, Truffle Fries, Cucumber & Tomato Salad, French Fries or Mixed Berries\n6 \nA 20% gratuity and 3% service fee will be added to parties of 8 or more. To expedite service, no separate checks for parties of 8 or more.  Menu subject to change at any time.\n\nDINNEr\nDinner 4:30pm -9:00 pm – Sunday through Thursday Dinner 4:30pm -10:00 pm – Friday & Saturday Chilled Seafood Shrimp Cocktail                                                                18/35 1/2 or Full Pound of Shrimp, Cocktail Sauce, Cajun Remoulade, Lemon Tuna Tartare                                                                           16 Ahi Tuna, Pickled Okra and Tomato Relish, Lemon Zest, Garlic, Shallots, served with Baguette Lobster, Shrimp, Blue Crab, Lemon Aioli served with Sliced Baguette Seafood Salad                                                                        19 Starters Crispy Fried Calamari                                                        15 Spicy Marinara Southern Cornbread                                                          12 Whipped Sorghum Honey Butter Artichoke Baked Ricotta                                                    15 Ricotta, Artichoke, Cream, Parmesan Cheese, Tomato Compote served with Baguette Crostini Peach Hot Honey Shrimp                                                  16 Sweet Chili, Honey, Lime, Banana Peppers, Vegetable Slaw Dip Platter                                                                            15 Hummus, Pimento Cheese, Pita Chips, Crudites P.E.I Mussels                                                                         17 Sautéed Mussels, Ham Hock Broth, Garlic, Shallots, Okra, Stewed Tomatoes, Smoked Ham, served with Sliced Baguette Soup & Salad Add Ons Chicken 8 \\ Shrimp 9 \\ Salmon 12 She Crab Soup                                                                         12 Double Cream, Sherry, Fresh Crab Meat Southern Caesar Salad                                                           12 Romaine Hearts, Caesar Dressing, Shaved Parmesan, Croutons Garden Salad                                                                             12 Mixed Greens, Cherry Tomatoes, Cucumbers, Red Onion, Dried Cranberries, Citrus-Mustard Vinaigrette Main Course Roasted Market Fish                                                            38 Mushroom Risotto, Broccolini, Citrus Beurre Blanc Prosecco Rose’, Lamarca, Italy – 14 Crab Stuffed Grouper                                                          44 Sweet Potato and Brussels Sprouts Hash, Brown Butter Sauce Chardonnay, Josh, CA – 14 Seafood Fettuccine 35 Mussels, Shrimp, Scallops, Lobster Meat, Cream Sauce, Served with Sliced Baguette Pinot Grigio, Ecco Domani, Italy –  12 Pan Seared Diver Scallops                                                  43 Root Vegetable Risotto, Asparagus, Lemon Beurre Blanc Chardonnay, Josh, California – 14 Grilled Salmon                                                                      29 Smashed Potatoes, Broccolini, Parmesan, Citrus Beurre Blanc Rose’, La Jolie Fleur, France – 13 Charleston Shrimp and Grits                                             29 Grilled Shrimp, Bacon Lardons, Tomato Broth, Grits, Sweet Peppers Brut, Mumm Napa, CA – 14 Fried Fish & Chips 25 Cod, Tartar Sauce, French Fries, Peach Coleslaw Sauvignon Blanc, Kono, New Zealand – 13 Lobster Ravioli                                                                       31 Spicy Tomato Cream Sauce, Shaved Parmesan, Wilted Arugula, Lobster Meat, Charred Bread Pinot Grigio, Ecco Domani, Italy –  12 Fried Shrimp & Oyster Platter                                            25 Cocktail Sauce, French Fries, Peach Cole Slaw Brut, Mumm Napa, CA – 14 Braised Short Rib                                                                  38 8-Hour Braised Short Rib, Smashed Potatoes, Roasted Root Vegetables, Fried Leeks, Pinot Noir Demi Glaze Cabernet Sauvignon, Josh, California – 16 \n$6 al a carte Parmesan Truffle Fries Garden Slaw Smashed Potatoes Cucumber & Tomato Salad Sweet Potato-Brussel Sprout Hash\nPremium Sides Proud to Call the Lowcountry Home! \nA 20% gratuity and 3% service fee will be added to parties of 8 or more. To expedite service, no separate checks for parties of 8 or more.  Menu subject to change at any time.\n\nPrivate Dining\nIn addition to our fantastic views and fresh menu options, we have four (4) distinct areas available for large parties or private bookings for up to 150 people.  Contact us today to check availability for hosting a corporate luncheon, business dinner, bridal luncheon, rehearsal dinner, reception, baby shower, or group happy hour. Click Here to Learn More For availability and additional information on hosting parties of 18 or more at the Fish House, you may contact our Sales Team at , via email at or by simply completing the inquiry form below. 843-284-7046 sales@charlestonharborresort.com \nWe look forward to hosting your next event soon.\n\nVenue Descriptions\n\nClick each toggle to learn more.\n\nYacht Club\nEXPERIENCE UNSURPASSED VIEWS The Yacht Club is the newest, most exclusive addition to the already existing 10,000 square feet of meeting space at Charleston Harbor Resort & Marina.  This 2,100 square foot event space is made almost completely of windows overlooking the Charleston Harbor Marina and picturesque Charleston skyline.  In addition to a view like no other, the space features reclaimed wooden planks for the flooring to give that nautical feel while using recycled materials.  The space has drop ceilings with stained wooden beams, audio visual connections and built-in sound system. Capacity: 175 Reception 120 Banquet 100 Classroom 180 Theater Square Feet: 2,100 \nBridge Bar\nFRESH SEAFOOD. FRESH DRINKS. FRESH AIR. Enjoy the views from this beautiful open air bar on the Charleston Harbor overlooking the USS Yorktown and historic Charleston skyline.  The only view of the entire Charleston skyline from Mt. Pleasant with 180 degree view of the Ravenel Bridge to downtown to the Atlantic Ocean.  Enjoy peaceful bliss with friends, family and loved ones in the friendliest city in the U.S. \nThe Harbor Room\nThis semi-private dining space off the main dining room in the Charleston Harbor Fish House. Existing seating can accommodate up to 44 people over looking the USS Yorktown out to the Ravenel Bridge with a beautiful sunset, should you time your gathering in the afternoon. \nFish House Porch\n1,350 square feet of separate dining space with climate control and large screen doors that can be opened seasonally to let the fresh harbor breeze flow through.  Existing seating can accommodate up to 72 people and can be used for reception space for up to 100 people. \nHoliday Parties\nThe Charleston Harbor Fish House is the perfect location for hosting holiday parties, end of year client events, or customer celebrations. With a variety of locations and options to fit all budgets, spaces do book quickly during the holiday season. Contact us today to confirm your Yuletide festivities at the premier waterfront location in Charleston. \nLarge Party Inquiries\n\nCharleston Harbor Resort Sales Team\nsales@charlestonharborresort.com \nInquiry Form\nName Email Address Subject Message Submit ☆ ☆ ☆ ☆ ☆ \n“Made a last minute reservation with no problem. Had an amazing view at sunset. Our server Hannah was excellent and the food was fantastic! Highly recommend.”\n\n-Devin Morris, Google Reviews\n☆ ☆ ☆ ☆ \nWOWZA! Absolutely stellar service by Tanniel and some of the best food I’ve had in Charleston. The view of the USS Yorktown and USS Laffey is a great perk!\n\n-Stimpy R., Google Reviews\n☆ ☆ ☆ ☆ \nThe food here is delicious! Such a wide variety. Highly recommend the cornbread skillet. The views of the harbor and the USS Yorktown are unbelievable as you dine.\n\n-Kristy A., Google Reviews\n\nLocation, Hours and Contact\n\nPHONE\n\n843-284-7019\n\nEMAIL\nfishhouse@charlestonharborresort.com \nADDRESS\n\n32 Patriots Point RoadMount Pleasant, South Carolina 29464\n\nHOURS\n\nBreakfast Hours:\n\n7am- 10:30am\n\nLunch Hours:\n\n11:30am – 3pm*\n\nDinner Hours:\n\n4:30pm – 9pm Sunday – Thursday | 4:30pm – 10pm Friday & Saturday\n\nReservations Strongly Recommended for Dinner\n\n*Limited menu from 3:00 PM to 4:30 PM\n\nSOCIAL MEDIA\nFollow Follow Follow Call for a Reservation Book a Reservation Online \nPlease note: for special requests or specific times, we recommend calling us directly at 843-284-7019, as availability during peak times can be determined more accurately through phone reservations over online bookings through Open Table.",
      "hash": "0b2380f07a8d",
      "downloadedAt": "2026-01-19T16:12:26.371Z",
      "trimmedAt": "2026-01-19T16:13:29.902Z",
      "sizeReduction": "95.6%"
    },
    {
      "url": "http://www.charlestonharborfishhouse.com/#location",
      "text": "[Page Title: Charleston Harbor Fish House | Fresh Local Seafood]\n\nThe Charleston Harbor Fish House\n\nSouthern Fare from the Land and Sea\n\nWe’re located conveniently on Patriots Point for easy access by land or sea. Serving South Carolina Coastal cuisine featuring dishes from the land and sea with local favorites like Shrimp & Grits, Surf and Turf and more. The views from the Fish House are like none other in Charleston; views of the historic Charleston skyline, the USS Yorktown and Marina from every table in the restaurant. The restaurant is divided into 3 distinct seating areas with the porch offering an Indoor/ Outdoor experience with custom surround garage doors, the main dining room offers a lively atmosphere with the bar and a brick fireplace and the Harbor Room is the smallest dining room ideal for parties or a more intimate experience. Come in the evening to view the most spectacular sunsets from the Bridge Bar, located on the rooftop of the Fish House for the unparalleled views.\n\nWe are open daily from 7:00am to 9:00pm.  Patrons are encouraged to make reservations for dinner.  Parking is conveniently located in the lot adjacent to the restaurant and parking vouchers are validated with a meal purchase.  You may also come by boat, please call the Charleston Harbor Marina at 843-284-7067 or hail us by VHF on Channel 16.\nBook a Reservation Online \nMenus\n\nClick a menu below to learn more.\n\nBreakfast Buffet Friday, Saturday, SUNDAY\nAdults $22.00 Per Person Children under 12 $11.00 Per Person \nBreakfast Served Daily 7:00 am – 10:30 am\nWaffle or French Toast Scrambled Eggs with Cheddar Cheese Bacon Sausage Breakfast Potatoes Toast, Pastries & Muffins Caprese Avocado Toast Brisket Hash Pancakes Pancake of the day (Varies Plain, Blueberry, Chocolate Chip) Grits Smoked Salmon Seasonal Fruit Yogurt & Granola A 20% gratuity and 3% service fee will be added to parties of 8 or more. To expedite service, no separate checks for parties of 8 or more. Menu subject to change at any time. Please call 843-284-7019 to have the most up to date menu emailed to you \nYour content goes here. Edit or remove this text inline or in the module Content settings. You can also style every aspect of this content in the module Design settings and even apply custom CSS to this text in the module Advanced settings.\n\nLunch\nLunch Served Daily 11:00 am – 3:00 pm Chilled Seafood Shrimp Cocktail                                                       18/35 1/2 or Full Pound of Shrimp, Cocktail Sauce, Cajun Remoulade, Lemon Tuna Tartare                                                                 16 Ahi Tuna, Pickled Okra and Tomato Relish, Lemon Zest, Garlic, Shallots, served with Baguette Lobster, Shrimp, Blue Crab, Lemon Aioli served with Sliced Baguette Lobster & Seafood Salad                                           18 Starters Oysters Rockefeller                                                      20 Creamed Spinach, Bearnaise Sauce, Parmesan Cheese, Panko Dip Platter                                                                       15 Hummus, Pimento Cheese, Pita Chips, Crudites Crispy Fried Calamari                                                   15 Spicy Marinara Peach Hot Honey Shrimp                                             16 Grilled Shrimp, Peach Hot Honey Sauce, Garden Slaw Soup & Salad She Crab Soup                                                                 12 Double Cream, Sherry, Fresh Crab Meat Southern Caesar Salad                                                   12 Romaine Hearts, Caesar Dressing, Freshly Shaven Parmesan, Rustic Croutons Garden Salad                                                                    12 Mixed Greens, Cherry Tomatoes, Cucumbers, Red Onion, Dried Cranberries, Citrus-Mustard Vinaigrette Burrata Salad                                                                    16 Citrus-roasted Red and Golden Beets, Burrata, Heirloom Carrots, Pecan Crumble, Baby Arugula, Pomegranate Molasses Chicken 8  /  Shrimp 9 / Salmon 12 Salad Add Ons: Sandwiches Double Burger 18 Double Smashed Patty, Lettuce Tomato, Caramelized Onion, Bacon, American Cheese, Fancy Sauce, Fries Grilled Chicken Sandwich 16 Lettuce, Tomato, Guacamole, Sundried Tomato Aioli, Brioche Bun, Kettle Chips Mahi Tacos 15 Grilled Mahi Mahi, Lettuce, M Cilantro Cream Sauce, Kettle Chips Shrimp Tacos 15 Grilled Shrimp, Cilantro– Lime Slaw, Sriracha Aioli, Kettle Chips Sliced BBQ Brisket, Garden Slaw, Jalapeno Chutney, Caramelized Onions on a Brioche Bun, French Fries BBQ Brisket Sandwich                                                       20 Fried Grouper, Bacon, Lettuce, Tomato, Remoulade, Sourdough Bread, Kettle Chips Fried Grouper BLT                                                                23 Main Course Honey-Garlic Salmon                                                            26 Seared Salmon, Green Onion and Cheddar Grits, Grilled Asparagus, Honey–Garlic Glaze Fried Fish n Chips 25 Fried Cod, Tartar sauce, French Fries, Garden Slaw Wild Mushroom Fettuccine                                                26 Cremini and Porcini Mushroom Cream Sauce with Crispy Fried Shallots Lobster Ravioli 31 Spicy Tomato Cream Sauce, Shaved Parmesan, Wilted Arugula, Lobster Meat, Served with Charred Baguette Slices Fried Shrimp & Oyster Platter 25 Cocktail Sauce, Fries, Garden Slaw Premium Sides \nGraden Slaw, Truffle Fries, Cucumber & Tomato Salad, French Fries or Mixed Berries\n6 \nA 20% gratuity and 3% service fee will be added to parties of 8 or more. To expedite service, no separate checks for parties of 8 or more.  Menu subject to change at any time.\n\nDINNEr\nDinner 4:30pm -9:00 pm – Sunday through Thursday Dinner 4:30pm -10:00 pm – Friday & Saturday Chilled Seafood Shrimp Cocktail                                                                18/35 1/2 or Full Pound of Shrimp, Cocktail Sauce, Cajun Remoulade, Lemon Tuna Tartare                                                                           16 Ahi Tuna, Pickled Okra and Tomato Relish, Lemon Zest, Garlic, Shallots, served with Baguette Lobster, Shrimp, Blue Crab, Lemon Aioli served with Sliced Baguette Seafood Salad                                                                        19 Starters Crispy Fried Calamari                                                        15 Spicy Marinara Southern Cornbread                                                          12 Whipped Sorghum Honey Butter Artichoke Baked Ricotta                                                    15 Ricotta, Artichoke, Cream, Parmesan Cheese, Tomato Compote served with Baguette Crostini Peach Hot Honey Shrimp                                                  16 Sweet Chili, Honey, Lime, Banana Peppers, Vegetable Slaw Dip Platter                                                                            15 Hummus, Pimento Cheese, Pita Chips, Crudites P.E.I Mussels                                                                         17 Sautéed Mussels, Ham Hock Broth, Garlic, Shallots, Okra, Stewed Tomatoes, Smoked Ham, served with Sliced Baguette Soup & Salad Add Ons Chicken 8 \\ Shrimp 9 \\ Salmon 12 She Crab Soup                                                                         12 Double Cream, Sherry, Fresh Crab Meat Southern Caesar Salad                                                           12 Romaine Hearts, Caesar Dressing, Shaved Parmesan, Croutons Garden Salad                                                                             12 Mixed Greens, Cherry Tomatoes, Cucumbers, Red Onion, Dried Cranberries, Citrus-Mustard Vinaigrette Main Course Roasted Market Fish                                                            38 Mushroom Risotto, Broccolini, Citrus Beurre Blanc Prosecco Rose’, Lamarca, Italy – 14 Crab Stuffed Grouper                                                          44 Sweet Potato and Brussels Sprouts Hash, Brown Butter Sauce Chardonnay, Josh, CA – 14 Seafood Fettuccine 35 Mussels, Shrimp, Scallops, Lobster Meat, Cream Sauce, Served with Sliced Baguette Pinot Grigio, Ecco Domani, Italy –  12 Pan Seared Diver Scallops                                                  43 Root Vegetable Risotto, Asparagus, Lemon Beurre Blanc Chardonnay, Josh, California – 14 Grilled Salmon                                                                      29 Smashed Potatoes, Broccolini, Parmesan, Citrus Beurre Blanc Rose’, La Jolie Fleur, France – 13 Charleston Shrimp and Grits                                             29 Grilled Shrimp, Bacon Lardons, Tomato Broth, Grits, Sweet Peppers Brut, Mumm Napa, CA – 14 Fried Fish & Chips 25 Cod, Tartar Sauce, French Fries, Peach Coleslaw Sauvignon Blanc, Kono, New Zealand – 13 Lobster Ravioli                                                                       31 Spicy Tomato Cream Sauce, Shaved Parmesan, Wilted Arugula, Lobster Meat, Charred Bread Pinot Grigio, Ecco Domani, Italy –  12 Fried Shrimp & Oyster Platter                                            25 Cocktail Sauce, French Fries, Peach Cole Slaw Brut, Mumm Napa, CA – 14 Braised Short Rib                                                                  38 8-Hour Braised Short Rib, Smashed Potatoes, Roasted Root Vegetables, Fried Leeks, Pinot Noir Demi Glaze Cabernet Sauvignon, Josh, California – 16 \n$6 al a carte Parmesan Truffle Fries Garden Slaw Smashed Potatoes Cucumber & Tomato Salad Sweet Potato-Brussel Sprout Hash\nPremium Sides Proud to Call the Lowcountry Home! \nA 20% gratuity and 3% service fee will be added to parties of 8 or more. To expedite service, no separate checks for parties of 8 or more.  Menu subject to change at any time.\n\nPrivate Dining\nIn addition to our fantastic views and fresh menu options, we have four (4) distinct areas available for large parties or private bookings for up to 150 people.  Contact us today to check availability for hosting a corporate luncheon, business dinner, bridal luncheon, rehearsal dinner, reception, baby shower, or group happy hour. Click Here to Learn More For availability and additional information on hosting parties of 18 or more at the Fish House, you may contact our Sales Team at , via email at or by simply completing the inquiry form below. 843-284-7046 sales@charlestonharborresort.com \nWe look forward to hosting your next event soon.\n\nVenue Descriptions\n\nClick each toggle to learn more.\n\nYacht Club\nEXPERIENCE UNSURPASSED VIEWS The Yacht Club is the newest, most exclusive addition to the already existing 10,000 square feet of meeting space at Charleston Harbor Resort & Marina.  This 2,100 square foot event space is made almost completely of windows overlooking the Charleston Harbor Marina and picturesque Charleston skyline.  In addition to a view like no other, the space features reclaimed wooden planks for the flooring to give that nautical feel while using recycled materials.  The space has drop ceilings with stained wooden beams, audio visual connections and built-in sound system. Capacity: 175 Reception 120 Banquet 100 Classroom 180 Theater Square Feet: 2,100 \nBridge Bar\nFRESH SEAFOOD. FRESH DRINKS. FRESH AIR. Enjoy the views from this beautiful open air bar on the Charleston Harbor overlooking the USS Yorktown and historic Charleston skyline.  The only view of the entire Charleston skyline from Mt. Pleasant with 180 degree view of the Ravenel Bridge to downtown to the Atlantic Ocean.  Enjoy peaceful bliss with friends, family and loved ones in the friendliest city in the U.S. \nThe Harbor Room\nThis semi-private dining space off the main dining room in the Charleston Harbor Fish House. Existing seating can accommodate up to 44 people over looking the USS Yorktown out to the Ravenel Bridge with a beautiful sunset, should you time your gathering in the afternoon. \nFish House Porch\n1,350 square feet of separate dining space with climate control and large screen doors that can be opened seasonally to let the fresh harbor breeze flow through.  Existing seating can accommodate up to 72 people and can be used for reception space for up to 100 people. \nHoliday Parties\nThe Charleston Harbor Fish House is the perfect location for hosting holiday parties, end of year client events, or customer celebrations. With a variety of locations and options to fit all budgets, spaces do book quickly during the holiday season. Contact us today to confirm your Yuletide festivities at the premier waterfront location in Charleston. \nLarge Party Inquiries\n\nCharleston Harbor Resort Sales Team\nsales@charlestonharborresort.com \nInquiry Form\nName Email Address Subject Message Submit ☆ ☆ ☆ ☆ ☆ \n“Made a last minute reservation with no problem. Had an amazing view at sunset. Our server Hannah was excellent and the food was fantastic! Highly recommend.”\n\n-Devin Morris, Google Reviews\n☆ ☆ ☆ ☆ \nWOWZA! Absolutely stellar service by Tanniel and some of the best food I’ve had in Charleston. The view of the USS Yorktown and USS Laffey is a great perk!\n\n-Stimpy R., Google Reviews\n☆ ☆ ☆ ☆ \nThe food here is delicious! Such a wide variety. Highly recommend the cornbread skillet. The views of the harbor and the USS Yorktown are unbelievable as you dine.\n\n-Kristy A., Google Reviews\n\nLocation, Hours and Contact\n\nPHONE\n\n843-284-7019\n\nEMAIL\nfishhouse@charlestonharborresort.com \nADDRESS\n\n32 Patriots Point RoadMount Pleasant, South Carolina 29464\n\nHOURS\n\nBreakfast Hours:\n\n7am- 10:30am\n\nLunch Hours:\n\n11:30am – 3pm*\n\nDinner Hours:\n\n4:30pm – 9pm Sunday – Thursday | 4:30pm – 10pm Friday & Saturday\n\nReservations Strongly Recommended for Dinner\n\n*Limited menu from 3:00 PM to 4:30 PM\n\nSOCIAL MEDIA\nFollow Follow Follow Call for a Reservation Book a Reservation Online \nPlease note: for special requests or specific times, we recommend calling us directly at 843-284-7019, as availability during peak times can be determined more accurately through phone reservations over online bookings through Open Table.",
      "hash": "79e948fcbb27",
      "downloadedAt": "2026-01-19T16:12:26.377Z",
      "trimmedAt": "2026-01-19T16:13:29.952Z",
      "sizeReduction": "95.6%"
    },
    {
      "url": "http://www.charlestonharborfishhouse.com/#menus",
      "text": "[Page Title: Charleston Harbor Fish House | Fresh Local Seafood]\n\nThe Charleston Harbor Fish House\n\nSouthern Fare from the Land and Sea\n\nWe’re located conveniently on Patriots Point for easy access by land or sea. Serving South Carolina Coastal cuisine featuring dishes from the land and sea with local favorites like Shrimp & Grits, Surf and Turf and more. The views from the Fish House are like none other in Charleston; views of the historic Charleston skyline, the USS Yorktown and Marina from every table in the restaurant. The restaurant is divided into 3 distinct seating areas with the porch offering an Indoor/ Outdoor experience with custom surround garage doors, the main dining room offers a lively atmosphere with the bar and a brick fireplace and the Harbor Room is the smallest dining room ideal for parties or a more intimate experience. Come in the evening to view the most spectacular sunsets from the Bridge Bar, located on the rooftop of the Fish House for the unparalleled views.\n\nWe are open daily from 7:00am to 9:00pm.  Patrons are encouraged to make reservations for dinner.  Parking is conveniently located in the lot adjacent to the restaurant and parking vouchers are validated with a meal purchase.  You may also come by boat, please call the Charleston Harbor Marina at 843-284-7067 or hail us by VHF on Channel 16.\nBook a Reservation Online \nMenus\n\nClick a menu below to learn more.\n\nBreakfast Buffet Friday, Saturday, SUNDAY\nAdults $22.00 Per Person Children under 12 $11.00 Per Person \nBreakfast Served Daily 7:00 am – 10:30 am\nWaffle or French Toast Scrambled Eggs with Cheddar Cheese Bacon Sausage Breakfast Potatoes Toast, Pastries & Muffins Caprese Avocado Toast Brisket Hash Pancakes Pancake of the day (Varies Plain, Blueberry, Chocolate Chip) Grits Smoked Salmon Seasonal Fruit Yogurt & Granola A 20% gratuity and 3% service fee will be added to parties of 8 or more. To expedite service, no separate checks for parties of 8 or more. Menu subject to change at any time. Please call 843-284-7019 to have the most up to date menu emailed to you \nYour content goes here. Edit or remove this text inline or in the module Content settings. You can also style every aspect of this content in the module Design settings and even apply custom CSS to this text in the module Advanced settings.\n\nLunch\nLunch Served Daily 11:00 am – 3:00 pm Chilled Seafood Shrimp Cocktail                                                       18/35 1/2 or Full Pound of Shrimp, Cocktail Sauce, Cajun Remoulade, Lemon Tuna Tartare                                                                 16 Ahi Tuna, Pickled Okra and Tomato Relish, Lemon Zest, Garlic, Shallots, served with Baguette Lobster, Shrimp, Blue Crab, Lemon Aioli served with Sliced Baguette Lobster & Seafood Salad                                           18 Starters Oysters Rockefeller                                                      20 Creamed Spinach, Bearnaise Sauce, Parmesan Cheese, Panko Dip Platter                                                                       15 Hummus, Pimento Cheese, Pita Chips, Crudites Crispy Fried Calamari                                                   15 Spicy Marinara Peach Hot Honey Shrimp                                             16 Grilled Shrimp, Peach Hot Honey Sauce, Garden Slaw Soup & Salad She Crab Soup                                                                 12 Double Cream, Sherry, Fresh Crab Meat Southern Caesar Salad                                                   12 Romaine Hearts, Caesar Dressing, Freshly Shaven Parmesan, Rustic Croutons Garden Salad                                                                    12 Mixed Greens, Cherry Tomatoes, Cucumbers, Red Onion, Dried Cranberries, Citrus-Mustard Vinaigrette Burrata Salad                                                                    16 Citrus-roasted Red and Golden Beets, Burrata, Heirloom Carrots, Pecan Crumble, Baby Arugula, Pomegranate Molasses Chicken 8  /  Shrimp 9 / Salmon 12 Salad Add Ons: Sandwiches Double Burger 18 Double Smashed Patty, Lettuce Tomato, Caramelized Onion, Bacon, American Cheese, Fancy Sauce, Fries Grilled Chicken Sandwich 16 Lettuce, Tomato, Guacamole, Sundried Tomato Aioli, Brioche Bun, Kettle Chips Mahi Tacos 15 Grilled Mahi Mahi, Lettuce, M Cilantro Cream Sauce, Kettle Chips Shrimp Tacos 15 Grilled Shrimp, Cilantro– Lime Slaw, Sriracha Aioli, Kettle Chips Sliced BBQ Brisket, Garden Slaw, Jalapeno Chutney, Caramelized Onions on a Brioche Bun, French Fries BBQ Brisket Sandwich                                                       20 Fried Grouper, Bacon, Lettuce, Tomato, Remoulade, Sourdough Bread, Kettle Chips Fried Grouper BLT                                                                23 Main Course Honey-Garlic Salmon                                                            26 Seared Salmon, Green Onion and Cheddar Grits, Grilled Asparagus, Honey–Garlic Glaze Fried Fish n Chips 25 Fried Cod, Tartar sauce, French Fries, Garden Slaw Wild Mushroom Fettuccine                                                26 Cremini and Porcini Mushroom Cream Sauce with Crispy Fried Shallots Lobster Ravioli 31 Spicy Tomato Cream Sauce, Shaved Parmesan, Wilted Arugula, Lobster Meat, Served with Charred Baguette Slices Fried Shrimp & Oyster Platter 25 Cocktail Sauce, Fries, Garden Slaw Premium Sides \nGraden Slaw, Truffle Fries, Cucumber & Tomato Salad, French Fries or Mixed Berries\n6 \nA 20% gratuity and 3% service fee will be added to parties of 8 or more. To expedite service, no separate checks for parties of 8 or more.  Menu subject to change at any time.\n\nDINNEr\nDinner 4:30pm -9:00 pm – Sunday through Thursday Dinner 4:30pm -10:00 pm – Friday & Saturday Chilled Seafood Shrimp Cocktail                                                                18/35 1/2 or Full Pound of Shrimp, Cocktail Sauce, Cajun Remoulade, Lemon Tuna Tartare                                                                           16 Ahi Tuna, Pickled Okra and Tomato Relish, Lemon Zest, Garlic, Shallots, served with Baguette Lobster, Shrimp, Blue Crab, Lemon Aioli served with Sliced Baguette Seafood Salad                                                                        19 Starters Crispy Fried Calamari                                                        15 Spicy Marinara Southern Cornbread                                                          12 Whipped Sorghum Honey Butter Artichoke Baked Ricotta                                                    15 Ricotta, Artichoke, Cream, Parmesan Cheese, Tomato Compote served with Baguette Crostini Peach Hot Honey Shrimp                                                  16 Sweet Chili, Honey, Lime, Banana Peppers, Vegetable Slaw Dip Platter                                                                            15 Hummus, Pimento Cheese, Pita Chips, Crudites P.E.I Mussels                                                                         17 Sautéed Mussels, Ham Hock Broth, Garlic, Shallots, Okra, Stewed Tomatoes, Smoked Ham, served with Sliced Baguette Soup & Salad Add Ons Chicken 8 \\ Shrimp 9 \\ Salmon 12 She Crab Soup                                                                         12 Double Cream, Sherry, Fresh Crab Meat Southern Caesar Salad                                                           12 Romaine Hearts, Caesar Dressing, Shaved Parmesan, Croutons Garden Salad                                                                             12 Mixed Greens, Cherry Tomatoes, Cucumbers, Red Onion, Dried Cranberries, Citrus-Mustard Vinaigrette Main Course Roasted Market Fish                                                            38 Mushroom Risotto, Broccolini, Citrus Beurre Blanc Prosecco Rose’, Lamarca, Italy – 14 Crab Stuffed Grouper                                                          44 Sweet Potato and Brussels Sprouts Hash, Brown Butter Sauce Chardonnay, Josh, CA – 14 Seafood Fettuccine 35 Mussels, Shrimp, Scallops, Lobster Meat, Cream Sauce, Served with Sliced Baguette Pinot Grigio, Ecco Domani, Italy –  12 Pan Seared Diver Scallops                                                  43 Root Vegetable Risotto, Asparagus, Lemon Beurre Blanc Chardonnay, Josh, California – 14 Grilled Salmon                                                                      29 Smashed Potatoes, Broccolini, Parmesan, Citrus Beurre Blanc Rose’, La Jolie Fleur, France – 13 Charleston Shrimp and Grits                                             29 Grilled Shrimp, Bacon Lardons, Tomato Broth, Grits, Sweet Peppers Brut, Mumm Napa, CA – 14 Fried Fish & Chips 25 Cod, Tartar Sauce, French Fries, Peach Coleslaw Sauvignon Blanc, Kono, New Zealand – 13 Lobster Ravioli                                                                       31 Spicy Tomato Cream Sauce, Shaved Parmesan, Wilted Arugula, Lobster Meat, Charred Bread Pinot Grigio, Ecco Domani, Italy –  12 Fried Shrimp & Oyster Platter                                            25 Cocktail Sauce, French Fries, Peach Cole Slaw Brut, Mumm Napa, CA – 14 Braised Short Rib                                                                  38 8-Hour Braised Short Rib, Smashed Potatoes, Roasted Root Vegetables, Fried Leeks, Pinot Noir Demi Glaze Cabernet Sauvignon, Josh, California – 16 \n$6 al a carte Parmesan Truffle Fries Garden Slaw Smashed Potatoes Cucumber & Tomato Salad Sweet Potato-Brussel Sprout Hash\nPremium Sides Proud to Call the Lowcountry Home! \nA 20% gratuity and 3% service fee will be added to parties of 8 or more. To expedite service, no separate checks for parties of 8 or more.  Menu subject to change at any time.\n\nPrivate Dining\nIn addition to our fantastic views and fresh menu options, we have four (4) distinct areas available for large parties or private bookings for up to 150 people.  Contact us today to check availability for hosting a corporate luncheon, business dinner, bridal luncheon, rehearsal dinner, reception, baby shower, or group happy hour. Click Here to Learn More For availability and additional information on hosting parties of 18 or more at the Fish House, you may contact our Sales Team at , via email at or by simply completing the inquiry form below. 843-284-7046 sales@charlestonharborresort.com \nWe look forward to hosting your next event soon.\n\nVenue Descriptions\n\nClick each toggle to learn more.\n\nYacht Club\nEXPERIENCE UNSURPASSED VIEWS The Yacht Club is the newest, most exclusive addition to the already existing 10,000 square feet of meeting space at Charleston Harbor Resort & Marina.  This 2,100 square foot event space is made almost completely of windows overlooking the Charleston Harbor Marina and picturesque Charleston skyline.  In addition to a view like no other, the space features reclaimed wooden planks for the flooring to give that nautical feel while using recycled materials.  The space has drop ceilings with stained wooden beams, audio visual connections and built-in sound system. Capacity: 175 Reception 120 Banquet 100 Classroom 180 Theater Square Feet: 2,100 \nBridge Bar\nFRESH SEAFOOD. FRESH DRINKS. FRESH AIR. Enjoy the views from this beautiful open air bar on the Charleston Harbor overlooking the USS Yorktown and historic Charleston skyline.  The only view of the entire Charleston skyline from Mt. Pleasant with 180 degree view of the Ravenel Bridge to downtown to the Atlantic Ocean.  Enjoy peaceful bliss with friends, family and loved ones in the friendliest city in the U.S. \nThe Harbor Room\nThis semi-private dining space off the main dining room in the Charleston Harbor Fish House. Existing seating can accommodate up to 44 people over looking the USS Yorktown out to the Ravenel Bridge with a beautiful sunset, should you time your gathering in the afternoon. \nFish House Porch\n1,350 square feet of separate dining space with climate control and large screen doors that can be opened seasonally to let the fresh harbor breeze flow through.  Existing seating can accommodate up to 72 people and can be used for reception space for up to 100 people. \nHoliday Parties\nThe Charleston Harbor Fish House is the perfect location for hosting holiday parties, end of year client events, or customer celebrations. With a variety of locations and options to fit all budgets, spaces do book quickly during the holiday season. Contact us today to confirm your Yuletide festivities at the premier waterfront location in Charleston. \nLarge Party Inquiries\n\nCharleston Harbor Resort Sales Team\nsales@charlestonharborresort.com \nInquiry Form\nName Email Address Subject Message Submit ☆ ☆ ☆ ☆ ☆ \n“Made a last minute reservation with no problem. Had an amazing view at sunset. Our server Hannah was excellent and the food was fantastic! Highly recommend.”\n\n-Devin Morris, Google Reviews\n☆ ☆ ☆ ☆ \nWOWZA! Absolutely stellar service by Tanniel and some of the best food I’ve had in Charleston. The view of the USS Yorktown and USS Laffey is a great perk!\n\n-Stimpy R., Google Reviews\n☆ ☆ ☆ ☆ \nThe food here is delicious! Such a wide variety. Highly recommend the cornbread skillet. The views of the harbor and the USS Yorktown are unbelievable as you dine.\n\n-Kristy A., Google Reviews\n\nLocation, Hours and Contact\n\nPHONE\n\n843-284-7019\n\nEMAIL\nfishhouse@charlestonharborresort.com \nADDRESS\n\n32 Patriots Point RoadMount Pleasant, South Carolina 29464\n\nHOURS\n\nBreakfast Hours:\n\n7am- 10:30am\n\nLunch Hours:\n\n11:30am – 3pm*\n\nDinner Hours:\n\n4:30pm – 9pm Sunday – Thursday | 4:30pm – 10pm Friday & Saturday\n\nReservations Strongly Recommended for Dinner\n\n*Limited menu from 3:00 PM to 4:30 PM\n\nSOCIAL MEDIA\nFollow Follow Follow Call for a Reservation Book a Reservation Online \nPlease note: for special requests or specific times, we recommend calling us directly at 843-284-7019, as availability during peak times can be determined more accurately through phone reservations over online bookings through Open Table.",
      "hash": "fd3f5b180320",
      "downloadedAt": "2026-01-19T16:12:26.381Z",
      "trimmedAt": "2026-01-19T16:13:30.002Z",
      "sizeReduction": "95.6%"
    }
  ],
  "sizeReduction": "95.6%"
}