{
  "venueId": "ChIJs5MtKAx6_ogRInNicW1wtNg",
  "venueName": "Magnolias",
  "venueArea": "Downtown Charleston",
  "website": "https://magnoliascharleston.com/?utm_source=google&utm_medium=local",
  "scrapedAt": "2026-01-19T16:12:35.166Z",
  "trimmedAt": "2026-01-19T16:13:33.432Z",
  "pages": [
    {
      "url": "https://magnoliascharleston.com/menus/",
      "text": "[Page Title: Menus - Magnolias Restaurant in Charleston, SC]\n\nSkip to content Dinner Menu Lunch Menu Brunch Menu Dessert Menu Wine List",
      "hash": "596b1ed27629",
      "downloadedAt": "2026-01-19T16:12:27.848Z",
      "trimmedAt": "2026-01-19T16:13:33.415Z",
      "sizeReduction": "99.5%"
    },
    {
      "url": "https://magnoliascharleston.com/?utm_source=google&utm_medium=local",
      "text": "[Page Title: Home - Magnolias Restaurant in Charleston, SC]\n\nSkip to content \nDefiningfor over 30 years.\nSouthern Cuisine Learn More \n, paving the way for a new generation of Lowcountry cooking in the city and across the entire South. A staple in Charleston for over 30 years, Magnolias remains a forerunner in upscale Southern cuisine, presenting traditional ingredients and cooking techniques elevated by modern flair and artful presentation.\nIn the summer of 1990, Magnolias ignited a culinary renaissance upon opening in Charleston, S.C. Upscale Southern Cuisine \nFood\nThe \nLed by Culinary Director Kelly Franz, our celebrated menu of Lowcountry fine dining fare features classics like Fried Green Tomatoes, Grilled Filet of Beef and Shellfish Gumbo, along with modern interpretations of traditional local cuisine including Lowcountry Bouillabaisse and Parmesan Crusted Market Catch.\nView The Menus Print PDF Menu Magnolias \nRestaurant\nThe \nA 1739 map shows 185 East Bay Street to be the site of Charleston’s original Customs House. Over the next 150 years, the original Customs House building underwent various changes until being substantially damaged in the earthquake of 1887.\n\nIn December 1989, the present-day building was purchased by the Parsell Family and the project began to reinstate the site to a destination of importance and prestige as it was in the days of the old Custom House. In July 1990, 185 East Bay Street recaptured that former prominence opening as Magnolias Uptown Down South. The restaurant is open for lunch, Monday – Saturday, brunch on Sundays and dinner nightly.\nMake A Reservation Kelly Franz \nChef\nThe \nThis August, we bid a fond farewell to our retiring Culinary Arts Director, Chef Donald Drake who has led Magnolias for over two decades. At the same time, we are excited to announce Chef Kelly Franz has returned to the restaurant as Culinary Director. Below is a little background about Kelly's journey as a chef. Please stay tuned for more about Chef Kelly and her team, along with menu updates, news and events.\n\nKelly Franz’s early life shaped her love of food and cooking. “Growing up in a traveling military family often meant experiencing different cultures through food,” says Franz. “My time in the kitchen began at a young age when I would help my father cook Sunday brunch. Eventually, food became a passion, where even grocery shopping was part of the fun.” \n\nFranz moved to Charleston in 2002 to attend the Culinary Institute of Charleston (at Trident Technical College). While a student, she joined Magnolias in November 2003, becoming the restaurant’s Sous Chef in 2005. Franz’s leadership skills and strong work ethic propelled her through the ranks; she became Chef de Cuisine in 2009 and Executive Chef in 2015. She was hired by Kiawah Island’s Food & Beverage team in 2019 and worked at several of the resort’s restaurants, rising to the position of Executive Chef at the prestigious River Club. \n\nFranz has received recognition and accolades from notable publications including USA Today, National Culinary Review and Wine Spectator. Additionally, Franz was runner-up in season 6 of the Food Network’s Cutthroat Kitchen and appeared on Bite Club with (Magnolias alum) Chef Tyler Florence. She is an active member of the Charleston community, serving the local Chapter of Les Dames d’Escoffier among other causes.\nWhen not in the kitchen at Magnolias, Franz enjoys spending time with her husband and son on a fishing boat in the Charleston Harbor, enjoying Folly Beach and entertaining at her home on James Island.\nDiscoverOurMenus \nGift the Magnolias Experience with our Gift Cards!\nPurchase Now Make Your Event Special \nDining\nPrivate \nThe Upper-Level Gallery offers two elegant dining rooms located directly above Magnolias restaurant. With a separate entrance on historic Lodge Alley leading to a spiral staircase and lounge area, these private rooms are the ideal venue for your next event. With its own kitchen, the Upper-Level Gallery is able to serve your group while maintaining Magnolias' high culinary standards. The Wine Room can accommodate groups of up to 24 and features a beautiful bay window overlooking Charleston's historic district. Alternatively, the Primrose Room comfortably seats up to 72 overlooking Lodge Alley and its neighboring courtyard.\nLearn More Gifts & Products \nShop\nOur \nBring a touch of Magnolias home with you.\nShop Now",
      "hash": "91324b8baf9f",
      "downloadedAt": "2026-01-19T16:12:27.851Z",
      "trimmedAt": "2026-01-19T16:13:33.430Z",
      "sizeReduction": "95.8%"
    },
    {
      "url": "https://magnoliascharleston.com/menus",
      "text": "[Page Title: Menus - Magnolias Restaurant in Charleston, SC]\n\nSkip to content Dinner Menu Lunch Menu Brunch Menu Dessert Menu Wine List",
      "hash": "af5c0decb613",
      "downloadedAt": "2026-01-19T16:12:27.852Z",
      "trimmedAt": "2026-01-19T16:13:33.432Z",
      "sizeReduction": "99.5%"
    }
  ],
  "sizeReduction": "97.1%"
}