{
  "venueId": "ChIJd5dH_05z_ogR9uALXAA7wp0",
  "venueName": "Nick's German Kitchen",
  "venueArea": "Mount Pleasant",
  "website": "http://www.nicksgerman.com/",
  "scrapedAt": "2026-01-19T16:12:34.096Z",
  "trimmedAt": "2026-01-19T16:13:23.295Z",
  "pages": [
    {
      "url": "http://www.nicksgerman.com/",
      "text": "[Page Title: Nicks German Kitchen | Modern German Fare in Charleston, South Carolina]\n\nModern German Fare\n\nJoin us at Nick’s for the scratch made German favorites likeSchnitzel, Spätzle, Strudel & More. No Lederhosen necessary!\nView Menu Reservation 7 \nOur Story\nNick’s German Kitchen \nGerman food with a modern twist… that is Nick’s German Kitchen!\n\nRestaurateurs Nick & Kelly have been serving their German favorites since 2004 when they opened up their boutique restaurant “Mezzo” in Darmstadt Germany, a combination of German & Italian cuisine served in an intimate upscale location. Fast forward 15 years to 2019… Nick & Kelly opened up a new “Mezzo” in Charleston, South Carolina. Serving an upbeat blend of European specialties with a heavy emphasis on German and Italian, Mezzo found many followers in the greater Charleston area. By far the favorite items on Chef Nick’s diverse menu: the Schnitzel!  So many came just for Schnitzel and Spaetzle alone that after two years of Mezzo, Nick & Kelly decided to answer the overwhelming demand for more of Nick’s German specialties and rebranded to Nick’s German Kitchen in 2021.\n\nFeaturing scratch-made German specialties like Schnitzel, Spaetzle and more, Nick’s German Kitchen offers an authentic German kitchen infused with a modern vibe. Flavorful, fresh and appealing, Nick’s German will make you rethink everything you think you know about German food! Guten Appetit!\n\nnot your oma’s german\n\nEssen gut, alles gut\n\nIt’s time to rethink your ideas about German food. Nick’s German Kitchen features modern German specialties that are authentic without being old-fashioned.  Because you don’t need Lederhosen to eat like a Jäger!\nView Our Menu \nWiener Schnitzel\nWie·​ner schnit·​zel | \\ ˈvē-nər-ˌshnit-səl : a thin breaded veal cutlet \nSpätzle\n: a small dumpling cooked by running batter through a colander into boiling water Such as Cheese Spaetzle \nStrudel\nstru·​del | \\ ˈstrü-dᵊl a pastry made from a thin sheet of dough rolled up with filling and baked.Such as : Apple Strudel \nKartoffelpuffer\n/kaʁˈtɔfl̩ˌpʊfɐ/ potato pancake : \nWurst\n/wɝst/, /vɝst/, /vʊɹst/ A German- or Austrian-style sausageSuch as Bratwurst : \nBrezel\n\n/ˈbreːtsəl/\n\npretzel; any kind of baked good in the form of a loose knot\n: \nTestimonials\n\nWhat People are Saying\n\n“A Great Find”\n\n““\nExcellent wait staff and food was outstanding. We are from the northeast and we’re looking for good food aside from the traditional southern cuisine. Needless to say we have found an excellent date night restaurant and will continue to go there. Charlie \n“Just like in Europe”\n\n“ “\nThere’s not enough space here to write how great a place this is. You just have to experience it. Bryon \n“Love this spot”\n\n““\nFrom start to finish our experience was fantastic. Everyone was gracious and kind. The restaurant truly has a warm energetic friendly atmosphere that makes you feel like you are in a cafe in Europe. The cuisine is DELICIOUS. Linda \n“Neighborhood Gem”\n\n“\nExcellent European dishes. Service is good. Owners Nick and Kelly are delightful hosts and enjoy mingling with clients. .” Mark F. \nDon’t Miss\n\nWhat’s Up at Nick’s\n\nJoin Us for Schnitzel Nights, Thirsty Thursday & Much More!\nTakeout \nWant to enjoy your Schnitzel, Spaetzle & Strudel at home? Now available online...\nread more Thirsty Thursday \nEvery Thursday it's time for wine! Wines by the bottle are 50% off ($100 & under) from 4-8 pm. Come enjoy our wide selection of European and...\nread more Schnitzel Nights \nGerman Food Fans get ready to enjoy your favorite Nick's Schnitzel on Tuesday & Wednesday! Our authentic Pork Schnitzel Specialties are $5 off both...\nread more Read More NICKS’S GERMAN KITCHEN 1150 Hungryneck BlvdMount Pleasant, SC 29464(843) 535-9565eat@nicksgerman.com \nÖffnungszeiten\nTUE – THU 4:00pm – 9:00pm FRI & SAT 4:00pm – 10:00pm SUN & MON We are closed Make a Reservation \nNick's Newsletter\n\nBecause you've got to knowwhat-the-schnitzel's going on!\n\nThanks for reaching out! You'll hear back from us soon!\ncontact us",
      "hash": "8e3bd3f96202",
      "downloadedAt": "2026-01-19T16:12:24.040Z",
      "trimmedAt": "2026-01-19T16:13:23.295Z",
      "sizeReduction": "98.1%"
    }
  ],
  "sizeReduction": "98.1%"
}