{
  "venueId": "ChIJlxxFERJ6_ogRyuFVYZioWlY",
  "venueName": "Food For the Southern Soul",
  "venueArea": "North Charleston",
  "website": "http://www.foodforthesouthernsoul.com/",
  "scrapedAt": "2026-01-19T16:12:34.698Z",
  "trimmedAt": "2026-01-19T16:13:28.578Z",
  "pages": [
    {
      "url": "http://www.foodforthesouthernsoul.com/",
      "text": "[Page Title: Food for the Southern Soul]\n\n×\nOnline Store Our Story Like Follow Instagram \nPO Box 30279, Charleston, SC 29417\n Email: \n Products: 800.538.0003\n\nContact Us\n[email protected] We grow rice on our family farm and simmer freshly picked vegetables with herbs and spices to create our delicious soups. Add chicken or shrimp to one of our soups and serve over Lavington Farms Charleston Gold rice for an easy meal that will feed your Southern soul. In the South, we take our grilling seriously. Use our Food for the Southern Soul dry rubs, marinades and finishing sauces to be your own backyard professional. Charleston Favorites Grits are made from select Southern corn and ground on an authentic millstone. Choose white, yellow or mixed variety and enjoy the small flecks of corn bran ~ they’re the sign you’re eating bonafide stone ground grits. Our Farm & Field marinade is a proprietary blend of spices including rosemary, basil, garlic, molasses and soy sauce to flavor and tenderize everything from summer veggies to pork tenderloin, chicken or venison. Fresh shrimp is a staple in the South ~ use our Tidewater Shrimp sauce to channel your inner Southerner and create a perfect supper for a crowd. Serve with crusty bread, and lots of napkins. \nFeatured Products\nCharleston Favorites Vegetable Soup View Product Charleston Favorites Okra Soup View Product Charleston Favorites Grits View Product Tidewater Shrimp Sauce View Product Charleston Favorites Pickled Okra View Product Charleston Favorites Jerusalem Artichoke Relish View Product Farm & Field Marinade View Product BlackJack Barbecue sauces View Product BlackJack Barbecue Dry Rub View Product Charleston Favorites Benne Wafers View Product Lavington Farms Charleston Gold Rice View Product Lavington Farms Cane Syrup View Product Our handmade gourmet foods are a celebration of all we love about Charleston and the South Carolina Lowcountry. \nOur Story\n\"...there's something even greater: Southern soul.\" Learn More \nIn the South, we pass down recipes like names and silver. We eat food grown and harvested from our own fertile fields. We cook, serve, and share with those we love. We smoke meats low and slow, grind corn, and turn sugar cane into magical umber syrup.\n\nOn the farm, we learn that there’s something deep and essential about food. Something primal about rolling up your sleeves and digging your hands into living earth. Something about the delicious beauty of peeling shrimp on the dock–and Sunday morning grits. Something that speaks to the roots of things.\n\nAt home, we learn how to nurture. We learn patience. We learn about the unity of work and pleasure. And we’ve come to understand that this way of life is one worth preserving –and celebrating with as many people as possible. Because beyond family, community, land, and culture, there’s something even greater: Southern soul. And it’s up to us to feed it.\n\nShrimp & Grits. Yes & Please.\n\nStart your own Southern tradition with our delicious stone-ground grits and Tidewater Shrimp Sauce & Marinade.\nSHOP NOW \nTake Your Shrimp Up A Notch With Our Tidewater Shrimp Sauce.\nShop Now \nFrom Our Instagram\n@food4southsoul See What We're Up To \nOur Twittersphere\n@FoodForTheSouthernSoul Follow Us",
      "hash": "d10f330506df",
      "downloadedAt": "2026-01-19T16:12:25.671Z",
      "trimmedAt": "2026-01-19T16:13:28.578Z",
      "sizeReduction": "84.4%"
    }
  ],
  "sizeReduction": "84.4%"
}