{
  "venueId": "ChIJCz9fzw16_ogRdAmRMXhXsuE",
  "venueName": "The Spectator Hotel",
  "venueArea": "Downtown Charleston",
  "website": "https://thespectatorhotel.com/?utm_source=google&utm_medium=organic&utm_campaign=business_listing",
  "scrapedAt": "2026-01-19T16:12:31.650Z",
  "trimmedAt": "2026-01-19T16:12:47.034Z",
  "pages": [
    {
      "url": "https://thespectatorhotel.com/?utm_source=google&utm_medium=organic&utm_campaign=business_listing",
      "text": "[Page Title: The Spectator Hotel | Homepage | Official Site]\n\nSkip to content \nAll For You\n\nThe Most Elite Way\n\nTo Experience Downtown Charleston\nOffering the best address in Charleston’s bustling historic district, The Spectator Hotel evokes the exuberance of the Jazz Age and the genteel glamour of the Old South. Step inside our sophisticated boutique jewel and discover why, year after year, we are recognized among Charleston’s top hotels. READ MORE \nReasons You’ll Love Us\n\n01\n\nPersonal Butler Services\n\n01\n\nPersonal Butler Services\n\nEnjoy the absolute attentiveness of a personal butler. The Spectator is the only hotel in Charleston with a personal butler for every guest.\nRead More \n02\n\nCharleston's Most Enviable Address\n\n02\n\nCharleston's Most Enviable Address\n\nRevel in an unmatched location at the corner of State and Linguard Streets just one block from the renowned Charleston City Market. We’re just steps from the city’s historic landmarks, cobblestone streets, and antebellum mansions.\nRead More \n03\n\nGourmet Breakfast in Bed\n\n03\n\nGourmet Breakfast in Bed\n\nExperience the simple luxury of butler-delivered breakfast featuring seasonal, locally sourced favorites.\nRead More \n04\n\nThe Bar at The Spectator\n\n04\n\nThe Bar at The Spectator\n\nScore a seat in The Bar, named one of the country’s top five bars by USA TODAY. It’s everything you imagine a Charleston hotspot should be...right down to the private label bourbon.\nRead More \n05\n\nSpacious Rooms with Luxury Amenities\n\n05\n\nSpacious Rooms with Luxury Amenities\n\nUnwind amid the lavish comfort of our guestrooms and suites featuring Nespresso machines, heated towel racks, and local Deep Steep bath amenities.\nRead More \nUnrivaled Polish\nREAD MORE \nToast The Good Life\nRead More SET YOUR SIGHTS ON CHARLESTON Gibbes Museum Of Art Philadelphia Alley MARION SQUARE WATERFRONT PARK COLLEGE OF CHARLESTON The Battery Historic City Market Rainbow Row CALHOUN ST COOPER RIVER HASELL ST KING ST S. BATTERY ASHLEY RIVER BROAD ST EAST BAY ST \nSET YOUR SIGHTS ON CHARLESTON\n\nTHE HOLY CITY\nGo on a whirlwind tour of Charleston, where parks, galleries, the historic Charleston City Market, and landmarks of national importance are just steps from some of the most creative culinary artistry in the country \nGibbes Museum Of Art\n0.3 MILES | 6 MIN \nLocated in a striking Beaux Arts building, this art museum houses a premier collection of over 10,000 works of fine art, many with a connection to the Old South and Historic Charleston.\n\nPhiladelphia Alley\n0.1 MILES | 3 MIN Take the path less travelled through this quiet, one-block stretch nestled between Church and State Street. Perfect for a beautiful walk downtown during the day or even a midnight stroll. \nMARION SQUARE\n0.7 MILES | 16 MIN \nFor locals and frequent visitors, Marion Square is much more than just a pretty block of green space spanning 10 acres. It is home to weekend Farmer's Markets, festival events, and more between Meeting Street and King Street.\n\nWATERFRONT PARK\n0.3 MILES | 7 MIN \nThis eight-acre park facing Charleston Harbor is known for its picturesque Pineapple Fountain and inviting fishing pier lined with wooden swings.\n\nCOLLEGE OF CHARLESTON\n0.6 MILES | 13 MIN \nFounded in 1770, this institution is the oldest college in South Carolina, featuring National Historic Landmarks like the Randolph Hall and the Cistern. This one is one of Butler David's Recommendations.\n\nThe Battery\n0.9 MILES | 19 MIN \nFamous for its stately historic homes, The Battery is a Civil War-era defensive seawall and beloved promenade stretching along the lower shores of the Charleston peninsula.\n\nHistoric City Market\n\nAround the corner from us is the cultural heart of our historic city. The City Market is a pivotal stop for those looking for handcrafted trinkets and a glimpse into life in the Old South.\n\nRainbow Row\n0.4 MILES | 9 MIN \nKnown as Rainbow Row since the 1930s, this series of 13 pastel-colored historic houses is among the most photographed locations in Charleston.\nEXPLORE Previous \nLook Around\nNext View More",
      "hash": "fccd047e6566",
      "downloadedAt": "2026-01-19T16:12:16.231Z",
      "trimmedAt": "2026-01-19T16:12:47.034Z",
      "sizeReduction": "94.6%"
    }
  ],
  "sizeReduction": "94.6%"
}