{
  "venueId": "ChIJ6SoyknBl_ogRlasNn90qfdY",
  "venueName": "Basil Park Circle",
  "venueArea": "North Charleston",
  "website": "http://eatatbasil.com/north-charleston",
  "scrapedAt": "2026-01-19T16:12:31.340Z",
  "trimmedAt": "2026-01-19T16:12:44.092Z",
  "pages": [
    {
      "url": "http://eatatbasil.com/north-charleston",
      "text": "[Page Title: North Charleston - Basil Thai Restaurant |]\n\n-\n\nRefinedThai\nMenu Gallery Visit Reservations Employment Opportunities Contact Us Basil Gift Cards Reservations \n(843) 225-8161\nContact Us \nToday\n\n5P - 9P\nView All Hours \nNorth Charleston, SC\nGet Driving Directions \nOur Menu\n\nPLEASE NOTE: Menu prices vary with location and time of day.\n\nWe are open for dine-in, carry-out and delivery. Click the link below for carry-out and delivery options.\nOrder Online \nDinner\n\n5P - 9P\n\nView Menu\n\nAppetizers\nFresh Basil Rolls Shrimp, rice noodles, lettuce, bean sprouts and basil, wrapped in a rice paper wrapper. Served with Chef Suntorn’s house sauce. 6.00 (2) 8.25 (3) Egg Rolls Egg roll wrapper stuffed with egg roll fillings (no meat). Served with sweet and sour sauce. 3.95 (2) 5.95 (3) Stuffed Shrimp Seasoned ground chicken, egg roll wrapper. Served with Chef Suntorn’s sauce. 8.95 (5) Fried Wontons Chicken, shrimp, and cream cheese, wonton wrapper. Served with Chef Suntorn’s sauce. 5.95 Satay Choice of chicken or beef, skewered and grilled, served with peanut sauce. *Can be gluten-free upon request 7.95 Neua Nam Tok Grilled steak mixed with ground rice, onions, scallions, mint, cilantro, chili powder,fish sauce and lemon juice. Served with a wedge of cabbage. 7.95 Nam Sod (Chicken or Pork) Minced meat mixed with ginger, scallions, cilantro, onions, peanuts, chili powder, fish sauce and lemon juice. Served with a wedge of Iceberg lettuce. 7.00 (Chicken Only) Larb (Chicken or Beef) Minced meat spiced with ground rice, onions, mint, scallions, cilantro, chili powder, lemon juice and fish sauce. Served with a wedge of cabbage. 7.00 (Chicken Only) Thai Chicken Wings Chicken marinated with soy sauce, garlic powder, and white pepper. Served with fish sauce and lime juice with fresh Thai chilies sauce. 7.95 Steamed Dumplings Chicken, shrimp, pork, water chesnut, mushroom, scallion. 8.95 \nSoups\nTom Kha Gai (Chicken Coconut) Cup Sliced chicken breast cooked in coconut milk with galanga roots, lime leaves, lemon grass, button mushrooms, cilantro and scallions. 3.95 Tom Kha Gai (Chicken Coconut) Tureen Sliced chicken breast cooked in coconut milk with galanga roots, lime leaves, lemon grass, button mushrooms, cilantro and scallions. 7.95 Tom Yum Kung (Shrimp Hot and Sour) (Shrimp Hot and Sour) Tom Yum broth flavored with galanga roots, lime leaves, lemon grass, button mushrooms, cilantro and scallions. 8.95 Wonton Soup Chicken broth, wontons stuffed with shrimp and chicken, napa cabbage, scallions, cilantro and garlic. 9.95 \nSalads\nYum Neua (Beef Salad) Grilled steak mixed with cucumbers, onions, tomatoes, mint, cilantro, scallions, chili powder, lemon juice and fish sauce. Served on a bed of Romaine lettuce. 7.95 Yum Kung (Shrimp Salad) Shrimp mixed with cucumbers, onions, tomatoes, mint, cilantro, scallions, chili powder, lemon juice and fish sauce. Served on a bed of Romaine lettuce. 7.95 Som Tum (Green Papaya Shrimp Salad) \nShredded green papaya, green beans, tomatoes, garlic, Thai chilies, palm sugar, fish sauce and lime juice. Tossed with and .\nboiled shrimp crushed peanuts 7.95 Yum Ped (Duck Salad) Fried pulled duck mixed with celery, onions, pineapple, carrots, ginger, cashew nuts, scallions and cilantro. Served with a wedge of Iceberg lettuce. 6.95 Yum Yai Iceberg lettuce mixed with cucumbers, onions, tomatoes, mushrooms, tofu, hard-boiled eggs, mint, cilantro, and scallions. Served with egg-peanut dressing. 5.95 Woon Sen Salad Chicken and shrimp tossed with cellophane noodles, tomatoes, garlic, scallions, onions, cilantro, mint,\ncelery, whole peanuts, Thai chilis, palm sugar, fish sauce and fresh lime juice. 7.95 \nSpecialties\nPad Thai Rice noodles stir-fried with chicken & shrimp, eggs, bean sprouts, scallions, peanuts and Pad Thai sauce. Served with a wedge of lime. (The National dish of Thailand) 10.95 Basil Duck Boneless half duck deep-fried, topped with basil, bell peppers, onions, garlic, snow peas, and button mushrooms. Stir-fried with our house Basil Sauce. 21.95/ 12.95 (half) Basil Mixed Seafood Shrimp, scallops, calamari, and green tipped mussels all stirred with onions, bell peppers and basil leaves. 19.95 Barramundi & Shrimp Asian Sea Bass lightly floured and deep fried, topped with ginger, mushrooms, onions, carrots, and scallions in our house ginger sauce. 17.95 Red Curry Duck Chef Suntorn’s Signature Dish. Boneless half duck deep-fried, topped with bell peppers, basil, green peas, snow peas, tomatoes, and pineapple. Dressed in red curry sauce. 21.95/ 12.95 (half) Barramundi Lightly floured and deep fried, then stir-fried in your choice of or sauce. Basil Curry 14.95 \nEntrees\n\nAll stir-fry dishes are served with Thai Jasmine rice and choice of beef, chicken, shrimp, pork or tofu.\nPad Prik Basil, bell peppers and onions, Prik King curry sauce. 10.95 Basil Basil, bell peppers, onions, and garlic, Thai chili sauce. 10.95 Ginger Juliennes of ginger, mushrooms, onions, carrots, and scallions. 10.95 Garlic Black pepper garlic sauce. Served on a bed of Romaine lettuce. 11.95 Sweet and Sour Onions, bell peppers, cucumbers, tomatoes, pineapples and scallions. 11.95 Prik King String beans, Prik King curry sauce. 10.95 Cashew Nuts Cashew nuts, bell peppers, onions and scallions. 10.95 Vegetables Delight Medley of green beans, bean sprouts, snow peas, mushrooms, broccoli, carrots and Napa cabbage stir-fried in a soy-based sauce. 10.95 Vegetables Delight (Vegetable only) Medley of green beans, bean sprouts, snow peas, mushrooms, broccoli, carrots and Napa cabbage stir-fried in a soy-based sauce. 9.95 \nCurries\n\nAll curries can be made gluten-free upon request and are served with Thai Jasmine rice and choice of beef, chicken, shrimp, pork or tofu.\nGreen Curry Bell peppers, bamboo shoots, eggplants, green peas and basil. 9.50 Masaman Potatoes, onions and cashew nuts. 9.50 Red Curry Bell peppers, bamboo shoots, and basil. 9.50 \nNoodles And Rice\n\nNoodle and rice dishes are made with choice of beef, chicken, shrimp, pork or tofu.\nPad See-Eu Flat rice noodles Stir-fried with eggs, broccoli, garlic and sweet soy sauce. 10.95 Pad Kee Mow Flat rice noodles stir-fried with tomato, onions, bell peppers and basil. 10.95 Pad Woon Sen Cellophane noodles, eggs, napa cabbage, onions, carrots, snow peas, tomatoes, mushrooms, scallions, and bean sprouts. 10.95 Thai Noodles Thin egg noodles stir-fried with green beans, tomatoes, basil, and mushrooms. 10.95 Vegetable Fried Rice Onions, carrots, green peas, mushrooms, broccoli, snow peas and egg.\n\n*(Mount Pleasant locations not gluten-free)* 8.95 Beef Fried Rice All fried rice has onions, scallions, carrots, green peas, and egg. 9.95 Chicken Fried Rice All fried rice has onions, scallions, carrots, green peas and egg. 8.95 Shrimp Fried Rice All fried rice has onions, scallions, carrots, green peas and egg.* 10.95 \nAppetizers\nFresh Basil Rolls Shrimp, rice noodles, lettuce, bean sprouts and basil, wrapped in a rice paper wrapper. Served with Chef Suntorn’s house sauce. 6.50 (2) 8.50 (3) Egg Rolls Egg roll wrapper stuffed with egg roll fillings (no meat). Served with sweet and sour sauce. 5.50 (2) 7.50 (3) Stuffed Shrimp Seasoned ground chicken, egg roll wrapper. Served with Chef Suntorn’s sauce. 9.95 Fried Wontons Chicken, shrimp, and cream cheese, wonton wrapper. Served with Chef Suntorn’s sauce. 7.50 Satay Choice of chicken or beef, skewered and grilled, served with peanut sauce. *Can be gluten-free upon request 9.95 Neua Nam Tok Grilled steak mixed with ground rice, onions, scallions, mint, cilantro, chili powder,fish sauce and lemon juice. Served with a wedge of cabbage. 9.95 Nam Sod (Chicken or Pork) Minced meat mixed with ginger, scallions, cilantro, onions, peanuts, chili powder, fish sauce and lemon juice. Served with a wedge of Iceberg lettuce. 7.50 (Chicken Only - North Charleston) Larb (Chicken or Beef) Minced meat spiced with ground rice, onions, mint, scallions, cilantro, chili powder, lemon juice and fish sauce. Served with a wedge of cabbage. 7.50 (Chicken Only - North Charleston) Thai Chicken Wings Chicken marinated with soy sauce, garlic powder, and white pepper. Served with fish sauce and lime juice with fresh Thai chilies sauce. 9.95 Steamed Dumplings Chicken, shrimp, pork, water chesnut, mushroom, scallion. 9.95 \nSoups\nTom Kha Gai (Chicken Coconut) Tureen Sliced chicken breast cooked in coconut milk with galanga roots, lime leaves, lemon grass, button mushrooms, cilantro and scallions. 11.95 Tom Yum Kung (Shrimp Hot and Sour) (Shrimp Hot and Sour) Tom Yum broth flavored with galanga roots, lime leaves, lemon grass, button mushrooms, cilantro and scallions. 10.95 Wonton Soup Chicken broth, wontons stuffed with shrimp and chicken, napa cabbage, scallions, cilantro and garlic. 10.95 \nSalads\nYum Neua (Beef Salad) Grilled steak mixed with cucumbers, onions, tomatoes, mint, cilantro, scallions, chili powder, lemon juice and fish sauce. Served on a bed of Romaine lettuce. 9.95 Yum Kung (Shrimp Salad) Shrimp mixed with cucumbers, onions, tomatoes, mint, cilantro, scallions, chili powder, lemon juice and fish sauce. Served on a bed of Romaine lettuce. 9.95 Som Tum (Green Papaya Shrimp Salad) \nShredded green papaya, green beans, tomatoes, garlic, Thai chilies, palm sugar, fish sauce and lime juice. Tossed with and .\nboiled shrimp crushed peanuts 9.95 Yum Ped (Duck Salad) Fried pulled duck mixed with celery, onions, pineapple, carrots, ginger, cashew nuts, scallions and cilantro. Served with a wedge of Iceberg lettuce. 8.95 Yum Yai Iceberg lettuce mixed with cucumbers, onions, tomatoes, mushrooms, tofu, hard-boiled eggs, mint, cilantro, and scallions. Served with egg-peanut dressing. 8.50 Woon Sen Salad Chicken and shrimp tossed with cellophane noodles, tomatoes, garlic, scallions, onions, cilantro, mint,\ncelery, whole peanuts, Thai chilis, palm sugar, fish sauce and fresh lime juice. 8.95 \nSpecialties\nPad Thai Rice noodles stir-fried with chicken & shrimp, eggs, bean sprouts, scallions, peanuts and Pad Thai sauce. Served with a wedge of lime. (The National dish of Thailand) 19.50 Basil Duck Boneless half duck deep-fried, topped with basil, bell peppers, onions, garlic, snow peas, and button mushrooms. Stir-fried with our house Basil Sauce. 28.95 Basil Mixed Seafood Shrimp, scallops, calamari, and green tipped mussels all stirred with onions, bell peppers and basil leaves. 26.95 Barramundi & Shrimp Asian Sea Bass lightly floured and deep fried, topped with ginger, mushrooms, onions, carrots, and scallions in our house ginger sauce. 26.95 Red Curry Duck Chef Suntorn’s Signature Dish. Boneless half duck deep-fried, topped with bell peppers, basil, green peas, snow peas, tomatoes, and pineapple. Dressed in red curry sauce. 28.95 Barramundi Lightly floured and deep fried, then stir-fried in your choice of or sauce. Basil Curry 21.00 \nEntrees\n\nAll stir-fry dishes are served with Thai Jasmine rice and choice of beef, chicken, shrimp, pork or tofu.\nPad Prik Basil, bell peppers and onions, Prik King curry sauce. 19.50 Basil Basil, bell peppers, onions, and garlic, Thai chili sauce. 19.50 Ginger Juliennes of ginger, mushrooms, onions, carrots, and scallions. 19.50 Garlic Black pepper garlic sauce. Served on a bed of Romaine lettuce. 20.50 Sweet and Sour Onions, bell peppers, cucumbers, tomatoes, pineapples and scallions. 19.50 Prik King String beans, Prik King curry sauce. 19.50 Cashew Nuts Cashew nuts, bell peppers, onions and scallions. 20.50 Vegetables Delight Medley of green beans, bean sprouts, snow peas, mushrooms, broccoli, carrots and Napa cabbage stir-fried in a soy-based sauce. 19.50 Vegetables Delight (Vegetable only) Medley of green beans, bean sprouts, snow peas, mushrooms, broccoli, carrots and Napa cabbage stir-fried in a soy-based sauce. 17.50 \nCurries\n\nAll curries can be made gluten-free upon request and are served with Thai Jasmine rice and choice of beef, chicken, shrimp, pork or tofu.\nGreen Curry Bell peppers, bamboo shoots, eggplants, green peas and basil. 19.50 Masaman Potatoes, onions and cashew nuts. 19.50 Red Curry Bell peppers, bamboo shoots, and basil. 19.50 \nNoodles And Rice\n\nNoodle and rice dishes are made with choice of beef, chicken, shrimp, pork or tofu.\nPad See-Eu Flat rice noodles Stir-fried with eggs, broccoli, garlic and sweet soy sauce. 19.50 Pad Kee Mow Flat rice noodles stir-fried with tomato, onions, bell peppers and basil. 19.50 Pad Woon Sen Cellophane noodles, eggs, napa cabbage, onions, carrots, snow peas, tomatoes, mushrooms, scallions, and bean sprouts. 19.50 Thai Noodles Thin egg noodles stir-fried with green beans, tomatoes, basil, and mushrooms. 20.50 Vegetable Fried Rice Onions, carrots, green peas, mushrooms, broccoli, snow peas and egg.\n\n*(Mount Pleasant locations not gluten-free)* 10.95 Beef Fried Rice All fried rice has onions, scallions, carrots, green peas, and egg. 12.95 Chicken Fried Rice All fried rice has onions, scallions, carrots, green peas and egg. 11.95 Shrimp Fried Rice All fried rice has onions, scallions, carrots, green peas and egg.* 13.95 Duck Fried Rice All fried rice has onions, scallions, carrots, green peas and egg. 13.95",
      "hash": "052d4f69f156",
      "downloadedAt": "2026-01-19T16:12:14.907Z",
      "trimmedAt": "2026-01-19T16:12:44.023Z",
      "sizeReduction": "87.8%"
    },
    {
      "url": "http://eatatbasil.com/north-charleston#menu",
      "text": "[Page Title: North Charleston - Basil Thai Restaurant |]\n\n-\n\nRefinedThai\nMenu Gallery Visit Reservations Employment Opportunities Contact Us Basil Gift Cards Reservations \n(843) 225-8161\nContact Us \nToday\n\n5P - 9P\nView All Hours \nNorth Charleston, SC\nGet Driving Directions \nOur Menu\n\nPLEASE NOTE: Menu prices vary with location and time of day.\n\nWe are open for dine-in, carry-out and delivery. Click the link below for carry-out and delivery options.\nOrder Online \nDinner\n\n5P - 9P\n\nView Menu\n\nAppetizers\nFresh Basil Rolls Shrimp, rice noodles, lettuce, bean sprouts and basil, wrapped in a rice paper wrapper. Served with Chef Suntorn’s house sauce. 6.00 (2) 8.25 (3) Egg Rolls Egg roll wrapper stuffed with egg roll fillings (no meat). Served with sweet and sour sauce. 3.95 (2) 5.95 (3) Stuffed Shrimp Seasoned ground chicken, egg roll wrapper. Served with Chef Suntorn’s sauce. 8.95 (5) Fried Wontons Chicken, shrimp, and cream cheese, wonton wrapper. Served with Chef Suntorn’s sauce. 5.95 Satay Choice of chicken or beef, skewered and grilled, served with peanut sauce. *Can be gluten-free upon request 7.95 Neua Nam Tok Grilled steak mixed with ground rice, onions, scallions, mint, cilantro, chili powder,fish sauce and lemon juice. Served with a wedge of cabbage. 7.95 Nam Sod (Chicken or Pork) Minced meat mixed with ginger, scallions, cilantro, onions, peanuts, chili powder, fish sauce and lemon juice. Served with a wedge of Iceberg lettuce. 7.00 (Chicken Only) Larb (Chicken or Beef) Minced meat spiced with ground rice, onions, mint, scallions, cilantro, chili powder, lemon juice and fish sauce. Served with a wedge of cabbage. 7.00 (Chicken Only) Thai Chicken Wings Chicken marinated with soy sauce, garlic powder, and white pepper. Served with fish sauce and lime juice with fresh Thai chilies sauce. 7.95 Steamed Dumplings Chicken, shrimp, pork, water chesnut, mushroom, scallion. 8.95 \nSoups\nTom Kha Gai (Chicken Coconut) Cup Sliced chicken breast cooked in coconut milk with galanga roots, lime leaves, lemon grass, button mushrooms, cilantro and scallions. 3.95 Tom Kha Gai (Chicken Coconut) Tureen Sliced chicken breast cooked in coconut milk with galanga roots, lime leaves, lemon grass, button mushrooms, cilantro and scallions. 7.95 Tom Yum Kung (Shrimp Hot and Sour) (Shrimp Hot and Sour) Tom Yum broth flavored with galanga roots, lime leaves, lemon grass, button mushrooms, cilantro and scallions. 8.95 Wonton Soup Chicken broth, wontons stuffed with shrimp and chicken, napa cabbage, scallions, cilantro and garlic. 9.95 \nSalads\nYum Neua (Beef Salad) Grilled steak mixed with cucumbers, onions, tomatoes, mint, cilantro, scallions, chili powder, lemon juice and fish sauce. Served on a bed of Romaine lettuce. 7.95 Yum Kung (Shrimp Salad) Shrimp mixed with cucumbers, onions, tomatoes, mint, cilantro, scallions, chili powder, lemon juice and fish sauce. Served on a bed of Romaine lettuce. 7.95 Som Tum (Green Papaya Shrimp Salad) \nShredded green papaya, green beans, tomatoes, garlic, Thai chilies, palm sugar, fish sauce and lime juice. Tossed with and .\nboiled shrimp crushed peanuts 7.95 Yum Ped (Duck Salad) Fried pulled duck mixed with celery, onions, pineapple, carrots, ginger, cashew nuts, scallions and cilantro. Served with a wedge of Iceberg lettuce. 6.95 Yum Yai Iceberg lettuce mixed with cucumbers, onions, tomatoes, mushrooms, tofu, hard-boiled eggs, mint, cilantro, and scallions. Served with egg-peanut dressing. 5.95 Woon Sen Salad Chicken and shrimp tossed with cellophane noodles, tomatoes, garlic, scallions, onions, cilantro, mint,\ncelery, whole peanuts, Thai chilis, palm sugar, fish sauce and fresh lime juice. 7.95 \nSpecialties\nPad Thai Rice noodles stir-fried with chicken & shrimp, eggs, bean sprouts, scallions, peanuts and Pad Thai sauce. Served with a wedge of lime. (The National dish of Thailand) 10.95 Basil Duck Boneless half duck deep-fried, topped with basil, bell peppers, onions, garlic, snow peas, and button mushrooms. Stir-fried with our house Basil Sauce. 21.95/ 12.95 (half) Basil Mixed Seafood Shrimp, scallops, calamari, and green tipped mussels all stirred with onions, bell peppers and basil leaves. 19.95 Barramundi & Shrimp Asian Sea Bass lightly floured and deep fried, topped with ginger, mushrooms, onions, carrots, and scallions in our house ginger sauce. 17.95 Red Curry Duck Chef Suntorn’s Signature Dish. Boneless half duck deep-fried, topped with bell peppers, basil, green peas, snow peas, tomatoes, and pineapple. Dressed in red curry sauce. 21.95/ 12.95 (half) Barramundi Lightly floured and deep fried, then stir-fried in your choice of or sauce. Basil Curry 14.95 \nEntrees\n\nAll stir-fry dishes are served with Thai Jasmine rice and choice of beef, chicken, shrimp, pork or tofu.\nPad Prik Basil, bell peppers and onions, Prik King curry sauce. 10.95 Basil Basil, bell peppers, onions, and garlic, Thai chili sauce. 10.95 Ginger Juliennes of ginger, mushrooms, onions, carrots, and scallions. 10.95 Garlic Black pepper garlic sauce. Served on a bed of Romaine lettuce. 11.95 Sweet and Sour Onions, bell peppers, cucumbers, tomatoes, pineapples and scallions. 11.95 Prik King String beans, Prik King curry sauce. 10.95 Cashew Nuts Cashew nuts, bell peppers, onions and scallions. 10.95 Vegetables Delight Medley of green beans, bean sprouts, snow peas, mushrooms, broccoli, carrots and Napa cabbage stir-fried in a soy-based sauce. 10.95 Vegetables Delight (Vegetable only) Medley of green beans, bean sprouts, snow peas, mushrooms, broccoli, carrots and Napa cabbage stir-fried in a soy-based sauce. 9.95 \nCurries\n\nAll curries can be made gluten-free upon request and are served with Thai Jasmine rice and choice of beef, chicken, shrimp, pork or tofu.\nGreen Curry Bell peppers, bamboo shoots, eggplants, green peas and basil. 9.50 Masaman Potatoes, onions and cashew nuts. 9.50 Red Curry Bell peppers, bamboo shoots, and basil. 9.50 \nNoodles And Rice\n\nNoodle and rice dishes are made with choice of beef, chicken, shrimp, pork or tofu.\nPad See-Eu Flat rice noodles Stir-fried with eggs, broccoli, garlic and sweet soy sauce. 10.95 Pad Kee Mow Flat rice noodles stir-fried with tomato, onions, bell peppers and basil. 10.95 Pad Woon Sen Cellophane noodles, eggs, napa cabbage, onions, carrots, snow peas, tomatoes, mushrooms, scallions, and bean sprouts. 10.95 Thai Noodles Thin egg noodles stir-fried with green beans, tomatoes, basil, and mushrooms. 10.95 Vegetable Fried Rice Onions, carrots, green peas, mushrooms, broccoli, snow peas and egg.\n\n*(Mount Pleasant locations not gluten-free)* 8.95 Beef Fried Rice All fried rice has onions, scallions, carrots, green peas, and egg. 9.95 Chicken Fried Rice All fried rice has onions, scallions, carrots, green peas and egg. 8.95 Shrimp Fried Rice All fried rice has onions, scallions, carrots, green peas and egg.* 10.95 \nAppetizers\nFresh Basil Rolls Shrimp, rice noodles, lettuce, bean sprouts and basil, wrapped in a rice paper wrapper. Served with Chef Suntorn’s house sauce. 6.50 (2) 8.50 (3) Egg Rolls Egg roll wrapper stuffed with egg roll fillings (no meat). Served with sweet and sour sauce. 5.50 (2) 7.50 (3) Stuffed Shrimp Seasoned ground chicken, egg roll wrapper. Served with Chef Suntorn’s sauce. 9.95 Fried Wontons Chicken, shrimp, and cream cheese, wonton wrapper. Served with Chef Suntorn’s sauce. 7.50 Satay Choice of chicken or beef, skewered and grilled, served with peanut sauce. *Can be gluten-free upon request 9.95 Neua Nam Tok Grilled steak mixed with ground rice, onions, scallions, mint, cilantro, chili powder,fish sauce and lemon juice. Served with a wedge of cabbage. 9.95 Nam Sod (Chicken or Pork) Minced meat mixed with ginger, scallions, cilantro, onions, peanuts, chili powder, fish sauce and lemon juice. Served with a wedge of Iceberg lettuce. 7.50 (Chicken Only - North Charleston) Larb (Chicken or Beef) Minced meat spiced with ground rice, onions, mint, scallions, cilantro, chili powder, lemon juice and fish sauce. Served with a wedge of cabbage. 7.50 (Chicken Only - North Charleston) Thai Chicken Wings Chicken marinated with soy sauce, garlic powder, and white pepper. Served with fish sauce and lime juice with fresh Thai chilies sauce. 9.95 Steamed Dumplings Chicken, shrimp, pork, water chesnut, mushroom, scallion. 9.95 \nSoups\nTom Kha Gai (Chicken Coconut) Tureen Sliced chicken breast cooked in coconut milk with galanga roots, lime leaves, lemon grass, button mushrooms, cilantro and scallions. 11.95 Tom Yum Kung (Shrimp Hot and Sour) (Shrimp Hot and Sour) Tom Yum broth flavored with galanga roots, lime leaves, lemon grass, button mushrooms, cilantro and scallions. 10.95 Wonton Soup Chicken broth, wontons stuffed with shrimp and chicken, napa cabbage, scallions, cilantro and garlic. 10.95 \nSalads\nYum Neua (Beef Salad) Grilled steak mixed with cucumbers, onions, tomatoes, mint, cilantro, scallions, chili powder, lemon juice and fish sauce. Served on a bed of Romaine lettuce. 9.95 Yum Kung (Shrimp Salad) Shrimp mixed with cucumbers, onions, tomatoes, mint, cilantro, scallions, chili powder, lemon juice and fish sauce. Served on a bed of Romaine lettuce. 9.95 Som Tum (Green Papaya Shrimp Salad) \nShredded green papaya, green beans, tomatoes, garlic, Thai chilies, palm sugar, fish sauce and lime juice. Tossed with and .\nboiled shrimp crushed peanuts 9.95 Yum Ped (Duck Salad) Fried pulled duck mixed with celery, onions, pineapple, carrots, ginger, cashew nuts, scallions and cilantro. Served with a wedge of Iceberg lettuce. 8.95 Yum Yai Iceberg lettuce mixed with cucumbers, onions, tomatoes, mushrooms, tofu, hard-boiled eggs, mint, cilantro, and scallions. Served with egg-peanut dressing. 8.50 Woon Sen Salad Chicken and shrimp tossed with cellophane noodles, tomatoes, garlic, scallions, onions, cilantro, mint,\ncelery, whole peanuts, Thai chilis, palm sugar, fish sauce and fresh lime juice. 8.95 \nSpecialties\nPad Thai Rice noodles stir-fried with chicken & shrimp, eggs, bean sprouts, scallions, peanuts and Pad Thai sauce. Served with a wedge of lime. (The National dish of Thailand) 19.50 Basil Duck Boneless half duck deep-fried, topped with basil, bell peppers, onions, garlic, snow peas, and button mushrooms. Stir-fried with our house Basil Sauce. 28.95 Basil Mixed Seafood Shrimp, scallops, calamari, and green tipped mussels all stirred with onions, bell peppers and basil leaves. 26.95 Barramundi & Shrimp Asian Sea Bass lightly floured and deep fried, topped with ginger, mushrooms, onions, carrots, and scallions in our house ginger sauce. 26.95 Red Curry Duck Chef Suntorn’s Signature Dish. Boneless half duck deep-fried, topped with bell peppers, basil, green peas, snow peas, tomatoes, and pineapple. Dressed in red curry sauce. 28.95 Barramundi Lightly floured and deep fried, then stir-fried in your choice of or sauce. Basil Curry 21.00 \nEntrees\n\nAll stir-fry dishes are served with Thai Jasmine rice and choice of beef, chicken, shrimp, pork or tofu.\nPad Prik Basil, bell peppers and onions, Prik King curry sauce. 19.50 Basil Basil, bell peppers, onions, and garlic, Thai chili sauce. 19.50 Ginger Juliennes of ginger, mushrooms, onions, carrots, and scallions. 19.50 Garlic Black pepper garlic sauce. Served on a bed of Romaine lettuce. 20.50 Sweet and Sour Onions, bell peppers, cucumbers, tomatoes, pineapples and scallions. 19.50 Prik King String beans, Prik King curry sauce. 19.50 Cashew Nuts Cashew nuts, bell peppers, onions and scallions. 20.50 Vegetables Delight Medley of green beans, bean sprouts, snow peas, mushrooms, broccoli, carrots and Napa cabbage stir-fried in a soy-based sauce. 19.50 Vegetables Delight (Vegetable only) Medley of green beans, bean sprouts, snow peas, mushrooms, broccoli, carrots and Napa cabbage stir-fried in a soy-based sauce. 17.50 \nCurries\n\nAll curries can be made gluten-free upon request and are served with Thai Jasmine rice and choice of beef, chicken, shrimp, pork or tofu.\nGreen Curry Bell peppers, bamboo shoots, eggplants, green peas and basil. 19.50 Masaman Potatoes, onions and cashew nuts. 19.50 Red Curry Bell peppers, bamboo shoots, and basil. 19.50 \nNoodles And Rice\n\nNoodle and rice dishes are made with choice of beef, chicken, shrimp, pork or tofu.\nPad See-Eu Flat rice noodles Stir-fried with eggs, broccoli, garlic and sweet soy sauce. 19.50 Pad Kee Mow Flat rice noodles stir-fried with tomato, onions, bell peppers and basil. 19.50 Pad Woon Sen Cellophane noodles, eggs, napa cabbage, onions, carrots, snow peas, tomatoes, mushrooms, scallions, and bean sprouts. 19.50 Thai Noodles Thin egg noodles stir-fried with green beans, tomatoes, basil, and mushrooms. 20.50 Vegetable Fried Rice Onions, carrots, green peas, mushrooms, broccoli, snow peas and egg.\n\n*(Mount Pleasant locations not gluten-free)* 10.95 Beef Fried Rice All fried rice has onions, scallions, carrots, green peas, and egg. 12.95 Chicken Fried Rice All fried rice has onions, scallions, carrots, green peas and egg. 11.95 Shrimp Fried Rice All fried rice has onions, scallions, carrots, green peas and egg.* 13.95 Duck Fried Rice All fried rice has onions, scallions, carrots, green peas and egg. 13.95",
      "hash": "9b3596ce052a",
      "downloadedAt": "2026-01-19T16:12:14.909Z",
      "trimmedAt": "2026-01-19T16:12:44.092Z",
      "sizeReduction": "87.8%"
    }
  ],
  "sizeReduction": "87.8%"
}