{
  "venueId": "ChIJJ3Jf0A97_ogRXfrKpV7AND4",
  "venueName": "Lifting Noodles Ramen",
  "venueArea": "West Ashley",
  "website": "http://www.liftingnoodlesramen.com/",
  "scrapedAt": "2026-01-19T16:12:32.084Z",
  "trimmedAt": "2026-01-19T16:12:53.008Z",
  "pages": [
    {
      "url": "http://www.liftingnoodlesramen.com/",
      "text": "[Page Title: LIFTING NOODLES RAMEN]\n\nSearch this site\nEmbedded Files Skip to main content Skip to navigation LIFTING NOODLES RAMEN Welcome Lifting Noodles Ramen, your favorite neighborhood ramen shop \nORDER ONLINE\nOur story, founders, and locations OUR STORY Lifiting Noodles is best known for their traditional ramen with a twist. Lifting Noodles opened its original flagship location inside the We Suki Suki food hall in East Atlanta Village January of 2018. Lifting Noodles started with the simple mission of being the best ramen in the city and quickly became one of the cities favorite ramen shops! OUR FOUNDERS Lifting Noodles ’s leadership team is led by Lifting Noodle ’s two founding partners, Seven Chan and Ken Yu. Seven Chan is a lifetime entrepreneur with almost 20 years of experience building and running successful companies. His specialties include business strategy, development, social media, press and marketing. Ken Yu has over 20 years of restaurant experience working in business startup, logistics,  quality assurance and food safety. Since opening Lifting Noodles the pair have gone on to win multiple awards for their business acumen and contributions to their city and have been featured on Entrepreneurial Chef, Food Network, Restaurant Unstoppable, Forbes, US Weekly and more. The pair has also parlayed the success of Lifting Noodles into the launch of KSP Restaurant Group which includes Lifting Noodles, the pairs other food concepts and franchising company. CURRENT LOCATIONS lifting noodles EAST ATLANTA VILLAGE The original Lifting Noodles located in East Atlanta Village opened  January 2018 inside the We Suki Suki Food Hall. Small but mighty our original location still ranks as one of the highest rated ramen restaurants in the city. CLICK FOR STORE DETAILS ORDER ONLINE lifting noodles DULUTH Lifting Noodles Duluth opened in the center of downtown Duluth inside the Sweet Octopus food hall in 2020. CLICK FOR STORE DETAILS ORDER ONLINE lifting noodles BATTERY Lifting Noodles opened in 2020 inside the PH'EAST Food Hall located inside Atlanta's famous Battery At Braves Stadium. CLICK FOR STORE DETAILS ORDER ONLINE lifting noodles PHILLY NOW OPEN! Lifting Noodles is located in the heart of Philly off 10th street! CLICK HERE FOR STORE DETAILS ORDER ONLINE lifting noodles Charleston Lifting Noodles Charleston is our first location in South Carolina, located inside the Historic Victory Building in West Ashley. CLICK HERE FOR STORE DETAILS ORDER ONLINE lifting noodles HOUSTON- Sugar Land Lifting Noodles Sugar Land CLICK HERE FOR STORE DETAILS ORDER ONLINE Page updated \nGoogle Sites\n\nReport abuse",
      "hash": "0c409eeecaa0",
      "downloadedAt": "2026-01-19T16:12:18.153Z",
      "trimmedAt": "2026-01-19T16:12:52.810Z",
      "sizeReduction": "98.3%"
    },
    {
      "url": "http://www.liftingnoodlesramen.com/menu-gallery",
      "text": "[Page Title: LIFTING NOODLES RAMEN - Menu Gallery]\n\nSearch this site\nEmbedded Files Skip to main content Skip to navigation \nMENU GALLERY\n\nMENU GALLERY\n\nPictures are worth a thousand words. Use this page to familiarize yourself with what we offer.\n\n(MENU MAY VARY FROM STORE TO STORE, CHECK YOUR FOR SPECIFIC DETAILS)\nLOCATION \nappetizers\n\nDUMPLINGS\n\nVEGGIE SPRING ROLLS\n\nBRUSSEL SPROUTS\n\nWAKAME SALAD\n\nGINGER MISO BEET SALAD\n\nRAMEN bowls\n\nVILLAGE CLASSIC\n\nANGRY ZUKO\n\nSEAFOOD RAMEN\n\nSPICY TANTAN\n\n1 UP\nPage updated \nGoogle Sites\n\nReport abuse",
      "hash": "319112deacc1",
      "downloadedAt": "2026-01-19T16:12:18.156Z",
      "trimmedAt": "2026-01-19T16:12:52.837Z",
      "sizeReduction": "99.6%"
    },
    {
      "url": "http://www.liftingnoodlesramen.com/locations/battery",
      "text": "[Page Title: LIFTING NOODLES RAMEN - BATTERY]\n\nSearch this site\nEmbedded Files Skip to main content Skip to navigation \nbattery, at Ph'east\n\nlifting noodles BATTERY\n\nLifting Noodles opened in 2020 inside the PH'EAST Food Hall located inside Atlanta's famous Battery At Braves Stadium.\n\nFOLLOW US ON INSTAGRAM AT\n@LIFTINGNOODLESBATTERY \nLOCATION INFORMATION\n\nADDRESS:\n925 Battery Ave SE Ste. 1100, Atlanta, GA 30339 \nHOURS: Open Everyday 11AM - 10:30PM\n\nPHONE: 2735\n( 470800 ) - \nEMAIL: LIFTINGNOODLESBATTERY@Gmail.com\nVIEW MENU REVIEW US ON YELP REVIEW US ON GOOGLE \nORDER NOW\nORDER ONLINE ORDER ON DOORDASH ORDER ON UBER EATS ORDER ON EZ CATER \ngoogle maps\nPage updated \nGoogle Sites\n\nReport abuse",
      "hash": "58e45d12e980",
      "downloadedAt": "2026-01-19T16:12:18.159Z",
      "trimmedAt": "2026-01-19T16:12:52.859Z",
      "sizeReduction": "99.4%"
    },
    {
      "url": "https://www.liftingnoodlesramen.com/locations/charleston",
      "text": "[Page Title: LIFTING NOODLES RAMEN - CHARLESTON]\n\nSearch this site\nEmbedded Files Skip to main content Skip to navigation LIFTING NOODLES PHILLY \nCharleston\nlifting noodles \nLaunched in February 2022 at the historic Victory Building in West Ashley.\nFOLLOW US ON INSTAGRAM AT @LIFTINGNOODLESCHS LOCATION INFORMATION ADDRESS: 835 Savannah HWY, Charleston SC, 29407 HOURS: Tues - Sat : 11am - 9pm PHONE: ( 843 ) - 887 - 8744 ORDER ONLINE google maps Page updated \nGoogle Sites\n\nReport abuse",
      "hash": "60d6e27dbea2",
      "downloadedAt": "2026-01-19T16:12:18.162Z",
      "trimmedAt": "2026-01-19T16:12:52.882Z",
      "sizeReduction": "99.6%"
    },
    {
      "url": "http://www.liftingnoodlesramen.com/locations",
      "text": "[Page Title: LIFTING NOODLES RAMEN - Locations]\n\nSearch this site\nEmbedded Files Skip to main content Skip to navigation Locations locations lifting noodles EAST ATLANTA VILLAGE The original Lifting Noodles located in East Atlanta Village opened  January 2018 inside the We Suki Suki Food Hall. Small but mighty our original location still ranks as one of the highest rated ramen restaurants in the city. CLICK FOR STORE DETAILS ORDER ONLINE lifting noodles DULUTH Lifting Noodles Duluth opened in the center of downtown Duluth inside the Sweet Octopus food hall in 2020. CLICK FOR STORE DETAILS ORDER ONLINE lifting noodles BATTERY Lifting Noodles opened in 2020 inside the PH'EAST Food Hall located inside Atlanta's famous Battery At Braves Stadium. CLICK FOR STORE DETAILS ORDER ONLINE lifting noodles philly NOW OPEN in the heart of Philly! CLICK FOR STORE DETAILS ORDER ONLINE lifting noodles Charleston Charlestons new favorite ramen is here! Located inside the Victory building in West Ashley! CLICK FOR STORE DETAILS ORDER ONLINE lifting noodles HOUSTON- SUGAR LAND Lifting Noodles Sugar Land OPENING 9 | 2 | 22 CLICK HERE FOR STORE DETAILS ORDER ONLINE Page updated \nGoogle Sites\n\nReport abuse",
      "hash": "69ef84b4065b",
      "downloadedAt": "2026-01-19T16:12:18.167Z",
      "trimmedAt": "2026-01-19T16:12:52.916Z",
      "sizeReduction": "99.1%"
    },
    {
      "url": "https://www.liftingnoodlesramen.com/locations/lifting-noodles-sugar-land",
      "text": "[Page Title: LIFTING NOODLES RAMEN - Lifting Noodles Sugar Land]\n\nSearch this site\nEmbedded Files Skip to main content Skip to navigation LIFTING NOODLES Sugar Land lifting noodles Sugar Land Opening Date: Friday 9 | 2 | 22 ! FOLLOW US ON INSTAGRAM AT @POKEBURRITX LOCATION INFORMATION ADDRESS: 1525 Lake Pointe PKWY, Sugar Land, TX 77478 HOURS: Tuesday - Sunday 11AM - 9PM PHONE: ( 832)-648-POKE ORDER ONLINE ORDER ONLINE WITH DOORDASH ORDER ONLINE WITH UBEREATS ORDER ONLINE WITH CHOWNOW google maps Page updated \nGoogle Sites\n\nReport abuse",
      "hash": "b00af1bf3d6d",
      "downloadedAt": "2026-01-19T16:12:18.170Z",
      "trimmedAt": "2026-01-19T16:12:52.941Z",
      "sizeReduction": "99.6%"
    },
    {
      "url": "https://www.liftingnoodlesramen.com/locations/philly",
      "text": "[Page Title: LIFTING NOODLES RAMEN - PHILLY]\n\nSearch this site\nEmbedded Files Skip to main content Skip to navigation \nLIFTING NOODLES PHILLY\n\nlifting noodles PHILLY\n\nNOW OPEN! Lifting Noodles Philly is located in the heart of Philly off 10th street!\n\nFOLLOW US ON INSTAGRAM AT\n@LIFTINGNOODLESPHILLY \nLOCATION INFORMATION\nADDRESS: 255 S 10th Street, Philadelphia, PA 19107 HOURS: Monday - Sunday: 11am - 9pm PHONE: ( 267 ) - 900 - 7888 VIEW MENU ORDER ONLINE ORDER WITH CHOWNOW ORDER WITH EZ CATER ORDER WITH UBEREATS ORDER WITH DOORDASH \ngoogle maps\nPage updated \nGoogle Sites\n\nReport abuse",
      "hash": "c4606eb30f8d",
      "downloadedAt": "2026-01-19T16:12:18.173Z",
      "trimmedAt": "2026-01-19T16:12:52.966Z",
      "sizeReduction": "99.5%"
    },
    {
      "url": "http://www.liftingnoodlesramen.com/locations/duluth",
      "text": "[Page Title: LIFTING NOODLES RAMEN - DULUTH]\n\nSearch this site\nEmbedded Files Skip to main content Skip to navigation \nduluth\n\nlifting noodles DULUTH\n\nLifting Noodles Duluth opened in the center of downtown Duluth inside the Sweet Octopus food hall in 2020.\n\nFOLLOW US ON INSTAGRAM\n@LIFTINGNOODLESDULUTH \nLOCATION INFORMATION\n\nADDRESS:\n3559 W Lawrenceville St Suite 600, Duluth, GA 30096 \nHOURS: Tues - Sun 11:30AM - 9:30PM\n\nPHONE: (678) 825-2990\n\nEMAIL: pokeburriduluth@gmail.com\nVIEW MENU REVIEW US ON YELP REVIEW US ON GOOGLE \nORDER NOW\nORDER ONLINE ORDER ON DOORDASH ORDER ON UBER EATS ORDER ON EZ CATER \ngoogle maps\nPage updated \nGoogle Sites\n\nReport abuse",
      "hash": "e2e4b8140fa6",
      "downloadedAt": "2026-01-19T16:12:18.175Z",
      "trimmedAt": "2026-01-19T16:12:52.986Z",
      "sizeReduction": "99.4%"
    },
    {
      "url": "http://www.liftingnoodlesramen.com/locations/eav",
      "text": "[Page Title: LIFTING NOODLES RAMEN - EAV]\n\nSearch this site\nEmbedded Files Skip to main content Skip to navigation \nEAST ATLANTA VILLAGE\n\nlifting noodles EAV\n\nThe original Lifting Noodles located in East Atlanta Village opened January 2018 inside the We Suki Suki Food Hall. Small but mighty our original location still ranks as one of the highest rated ramen restaurants in the city.\n\nFOLLOW US ON INSTAGRAM\n@LIFTINGNOODLESRAMEN \nLOCATION INFORMATION\n\nADDRESS: 477 Flat Shoals Ave SE, Atlanta GA, 30316\n\nHOURS: Tuesday - Saturday | 11:30 AM - 9:00 PM\n\nPHONE: (404) 558-2052\n\nEMAIL:\nLIFTINGNOODLESRAMEN@Gmail.com VIEW MENU REVIEW US ON YELP REVIEW US ON GOOGLE \nORDER NOW\nORDER ONLINE ORDER ON DOORDASH ORDER ON UBER EATS \ngoogle maps\nPage updated \nGoogle Sites\n\nReport abuse",
      "hash": "fa35ce99707e",
      "downloadedAt": "2026-01-19T16:12:18.178Z",
      "trimmedAt": "2026-01-19T16:12:53.008Z",
      "sizeReduction": "99.3%"
    }
  ],
  "sizeReduction": "99.3%"
}