{
  "venueId": "ChIJRzvtEhJ6_ogRYCvfAllsQBo",
  "venueName": "Peninsula Grill",
  "venueArea": "Downtown Charleston",
  "website": "https://peninsulagrill.com/",
  "scrapedAt": "2026-01-19T16:12:32.847Z",
  "trimmedAt": "2026-01-19T16:13:00.317Z",
  "pages": [
    {
      "url": "https://peninsulagrill.com/",
      "text": "[Page Title: Peninsula Grill – Fine Dining, Restaurant, Historic Market, Charleston, SC]\n\nSkip to content \nSophisticated\n\ncharm\nLearn More Reservations \nOur History\nIn Charleston, S.C., the crown jewel of the dining scene is Peninsula Grill, the beguiling Four-Diamond and Four-Star restaurant hidden amidst a lush moonlit garden in the very heart of the Historic District. \nLoved by locals and guests from around the world, Peninsula Grill offers a genuinely resplendent dining experience that pulls out all the stops—a spectacular setting, fresh and delicious cuisine, fantastic service that seamlessly anticipates a guest’s wants and needs, an award-winning wine list, a famous signature dessert, and one more ingredient… a bit of enchantment.\nLearn More \nThe Cuisine\n\nOur menu offers a range of dishes inspired by the local Lowcountry cuisine, which combines modern Southern cooking techniques with fresh seafood, prime cut steaks and local produce. In addition to exceptional food, we offer an extensive wine list, with over 300 selections from around the world, including many rare bottles. We are honored to have received the Wine Spectator “Best of Award of Excellence” for four years running.\nOur attentive and knowledgeable staff are happy to help you choose the perfect wine to complement your meal. Experience the best of Charleston’s cuisine in an elegant and classic Southern setting. Welcome to Peninsula Grill. \nExplore Our Restaurant\nDining Room Champagne Bar Courtyard Private Dining Learn More \nA little \nslice of heaven\n\n-The New York Times\n\nThe Ultimate \nCoconut Cake™\n\nThe talented Peninsula Grill Pastry Chefs begin baking delicious Ultimate Coconut Cakes™ at dawn. By midday, their 12-layer masterpieces are carefully packaged and ready to be shipped across America via overnight delivery.\nLearn More \nCelebrate With Us: New Years Eve at Peninsula Grill\n\nWe invite you to bid adieu to the past year and celebrate the arrival of the New Year ahead in style and elegance at Peninsula Grill.Join us for a special evening built around a beautifully crafted coursed menu, prepared with intention, inspired by the spirit of celebration, the traditions of the South, and the promise of a fresh beginning.\nView Menu Reserve Your Table",
      "hash": "236fe33946d5",
      "downloadedAt": "2026-01-19T16:12:20.031Z",
      "trimmedAt": "2026-01-19T16:13:00.298Z",
      "sizeReduction": "97.8%"
    },
    {
      "url": "https://peninsulagrill.com/restaurant#bar",
      "text": "[Page Title: Restaurant – Peninsula Grill]\n\nSkip to content \nThe Restaurant\nIn Charleston, S.C., the crown jewel of the dining scene is Peninsula Grill, the beguiling Four-Diamond and Four-Star restaurant hidden amidst a lush moonlit garden in the very heart of the Historic District. \nLoved by locals and guests from around the world, Peninsula Grill offers a genuinely resplendent dining experience that pulls out all the stops—a spectacular setting, fresh and delicious cuisine, fantastic service that seamlessly anticipates a guest’s wants and needs, an award-winning wine list, a famous signature dessert, and one more ingredient… a bit of enchantment.\n\nHere, a longstanding tradition takes place every evening at dusk when the garden’s carriage lanterns are lit by hand, one-by-one, until the area comes alive. Palmetto trees are illuminated, and tea lights flicker in this magical twilight tableau. A path paved with historic bricks meanders through the courtyard, leading to a gleaming green door adorned with a burnished gold fleur-de-lis—Charleston’s most romantic sense of arrival.\nCourtyard Dining Learn More \nOnce inside, guests are welcomed into the glittering jewel-box-like ambiance of the candlelit where an extensive array of rare and popular vintages, a variety of fresh oyster preparations, and a selection of delicious appetizers including seared foie gras with poached pear, frisee salad, and port gastrique are served nightly. The Champagne Bar walls are wrapped in a handpainted mural of a Lowcountry rice harvest, a visual feast that imbues the intimate bar with amber, honeyed warmth.\nChampagne Bar Learn More \nThe , renowned for its chic oyster-tone-velvet-lined walls, seagrass flooring, and custom chandeliers, was designed by the incomparable Amelia Handegan, whose coveted interiors are frequently chronicled by Architectural Digest, Veranda, and House Beautiful, among others. Delightfully curious and lighthearted details are found throughout the classically elegant room, including a series of captivating 19th-Century oil painting portraits and one very popular painting of a mule. The effect is lovely and inviting—the perfect embodiment of the entire Peninsula Grill experience.\nDining Room Learn More \nWhen Peninsula Grill opened on February 13, 1997, the city had not yet blossomed into the tantalizing travel and dining destination it is today. The arrival of a restaurant offering intimate tables in a garden illuminated by flickering carriage lanterns, shimmering velvet walls in the dining room, an impressive wine cache, a professional waitstaff, and a talented chef who espoused using the very best and freshest seasonal ingredients for his nouveau Southern cuisine garnered immediate attention. Charlestonians turned out in droves to see what Peninsula Grill had to offer.\n\nGuests who scored a table on Peninsula Grill’s second-ever night of service——witnessed history in the making during the dessert course: a towering 12-layer coconut cake that caused heads to turn as it was paraded through the dining room at the end of the evening. Delicious to taste and spectacular to behold, the  was an instant sensation, and it has appeared on Peninsula Grill’s menu ever since its Valentine’s Day debut.\nFebruary 14, 1997 Ultimate Coconut Cake™ Learn More \nHeralded by Esquire magazine as one of “America’s Best New Restaurants,” Peninsula Grill quickly earned the Award of Excellence from Wine Spectator, Four Stars from Forbes Travel Guide, and Four Diamonds from AAA.\n\nIn 1999, Peninsula Grill was invited to join , the exclusive collection of renowned restaurants and boutique hotels located in the world’s most romantic destinations, and it remains South Carolina’s sole culinary member. It is our distinct pleasure to serve dinner—with style—every evening to locals and new friends from around the world. Welcome to the very heart and soul of spectacular Charleston, South Carolina.\nRelais & Châteaux \nWelcome to .\nPeninsula Grill \nRESERVATIONS:\n(843) 723-0700 \nCelebrate With Us: New Years Eve at Peninsula Grill\n\nWe invite you to bid adieu to the past year and celebrate the arrival of the New Year ahead in style and elegance at Peninsula Grill.Join us for a special evening built around a beautifully crafted coursed menu, prepared with intention, inspired by the spirit of celebration, the traditions of the South, and the promise of a fresh beginning.\nView Menu Reserve Your Table",
      "hash": "2b2713652da4",
      "downloadedAt": "2026-01-19T16:12:20.033Z",
      "trimmedAt": "2026-01-19T16:13:00.313Z",
      "sizeReduction": "95.5%"
    },
    {
      "url": "https://peninsulagrill.com/menu/",
      "text": "[Page Title: Menu – Peninsula Grill]\n\nSkip to content \nMenu\n\nThe culinary\n\nexperience\n\nCelebrate With Us: New Years Eve at Peninsula Grill\n\nWe invite you to bid adieu to the past year and celebrate the arrival of the New Year ahead in style and elegance at Peninsula Grill.Join us for a special evening built around a beautifully crafted coursed menu, prepared with intention, inspired by the spirit of celebration, the traditions of the South, and the promise of a fresh beginning.\nView Menu Reserve Your Table",
      "hash": "673bee39e643",
      "downloadedAt": "2026-01-19T16:12:20.036Z",
      "trimmedAt": "2026-01-19T16:13:00.317Z",
      "sizeReduction": "99.3%"
    }
  ],
  "sizeReduction": "97.4%"
}