{
  "venueId": "ChIJZQj26RF6_ogRDEeecY6dgJU",
  "venueName": "Eli's Table",
  "venueArea": "Downtown Charleston",
  "website": "https://elistable.com/",
  "scrapedAt": "2026-01-19T16:12:33.559Z",
  "trimmedAt": "2026-01-19T16:13:17.343Z",
  "pages": [
    {
      "url": "https://elistable.com/",
      "text": "[Page Title: HOME - Eli's Table]\n\nFollow Follow Follow Follow Follow join our table \nExplore unprecedented flavors at Eli’s Table\nMAKE A RESERVATION bold, worldly flavors \nusing local & fresh ingredients\nRESERVE NOW \nWelcome\n\nEli’s Table features a menu offering bold, worldly flavors while using fresh and local ingredients. Named after the owner of Charleston Hospitality Group’s son Eli, the restaurant is sentimental for many reasons. With the flair our Executive Chef has brought to Eli’s Table, guests are treated with a new way to savor their favorite classics. Tantalize your taste buds and join us at Eli’s Table tonight.\nHOURS \nWednesday through Sunday: 5 – 11 PM\n\nMonday, Tuesday: Closed\n\nDinner menu await you to be discovered.\nOur Menu \nBrunch and Dinner menus await you to be discovered.\nOur Menu \nBook Your Event\n\nEli’s Table will make your special days unforgettable with its extensive menu options.Book your event now.\nREAD MORE \nBook Your Event\n\nEli’s Table will make your special days unforgettable with its extensive menu options.Book your event now.\nREAD MORE \nIf you aren’t stopping here, you are missing out. Eli’s Table is one of the best places for breakfast. I can’t get beyond the sweet potato pancackes, but I have tasted some of my husband’s choices. The drinks are amazing…and the service is top-notch. We hadn’t been back in a year, and got the same waitress at the same table…enjoy.\nSaundra ⭐️⭐️⭐️⭐️⭐️ \nEli’s Table is a Hidden Treasure on Meeting Street! We found Eli’s Table after a long morning of walking The Battery, the park, and everything in between. It is a delightful surprise in the middle of everything! We enjoyed a late lunch complete with a delicious mimosa that another customer highly recommended as she overheard our indecision. Her advice was spot on! The service was extraordinary and our lunch was excellent. Our only regret is that we did not get to return for dinner or brunch before we had to leave. WE WILL RETURN TO CHARLESTON AND ELI’S!\nNane LaGrange ⭐️⭐️⭐️⭐️⭐️ \nOne of the best restaurants in Charleston! The egg croissant was one of the best I’ve had. Danny was an awesome server/bartender and made sure our table was happy well taken care of. Beautiful patio and great ambiance! Definitely will be back soon and highly recommend.\nLeah L. ⭐️⭐️⭐️⭐️⭐️ \nHad a great time. Ray and Kris took excellent care of us. Next best thing to being at a restaurant in New Orleans.\nMarcelle S. ⭐️⭐️⭐️⭐️ \nWe’ve been to Eli’s Table twice before. This time we took our two kids which are 4 and 2 which anyone with children knows that can be difficult sometimes, but we were sitting fast and our waiter Danny was amazing. Our food was great as always; we had chicken and waffles, and Eli’s breakfast and a short stack of pancakes. All the food was delicious and the service was very good. Eli’s is and will always be a staple for our family when we visit the Holy City.\nDylan Short ⭐️⭐️⭐️⭐️⭐️ \nMORE REVIEWS\n\nGift Card\n\nAvailable in any denomination, choose the gift that fits the occasion. Our eGifts are delivered in minutes or can be scheduled for a future delivery date. Start customizing your card.\nBUY NOW CHECK BALANCE REWARDS",
      "hash": "27834302cb07",
      "downloadedAt": "2026-01-19T16:12:23.028Z",
      "trimmedAt": "2026-01-19T16:13:17.333Z",
      "sizeReduction": "96.0%"
    },
    {
      "url": "https://elistable.com/news-and-events/",
      "text": "[Page Title: NEWS AND EVENTS - Eli's Table]\n\nNEWS AND EVENTS\nThe More You Eat, The More You’re Rewarded \n|\nJul 22, 2021 News \nTreat Yourself! Save Money While Dining Decadently at  CHG Locations One of the biggest predicaments frequent restaurant guests face is determining...\nread more Get your country on! \n| ,\nJul 14, 2021 Events News \nGet Your Country On At The Saloon! If there is ever a time or place to experience “The South”, it is at Charleston Hospitality Group’s country...\nread more Recipient Of Employer Support Award On Supporting Community Through Hospitality Group \n|\nMay 20, 2021 News \nGeneral Michael Flynn recently stopped by the Honky Tonk Saloon in South Carolina for a “Bikers for Trump” event, where he presented the Patriot...\nread more Sam Mustafa, Charleston Hospitality Group Featured on OAN News \n|\nMay 20, 2021 News \nWatch the Interview CEO of Charleston Hospitality Group, Sam Mustafa of Charleston, SC is featured on One America News Network (OAN) after receiving...\nread more Check out this article by Market Watch Magazine that features Charleston Hospitality Group and their mission to attract a wide range of customers with its varied portfolio of restaurants and bars. \n|\nMay 14, 2021 Uncategorized \nFrom Southern barbecue to all-day breakfast to seaside Mediterranean fare, Charleston Hospitality Group aims to have something for every...\nread more Charleston Hospitality Group presented over $2,000 to MUSC Hollings Cancer \n|\nMar 10, 2021 News \nSam Mustafa, CEO and founder of Charleston Hospitality Group presented two checks to MUSC Hollings Cancer Center as a part of their ongoing Full...\nread more Lawmaker discuss federal minimum wage increase as hospitality workers detail a potential impact \n|\nMar 10, 2021 News \nCHARLESTON, S.C. (WCBD) – A push to increase the federal minimum wage was the topic of discussion Thursday in a Senate Budget Committee Hearing, and...\nread more MUSC Hollings Cancer Center receives over $2,000 \n|\nMar 10, 2021 News \nCHARLESTON, S.C. (WCIV) — Charleston Hospitality Group’s ‘Pink Drink’ sales during Breast Cancer Awareness month provides a donation of $2,048 to...\nread more MUSC Hollings Cancer Center receives over $2,000 \n|\nMar 10, 2021 News \nCharleston Hospitality Group; sales during Breast Cancer Awareness month provides a donation of $2,048 to MUSC’s Hollings Cancer Center. Sam...\nread more VIDEO: Charleston businesses optimistic for tourist season \n|\nMar 10, 2021 News \nRead More\nread more « Older Entries",
      "hash": "45c99c85e186",
      "downloadedAt": "2026-01-19T16:12:23.030Z",
      "trimmedAt": "2026-01-19T16:13:17.343Z",
      "sizeReduction": "96.4%"
    }
  ],
  "sizeReduction": "96.2%"
}