{
  "venueId": "ChIJM-G_SU57_ogRcyuhXRHmmFM",
  "venueName": "Heavy's Barburger",
  "venueArea": "Mount Pleasant",
  "website": "https://www.heavysbarburger.com/",
  "scrapedAt": "2026-01-19T16:12:32.255Z",
  "trimmedAt": "2026-01-19T16:12:54.143Z",
  "pages": [
    {
      "url": "https://www.heavysbarburger.com/menu",
      "text": "[Page Title: Menu — Heavy's Barburger]\n\nOUR MENU\n\nView our full food menu and drink selection - it’s full of all things you love, from our famous Barburger and Jumbo Wings to our Fresh Salads and Shorty Margarita.\nMenu offerings vary by location! Check your local Heavy’s for location-specific menu & pricing. For catering party trays, click here . Charleston Menu Daniel Island Menu \nShareable Snacks\n\nComes with One Dipping Sauce..\nAdditional Sauces +$1 each \nOur Crispy Wings Tossed in Choice of Red Ranger Sauce, The Wright Sauce, or Lemon Pepper Dry Rub. Buttermilk Ranch for Dipping. Served with Carrots & Celery.\nHEAVY’S JUMBO WINGS SIX / TEN RGF \nFour Jumbo Tenders, Buttermilk-Dipped, Hand-Breaded & Fried. Honey Mustard for Dipping.\nCHICKEN TENDERS & FRIES Dunked in Red Ranger Sauce for +$1 \nViv’s Deviled Eggs & Heavy’s Sweet & Spicy Thick-Cut Bacon\nBACON & EGGS GF \nHouse-Made Hand-Cut Sweet Onion Rings. Served with Heavy’s Sauce and Sweet & Sassy BBQ for Dipping.\nONION RINGS BASKET / HEAVY BASKET \nHeavy’s Sandwiches\n\nCrispy Fried Chicken Breast Dipped in Spiked-Up Cayenne Sauce, Topped with Pepper Slaw and Pickles\nTHE RED RANGER \nGrilled Chicken Breast with Pepper Jack Cheese, Avocado, Lettuce, Tomato, Red Onion and Duke's Mayo on a Martin's Potato Bun\nTHUNDERBIRD \nFish Filet Dusted with our Rub and Seared on a Cast Iron Skillet, Topped with Lettuce, Tomato, Red Onion and Heavy’s Sauce\nST. JOE BLACKENED FISH \nFresh Local Tomatoes, Applewood Smoked Bacon, and Fresh Lettuce with Duke’s Mayo on Normandy Farm Sourdough\nHEAVY’S BLT (SEASONAL) \nSlow-Roasted Prime Rib, Sliced Thin and Piled High on a Toasted French Loaf. Served with House-Made Jus for Dipping and The Wright Sauce.\nBIG TIM’S PRIME RIB \nSalads & Soups\n\nHand-Breaded Chicken on Fresh Greens with Cheddar, Cucumbers, Tomatoes, Bacon, Toasted Almonds, and Crunchy Sweet Potato Straws with a Side of Heavy’s Honey Mustard||\nFRIED CHICKEN SALAD RGF Sub: Chicken Salad +$1 Grilled Chicken +$2 Barburger Patty +$1 | Blackened Fish +$5 \nRoasted Chicken, Chilled, Sliced, and Tossed with Fresh Greens, Avocado, Diced Tomatoes, Toasted Almonds, Roasted Corn, Sweet Dates, Crumbled Goat Cheese, Cornbread Croutons, and Our Lemon Vinaigrette\nTHE COMPANY SALAD GF \nFresh Romaine Hearts Tossed in Our House-Made Caesar with Fresh Baked Sourdough Croutons, Topped with a Grilled Chicken Breast and Grated Parmesan\nGRILLED CHICKEN CAESAR RGF \nBrisket, Short-Rib, Kicked-Up with Sautéed Onions, Peppers, Stewed Tomatoes, and Beans. Topped with Cheddar & Jalapeños.\nSTEW’S CHILI CUP / BOWL RGF \nWe griddle-cook each of our quarter-pound smashburgers to order with our blend of ground Angus beef and serve ‘em on a Toasted Sesame Bun.Double Patty, American Cheese, Sliced Tomato, Red Onion, Lettuce, Pickles, Heavy’s Sauce\nBARBURGER \nAmerican Cheese, Red Onion, Pickles, Duke’s Mayo, French’s Mustard\nLUTEN’S CHEESEBURGER \nThick-Cut Bacon, Pepper Jack Cheese, Grilled Onions, Pickled Jalapeños, Sweet & Sassy BBQ, Fried Onion Straws\nUNCLE GENE’S RANCHERO \nAmerican & Swiss, Grilled Onions, Pickles, Heavy’s Sauce on Griddled Texas Toast\nPATTY MELT \nMarinated Mushrooms, Caramelized Onions, Swiss Cheese, Duke’s Mayo\nFUN GUY \nStew’s Chili, Grilled Onions, Cheddar Cheese, French’s Mustard on a Toasted Martin’s Potato Bun\nSTEW’S CHILI & CHEESE BURGER \nHouse-Made Veggie Patty, Swiss Cheese, Sliced Tomato, Red Onion, Lettuce, Pickles, Duke’s Mayo on a Toasted Martin’s Potato Bun\nHIPPIE BURGER \nHeavy’s Sides\n\nAdd to any sandwich or burger.\nCRINKLE CUT FRY RGF SWEET POTATO FRY GF HEAVY’S COLESLAW GF CUP OF STEW’S CHILI RGF LIL RANCH SALAD GF \nWe Have Pie!\n\nMade In-House with Fresh Lemons and Limes in a Graham Cracker and Almond Crust with House-Made Whipped Topping\nLEMON LIME ICEBOX PIE \nHeavy-Handed Pours\n\nEl Jimador Reposado, Agave Nectar, Orange, Fresh Squeezed Lime.\nSHORTY MARGARITA GF Add: Grand Marnier float +$3 \nTop Shelf Margarita with Patron Silver, Cointreau, Fresh Lime & Grand Marnier Side Piece\nELECTRA 225 GF \nA tad on the sweet side. Bulleit Bourbon, Angostura, Maple, Orange, and a good Cherry\nOUR BEST OLD FASHIONED GF \nFrozen Tequila Sunrise-ish\nTHE BANDWAGON GF \nServed Very Cold! Wild Turkey 101, Cherry & Rosemary Syrup, Fresh Squeezed Lemon\nCHERRY BOMB MANHATTAN GF \nDeep Eddy Lime Vodka, Ginger Beer, Lime\nMULE NAMED EDGAR GF \nJasper Gin, Ancho Reyes, Honey, Fresh Squeezed Lemon\nBEE STING \nAppleton Estates Rum, Plantation Pineapple Rum, Grand Marnier, Orgeat, Bitters, Fresh Squeezed Orange and Pineapple Juice\nHEY KOOL-AID MAN! GF \nZero-Proof “Cocktails”\n\nAmethyst Lemon Cucumber Serrano, Agave, Lime, Lemon, Orange\nGOOD GIRL DAISY GF \nAmethyst Blueberry Ginger Mint & Lois’s Lemonade\nBLUEBERRY LEMON CRUSH GF \nSoft Drinks\nLOIS’S FRESH LEMONADE GF BOTTLED DRINKS: CHEERWINE, NEHI, TOPO CHICO, IBC ROOT BEER, MEXICAN COKE GF DR. PEPPER & COKE PRODUCTS GF ICED TEA GF \nGluten-Friendly*\n\nRequest Gluten FriendlyGluten Friendlyon any Burger/Sandwich +$3on any Burger/Sandwich +$1\nRGF = GF = Sub Gluten Free Bun Sub Lettuce Wrap *Prepared in a shared kitchen. Not recommended for celiac or severe gluten allergy.",
      "hash": "a4ec0fdc2ca3",
      "downloadedAt": "2026-01-19T16:12:18.651Z",
      "trimmedAt": "2026-01-19T16:12:54.143Z",
      "sizeReduction": "97.3%"
    }
  ],
  "sizeReduction": "97.3%"
}