{
  "venueId": "ChIJQSLQ-xB6_ogRNf0_5P9nJt0",
  "venueName": "John Rutledge House Inn",
  "venueArea": "Downtown Charleston",
  "website": "https://www.johnrutledgehouseinn.com/?utm_source=google&utm_medium=organic&utm_campaign=business-listing",
  "scrapedAt": "2026-01-19T16:12:32.643Z",
  "trimmedAt": "2026-01-19T16:12:57.689Z",
  "pages": [
    {
      "url": "https://www.johnrutledgehouseinn.com/?utm_source=google&utm_medium=organic&utm_campaign=business-listing",
      "text": "[Page Title: John Rutledge House Inn Official Site | Hotel In Charleston]\n\nSkip to Main Content \nHistory & Timeless Luxury\n\nWelcome to John Rutledge House Inn\n® \nThe only home of a signer of The United States Constitution that now serves as both a living national historic landmark as well as an inn, the John Rutledge House Inn® mixes its original features in a charming historic setting with incredible amenities and a timeless sense of Charleston’s heart and soul.\nBook Now \nOur Perks\n\nLife’s Little Luxuries\n\nComplimentary deluxe continental or cooked breakfast\nAfternoon tea & light hors d’oeuvres \nEvening port, sherry, or brandy\nBook Now View More \nYOUR CHARLESTON HOME AWAITS\n\nTop Reasons to Stay\n\nEndless Photo Opportunities\n\nFrom the intimate courtyard to the teal wrought iron to the black and white checkered sidewalk, you are sure to find the perfect spot for the perfect photo.\nLearn More \nThoughtful Amenities\n\nA stay at John Rutledge House Inn® includes more than just free Wi-Fi. Guests also enjoy complimentary afternoon tea & light hors d'ouevres, 24-concierge service, and more.\nLearn More \nPerfect Location\n\nIdeally located on Broad Street, our inn is within perfect walking distance of many of the city's must-see attractions, shopping, and dining.\nLearn More \nUnparalleled Southern Hospitality\n\nAt John Rutledge House Inn®, you will be welcomed like family where you will feel like you are returning to your very own home.\nLearn More Close \nrooms & suites\n\nA Refined Retreat\n\nEach one of our 19 guest rooms and suites is unique – in size,\nin shape, in striking architectural details – but all provide a\nrefined oasis for reveling in the history and charm of historic downtown Charleston.\nView Rooms \nExplore Our Curated Offerings\n\nOffers & Packages\n\nGuests can choose from a range of packages, each designed to provide the ultimate in comfort, relaxation, and southern charm.\nExplore \nTimeless Luxury\n\nIn the Heart of Charleston\n\nJohn Rutledge House Inn is just steps away from some of Charleston’s most stylish boutiques, art galleries, and world-class restaurants.\nExplore \nGUIDES TO EVENTS IN AND AROUND CHARLESTON\n\nTop Seasonal Events in Charleston\n\nHappening In\n\nSpring\n\nHappening in\n\nSummer\n\nHappening In\n\nFall\n\nHappening In\n\nWinter\nMore Guides to Charleston \n\"Charming & fantastic location\"\n\nCan’t say enough great things. Staff was accommodating, helpful and welcoming. Location can’t be beat. Breakfast every day was complete perfection. This is an old inn & decor is period-specific. We loved it. Bathroom was modern and had amazing water pressure which for the age of the inn was a nice surprise!\n\nKCM | 4/12/25\n\n\"Great Stay; Strongly Recommended\"\n\nWe thoroughly enjoyed our three-night stay. This historic property is wonderfully maintained. Our room was very comfortable. The reception staff is extremely friendly, helpful, and genuinely an asset to the property. Breakfast staff is equally attentive and friendly. While all the staff is wonderful, the all star is the gentleman who handles luggage, does light maintenance and other tasks. Property is within walking distance to restaurants and most of the historic district. We did not need a vehicle when we were staying here, but they do have a parking area (added fee) for those that do. If we visit Charleston again, we will certainly stay here.\n\nAndy | 3/23/25\n\n\"Wonderful stay\"\n\nReally enjoyed our 3 night stay here. The property was beautiful and in a historic area of town. We had breakfast served in our room every morning which was a treat! They offer delicious treats for afternoon tea. The concierges are so helpful - from fixing the tv sound, to getting more pillows and advising how to get to dinner. We stayed in the carriage house which worked well for us. Minimal stairs!\n\nKate | 3/5/25\n\nAwards & Accolades\n\nCelebrating Excellence\n\nNo. 2\n\nFavorite Hotel in Charleston\n\nTravel + Leisure\n\nNo. 9\n\nBest Hotel in the U.S.\n\nTravel + Leisure\n\nTop 500\n\nHotels in the World\n\nTravel + Leisure\n\nNo. 1\n\nBest Hotel in Charleston\n\nTravel + Leisure\n\nThe Gold List\n\nConde Nast Traveler\nView All johnrutledgehouseinn View Instagram post by johnrutledgehouseinn Jan 18 Open post by johnrutledgehouseinn with ID 18067540967445222 Every dog deserves a little luxury. 🐕 Our A Dog’s World package at John Rutledge House Inn® is designed for tails to wag and paws to explore, so you and your pup can savor Charleston together. Discover more and book your stay through the link in our bio.#PetFriendly #PetFriendlyHotel #CharlestonRetreats #VisitCharleston #JohnRutledgeHouseInn #BedAndBreakfast #HistoricHotel #HistoricHotelsOfAmerica #SelectRegistry #StaySelect #ExploreCharleston ... 3 0 johnrutledgehouseinn View Instagram post by johnrutledgehouseinn Jan 16 Open post by johnrutledgehouseinn with ID 18080218838257874 Cozy up this winter at John Rutledge House Inn® with a warm cup by the fire. ❄️ As Charleston’s streets grow quiet and the air turns crisp, the Inn offers a serene retreat where historic charm, comfort, and timeless Southern elegance meet. Discover the perfect winter escape in our blog—link in bio.#JohnRutledgeHouseInn #BedAndBreakfast #HistoricHotel #HistoricHotelsOfAmerica #SelectRegistry #StaySelect #CharlestonWinter #VisitCharleston ... 2 0 johnrutledgehouseinn View Instagram post by johnrutledgehouseinn Jan 13 Open post by johnrutledgehouseinn with ID 18054468872669298 History worth preserving. Swipe to see the past and present of John Rutledge House Inn®, where careful restoration ensures the character, craftsmanship, and story of this iconic home endure. Which detail captures your attention? #JohnRutledgeHouseInn #BedAndBreakfast #HistoricHotel #HistoricHotelsOfAmerica #SelectRegistry #StaySelect #CharlestonExperience #CharlestonHistory ... 14 1 johnrutledgehouseinn View Instagram post by johnrutledgehouseinn Jan 10 Open post by johnrutledgehouseinn with ID 18554526844055222 From intimate nooks to grand, historic spaces, every room at John Rutledge House Inn® captures a piece of Charleston’s rich history. Which one would you call your home-away-from-home on your next visit?#JohnRutledgeHouseInn #BedAndBreakfast #HistoricHotel #HistoricHotelsOfAmerica #SelectRegistry ... 12 1 johnrutledgehouseinn View Instagram post by johnrutledgehouseinn Jan 7 Open post by johnrutledgehouseinn with ID 17854748598600631 Because cozy isn’t just for the nighttime. Daytime fires and classic Charleston charm make every moment at John Rutledge House Inn® feel warm and welcoming. Fireplaces are available in select rooms. 🕯 Explore availability through the link in our bio.#JohnRutledgeHouseInn #BedAndBreakfast #HistoricHotel #HistoricHotelsOfAmerica #selectregistry ... 24 4 johnrutledgehouseinn View Instagram post by johnrutledgehouseinn Jan 5 Open post by johnrutledgehouseinn with ID 17899240242359175 National Hot Tea Month calls for time well spent. At John Rutledge House Inn®, guests are welcomed each afternoon to linger over a hot drink during our refined afternoon tea and hors d`oeuvres, served in a setting rich with history and charm.#JohnRutledgeHouseInn #BedAndBreakfast #HistoricHotel #HistoricHotelsOfAmerica #SelectRegistry #StaySelect #TeaTime #SouthernCharm ... 13 2 johnrutledgehouseinn View Instagram post by johnrutledgehouseinn Jan 3 Open post by johnrutledgehouseinn with ID 18073751657373045 Evenings at John Rutledge House Inn® are meant to be savored - recent guest Clara M. said it best: “We loved the option of a night cap in the ballroom, it made everything feel so immersive and elegant.” From cozy corners to timeless charm, every stay is full of moments to remember. Book your visit today through the link in bio.#JohnRutledgeHouseInn #BedAndBreakfast #HistoricHotel #HistoricHotelsOfAmerica #SelectRegistry #StaySelect #Testimonial ... 8 0 johnrutledgehouseinn View Instagram post by johnrutledgehouseinn Dec 31 Open post by johnrutledgehouseinn with ID 17985177260928295 From morning light in the ballroom to evenings wrapped in history, 2025 was a year defined by gracious hospitality at John Rutledge House Inn®. We’re grateful for every guest who made our halls feel like home and look forward to welcoming you again soon.#JohnRutledgeHouseInn #BedAndBreakfast #HistoricHotel #HistoricHotelsOfAmerica #SelectRegistry ... 22 1 johnrutledgehouseinn View Instagram post by johnrutledgehouseinn Dec 29 Open post by johnrutledgehouseinn with ID 18077447651245667 Take a step back into history with our Discover Charleston Package. 🕰️ Perfect for two, this experience combines a stay in our historic inn with a carriage ride through cobblestone streets, a choice of tour at Patriots Point Naval & Maritime Museum or Fort Sumter, and a visit to a historic Charleston home. Discover the city’s charm and stories—plan your escape through the link in our bio.#JohnRutledgeHouseInn #BedAndBreakfast #HistoricHotel #HistoricHotelsOfAmerica #SelectRegistry #StaySelect #CharlestonExperience #CharlestonHistory ... 28 1 johnrutledgehouseinn View Instagram post by johnrutledgehouseinn Dec 27 Open post by johnrutledgehouseinn with ID 17932504593015117 Step inside John Rutledge House Inn® and discover a stay steeped in history, charm, and quiet sophistication. From the warmth of our staff to the elegance of every room, each visit is designed to create memories that stay long after you’ve left. 🕯️ If your time with us was special, we’d love for you to share your experience in Travel + Leisure’s 2026 World’s Best Awards reader survey—link in bio.#JohnRutledgeHouseInn #BedAndBreakfast #HistoricHotel #HistoricHotelsOfAmerica #SelectRegistry #StaySelect #BoutiqueHotels #TravelandLeisure #WorldsBest #WorldsBestAwards ... 9 1 johnrutledgehouseinn View Instagram post by johnrutledgehouseinn Dec 24 Open post by johnrutledgehouseinn with ID 18074873294052550 As Christmas Eve unfolds, John Rutledge House Inn® extends our warmest wishes for a Merry Christmas. May the season bring serenity, laughter, and the comfort of home, as well as treasured memories to carry with you into the new year. ❄️#JohnRutledgeHouseInn #BedAndBreakfast #HistoricHotel #HistoricHotelsOfAmerica #SelectRegistry #StaySelect #CharlestonHolidays #HolidayGetaway #CharlestonChristmas #VisitCharleston ... 13 0 johnrutledgehouseinn View Instagram post by johnrutledgehouseinn Dec 21 Open post by johnrutledgehouseinn with ID 18084088064035263 Winter begins today, and we can’t help but think back to last year’s snowfall—when Broad Street fell quiet, and John Rutledge House Inn® stood beautifully still, wrapped in a rare Charleston winter moment. ❄️ Cozy up with us this season; check availability through the link in our bio.#JohnRutledgeHouseInn #BedAndBreakfast #HistoricHotel #HistoricHotelsOfAmerica #SelectRegistry #StaySelect #CharlestonHolidays #HolidayGetaway #CharlestonWinter #VisitCharleston ... 26 0 johnrutledgehouseinn View Instagram post by johnrutledgehouseinn Dec 18 Open post by johnrutledgehouseinn with ID 17911406511122690 Please join us in welcoming Rashica Coakley as our Innkeeper. ✨ A Mount Pleasant native with more than 33 years of hospitality experience, Rashica is passionate about creating meaningful moments for guests and team members alike. She brings a deep love for Charleston’s culture and Southern hospitality—and carries tradition forward through sweetgrass basket weaving! Please give her a warm welcome in the comments below ⬇️#JohnRutledgeHouseInn #BedAndBreakfast #HistoricHotel #HistoricHotelsOfAmerica #SelectRegistry #StaySelect #LuxuryTravel #Innkeeper #GeneralManager #MeetTheTeam ... 17 2 johnrutledgehouseinn View Instagram post by johnrutledgehouseinn Dec 15 Open post by johnrutledgehouseinn with ID 18061001816261355 It’s often debated whether today is officially International Tea Day—but there’s no debate here. At John Rutledge House Inn®, afternoon tea is a daily tradition, exclusively for our guests and served with timeless Charleston hospitality. ☕🍃 Book your stay and enjoy tea time as it’s meant to be—link in our bio.#JohnRutledgeHouseInn #BedAndBreakfast #HistoricHotel #HistoricHotelsOfAmerica #SelectRegistry #StaySelect #TeaTime #SouthernCharm #InternationalTeaDay ... 8 0 johnrutledgehouseinn View Instagram post by johnrutledgehouseinn Dec 13 Open post by johnrutledgehouseinn with ID 18076275067997592 Start your morning on the right note with our complimentary deluxe breakfast, served wherever you feel most at home—your guest room, the ballroom, the courtyard, or the piazza. A peaceful beginning to any Charleston day. ☕ Explore more thoughtful amenities through the link in our bio.#JohnRutledgeHouseInn #BedAndBreakfast #HistoricHotel #HistoricHotelsOfAmerica #SelectRegistry #StaySelect #Breakfast #HotelBreakfast #Brunch #CharlestonBreakfast ... 9 1 johnrutledgehouseinn View Instagram post by johnrutledgehouseinn Dec 11 Open post by johnrutledgehouseinn with ID 18083212805113230 A new year brings new moments to celebrate. Whether you`re envisioning an intimate wedding or a small, heartfelt gathering, the John Rutledge House Inn® offers a historic setting where every detail feels special. Start planning through the link in our bio.#JohnRutledgeHouseInn #BedAndBreakfast #HistoricHotel #HistoricHotelsOfAmerica #SelectRegistry #StaySelect #CharlestonWedding #VisitCharleston #CharlestonEvents #EventPlanning ... 9 0 johnrutledgehouseinn View Instagram post by johnrutledgehouseinn Dec 9 Open post by johnrutledgehouseinn with ID 17930093412154774 POV: A front-row view of the Charleston Christmas Parade—courtesy of your stay at John Rutledge House Inn®. Set directly on Broad Street, our location puts the best of the city right outside your door. Reserve your stay through the link in bio and experience Charleston with ease.#JohnRutledgeHouseInn #BedAndBreakfast #HistoricHotel #HistoricHotelsOfAmerica #SelectRegistry #StaySelect #CharlestonHolidays #HolidayGetaway #CharlestonChristmas #VisitCharleston ... 15 1 johnrutledgehouseinn View Instagram post by johnrutledgehouseinn Dec 6 Open post by johnrutledgehouseinn with ID 18321735925172974 Grab your closest friends—your Charleston escape is calling. Our 4-day Girls’ Getaway itinerary is filled with candle-making, rooftop dinners, boutique finds, sunset sails, and just enough free time for those perfect Charleston photo opps. Explore through the link in bio and start planning your stay at John Rutledge House Inn®.#JohnRutledgeHouseInn #BedAndBreakfast #HistoricHotel #HistoricHotelsOfAmerica #SelectRegistry #StaySelect #GirlsTrip #Charleston #GirlsGetaway #VisitCharleston ... 14 1 johnrutledgehouseinn View Instagram post by johnrutledgehouseinn Dec 3 Open post by johnrutledgehouseinn with ID 18544369693020697 A day in the life of our Holiday Package at John Rutledge House Inn®? Morning goodies, exploring twinkling Charleston streets, and ending the night in a place filled with history and charm. Holiday magic, delivered. ✨ Visit the link in our bio to secure your stay.#JohnRutledgeHouseInn #BedAndBreakfast #HistoricHotel #HistoricHotelsOfAmerica #SelectRegistry #StaySelect #CharlestonHolidays #HolidayGetaway #CharlestonChristmas #VisitCharleston ... 39 1 johnrutledgehouseinn View Instagram post by johnrutledgehouseinn Nov 30 Open post by johnrutledgehouseinn with ID 18061226804537458 Give the gift of an experience this holiday season! Treat someone special to a journey back in time with a private ride through Charleston in our restored 1928 Model A Ford Sport Coupe — a nostalgic, one-of-a-kind outing available exclusively to guests. Visit the link in our bio to learn more. 🧳#JohnRutledgeHouseInn #BedAndBreakfast #HistoricHotel #HistoricHotelsOfAmerica #SelectRegistry #StaySelect #CharlestonExperience #VintageCar #CharlestonHistory ... 9 0 Load More Follow on Instagram \nManage Consent\n\nTo provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions.\nFunctional Always active Functional The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} \nManage Consent\n\nTo provide the best experiences, we use technologies like cookies to store and/or access device information. Consenting to these technologies will allow us to process data such as browsing behavior or unique IDs on this site. Not consenting or withdrawing consent, may adversely affect certain features and functions.\nFunctional Always active Functional The technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network. Preferences Preferences The technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user. Statistics Statistics The technical storage or access that is used exclusively for statistical purposes. The technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you. Marketing Marketing The technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes. Manage options Manage services Manage {vendor_count} vendors Read more about these purposes Accept Deny View preferences Save preferences View preferences {title} {title} {title} Manage consent Manage consent \nKeep in Touch!\n\nStay connected for promotions, announcements, & more!\nYes, I would like to receive updates. Get Updates",
      "hash": "def5accf24d8",
      "downloadedAt": "2026-01-19T16:12:19.500Z",
      "trimmedAt": "2026-01-19T16:12:57.689Z",
      "sizeReduction": "95.2%"
    }
  ],
  "sizeReduction": "95.2%"
}