{
  "venueId": "ChIJDYLlQpFx_ogRHD2-wKDHeOI",
  "venueName": "Tokyo Bistro",
  "venueArea": "Mount Pleasant",
  "website": "https://www.tokyoasianbistro.com/?utm_source=google&utm_medium=search",
  "scrapedAt": "2026-01-19T16:12:31.669Z",
  "trimmedAt": "2026-01-19T16:12:47.186Z",
  "pages": [
    {
      "url": "https://www.tokyoasianbistro.com/?utm_source=google&utm_medium=search",
      "text": "[Page Title: Tokyo Bistro - Asian Fusion Restaurant | Online Order | Mt Pleasant | SC]\n\nTokyo Bistro\n\nWelcome to our restaurant, come and taste!\nOnline Order Now！ \nAbout This Awesome Asian Fusion Restaurant\n\nWelcome to Tokyo Bistro – Where Asian Flavors Unite\n\nAt Tokyo Bistro, we bring together the best of Asian cuisine under one roof. From the delicate artistry of Japanese sushi and sizzling hibachi grills to the rich, savory traditions of Chinese dishes, our menu offers something for every palate.Whether you’re craving fresh sashimi, a fiery hibachi , or classic Chinese comfort food, Tokyo Bistro is your go-to destination for quality, variety, and unforgettable taste. Perfect for family dinners, casual lunches, or group celebrations, our restaurant is your go-to destination for a dynamic and satisfying dining experience.\n\nTokyo Bistro – More than just sushi. It’s a taste of Asia.\nOnline Order Now！ \nGoogle Review\n\n“This place is surprisingly affordable and the food is excellent. We ordered sushi as well as the General Tso’s chicken. They also have a nice selection of drinks. Overall, a clean, quiet vibe with friendly service and a little escape from Mount Pleasant to the serenity of Japan and its cuisine.”\n\n“Great food and location. We love Asian food, so it’s nice to have a good option in this area when we visit.The portion size is more than enough and they offer sturdy, reusable take out containers.”\n\n“Great place! The food was absolutely amazing and delicious. My husband had Philly sushi rolls and I had fresh rolls, soup and east rolls. The service was great, place is clean and server is polite and fast. Would definitely come again.”\n\nGallery\n\nHungry? Order now!\nOnline Order \nContact Us\n\nBusiness Phone:\n843-971-0277 \nBusiness Hours:\n\nMon: 11 AM - 10 PM\nTue: Closed\nWed - Thur: 11 AM - 10 PM\nFri - Sat: 11 AM - 10:30 PM\nSun: 12PM - 10 PM\n\nBusiness Location:\n\n1501 N Hwy 17 B, Mt Pleasant, SC 29464\nFollow View Location on Google Maps",
      "hash": "4286cd052751",
      "downloadedAt": "2026-01-19T16:12:16.359Z",
      "trimmedAt": "2026-01-19T16:12:47.186Z",
      "sizeReduction": "98.9%"
    }
  ],
  "sizeReduction": "98.9%"
}