{
  "venueId": "ChIJ24rlvQ56_ogRzo2H917ndGQ",
  "venueName": "Harbour Club at WestEdge",
  "venueArea": "Downtown Charleston",
  "website": "http://myharbourclub.com/",
  "scrapedAt": "2026-01-19T16:12:30.965Z",
  "trimmedAt": "2026-01-19T16:12:40.275Z",
  "pages": [
    {
      "url": "http://myharbourclub.com/",
      "text": "[Page Title: Home - Harbour Club at WestEdge]\n\nMember Login Member Experience Feedback \nHarbour Club at WestEdge Charleston’s premier private business & social club\n\nVideo by Daniel Woodcock/Drone Works Photo\n\nHarbour Club WestEdge\nAT \nHarbour Club at WestEdge is Charleston’s Premier Private Business and Social Club located along the banks of the Ashley River in downtown Charleston. Designed as a space where like-minded individuals can connect, the Club offers a welcoming environment that fosters interaction and camaraderie. It features distinctive food and beverage offerings, personalized Member experience, and abundant networking opportunities.\nInquire About Membership \nCharleston’s Premier Private Business & Social Club\nFacebook Instagram Linkedin \n22 WestEdge Street, 7th Floor, Charleston SC, 29403\n843.723.9680 Club Hours Monday \nBreakfast/Lunch/Dinner7:00 a.m. – 5:00 p.m.()\nKitchen closes at 3:00 p.m. Tuesday – Friday \nBreakfast/Lunch/Dinner7:00 a.m. – Close()\nKitchen closes at 9:00 p.m. Saturday \nClub Closed*\nCheck Club Calendar for Theme Dinner",
      "hash": "53a06da7860e",
      "downloadedAt": "2026-01-19T16:12:13.684Z",
      "trimmedAt": "2026-01-19T16:12:40.238Z",
      "sizeReduction": "98.7%"
    },
    {
      "url": "https://myharbourclub.com/meetings-events/member-events/",
      "text": "[Page Title: Member Events - Harbour Club at WestEdge]\n\nMember Login Member Experience Feedback \nMember Events\n\nWhether you joined Harbour Club at WestEdge for business or leisure, our Member events and activities are what will keep you coming back. These events offer a chance for Members to connect, find community, and engage in social, business, educational, and charitable experiences throughout the year. We pride ourselves on curating exceptional activities that Members can look forward to, be excited about, and proudly share with friends and colleagues.\nOur team excels at organizing a diverse range of social gatherings, including Business Networking Breakfasts, Golf Outings, Cooking Classes, Monthly Member Receptions, Wine Dinners, Cigar Happy Hours, Family Nights, and more. To see what’s coming up, check out our event calendar below. If you have any questions, feel free to reach out to our Member Relations Director, Megan Yenzer, at . megan.yenzer@myharbourclub.com Upcoming Events \nCharleston’s Premier Private Business & Social Club\nFacebook Instagram Linkedin \n22 WestEdge Street, 7th Floor, Charleston SC, 29403\n843.723.9680 Club Hours Monday \nBreakfast/Lunch/Dinner7:00 a.m. – 5:00 p.m.()\nKitchen closes at 3:00 p.m. Tuesday – Friday \nBreakfast/Lunch/Dinner7:00 a.m. – Close()\nKitchen closes at 9:00 p.m. Saturday \nClub Closed*\nCheck Club Calendar for Theme Dinner",
      "hash": "bc32dadb3dc8",
      "downloadedAt": "2026-01-19T16:12:13.700Z",
      "trimmedAt": "2026-01-19T16:12:40.250Z",
      "sizeReduction": "98.4%"
    },
    {
      "url": "https://myharbourclub.com/meetings-events/business-meetings/",
      "text": "[Page Title: Business Meetings - Harbour Club at WestEdge]\n\nMember Login Member Experience Feedback \nHarbour Club at WestEdge offers a sophisticated yet comfortable setting for business meetings of all sizes. With modern, fully equipped spaces, we provide flexible options for everything from board meetings to large conferences.What sets us apart is our dedicated staff, ensuring your event runs seamlessly. From catering to technology setup, we handle the details so you can focus on business. Our expert coordinators provide personalized service, making hosting with us effortless and enjoyable.\n\nFor event planning assistance, contact us at 843-823-0528 or .\ncandice.halsey@myharbourclub.com Request for Proposal \nMenu\n\nCharleston’s Premier Private Business & Social Club\nFacebook Instagram Linkedin \n22 WestEdge Street, 7th Floor, Charleston SC, 29403\n843.723.9680 Club Hours Monday \nBreakfast/Lunch/Dinner7:00 a.m. – 5:00 p.m.()\nKitchen closes at 3:00 p.m. Tuesday – Friday \nBreakfast/Lunch/Dinner7:00 a.m. – Close()\nKitchen closes at 9:00 p.m. Saturday \nClub Closed*\nCheck Club Calendar for Theme Dinner",
      "hash": "e353fe5c2ff9",
      "downloadedAt": "2026-01-19T16:12:13.703Z",
      "trimmedAt": "2026-01-19T16:12:40.258Z",
      "sizeReduction": "98.4%"
    },
    {
      "url": "https://myharbourclub.com/meetings-events/social/",
      "text": "[Page Title: Social - Harbour Club at WestEdge]\n\nMember Login Member Experience Feedback \nHarbour Club offers an elevated setting for social events of all sizes, combining sophistication with comfort. Whether you’re hosting an intimate gathering or a grand celebration, our versatile spaces provide the perfect backdrop. From elegant cocktail receptions to gala dinners, we tailor every detail to bring your vision to life.Our dedicated team ensures your event runs flawlessly, handling everything from catering and entertainment to seamless event flow. With our commitment to excellence, hosting with us is effortless and stress-free.\n\nFor event planning assistance, contact us at 843-823-0528 or .\ncandice.halsey@myharbourclub.com Request for Proposal \nMenu\n\nCharleston’s Premier Private Business & Social Club\nFacebook Instagram Linkedin \n22 WestEdge Street, 7th Floor, Charleston SC, 29403\n843.723.9680 Club Hours Monday \nBreakfast/Lunch/Dinner7:00 a.m. – 5:00 p.m.()\nKitchen closes at 3:00 p.m. Tuesday – Friday \nBreakfast/Lunch/Dinner7:00 a.m. – Close()\nKitchen closes at 9:00 p.m. Saturday \nClub Closed*\nCheck Club Calendar for Theme Dinner",
      "hash": "e6654a31e6e3",
      "downloadedAt": "2026-01-19T16:12:13.706Z",
      "trimmedAt": "2026-01-19T16:12:40.265Z",
      "sizeReduction": "98.4%"
    },
    {
      "url": "https://myharbourclub.com/meetings-events/event-venues/",
      "text": "[Page Title: Event Venues - Harbour Club at WestEdge]\n\nMember Login Member Experience Feedback \nEvent Spaces\n\nCooper Ballroom\n\nThe center ballroom provides the largest space in the Club to host any corporate or social event. Break away from the traditional banquet room setting and enjoy the outdoor feel paired with the comfort of indoor conveniences. This room comes with a 72in screen TV that guests have access to for any reason necessary.\n\nRivers Ballroom\n\nThe ballroom features seating for 250+, a custom built-in bar, and vast open space for a number of setup options.Two air walls allow this space to be partitioned into 2-3 separate ballroom. Polished concrete floors set the sophisticated scene with endless options for plated or reception style celebrations, classroom meetings, or casual cocktail rehearsal dinners. The floor to ceiling windows showcase a backdrop of a metropolitan Charleston, and the twinkling ceiling enhances the evening ambiance. Also comes with 3 72in screen TV’s for your presentation or powerpoint needs!\n\nStono Ballroom\n\nThis ballroom is closest to the foyer and main club entrance. It includes a beautiful custom-built in bar and mounted 72″ flat screen. The views offer a glimpse of the Ravenel Bridge, Connector and urban downtown Charleston\n\nWando Ballroom\n\nOur corner ballroom with two walls of oversized floor to ceiling windows bring in natural light and inspiring city views. Ideal for indoor ceremonies, cocktail hours, plated dinners, stationed or buffet dinners, etc. facing views of the bridges, historic church steeples and beauty of the downtown Charleston landscape. Comes with a mounted 72″ flat screen TV.\nContact Our Private Events Director \nBoardrooms & Small Meeting Rooms\n\nIdeation\n\nThis flexible space is the perfect brainstorming room for your next business meeting, or unique getaway for a family dinner and game night. Adjustable seating\noffers a fun and casual setting unlike any other space in the Club\n\nHonor and Respect Boardroom\n\nThis corner room offers 2 large tables and seating for 22. Views of the Citadel, Ashley River and luscious surrounding landscape make it ideal for a conference meeting or a family dinner. An air wall allows this space to be partitioned into two separate boardrooms. Additional amenities: two mounted flat screen monitors, AV capabilities\n\nHigh Garden\n\nThis corner room, located just off our stunning Ashley’s Gate dining room, features a table and seating for 10. With views of the Ashley River and The Harborage Ashley Marina, it’s the perfect setting for a conference meeting or an intimate family dinner. Additional amenities include a flat-screen monitor and AV capabilities for your convenience.\nContact Our Private Events Director \nCharleston’s Premier Private Business & Social Club\nFacebook Instagram Linkedin \n22 WestEdge Street, 7th Floor, Charleston SC, 29403\n843.723.9680 Club Hours Monday \nBreakfast/Lunch/Dinner7:00 a.m. – 5:00 p.m.()\nKitchen closes at 3:00 p.m. Tuesday – Friday \nBreakfast/Lunch/Dinner7:00 a.m. – Close()\nKitchen closes at 9:00 p.m. Saturday \nClub Closed*\nCheck Club Calendar for Theme Dinner",
      "hash": "ebda2094598a",
      "downloadedAt": "2026-01-19T16:12:13.708Z",
      "trimmedAt": "2026-01-19T16:12:40.275Z",
      "sizeReduction": "96.2%"
    }
  ],
  "sizeReduction": "98.0%"
}