{
  "venueId": "ChIJO-77xst7_ogR5KmN-afPT_I",
  "venueName": "Bar Rollins",
  "venueArea": "Mount Pleasant",
  "website": "https://table22.com/bar-rollins",
  "scrapedAt": "2026-01-19T15:41:57.952Z",
  "trimmedAt": "2026-01-19T15:44:57.518Z",
  "pages": [
    {
      "url": "https://table22.com/bar-rollins",
      "text": "[Page Title: Table22]\n\n0 \nSee where your business is leaving on the table\nnew revenue \n, complete with a revenue forecast and branded storefront.\nPreview a membership concept for your restaurant or shop in under a minute See your concept No commitment. Free to try. Trusted by thousands of operators. Or talk to our growth experts  → \nTrusted by thousands of top operators\n\n“Table22 is a rare win-win-win for the restaurant, the guest, and the platform. It has enabled us to drive 7 figures of new sales across subscriptions and retail, while helping us nurture guest relationships and extend our brand.”\n\n— , Rose’s Luxury (Washington, D.C.)\nAaron Silverman \n“Working with Table22 has allowed us to focus on the fun parts of our wine club, while they handle the hard stuff.  It doesn’t feel like you’re working with a 3rd party; they take the time to get to know your business, the people, and the needs.”\n\n— , Macchialina (Miami, FL)\nJacqueline Pirolo \n“Partnering with Table22 was an excellent idea, and allowed us to increase revenue without the operational impact of regular take-out. Their team is very organized and very pleasant to work with — always a step ahead and ready to assist.”\n\n— , Sarma (Somerville, MA)\nFernando Neves \nReliable new revenue models for restaurants, wine shops, butchers, and more\n\nTable22 is the only system built for beyond-four-wall offerings like subscriptions, drops, and pre-orders\n\nBoston, MA\nSarma \nMiami, FL\nBoia de \nAustin, TX\nAntonelli’s Cheese \nBrooklyn, NY\nWINNER \nSeattle, WA\nMusang \nNew York, NY\nIl Buco Alimentari Learn more \nGrow your sales, not your workload\n\nTable22 powers your storefront, processes payments, does customer service, creates branded marketing, and handles fulfillment — all under your brand\n\nAutomated marketing\n\nLaunch campaigns, track conversions, and retain members using CRM tools built specifically for hospitality\n\nUnified commerce\n\nA customizable checkout built for subscriptions, memberships, and pre-orders\n\nWhite-glove logistics\n\nOur fulfillment network handles the complexities of in-person pickup, national shipping, and local delivery\n\nGetting started with Table22 is fast, easy, and free to try\n\nWe'll design your program, build your storefront, and get you selling — all with no upfront cost\nDesign your program \nWe'll help you build the right subscription, membership, or pre-order program for your business — based on what's worked for thousands of operators like you\nWe handle the hard parts \nStorefronts, payments, delivery logistics, customer support, and marketing – managed for you\n\nNew revenue, from untapped customers\n\n80% of subscribers haven't visited in the past year — we let you monetize patrons who love your brand but can't always walk through the door\n\nMade by you, powered by Table22\n\nFor busy operators, Table22 takes the headache out of subscription growth.\n\nOur platform unlocks predictable revenue, strengthens guest loyalty, and provides a creative canvas for sharing and discovery.\nRead how Montrose Cheese and Wine used Table22 to take their memberships to the next level. Read the case study → Learn why so many top restaurants and retailers trust Table22 \nFrom wine clubs to meal subscriptions, we help restaurants and retailers launch programs their customers love.\nSee It For Yourself",
      "hash": "2f9fd520346b",
      "downloadedAt": "2026-01-19T15:30:48.886Z",
      "trimmedAt": "2026-01-19T15:44:57.518Z",
      "sizeReduction": "98.5%"
    }
  ],
  "sizeReduction": "98.5%"
}