{
  "venueId": "ChIJ-2QjVv5l_ogRuXbJiBeHHg0",
  "venueName": "Macho Pichu Chicken",
  "venueArea": "North Charleston",
  "website": "http://www.machopichuchicken.com/",
  "scrapedAt": "2026-01-19T15:41:53.696Z",
  "trimmedAt": "2026-01-19T15:42:08.490Z",
  "pages": [
    {
      "url": "http://www.machopichuchicken.com/",
      "text": "[Page Title: Macho Pichu Chicken]\n\nMacho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken Macho Pichu Chicken\n\nPeruvian Rotisserie chicken\nPeruvian Rotisserie chicken Peruvian Rotisserie chicken Peruvian Rotisserie chicken Quarter, Half, Whole, that's how we roll! \nPeruvian Rotisserie chicken\nPeruvian Rotisserie chicken Peruvian Rotisserie chicken Peruvian Rotisserie chicken Quarter, Half, Whole, that's how we roll! Gallery \nReviews\nSocial Visit Us \nContact Us\nName Phone Email* Send \nThis site is protected by reCAPTCHA and the Google and apply.\nPrivacy Policy Terms of Service \nMacho Pichu Chicken\n\n1813 Reynolds Avenue\nNorth Charleston, SC 29405\nUS\n\ndine in or carry out\n(843) 640-3537 machopichuchicken@gmail.com \nHours\n\nOpen today\n12:00 – 20:00 Copyright © 2024 Macho Pichu Chicken - All Rights Reserved. Powered by Website Builder GoDaddy",
      "hash": "5782ffa9a9b7",
      "downloadedAt": "2026-01-19T15:34:45.096Z",
      "trimmedAt": "2026-01-19T15:42:08.440Z",
      "sizeReduction": "98.0%"
    },
    {
      "url": "http://www.machopichuchicken.com/menu",
      "text": "[Page Title: Macho Pichu Chicken]\n\nMenu \nCOMFORT FOOD\n\nCHICKEN EMPANADAS (2)\n\n$8.00\npulled chicken, olives, peppernato \nCHICKEN POT PIE (seasonal)\n\n$10.00\nrotisserie chicken, peas, carrots, corn, green beans, gravy, puff pastry \nJUMBO CHILI LIME WINGS\n\nMarket Price\nsmall (5 pc)  large (8 pc) \nSANDWICHES\n\nCHICKEN SALAD\n\n$ 9.00\nrotisserie chicken, red onion, celery, peruvian mayo served w/ lettuce, tomato on sourdough bread \nCHICKEN CUBANO\n\n$ 12.75\npulled mojo chicken, ham, swiss, yellow pepper mustard, house pickles on a pressed roll \nPICKLEBACK\n\n$10.25\nfried pickle brined chicken thigh, sweet and sour pickles, house yum-yum sauce, served on a toasted bun \nPERUVIAN CHICKEN\n\nall natural chicken marinated in our authentic spice mix and roasted over hardwood charcoal.\n\nQUARTER DARK\n\n$ 7.00\n\nQUARTER WHITE\n\n$9\n\nHALF DARK & WHITE\n\n$15\n\nWHOLE\n\n$28\n\nPERUVIAN CHICKEN COMBO\n\n$34\nSERVED FAMILY STYLE whole chicken, red beans and rice or steak fries. \nMACHO COMBO\n\nServed with a house salad or your choice of: red beans and rice or steak fries.\n\nQUARTER DARK\n\n$11.50\n\nQUARTER WHITE\n\n$13.50\n\nHALF DARK & WHITE\n\n$15.50\n\nSIDES\n\n$5.00 EACH\n\nSTEAK FRIES\n\nRED BEANS AND RICE\n\nHOUSE SALAD\nmixed greens, carrot, tomato, house vinaigrette \nSPECIALTY SIDES\n\n$6.00 EACH\n\nSTRING BEANS\n\nARROZARONI\n\nMADUROS\n\nYUCCA FRIES\n\nSWEETS\n\nask about our weekly feature\n\nconsuming raw or undercooked meats, poultry, seafood, shellfish, or eggs may increase your risk of food borne illness\nCopyright © 2024 Macho Pichu Chicken - All Rights Reserved. Powered by Website Builder GoDaddy",
      "hash": "c53c58e24c5b",
      "downloadedAt": "2026-01-19T15:34:45.311Z",
      "trimmedAt": "2026-01-19T15:42:08.490Z",
      "sizeReduction": "98.5%"
    }
  ],
  "sizeReduction": "98.2%"
}