{
  "venueId": "ChIJCcbkaFd__ogRHn8eNHambBU",
  "venueName": "Tolli’s Trattoria",
  "venueArea": "West Ashley",
  "website": "http://www.tollistrattoria.com/",
  "scrapedAt": "2026-01-19T15:41:55.937Z",
  "trimmedAt": "2026-01-19T15:42:59.818Z",
  "pages": [
    {
      "url": "http://www.tollistrattoria.com/menus",
      "text": "[Page Title: Menus | Tolli's Trattoria in Johns Island, SC]\n\nMain content starts here, tab to start navigating Slide 1 of 4 Slide 2 of 4 Slide 3 of 4 Slide 4 of 4 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides \nMenus\nAppetizers Salads Entrees 12\" Pizzas For Take Out Pasta Subs Chubby Chub Sub Desserts Sides & Additions Drinks Catering Menu Tollis Trattoria Lunch Menu \nAppetizers\n\nN.Y. Style Fried Calamari\n\nCorn meal n flour dusted domestic calamari tube & tentacles fried with sliced hot cherry peppers. Served with lemon wedge & our marinara sauce\n15.00 $ \nGarlic Pesto Knots\n\nOur pizza dough knots baked & then tossed in housemade garlicky pesto. 6 pieces per order **There are no nuts in this dish**\n9.00 $ \nCheezy Garlic Bread\n\nOur daily fresh made in house bread slathered with garlic butter then topped with American, mozzarella, oregano & pecorino cheeses baked til nice n cheezy, then parsley\n10.00 $ \nArancini's\n\nCrisp shell Risotto fritters with peas, chili pepper and pecorino cheese served on a bed of our marinara sauce topped with more grated pecorino cheese. Two to an order\n9.00 $ \nTollis Dam Good Bar Wings\n\nOur seasoned & floured jumbo wings deep fried and dressed with one of our buffalo or sweet & spicy Italian chili sauce. Served with either our blue cheese dressing or our ranch dressing\n9.00 $ \nClams Posillipo\n\nLocal Clams, Garlic, Nduja, Anchovies, white wine, Grape tomato, splash of marinara, lemon zest & Grilled crostini\n13.00 $ \nBurrata Amalfi\n\nA center cracked Burrata Ball with sliced Mortadella, pistachios, EVOO, parsley pesto and our sliced ciabatta bread\n16.00 $ \nFocaccia of the Day\n\nHouse made thick airy Focaccia, dressed differently Daily, square cut & sliced. served warm\n8.00 $ \nSoup of the Day\n10.00 $ \nSalads\n\nArugula Panzanella Salad\n\nCaramelized onion pizzette with burrata cheese, EVOO, cracked pepper & balsamic drizzle\n16.00 $ \nTre Colori Caprese\n\nArugula, fresh mozzarella ovaline, sliced on top of vine ripe tomato, some sweet grape tomato with olive oil, parsley pesto, salt and pepper, balsamic glaze drizzle & fresh basil\n14.00 $ \nClassic Caesar Salad\n\nCrisp romaine tossed with our housemade Caesar dressing and house made croutons, finished with shaved grana padana cheese\n12.00 $ \nTolli's Chopped Salad\n\nCrisp romaine, green olives, sliced hot cherry peppers, diced red onion, crisp bacon, & housemade blue cheese dressing. Red wine vinaigrette is available upon request\n12.00 $ \nRed Beet Salad\n\nRoasted Beets, Arugula, Whipped Ricotta Cheese base, Crushed Pistachio sprinkled on top & House made Lemon Vinaigrette.\n14.00 $ \nEntrees\n\nMain course items\n\nChicken Milanese\n\nOur cooked to order cutlet from tenders, topped with grape tomato and arugula salad with lemon parm dressing and house pickled red onions\n21.00 $ \nChicken Parmigiana\n\nOur fried cutlet topped with marinara sauce & melted mozzarella served over rigatoni or linguini pasta\n28.00 $ \nBaked Meatballs\n\nFour of our homemade beef meatballs served in marinara sauce topped with melted mozzarella cheese, fresh arugula & pickled red onions\n18.00 $ \nChicken Piccata\n\nSauteed thin, floured cutlets finished in lemon butter sauce with Garlic Aioli dressed smashed fried potato\n26.00 $ \nSalmon Lemon Thyme\n\nSkinless salmon filet, pan seared & finished in a lemon, thyme wine sauce served with salt & pepper Broccoli\n27.00 $ \nCountry Fried Pork\n\nPork tenderloin cutlets, buttermilk marinade, floured, fried and dressed with cracked black pepper gravy served with salt & pepper Broccoli\n26.00 $ \nN.Y. Strip Steak Frites\n\nstrip steak pan seared finished with a chimichurri sauce, pecorino parsley fries and a horseradish cream dipping sauce\n39.00 $ \n12\" Pizzas For Take Out\n\n12\" Pizzas Your Way\n\nBase\n\nRed or white. Add mozzarella\n\nA La Carte Toppings (Limit 5)\n\nBacon | Pepperoni | Meatball | Sausage | Fresh Mozzarella | Fresh Tomato | Bell Pepper | Fresh Garlic | Onion | Mushroom | Arugula | Black Olive\n\n12\" Red Mozzarella Build Your Own Apizza\n\nClassic red base with tomato sauce, oregano, mozzarella. Now comes with mozzarella\n11.00 $ \n12\" White Mozzarella Build Your Own Apizza\n\nClassic white base with EVOO, oregano, mozzarella. Now comes with mozzarella\n11.00 $ \nCalzone\n\nOur dough is filled with a three cheese blend of ricotta, mozzarella & grated pecorino romano cheese, black pepper, and parsley mixture then topped with your choice of filling. The dough is folded over itself, sealed, and baked till golden. Served with a side of marinara sauce\n15.75 $ \n12\" New Calabrese\n\nOur Calabrese but made better. Red base, fresh mozzarella, pickled Fresno, soppressata, chili flakes, honey, pecorino & when done we add a little arugula and pickled red onion. Small change. Huge taste difference for the better!\n23.25 $ \n12\" Morty Mortadella\n\nWhite base with fresh mozzarella baked blind. Then we add fresh sliced mortadella fresh ricotta, parsley pesto, roasted pistachio & EVOO. An amazing pizza\n23.00 $ \n12\" Thea\n\nWhite a pizza with mozzarella, chopped broccoli rabe, fresh garlic, pinch of chili flakes, EVOO, pecorino and our loose Italian sausage\n19.75 $ \n12\" Americano\n\nWhite a pizza, mozzarella, fresh sliced tomato, fresh garlic, pecorino, fresh basil & parley pesto drizzle\n16.75 $ \n12\" BBQ Chicken\n\nWhite a pizza, mozzarella, chopped fried chicken, red onion, pecorino, BBQ sauce & bacon\n19.25 $ \n12\" Buffalo Chicken\n\nWhite pie with our blended Frank’s red hot special sauce, fried chicken, mozzarella cheese & pecorino\n16.00 $ \n12\" Estiva\n\nWhite a pizza with mozzarella, baked blind then dressed with arugula, chopped tomato, shaved Parmigiano cheese, drizzled with our lemon parm dressing and finished with sliced prosciutto di parma\n16.75 $ \n12\" Margharita\n\nPlain tomato sauce, our fresh mozzarella, fresh basil, pecorino & E.V.O.O. this is the a pizza made to honor queen Margherita of Italy. Hence the name... also the pizza was to symbolize the Italian flag colors\n16.75 $ \n12\" Marios\n\nThis white a pizza is unique. White base with crumbled goat cheese, caramelized onions, ground pistacchio nuts, honey, olive oil and finished with truffle oil when it comes out of oven. You can also add fresh fruit as an option\n17.50 $ \n12\" Nonno\n\nOur red sauce base, mozzarella, oregano, fresh garlic, loose Italian sausage, pecorino and fresh sliced mushrooms\n16.25 $ \n12\" Shrimp Arugentine\n\nWhite pizza with mozzarella, shrimp, garlic baked then dressed with fresh arugula, chopped tomato, lemon Parmigiani dressing, pecorino and shaved grana Padana cheese\n24.00 $ \n12\" Shrimp Scampi\n\nA white pizza with oregano, mozzarella, fresh shrimp, fresh garlic, lemon parm dressing, sliced grape tomato, fresh parsley, pecorino, EVOO and baked until crisp and golden\n22.75 $ \n12\" Tonino's\n\nWhite base, mozzarella, ham, mushrooms, caramelized onions, hot cherry peppers, pecorino, & EVOO\n21.50 $ \n12\" Shrimp Pesto\n\nWhite base, mozzarella, garlic, shrimp, pesto, pecorino, oregano & EVOO\n20.25 $ \n12\" Porchetta & Rabe\n\nWhite base, mozzarella, porchetta, broccoli rabe, garlic, pesto & EVOO\n21.25 $ \n12\" Scampi Casino\n\nWhite, mozzarella, shrimp, garlic, lemon parm dressing, sliced grape tomato, roasted peppers, fresh parsley, pecorino & bacon\n25.75 $ \n12\" Nutty Cannoli\n\nWhite pizza shell baked blind, then topped with Nutella spread, crumbled cannoli shells, cannoli cream and chocolate chips\n19.25 $ \n12\" N.Y. Steakbomb\n\nwhite pizza, American, Mozzarella, mushrooms, onions, garlic, shaved steak & hot cherry peppers\n19.75 $ \n12\" chicken Supreme\n\nWhite pizza, mozzarella, chopped chicken cutlet, spinach, red onions, garlic, bacon & Bread Crumb\n20.00 $ \n12\" Eggplant Deluxe\n\nRed pizza, mozzarella, spinach, eggplant, ricotta, garlic, pecorino & EVOO\n18.50 $ \n12\" Broccoli & Sausage\n\nWhite pizza, mozzarella, broccoli, housemade sausage, garlic, ricotta & pecorino\n19.50 $ \nPasta\n\nLinguini Puttanesca\n\nTomato base with Kalamata and green olives, anchovy, garlic, capers, Fresno, shallots tossed with linguini pasta and finished with fresh parsley. An old-school Italian staple\n25.00 $ \nLinguini Shrimp Provencal\n\nGrape tomato sauteed with shallots, garlic, EVOO, white wine, pepper flakes, with shrimp & shrimp stock, tossed with linguini pasta\n28.00 $ \nShrimp Fra Diavolo\n\nSauteed Shrimp In Our Marinara With Added Chili Flakes to spice it up Fra Diavolo Style.\n27.00 $ \nPasta Marinara & Meatball\n\nEither Penne or Linguini tossed with our Marinara Sauce, Topped with two of our all Beef Meatballs finished with Pecorino & EVOO.\n22.00 $ \nPenne Alla Vodka\n\nBacon, shallots, sweet peas, & Fresno chilis sautéed & tossed with Penne Rigate pasta in a vodka cream sauce & finished with grated pecorino\n24.00 $ \nPesto Cream Gnocchi\n\nOur housemade ricotta gnocchi tossed with traditional basil pesto & a touch of cream. Finished with pecorino Romano cheese & olive oil drizzle. **There are nuts in this dish**\n27.00 $ \nLinguine Alle Vongole Bianco\n\nLinguine and fresh pasta neck local clams in their shells, sautéed with garlic, shallot, & fresno peppers. Finished with fresh parsley\n28.00 $ \nPasta Marinara\n\nEither Penne Rigate or linguini tossed with our marinara sauce finished with pecorino & EVOO\n14.00 $ \nGnocchi Sorrentino\n\nHousemade ricotta gnocchi, tossed with our marinara sauce and finished with fresh mozzarella, fresh basil and pecorino cheese\n26.00 $ \nFettucine Alfredo\n\nEgg noodle fettuccine pasta tossed with an alfredo sauce of cream, butter, nutmeg and pecorino cheese dusted with fresh cracked black pepper\n20.00 $ \nPasta Rose'\n\nEither penne or linguine pasta with our house marinara and a touch of cream tossed with fresh basil & pecorino\n20.00 $ \nPappardelle alla Bolognese\n\nTraditional beef Bolognese served with house made pappardelle tossed with pecorino Romano grated cheese and finished with Spanish EVOO\n27.00 $ \nCavatelli Rabe\n\nHouse made Ricotta Cavatelli with sauteed rabe, house made sausage, pecorino, chili flakes, butter, vegetable stock & EVOO.\n28.00 $ \nSubs\n\nMeatball Parm\n\nNonna's famous meatballs with our pomodoro sauce baked on our housemade bread with melted mozzarella & grated cheese\n15.00 $ \nChicken Parm\n\nChicken cutlets, hand-pounded & fried to order then dressed with our pomodoro sauce and mozzarella and pecorino cheeses. Served on our toasted italian bread\n15.00 $ \nItalian combo Chubby Chub Sub\n\nMortadella, Genoa salami, provolone cheese, baby gem lettuce, oil & vinegar, oregano & sliced tomato\n15.00 $ \nPepperoni Parm\n\nOur fresh baked bread is layered with pepperoni, mozzarella cheese, and our famous pomodoro sauce. Toasty and melty and delicious!\n15.00 $ \nCaprese Chubby Chub Sub\n\nFresh mozzarella, tomato, fresh basil, arugula, parsley pesto, balsamic glaze, EVOO on our housemade bread\n15.00 $ \nChicken Cutlet Chubby Chub Sub\n\nOur crunchy & juicy chicken tender cutlets are fried, sliced, and placed on our housemade bread with mayo, romaine, tomato, salt n pepper & white American cheese. A cold sub\n15.00 $ \nBuffalo Chicken Cutlet Chubby Chub Sub\n\nCrispy juicy fried tenders sliced and dressed with our buffalo sauce, Romaine, blue cheese dressing & pickled red onions\n15.00 $ \nN.Y. Steak Bomb Chubby Chub Sub\n\nShaved steak, sautéed in garlic butter, mushrooms, onions then put in our bread with sliced hot cherry peppers and toasted with white American cheese The Bomb!! (*Served until 3pm only!)\n15.00 $ \nMuffuletta Chubby Chub Sub\n\nBread with EVOO, parsley pesto, ham, soppressata, provolone cheese, mozzarella cheese, olive tapenade and mortadella\n15.00 $ \nPorchetta & Rabe Chubby Chub Sub\n\nOur bread with sliced pork belly porchetta, parsley pesto, sautéed rabe and provolone. Toasted\n15.00 $ \nMorty Chubby Chub Sub\n\nEVOO, Olive Tapenade, Mortadella, Fresh Mozzarella, Pickled Red Onions\n15.00 $ \nItalian Trio Chubby Chub Sub\n\nVinaigrette, Olive Tapenade, Greens, Cotto Ham, Mortadella, Soppressata, Vine Ripe Tomato, Oregano & Provolone\n15.00 $ \nRoyal Caprese Chubby Chub Sub\n\nParsley Pesto, EVOO, Arugula, Prosciutto, Fresh Mozzarella, Vine Ripe Tomato, Fresh Basil & Balsamic Glaze.\n19.00 $ \nLil Taliano\n\nOlive Tapenade, Vinaigrette, Cotto Ham, Soppressata, Greens, Fresh Mozzarella.\n15.00 $ \nThe Medi\n\nBurrata, Vine Ripe Tomato, Greens, Olive Tapenade, EVOO, Balsamic Glaze.\n15.00 $ \nDesserts\n\nChanges often, check with order taker or waitstaff\n\nCheesecake Of The Day, Call To Find Out What Flavor\n12.00 $ \nPeanutbutter & Reeses Chunk Cookies\n3.95 $ \nAssorted Gelati Flavors & Sorbetto\n4.00 $ \nTRIPLE CHIP CHOCOLATE CHIP COOKIES\n3.95 $ \nTWO Small Cannoli\n6.00 $ \nNonna Pina Makes an Assortment of Different Desserts, Changes Daily\n\nFrom Carrot Cakes, Chocolate Cakes, Ricotta Cakes, French Apple Cakes, etc\n\n11' Whole Cheese Cake (Three Day Advance Notice To Order)\n120.00 $ \n9\" Whole Three Layer Cake (3 Day Advance Notice To Order)\n85.00 $ \nGELATI\n\nEspresso Gelato\n1 scoop/ 4.00 $ \nPistachio Gelato\n1 scoop/ 4.00 $ \nMixed Berry Sorbet\n1 scoop/ 4.00 $ \nSea Salt Caramel Gelato\n1 scoop/ 4.00 $ \nChocolate Gelato\n1 scoop/ 4.00 $ \nHazelnut Gelato\n1 scoop/ 4.00 $ \nSides & Additions\n\nSide Bread Butter & EVOO\n\nOur housemade ciabatta bread sliced & served with butter & EVOO\n5.00 $ \n7 Grilled Shrimp\n\nFresh local shrimp seasoned with salt & black pepper lightly grilled and added to your salad of choice\n9.00 $ \nSingle Meatball\n\nHousemade all beef meatball with marinara sauce & grated pecorino cheese\n4.00 $ \nSide Chicken Cutlet\n\nOur jumbo tender cutlet fried to order for pasta or salad of your choice\n6.00 $ \nSingle Burrata Ball\n\nFresh mozzarella ball with stracciatella cheese center\n6.00 $ \nSide EVOO\n\nImported first cold pressed extra virgin olive oil\n1.00 $ \nSide Blue Cheese Dressing\n\nOur housemade Danish blue cheese dressing, 2.5 oz\n1.75 $ \nSide Grated Cheese\n\nD.O.P. Pecorino Romano genuine, sheep's milk cheese, cut fresh, dried and grated in house\n1.00 $ \nSide of Crushed Red Pepper Flakes\n\nDried crushed chili pepper flakes\n0.25 $ \nSide Marinara Sauce\n\nOur fresh housemade marinara, 2.5 oz\n1.00 $ \nCouple of Meatballs\n\nTwo of our all beef housemade meatball with marinara sauce & pecorino cheese\n8.00 $ \nSide Grilled Chicken\n\nJumbo tender lightly seasoned with salt & pepper olive oil and grilled, to add to a salad or pasta\n5.00 $ \nSide Of Fries\n\nOur lunch fries with salt & side of ketchup\n5.00 $ \nSingle Ovaline Fresh Mozzarella\n\nFresh ovaline mozzarella cheese ball, added to your item\n4.00 $ \nSide of Extra Vinaigrette Dressing\n1.00 $ \nSide of Extra Lemon Parm Dressing\n1.00 $ \nSide Extra Ranch Dressing\n1.00 $ \nItalian Sautéed Greens\n\nChef's choice of available greens sautéed with fresh garlic, chili pepper flakes, anchovies and spices & finished with extra virgin olive oil\n9.00 $ \nSide Bread, EVOO & Butter\n\nOur housemade bread sliced and served with butter & EVOO, that's it\n5.00 $ \nDrinks\n\nCocktails & wines\n\nCocktails\n\nAmber Negroni\n\nGin, Braulio Amaro, Cocchi Americano, lemon, rosemary\n13.00 $ \nBlack Manhattan\n\nKnob Creek Rye, Averna Amaro, walnut bitters, orange zest\n13.00 $ \nAperol Spritz\n\nAperol, Prosecco, seltzer & an orange slice on ice\n11.00 $ \nOld Fashioned\n\nBourbon, bitters, sugar, orange zest & maraschino cherry over large cube\n14.00 $ \nTolli Bellini\n\nAlberto Nani Prosecco & white peach puree, fresh basil in a flute\n13.00 $ \nSgroppino Al Limone\n\nLemon sorbetto, prosecco float, Wheatly Vodka, slice of lemon and mint martini glass\n13.00 $ \nRose' Pina\n\nHomemade Orangecello, Carolina Reaper Vodka, Pasubio Amaro, Pineapple & Rose' Prosecco\n14.00 $ \nBig Ant's Manhattan\n\nMAKERS MARK BOURON, NONINO AMARO, SWEET VERMOUTH, ANGOSTURA BITTERS & CHERRY\n16.00 $ \nThe Ringmaster\n\nBlanco Tequila, Grand Marnier, Lime, Pineapple & Coconut Cream with Nutmeg.\n13.00 $ \nThe Efficiency Expert\n\nWhite Rum, Homemade Limoncello, Lime, Angostura Bitters, Simple Syrup, Fresh Mint & Club Soda.\n13.00 $ \nThe Odd Man\n\nBulleit Bourbon, Grapefruit, Campari, Lemon & Simple Syrup.\n14.00 $ \nThe Zinger\n\nHendrick's Gin, Cocchi Americano, Lemon, Simple Syrup, Cardamon Lemongrass Bitters, Orange Bitters & Prosecco.\n15.00 $ \nThe Throwback\n\nJameson, Sweet Vermouth & Fontbonne Herbal Liqueur with Orange Essence.\n11.00 $ \nThe Sass\n\nBourbon, Demerara Simple Syrup & Lemon with Lambrusco Wine Float.\n11.00 $ \nThe Aficionado\n\nCasamigos Anejo Tequila, Agave Syrup, Angostura & Orange Bitters with Cherry.\n17.00 $ \nThe Stark & Dormy\n\nWhite Rum, Goslings Rum, Bergamot Black Tea, Allspice Bitters, Lime & Ginger Beer.\n11.00 $ \nThe Ingenue\n\nBlanco Tequila, Fontbonne Herbal Liqueur, Passionfruit Puree & Lime.\n11.00 $ \nThe Go- Getter\n\nMuddled Fresh Strawberries & Basil, Gin Mare', Lillet Blanc & Lemon Served Up, Topped with Prosecco & Fresh Basil.\n14.00 $ \nThe Nightcap\n\nGrappa, Strega, Orange & Lemon.\n15.00 $ \nThe Cherry on Top\n\nVodka, Borghetti, Nonino Amaro, Sherry, Simple Syrup & Cherry.\n12.00 $ \nFiora D' Amalfi\n\nWhite Rum, Limoncello, Elderflower Liqueur & Lemon.\n14.00 $ \nEspresso Martini\n\nVodka, Borghetti, Espresso.\n12.00 $ \nMocha Martini\n\nVan Gogh Double Espresso Vodka, Licor 43 Chocolate Liqueur, Espresso.\n13.00 $ \nBrown Sugar Walnut old Fashioned\n\nTempleton Rye, Demerara Simple Syrup, Black Walnut Bitters.\n13.00 $ \nWines\n\nSparkling & Rose\n\nProsecco, Nino Arvedi\n\nVeneto, Italy NV\nGls/ 9.00 $ BTL/ 32.00 $ \nRosé, Prosecco, \"Ca Di Rajo\" Brut\n\nVeneto, Italy NV\nGLS/ 13.00 $ BTL/ 48.00 $ \nMoscato Sicilia, Cantine Pellegrino\n\nSicily, IT\nGLS/ 9.00 $ BTL/ 32.00 $ \nLambrusco, \"LINI 910\"\n\nEmilia Romagna, Italy NV\nGLS/ 10.00 $ BTL/ 36.00 $ \nChampagne, Laurent Perrier Brut Rose'\n\nFrance\n144.00 $ \nWhites\n\nHouse White, Bonizio Italian White Blend\nGLS/ 9.00 $ \nSauvignon Blanc, Sea Pearl\n\nMarlborough, New Zealand 2021\nGLS/ 10.00 $ BTL/ 36.00 $ \nSauvignon Blanc, Sager & Verdier\n\nLoire Valley, FR\nBTL/ 49.00 $ \nPinot Grigio, Antonutti\n\nFriuli, Italy\nGLS/ 13.00 $ BTL/ 48.00 $ \nChardonnay, Mer Soleil\n\nMonterrey, CA\nGLS/ 13.00 $ BTL/ 48.00 $ \nChardonnay, Ferrari Carano\n\nRussian River Valley, California\nBTL/ 66.00 $ \nChardonnay, Rombauer\n\nCarneros, CA\nBTL/ 70.00 $ \nReds\n\nHouse Red, Bonizio Italian Red Blend\nGLS/ 9.00 $ \nPinot Noir, \"Calatroni\"\n\nLombardy,IT\nGLS/ 10.00 $ BTL/ 36.00 $ \nChianti Classico , Castello di Bossi\n\nTuscany, Italy\nGLS/ 12.00 $ BTL/ 24.00 $ \nSuper Tuscan, Trambusti\n\nTuscany, Italy\nGLS/ 11.00 $ BTL/ 40.00 $ \nMontepulciano d'Abruzzo, Zaccagnini\n\nAbruzzo, Italy\nGLS/ 12.00 $ BTL/ 44.00 $ \nCorvina, Baby Amarone- Tinazzi\n\nVeneto, Italy\nGLS/ 13.00 $ BTL/ 48.00 $ \nCabernet Sauvignon, Broadbent\n\nNorth Coast, CA\nGLS/ 12.00 $ BTL/ 44.00 $ \nZinfandel, Saldo, The Prisoner Wine Co.\n\nNapa Valley, California\nBTL/ 57.00 $ \nBarolo, Damilano “Lecinquevigne”\n\nPiedmont, Italy\nBTL/ 75.00 $ \nGrenache Blend, Dept. 66, \"Others\"\n\nLanguedoc-Roussillon, France\nBTL/ 60.00 $ \nRed Blend, 8 Years In Th e Desert\n\nCalifornia\nBTL/ 85.00 $ \nBarolo, Broccardo\n\nPiemonte, Italy\nBTL/ 90.00 $ \nAmarone Della Valpolicella, \"Tinazzi\"\n\nVeneto, Italy\nBTL/ 90.00 $ \nChianti Classico, \"Arcena\"\n\nItaly\nBTL/ 54.00 $ \nSuper Tuscan, \"Fabio Motta\"\n\nBolgheri Rosso,Italy\nBTL/ 90.00 $ \nSuper Tuscan, Pietro Nova\n\nBolgheri Rosso, IT\nBTL/ 120.00 $ \nRed Blend, Papillon, Orin Swift\n\nNapa,CA\nBTL/ 140.00 $ \nFortified\n\n\"Florio\", Marsala- Vecchio & Dolce\n\nItaly\n12.00 $ \nGrahams- Reserve 6 Grape\n12.00 $ \nSandeman- Fine Tawny Porto\n8.00 $ \nCatering Menu\n\nView our catering menu below, then contact us at the restaurant to make an order!\n\nAppetizers\n\nDough Knots\n\nOur dough tied baked and dressed\n(30 piece / order) \nAntipasti\n\nMortadella, coppa, Genoa salami, artichoke, giardiniera, roast pepper, grana padano, sharp provolone and fontina\n\nEggplant Rollatini\n\nWe grill & marinate our sliced eggplant then stuff & roll with ricotta, mozzarella, pecorino & herbs. Then top with sauced, and baked\n(22 piece) \nItalian Housemade Sausage Peppers & Onions\n\nOur housemade mild sausage links, roasted, sliced then tossed with oven roasted peppers, sautéed onions together with a touch of marinara sauce fresh parsley and finished with grated pecorino\n\nGrilled Vegetables\n\nWe grill sliced, onion, eggplant, green & yellow zucchini, colored peppers and then dress with a vinaigrette, fresh mint, fresh parsley and Spanish EVOO to finish\n\nTollis Rosemary Roasted Potato\n\nTake peeled potato, quarter lengthwise, then oil, fresh rosemary, salt, pepper, garlic and roast til crisp on outside but moist inside\n\nGolden Moist Fried Jumbo Wings\n\nJumbo wings, flats & drums, floured with house seasonings, fried til crisp and moist, then dressed with sauce of choice. Dry, Italian sweet & spicy, BBQ, or our buffalo sauce\n\nCream Cheese and Crab Stuffed Mushrooms\n\nWe use leg and claw crab meat together with cream cheese, herbs and seasonings, mix together and fill caps then top with panko, butter and bake\n\nSausage And Herb Stuffing, Stuffed Mushrooms\n\nWe do a sausage and mushroom mix, sauté with garlic and shallots then add some moistened bread with chicken stock to make a dressing then put into caps and bake\n\nChicken\n\nChicken Marsala\n\nMushroom, marsala, butter with floured tenders\n\nChicken Picatta\n\nTraditional lemon caper piccata sauce with sauteed floured tenders finished with sliced lemon wheels and fresh parsley. Can add penne pasta as an add on option, finished in same lemon caper piccata sauce\n\nChicken Parmigiano\n\nOur cutlets fried then layered on sauce then topped with more sauce, mozzarella and pecorino cheese, then baked til cheese just melts. You can order it over penne that is finished in a bechamel sauce under chicken for a nice twist\n\nChicken Francese\n\nOur cutlets, floured dredged, egg-dipped, sautéed with a lemon butter and white wine sauce\n\nChicken Al Forno\n\nLeg & thigh meat baked with onions, peas, garlic, rosemary & potato. On the bone, old school Italian\n\nFish Selection\n\nScrod Oreganato\n\nFilets of scrod seasoned with salt, pepper, crushed red pepper flakes, oregano, sliced green & Kalamata olives, crushed tomato, white wine, parsley & EVOO & a cracker panko crumb. Baked to perfection\n\nBaked Stuffed Filet Of Sole\n\nWe take a good size filet of sole line it with herbs, crab meat, and a light cracker crumb filling, roll it up bake and dress with a meuniere sauce to finish\n\nSalads\n\nHouse Chop Salad\n\nRomaine, grape tomato, diced red onion, sliced cherry peppers, sliced green olives, crisp bacon crumble & house vinaigrette\n\nCaesar Salad\n\nHousemade croutons, shaved grana padano finished with our housemade dressing. You can add grilled chicken tenders seasoned with herbs, grilled, sliced, and dressed\n\nPasta\n\nBaked Penne\n\nMeatball crumbles, ricotta, mozzarella, pecorino house tomato sauce, and parsley tossed with pasta and baked crispy\n\nPenne Vodka\n\nOur house vodka cream sauce, made with onion, bacon, peas, marinara and pecorino, tossed with penne pasta & finished with fresh pecorino cheese\n\nManicotti Di Tolli\n\nLight egg noodle, housemade and rolled with ricotta, pecorino, pepper, mozzarella then topped with our marinara sauce then baked\n(12 piece minimum) \nPenne Rigate Marinara\n\nOur plain marinara sauce tossed with penne rigate to hold the sauce and finished with fresh basil and pecorino cheese. You can add housemade beef meatballs\n\nItalian Macaroni & 3 Cheese\n\nTraditional elbow pasta tossed with our three cheese bechamel sauce, then we add panko chip crumb and bake. You can add shrimp or lobster meat to make it special\n\nTollis Lasagna (Vegetable or Meat)\n\nOur egg noodle pasta sheet five layers with ricotta, mozzarella, herbs and seasonings together with either crumbled meatballs or veggies consisting of broccoli, spinach, slice tomato and roasted portobello with ricotta, mozzarella, marinara sauce and baked off\n\nDesserts\n\nBiscotti\n\nCannoli\n\nNonna Pina 11\" Whole Cheesecakes\n120.00 $ \nGourmet Fresh Baked 4.5 Ounce Jumbo Cookies\n\nTriple chocolate chip cookies, Reese's chunk cookies\n\nLunch Menu\n\nServed from 11:00 am to 3:00 pm. Dine-in or take-out\n\nAppetizer\n\nNY Fried Calamari\n14.00 $ \nGarlic Knotz\n9.00 $ \nCheesey Garlic Bread\n10.00 $ \nArancini\n9.00 $ \nTollis Dam Good Bar Wings\n9.00 $ \nBurrata Amalfi\n14.00 $ \nFresh Mozzarella Caprese\n13.00 $ \nLunch Chubby Chub Subs\n\nThe Medi\n\nBurrata, tomato, greens, olive tapenade, hot pepper marmalade & balsamic glaze\n15.00 $ \nPorchetta / Rabe\n\nPesto, broccoli rabe, porchetta, melted provolone & EVOO\n15.00 $ \nLil Italiano\n\nSalami, sopressata, hot pepper spread, greens, fresh mozzarella, vinaigrette\n15.00 $ \nRoyal Caprese\n\nProsciutto, fresh mozzarella, tomato, pesto, balsamic glaze, arugula, basil & EVOO\n15.00 $ \nMiggy\n\nMortadella, fresh mozzarella, hot pepper marmalade, pickled red onion\n15.00 $ \nCombo\n\nMortadella, salami, greens, tomato, vinaigrette & provolone\n15.00 $ \nTrio\n\nHam, mortadella & salami, greens, tomato, vinaigrette & provolone\n15.00 $ \nOur Muffaletta\n\nHot pepper marmalade, olive tapenade, ham, salami, mortadella, mayo & provolone\n15.00 $ \nChicken Parm\n\nChicken cutlet, marinara, Melted mozzarella, pecorino\n15.00 $ \nMeatball Parm\n\nMeatballs, marinara, melted mozzarella, pecorino\n15.00 $ \nBuffalo Chicken\n\nChicken cutlet, mayo, buffalo sauce, American cheese, pickled red onions, greens\n15.00 $ \nChicken Cutlet\n\nChicken cutlet, mayo, greens, tomato, American cheese\n15.00 $ \nNY Steak Bomb\n\nShaved steak, sautéed mushrooms, onions, in a garlic butter & hot cherry peppers, toasted with American cheese\n15.00 $ \nLunch Mains\n\nChicken Picatta\n22.00 $ \nChicken Milanese\n21.00 $ \nLunch Pastas\n\nLinguini Putanesca\n\nMarinara, Kalamata olives, anchovy, shallots, Fresno chili & garlic\n19.00 $ \nBucatini Nocciole Aglio & Olio\n\nToasted hazelnuts, garlic, chili flakes, EVOO, pasta water and fresh parsley\n\nFettucine Estate'\n\nEgg fettucine, lemon, parsley, anchovy, grape tomato, butter & toasted breadcrumb\n18.00 $ \nRigatoni Cacio e' Pepe\n\nPecorino cheese, parmigiano reggiano cheese, cracked black pepper & pasta water to cream sauce\n18.00 $ \nLinguini Sugo Al' Amatriciana\n\nGuanciale sautéed, wine, crushed tomato, pecorino Romano cheese tossed with linguini\n19.00 $ \nLunch Salads\n\nChop Salad\n12.00 $ \nArugula Panzanella\n14.00 $ \nClassic Caesar\n12.00 $ \nRoast Beet Salad\n14.00 $ \nSalad Dressing & Additions\n\nHouse Vinaigrette\n\nHouse Blue Cheese Dressing\n\nHouse Caesar\n\nBalsamic\n\nHouse Lemon Vinaigrette\n\nGrill Shrimp Add-On\n9.00 $ \nGrill Chicken Add on\n5.00 $ \nChicken Cutlet Add-On\n6.00 $ \nBurrata Add-On\n6.00 $ \nHandwich combos come with choice of one side\n\nLunch Handwich Combo\n\nCombo Cup of Soup\n\nCombo Side Arugula Salad\n\nCombo Side Fries\n\nCombo Bag of Chips\n\nHandwich Lil Italiano\n\nSalami, sopressata, hot pepper marmalade, greens, fresh mozzarella, vinaigrette\n12.50 $ \nHandwich Royal Caprese\n\nProsciutto, fresh mozzarella, tomato, pesto, balsamic glaze, arugula, basil & EVOO\n12.50 $ \nHandwich Miggy\n\nMortadella, fresh mozzarella, hot pepper marmalade, pickled red onion\n12.50 $ \nHandwich Combo\n\nMortadella, salami, greens, tomato, vinaigrette & provolon\n12.50 $ \nHandwich Trio\n\nHam, mortadella & salami, greens, tomato, vinaigrette & provolone\n12.50 $ \nHandwich Muffaletta\n\nHot pepper marmalade, olive tapenade, ham, salami, mortadella, mayo & provolone\n12.50 $ \nHandwich Chicken Parm\n\nChicken cutlet, marinara, melted mozzarella, pecorino\n12.50 $ \nHandwich Meatball Parm\n\nMeatballs, marinara, melted mozzarella, pecorino\n12.50 $ \nHandwich Buffalo Chicken\n\nChicken cutlet, mayo, buffalo sauce, American cheese, pickled red onions, greens\n12.50 $ \nHandwich Chicken Cutlet\n\nChicken cutlet, mayo, greens, tomato, American cheese\n12.50 $ Call (843)-212-7893 Order Online Through Us \nEmail Signup\nPlease, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google\n and\n apply. Privacy Policy Terms of Service",
      "hash": "2f97d5113ac6",
      "downloadedAt": "2026-01-19T15:38:34.586Z",
      "trimmedAt": "2026-01-19T15:42:59.693Z",
      "sizeReduction": "88.7%"
    },
    {
      "url": "http://www.tollistrattoria.com/location/tollis-trattoria/",
      "text": "[Page Title: Hours & Location | Tolli's Trattoria in Johns Island, SC]\n\nMain content starts here, tab to start navigating \nHours & Location\n1803 Crowne Commons Way Suite A-3, Johns Island, SC 29455 (843)-212-7893 info@tollistrattoria.com \n4:00 PM - 9:00 PM\nMonday: \n11:00 AM - 9:00 PM\nTuesday - Saturday: Get Directions Call (843)-212-7893 Order Online Through Us \nEmail Signup\nPlease, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google\n and\n apply. Privacy Policy Terms of Service",
      "hash": "6c1312a27dac",
      "downloadedAt": "2026-01-19T15:38:32.681Z",
      "trimmedAt": "2026-01-19T15:42:59.695Z",
      "sizeReduction": "97.5%"
    },
    {
      "url": "http://www.tollistrattoria.com/private-events/",
      "text": "[Page Title: Private Events | Tolli's Trattoria in Johns Island, SC]\n\nMain content starts here, tab to start navigating \nPrivate Events\n\nBook an Event\n\nOur space holds 20 people max. For all inquiries, please fill out the form below and we’ll be in touch soon.\nInquire Now Call (843)-212-7893 Order Online Through Us \nEmail Signup\nPlease, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google\n and\n apply. Privacy Policy Terms of Service \nContact Us About Your Private Event\nPlease, enter a valid email Email - Required Please, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid phone number Phone Number - Required Please, enter a valid company Company - Required Event Date - Required Please, enter a valid start time Start Time - Required Start Time 11:30 PM 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM 6:30 AM 6:00 AM 5:30 AM 5:00 AM 4:30 AM 4:00 AM 3:30 AM 3:00 AM 2:30 AM 2:00 AM 1:30 AM 1:00 AM 12:30 AM 12:00 AM Please, enter a valid end time End Time - Required End Time 11:30 PM 11:00 PM 10:30 PM 10:00 PM 9:30 PM 9:00 PM 8:30 PM 8:00 PM 7:30 PM 7:00 PM 6:30 PM 6:00 PM 5:30 PM 5:00 PM 4:30 PM 4:00 PM 3:30 PM 3:00 PM 2:30 PM 2:00 PM 1:30 PM 1:00 PM 12:30 PM 12:00 PM 11:30 AM 11:00 AM 10:30 AM 10:00 AM 9:30 AM 9:00 AM 8:30 AM 8:00 AM 7:30 AM 7:00 AM 6:30 AM 6:00 AM 5:30 AM 5:00 AM 4:30 AM 4:00 AM 3:30 AM 3:00 AM 2:30 AM 2:00 AM 1:30 AM 1:00 AM 12:30 AM 12:00 AM Please, enter a valid type of event Type of Event - Required Type of Event Alumni Bachelor / Bachelorette Birthday Cocktail Reception Corporate Lunch Engagement Fundraiser Graduation Holiday Meeting / Presentation Photo / Film Shoot Private Dinner Rehearsal Dinner Shower Sporting Event Wedding Other Please, enter a valid number of people Number of People - Required Additional Information - Optional Submit Please check errors in the form above Thank you for your inquiry. We’ll be in touch shortly. Close This site is protected by reCAPTCHA and the Google\n and\n apply. Privacy Policy Terms of Service",
      "hash": "7be220a84667",
      "downloadedAt": "2026-01-19T15:38:33.769Z",
      "trimmedAt": "2026-01-19T15:42:59.705Z",
      "sizeReduction": "94.7%"
    },
    {
      "url": "http://www.tollistrattoria.com/",
      "text": "[Page Title: Tolli's Trattoria | Italian Restaurant in Johns Island, SC]\n\nHome\nMain content starts here, tab to start navigating \nClassic & Modern Italian\n\nTolli's Trattoria in Johns Island\nLearn More Slide 1 of 7 Slide 2 of 7 Slide 3 of 7 Slide 4 of 7 Slide 5 of 7 Slide 6 of 7 Slide 7 of 7 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides \nJohns Island, SC\n\nWe prepare classic and modern Italian dinners, pizza, and pasta. Tolli's brings Johns Island over 80 years and four generations of our family's dedication to serving the very best.\nOur Menu \nReserve\n\nBook your Tollis Trattoria reservation below\nBook Now \nPrivate Events\n\nCelebrate your birthday, graduation, wedding, holiday, family events, or any kind of your big day with us. We’ll do our best to make it special!\n\nCatering\n\nLet us cater your next event\nFine food is very important at any event - book catering with us and make sure people talk about your event for a long time! Call (843)-212-7893 Order Online Through Us \nEmail Signup\nPlease, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google\n and\n apply. Privacy Policy Terms of Service",
      "hash": "8374b5d76ca3",
      "downloadedAt": "2026-01-19T15:38:32.629Z",
      "trimmedAt": "2026-01-19T15:42:59.709Z",
      "sizeReduction": "96.4%"
    },
    {
      "url": "http://www.tollistrattoria.com/menus/",
      "text": "[Page Title: Menus | Tolli's Trattoria in Johns Island, SC]\n\nMain content starts here, tab to start navigating Slide 1 of 4 Slide 2 of 4 Slide 3 of 4 Slide 4 of 4 hero gallery paused, press to play images slides Playing hero gallery, press to pause images slides \nMenus\nAppetizers Salads Entrees 12\" Pizzas For Take Out Pasta Subs Chubby Chub Sub Desserts Sides & Additions Drinks Catering Menu Tollis Trattoria Lunch Menu \nAppetizers\n\nN.Y. Style Fried Calamari\n\nCorn meal n flour dusted domestic calamari tube & tentacles fried with sliced hot cherry peppers. Served with lemon wedge & our marinara sauce\n15.00 $ \nGarlic Pesto Knots\n\nOur pizza dough knots baked & then tossed in housemade garlicky pesto. 6 pieces per order **There are no nuts in this dish**\n9.00 $ \nCheezy Garlic Bread\n\nOur daily fresh made in house bread slathered with garlic butter then topped with American, mozzarella, oregano & pecorino cheeses baked til nice n cheezy, then parsley\n10.00 $ \nArancini's\n\nCrisp shell Risotto fritters with peas, chili pepper and pecorino cheese served on a bed of our marinara sauce topped with more grated pecorino cheese. Two to an order\n9.00 $ \nTollis Dam Good Bar Wings\n\nOur seasoned & floured jumbo wings deep fried and dressed with one of our buffalo or sweet & spicy Italian chili sauce. Served with either our blue cheese dressing or our ranch dressing\n9.00 $ \nClams Posillipo\n\nLocal Clams, Garlic, Nduja, Anchovies, white wine, Grape tomato, splash of marinara, lemon zest & Grilled crostini\n13.00 $ \nBurrata Amalfi\n\nA center cracked Burrata Ball with sliced Mortadella, pistachios, EVOO, parsley pesto and our sliced ciabatta bread\n16.00 $ \nFocaccia of the Day\n\nHouse made thick airy Focaccia, dressed differently Daily, square cut & sliced. served warm\n8.00 $ \nSoup of the Day\n10.00 $ \nSalads\n\nArugula Panzanella Salad\n\nCaramelized onion pizzette with burrata cheese, EVOO, cracked pepper & balsamic drizzle\n16.00 $ \nTre Colori Caprese\n\nArugula, fresh mozzarella ovaline, sliced on top of vine ripe tomato, some sweet grape tomato with olive oil, parsley pesto, salt and pepper, balsamic glaze drizzle & fresh basil\n14.00 $ \nClassic Caesar Salad\n\nCrisp romaine tossed with our housemade Caesar dressing and house made croutons, finished with shaved grana padana cheese\n12.00 $ \nTolli's Chopped Salad\n\nCrisp romaine, green olives, sliced hot cherry peppers, diced red onion, crisp bacon, & housemade blue cheese dressing. Red wine vinaigrette is available upon request\n12.00 $ \nRed Beet Salad\n\nRoasted Beets, Arugula, Whipped Ricotta Cheese base, Crushed Pistachio sprinkled on top & House made Lemon Vinaigrette.\n14.00 $ \nEntrees\n\nMain course items\n\nChicken Milanese\n\nOur cooked to order cutlet from tenders, topped with grape tomato and arugula salad with lemon parm dressing and house pickled red onions\n21.00 $ \nChicken Parmigiana\n\nOur fried cutlet topped with marinara sauce & melted mozzarella served over rigatoni or linguini pasta\n28.00 $ \nBaked Meatballs\n\nFour of our homemade beef meatballs served in marinara sauce topped with melted mozzarella cheese, fresh arugula & pickled red onions\n18.00 $ \nChicken Piccata\n\nSauteed thin, floured cutlets finished in lemon butter sauce with Garlic Aioli dressed smashed fried potato\n26.00 $ \nSalmon Lemon Thyme\n\nSkinless salmon filet, pan seared & finished in a lemon, thyme wine sauce served with salt & pepper Broccoli\n27.00 $ \nCountry Fried Pork\n\nPork tenderloin cutlets, buttermilk marinade, floured, fried and dressed with cracked black pepper gravy served with salt & pepper Broccoli\n26.00 $ \nN.Y. Strip Steak Frites\n\nstrip steak pan seared finished with a chimichurri sauce, pecorino parsley fries and a horseradish cream dipping sauce\n39.00 $ \n12\" Pizzas For Take Out\n\n12\" Pizzas Your Way\n\nBase\n\nRed or white. Add mozzarella\n\nA La Carte Toppings (Limit 5)\n\nBacon | Pepperoni | Meatball | Sausage | Fresh Mozzarella | Fresh Tomato | Bell Pepper | Fresh Garlic | Onion | Mushroom | Arugula | Black Olive\n\n12\" Red Mozzarella Build Your Own Apizza\n\nClassic red base with tomato sauce, oregano, mozzarella. Now comes with mozzarella\n11.00 $ \n12\" White Mozzarella Build Your Own Apizza\n\nClassic white base with EVOO, oregano, mozzarella. Now comes with mozzarella\n11.00 $ \nCalzone\n\nOur dough is filled with a three cheese blend of ricotta, mozzarella & grated pecorino romano cheese, black pepper, and parsley mixture then topped with your choice of filling. The dough is folded over itself, sealed, and baked till golden. Served with a side of marinara sauce\n15.75 $ \n12\" New Calabrese\n\nOur Calabrese but made better. Red base, fresh mozzarella, pickled Fresno, soppressata, chili flakes, honey, pecorino & when done we add a little arugula and pickled red onion. Small change. Huge taste difference for the better!\n23.25 $ \n12\" Morty Mortadella\n\nWhite base with fresh mozzarella baked blind. Then we add fresh sliced mortadella fresh ricotta, parsley pesto, roasted pistachio & EVOO. An amazing pizza\n23.00 $ \n12\" Thea\n\nWhite a pizza with mozzarella, chopped broccoli rabe, fresh garlic, pinch of chili flakes, EVOO, pecorino and our loose Italian sausage\n19.75 $ \n12\" Americano\n\nWhite a pizza, mozzarella, fresh sliced tomato, fresh garlic, pecorino, fresh basil & parley pesto drizzle\n16.75 $ \n12\" BBQ Chicken\n\nWhite a pizza, mozzarella, chopped fried chicken, red onion, pecorino, BBQ sauce & bacon\n19.25 $ \n12\" Buffalo Chicken\n\nWhite pie with our blended Frank’s red hot special sauce, fried chicken, mozzarella cheese & pecorino\n16.00 $ \n12\" Estiva\n\nWhite a pizza with mozzarella, baked blind then dressed with arugula, chopped tomato, shaved Parmigiano cheese, drizzled with our lemon parm dressing and finished with sliced prosciutto di parma\n16.75 $ \n12\" Margharita\n\nPlain tomato sauce, our fresh mozzarella, fresh basil, pecorino & E.V.O.O. this is the a pizza made to honor queen Margherita of Italy. Hence the name... also the pizza was to symbolize the Italian flag colors\n16.75 $ \n12\" Marios\n\nThis white a pizza is unique. White base with crumbled goat cheese, caramelized onions, ground pistacchio nuts, honey, olive oil and finished with truffle oil when it comes out of oven. You can also add fresh fruit as an option\n17.50 $ \n12\" Nonno\n\nOur red sauce base, mozzarella, oregano, fresh garlic, loose Italian sausage, pecorino and fresh sliced mushrooms\n16.25 $ \n12\" Shrimp Arugentine\n\nWhite pizza with mozzarella, shrimp, garlic baked then dressed with fresh arugula, chopped tomato, lemon Parmigiani dressing, pecorino and shaved grana Padana cheese\n24.00 $ \n12\" Shrimp Scampi\n\nA white pizza with oregano, mozzarella, fresh shrimp, fresh garlic, lemon parm dressing, sliced grape tomato, fresh parsley, pecorino, EVOO and baked until crisp and golden\n22.75 $ \n12\" Tonino's\n\nWhite base, mozzarella, ham, mushrooms, caramelized onions, hot cherry peppers, pecorino, & EVOO\n21.50 $ \n12\" Shrimp Pesto\n\nWhite base, mozzarella, garlic, shrimp, pesto, pecorino, oregano & EVOO\n20.25 $ \n12\" Porchetta & Rabe\n\nWhite base, mozzarella, porchetta, broccoli rabe, garlic, pesto & EVOO\n21.25 $ \n12\" Scampi Casino\n\nWhite, mozzarella, shrimp, garlic, lemon parm dressing, sliced grape tomato, roasted peppers, fresh parsley, pecorino & bacon\n25.75 $ \n12\" Nutty Cannoli\n\nWhite pizza shell baked blind, then topped with Nutella spread, crumbled cannoli shells, cannoli cream and chocolate chips\n19.25 $ \n12\" N.Y. Steakbomb\n\nwhite pizza, American, Mozzarella, mushrooms, onions, garlic, shaved steak & hot cherry peppers\n19.75 $ \n12\" chicken Supreme\n\nWhite pizza, mozzarella, chopped chicken cutlet, spinach, red onions, garlic, bacon & Bread Crumb\n20.00 $ \n12\" Eggplant Deluxe\n\nRed pizza, mozzarella, spinach, eggplant, ricotta, garlic, pecorino & EVOO\n18.50 $ \n12\" Broccoli & Sausage\n\nWhite pizza, mozzarella, broccoli, housemade sausage, garlic, ricotta & pecorino\n19.50 $ \nPasta\n\nLinguini Puttanesca\n\nTomato base with Kalamata and green olives, anchovy, garlic, capers, Fresno, shallots tossed with linguini pasta and finished with fresh parsley. An old-school Italian staple\n25.00 $ \nLinguini Shrimp Provencal\n\nGrape tomato sauteed with shallots, garlic, EVOO, white wine, pepper flakes, with shrimp & shrimp stock, tossed with linguini pasta\n28.00 $ \nShrimp Fra Diavolo\n\nSauteed Shrimp In Our Marinara With Added Chili Flakes to spice it up Fra Diavolo Style.\n27.00 $ \nPasta Marinara & Meatball\n\nEither Penne or Linguini tossed with our Marinara Sauce, Topped with two of our all Beef Meatballs finished with Pecorino & EVOO.\n22.00 $ \nPenne Alla Vodka\n\nBacon, shallots, sweet peas, & Fresno chilis sautéed & tossed with Penne Rigate pasta in a vodka cream sauce & finished with grated pecorino\n24.00 $ \nPesto Cream Gnocchi\n\nOur housemade ricotta gnocchi tossed with traditional basil pesto & a touch of cream. Finished with pecorino Romano cheese & olive oil drizzle. **There are nuts in this dish**\n27.00 $ \nLinguine Alle Vongole Bianco\n\nLinguine and fresh pasta neck local clams in their shells, sautéed with garlic, shallot, & fresno peppers. Finished with fresh parsley\n28.00 $ \nPasta Marinara\n\nEither Penne Rigate or linguini tossed with our marinara sauce finished with pecorino & EVOO\n14.00 $ \nGnocchi Sorrentino\n\nHousemade ricotta gnocchi, tossed with our marinara sauce and finished with fresh mozzarella, fresh basil and pecorino cheese\n26.00 $ \nFettucine Alfredo\n\nEgg noodle fettuccine pasta tossed with an alfredo sauce of cream, butter, nutmeg and pecorino cheese dusted with fresh cracked black pepper\n20.00 $ \nPasta Rose'\n\nEither penne or linguine pasta with our house marinara and a touch of cream tossed with fresh basil & pecorino\n20.00 $ \nPappardelle alla Bolognese\n\nTraditional beef Bolognese served with house made pappardelle tossed with pecorino Romano grated cheese and finished with Spanish EVOO\n27.00 $ \nCavatelli Rabe\n\nHouse made Ricotta Cavatelli with sauteed rabe, house made sausage, pecorino, chili flakes, butter, vegetable stock & EVOO.\n28.00 $ \nSubs\n\nMeatball Parm\n\nNonna's famous meatballs with our pomodoro sauce baked on our housemade bread with melted mozzarella & grated cheese\n15.00 $ \nChicken Parm\n\nChicken cutlets, hand-pounded & fried to order then dressed with our pomodoro sauce and mozzarella and pecorino cheeses. Served on our toasted italian bread\n15.00 $ \nItalian combo Chubby Chub Sub\n\nMortadella, Genoa salami, provolone cheese, baby gem lettuce, oil & vinegar, oregano & sliced tomato\n15.00 $ \nPepperoni Parm\n\nOur fresh baked bread is layered with pepperoni, mozzarella cheese, and our famous pomodoro sauce. Toasty and melty and delicious!\n15.00 $ \nCaprese Chubby Chub Sub\n\nFresh mozzarella, tomato, fresh basil, arugula, parsley pesto, balsamic glaze, EVOO on our housemade bread\n15.00 $ \nChicken Cutlet Chubby Chub Sub\n\nOur crunchy & juicy chicken tender cutlets are fried, sliced, and placed on our housemade bread with mayo, romaine, tomato, salt n pepper & white American cheese. A cold sub\n15.00 $ \nBuffalo Chicken Cutlet Chubby Chub Sub\n\nCrispy juicy fried tenders sliced and dressed with our buffalo sauce, Romaine, blue cheese dressing & pickled red onions\n15.00 $ \nN.Y. Steak Bomb Chubby Chub Sub\n\nShaved steak, sautéed in garlic butter, mushrooms, onions then put in our bread with sliced hot cherry peppers and toasted with white American cheese The Bomb!! (*Served until 3pm only!)\n15.00 $ \nMuffuletta Chubby Chub Sub\n\nBread with EVOO, parsley pesto, ham, soppressata, provolone cheese, mozzarella cheese, olive tapenade and mortadella\n15.00 $ \nPorchetta & Rabe Chubby Chub Sub\n\nOur bread with sliced pork belly porchetta, parsley pesto, sautéed rabe and provolone. Toasted\n15.00 $ \nMorty Chubby Chub Sub\n\nEVOO, Olive Tapenade, Mortadella, Fresh Mozzarella, Pickled Red Onions\n15.00 $ \nItalian Trio Chubby Chub Sub\n\nVinaigrette, Olive Tapenade, Greens, Cotto Ham, Mortadella, Soppressata, Vine Ripe Tomato, Oregano & Provolone\n15.00 $ \nRoyal Caprese Chubby Chub Sub\n\nParsley Pesto, EVOO, Arugula, Prosciutto, Fresh Mozzarella, Vine Ripe Tomato, Fresh Basil & Balsamic Glaze.\n19.00 $ \nLil Taliano\n\nOlive Tapenade, Vinaigrette, Cotto Ham, Soppressata, Greens, Fresh Mozzarella.\n15.00 $ \nThe Medi\n\nBurrata, Vine Ripe Tomato, Greens, Olive Tapenade, EVOO, Balsamic Glaze.\n15.00 $ \nDesserts\n\nChanges often, check with order taker or waitstaff\n\nCheesecake Of The Day, Call To Find Out What Flavor\n12.00 $ \nPeanutbutter & Reeses Chunk Cookies\n3.95 $ \nAssorted Gelati Flavors & Sorbetto\n4.00 $ \nTRIPLE CHIP CHOCOLATE CHIP COOKIES\n3.95 $ \nTWO Small Cannoli\n6.00 $ \nNonna Pina Makes an Assortment of Different Desserts, Changes Daily\n\nFrom Carrot Cakes, Chocolate Cakes, Ricotta Cakes, French Apple Cakes, etc\n\n11' Whole Cheese Cake (Three Day Advance Notice To Order)\n120.00 $ \n9\" Whole Three Layer Cake (3 Day Advance Notice To Order)\n85.00 $ \nGELATI\n\nEspresso Gelato\n1 scoop/ 4.00 $ \nPistachio Gelato\n1 scoop/ 4.00 $ \nMixed Berry Sorbet\n1 scoop/ 4.00 $ \nSea Salt Caramel Gelato\n1 scoop/ 4.00 $ \nChocolate Gelato\n1 scoop/ 4.00 $ \nHazelnut Gelato\n1 scoop/ 4.00 $ \nSides & Additions\n\nSide Bread Butter & EVOO\n\nOur housemade ciabatta bread sliced & served with butter & EVOO\n5.00 $ \n7 Grilled Shrimp\n\nFresh local shrimp seasoned with salt & black pepper lightly grilled and added to your salad of choice\n9.00 $ \nSingle Meatball\n\nHousemade all beef meatball with marinara sauce & grated pecorino cheese\n4.00 $ \nSide Chicken Cutlet\n\nOur jumbo tender cutlet fried to order for pasta or salad of your choice\n6.00 $ \nSingle Burrata Ball\n\nFresh mozzarella ball with stracciatella cheese center\n6.00 $ \nSide EVOO\n\nImported first cold pressed extra virgin olive oil\n1.00 $ \nSide Blue Cheese Dressing\n\nOur housemade Danish blue cheese dressing, 2.5 oz\n1.75 $ \nSide Grated Cheese\n\nD.O.P. Pecorino Romano genuine, sheep's milk cheese, cut fresh, dried and grated in house\n1.00 $ \nSide of Crushed Red Pepper Flakes\n\nDried crushed chili pepper flakes\n0.25 $ \nSide Marinara Sauce\n\nOur fresh housemade marinara, 2.5 oz\n1.00 $ \nCouple of Meatballs\n\nTwo of our all beef housemade meatball with marinara sauce & pecorino cheese\n8.00 $ \nSide Grilled Chicken\n\nJumbo tender lightly seasoned with salt & pepper olive oil and grilled, to add to a salad or pasta\n5.00 $ \nSide Of Fries\n\nOur lunch fries with salt & side of ketchup\n5.00 $ \nSingle Ovaline Fresh Mozzarella\n\nFresh ovaline mozzarella cheese ball, added to your item\n4.00 $ \nSide of Extra Vinaigrette Dressing\n1.00 $ \nSide of Extra Lemon Parm Dressing\n1.00 $ \nSide Extra Ranch Dressing\n1.00 $ \nItalian Sautéed Greens\n\nChef's choice of available greens sautéed with fresh garlic, chili pepper flakes, anchovies and spices & finished with extra virgin olive oil\n9.00 $ \nSide Bread, EVOO & Butter\n\nOur housemade bread sliced and served with butter & EVOO, that's it\n5.00 $ \nDrinks\n\nCocktails & wines\n\nCocktails\n\nAmber Negroni\n\nGin, Braulio Amaro, Cocchi Americano, lemon, rosemary\n13.00 $ \nBlack Manhattan\n\nKnob Creek Rye, Averna Amaro, walnut bitters, orange zest\n13.00 $ \nAperol Spritz\n\nAperol, Prosecco, seltzer & an orange slice on ice\n11.00 $ \nOld Fashioned\n\nBourbon, bitters, sugar, orange zest & maraschino cherry over large cube\n14.00 $ \nTolli Bellini\n\nAlberto Nani Prosecco & white peach puree, fresh basil in a flute\n13.00 $ \nSgroppino Al Limone\n\nLemon sorbetto, prosecco float, Wheatly Vodka, slice of lemon and mint martini glass\n13.00 $ \nRose' Pina\n\nHomemade Orangecello, Carolina Reaper Vodka, Pasubio Amaro, Pineapple & Rose' Prosecco\n14.00 $ \nBig Ant's Manhattan\n\nMAKERS MARK BOURON, NONINO AMARO, SWEET VERMOUTH, ANGOSTURA BITTERS & CHERRY\n16.00 $ \nThe Ringmaster\n\nBlanco Tequila, Grand Marnier, Lime, Pineapple & Coconut Cream with Nutmeg.\n13.00 $ \nThe Efficiency Expert\n\nWhite Rum, Homemade Limoncello, Lime, Angostura Bitters, Simple Syrup, Fresh Mint & Club Soda.\n13.00 $ \nThe Odd Man\n\nBulleit Bourbon, Grapefruit, Campari, Lemon & Simple Syrup.\n14.00 $ \nThe Zinger\n\nHendrick's Gin, Cocchi Americano, Lemon, Simple Syrup, Cardamon Lemongrass Bitters, Orange Bitters & Prosecco.\n15.00 $ \nThe Throwback\n\nJameson, Sweet Vermouth & Fontbonne Herbal Liqueur with Orange Essence.\n11.00 $ \nThe Sass\n\nBourbon, Demerara Simple Syrup & Lemon with Lambrusco Wine Float.\n11.00 $ \nThe Aficionado\n\nCasamigos Anejo Tequila, Agave Syrup, Angostura & Orange Bitters with Cherry.\n17.00 $ \nThe Stark & Dormy\n\nWhite Rum, Goslings Rum, Bergamot Black Tea, Allspice Bitters, Lime & Ginger Beer.\n11.00 $ \nThe Ingenue\n\nBlanco Tequila, Fontbonne Herbal Liqueur, Passionfruit Puree & Lime.\n11.00 $ \nThe Go- Getter\n\nMuddled Fresh Strawberries & Basil, Gin Mare', Lillet Blanc & Lemon Served Up, Topped with Prosecco & Fresh Basil.\n14.00 $ \nThe Nightcap\n\nGrappa, Strega, Orange & Lemon.\n15.00 $ \nThe Cherry on Top\n\nVodka, Borghetti, Nonino Amaro, Sherry, Simple Syrup & Cherry.\n12.00 $ \nFiora D' Amalfi\n\nWhite Rum, Limoncello, Elderflower Liqueur & Lemon.\n14.00 $ \nEspresso Martini\n\nVodka, Borghetti, Espresso.\n12.00 $ \nMocha Martini\n\nVan Gogh Double Espresso Vodka, Licor 43 Chocolate Liqueur, Espresso.\n13.00 $ \nBrown Sugar Walnut old Fashioned\n\nTempleton Rye, Demerara Simple Syrup, Black Walnut Bitters.\n13.00 $ \nWines\n\nSparkling & Rose\n\nProsecco, Nino Arvedi\n\nVeneto, Italy NV\nGls/ 9.00 $ BTL/ 32.00 $ \nRosé, Prosecco, \"Ca Di Rajo\" Brut\n\nVeneto, Italy NV\nGLS/ 13.00 $ BTL/ 48.00 $ \nMoscato Sicilia, Cantine Pellegrino\n\nSicily, IT\nGLS/ 9.00 $ BTL/ 32.00 $ \nLambrusco, \"LINI 910\"\n\nEmilia Romagna, Italy NV\nGLS/ 10.00 $ BTL/ 36.00 $ \nChampagne, Laurent Perrier Brut Rose'\n\nFrance\n144.00 $ \nWhites\n\nHouse White, Bonizio Italian White Blend\nGLS/ 9.00 $ \nSauvignon Blanc, Sea Pearl\n\nMarlborough, New Zealand 2021\nGLS/ 10.00 $ BTL/ 36.00 $ \nSauvignon Blanc, Sager & Verdier\n\nLoire Valley, FR\nBTL/ 49.00 $ \nPinot Grigio, Antonutti\n\nFriuli, Italy\nGLS/ 13.00 $ BTL/ 48.00 $ \nChardonnay, Mer Soleil\n\nMonterrey, CA\nGLS/ 13.00 $ BTL/ 48.00 $ \nChardonnay, Ferrari Carano\n\nRussian River Valley, California\nBTL/ 66.00 $ \nChardonnay, Rombauer\n\nCarneros, CA\nBTL/ 70.00 $ \nReds\n\nHouse Red, Bonizio Italian Red Blend\nGLS/ 9.00 $ \nPinot Noir, \"Calatroni\"\n\nLombardy,IT\nGLS/ 10.00 $ BTL/ 36.00 $ \nChianti Classico , Castello di Bossi\n\nTuscany, Italy\nGLS/ 12.00 $ BTL/ 24.00 $ \nSuper Tuscan, Trambusti\n\nTuscany, Italy\nGLS/ 11.00 $ BTL/ 40.00 $ \nMontepulciano d'Abruzzo, Zaccagnini\n\nAbruzzo, Italy\nGLS/ 12.00 $ BTL/ 44.00 $ \nCorvina, Baby Amarone- Tinazzi\n\nVeneto, Italy\nGLS/ 13.00 $ BTL/ 48.00 $ \nCabernet Sauvignon, Broadbent\n\nNorth Coast, CA\nGLS/ 12.00 $ BTL/ 44.00 $ \nZinfandel, Saldo, The Prisoner Wine Co.\n\nNapa Valley, California\nBTL/ 57.00 $ \nBarolo, Damilano “Lecinquevigne”\n\nPiedmont, Italy\nBTL/ 75.00 $ \nGrenache Blend, Dept. 66, \"Others\"\n\nLanguedoc-Roussillon, France\nBTL/ 60.00 $ \nRed Blend, 8 Years In Th e Desert\n\nCalifornia\nBTL/ 85.00 $ \nBarolo, Broccardo\n\nPiemonte, Italy\nBTL/ 90.00 $ \nAmarone Della Valpolicella, \"Tinazzi\"\n\nVeneto, Italy\nBTL/ 90.00 $ \nChianti Classico, \"Arcena\"\n\nItaly\nBTL/ 54.00 $ \nSuper Tuscan, \"Fabio Motta\"\n\nBolgheri Rosso,Italy\nBTL/ 90.00 $ \nSuper Tuscan, Pietro Nova\n\nBolgheri Rosso, IT\nBTL/ 120.00 $ \nRed Blend, Papillon, Orin Swift\n\nNapa,CA\nBTL/ 140.00 $ \nFortified\n\n\"Florio\", Marsala- Vecchio & Dolce\n\nItaly\n12.00 $ \nGrahams- Reserve 6 Grape\n12.00 $ \nSandeman- Fine Tawny Porto\n8.00 $ \nCatering Menu\n\nView our catering menu below, then contact us at the restaurant to make an order!\n\nAppetizers\n\nDough Knots\n\nOur dough tied baked and dressed\n(30 piece / order) \nAntipasti\n\nMortadella, coppa, Genoa salami, artichoke, giardiniera, roast pepper, grana padano, sharp provolone and fontina\n\nEggplant Rollatini\n\nWe grill & marinate our sliced eggplant then stuff & roll with ricotta, mozzarella, pecorino & herbs. Then top with sauced, and baked\n(22 piece) \nItalian Housemade Sausage Peppers & Onions\n\nOur housemade mild sausage links, roasted, sliced then tossed with oven roasted peppers, sautéed onions together with a touch of marinara sauce fresh parsley and finished with grated pecorino\n\nGrilled Vegetables\n\nWe grill sliced, onion, eggplant, green & yellow zucchini, colored peppers and then dress with a vinaigrette, fresh mint, fresh parsley and Spanish EVOO to finish\n\nTollis Rosemary Roasted Potato\n\nTake peeled potato, quarter lengthwise, then oil, fresh rosemary, salt, pepper, garlic and roast til crisp on outside but moist inside\n\nGolden Moist Fried Jumbo Wings\n\nJumbo wings, flats & drums, floured with house seasonings, fried til crisp and moist, then dressed with sauce of choice. Dry, Italian sweet & spicy, BBQ, or our buffalo sauce\n\nCream Cheese and Crab Stuffed Mushrooms\n\nWe use leg and claw crab meat together with cream cheese, herbs and seasonings, mix together and fill caps then top with panko, butter and bake\n\nSausage And Herb Stuffing, Stuffed Mushrooms\n\nWe do a sausage and mushroom mix, sauté with garlic and shallots then add some moistened bread with chicken stock to make a dressing then put into caps and bake\n\nChicken\n\nChicken Marsala\n\nMushroom, marsala, butter with floured tenders\n\nChicken Picatta\n\nTraditional lemon caper piccata sauce with sauteed floured tenders finished with sliced lemon wheels and fresh parsley. Can add penne pasta as an add on option, finished in same lemon caper piccata sauce\n\nChicken Parmigiano\n\nOur cutlets fried then layered on sauce then topped with more sauce, mozzarella and pecorino cheese, then baked til cheese just melts. You can order it over penne that is finished in a bechamel sauce under chicken for a nice twist\n\nChicken Francese\n\nOur cutlets, floured dredged, egg-dipped, sautéed with a lemon butter and white wine sauce\n\nChicken Al Forno\n\nLeg & thigh meat baked with onions, peas, garlic, rosemary & potato. On the bone, old school Italian\n\nFish Selection\n\nScrod Oreganato\n\nFilets of scrod seasoned with salt, pepper, crushed red pepper flakes, oregano, sliced green & Kalamata olives, crushed tomato, white wine, parsley & EVOO & a cracker panko crumb. Baked to perfection\n\nBaked Stuffed Filet Of Sole\n\nWe take a good size filet of sole line it with herbs, crab meat, and a light cracker crumb filling, roll it up bake and dress with a meuniere sauce to finish\n\nSalads\n\nHouse Chop Salad\n\nRomaine, grape tomato, diced red onion, sliced cherry peppers, sliced green olives, crisp bacon crumble & house vinaigrette\n\nCaesar Salad\n\nHousemade croutons, shaved grana padano finished with our housemade dressing. You can add grilled chicken tenders seasoned with herbs, grilled, sliced, and dressed\n\nPasta\n\nBaked Penne\n\nMeatball crumbles, ricotta, mozzarella, pecorino house tomato sauce, and parsley tossed with pasta and baked crispy\n\nPenne Vodka\n\nOur house vodka cream sauce, made with onion, bacon, peas, marinara and pecorino, tossed with penne pasta & finished with fresh pecorino cheese\n\nManicotti Di Tolli\n\nLight egg noodle, housemade and rolled with ricotta, pecorino, pepper, mozzarella then topped with our marinara sauce then baked\n(12 piece minimum) \nPenne Rigate Marinara\n\nOur plain marinara sauce tossed with penne rigate to hold the sauce and finished with fresh basil and pecorino cheese. You can add housemade beef meatballs\n\nItalian Macaroni & 3 Cheese\n\nTraditional elbow pasta tossed with our three cheese bechamel sauce, then we add panko chip crumb and bake. You can add shrimp or lobster meat to make it special\n\nTollis Lasagna (Vegetable or Meat)\n\nOur egg noodle pasta sheet five layers with ricotta, mozzarella, herbs and seasonings together with either crumbled meatballs or veggies consisting of broccoli, spinach, slice tomato and roasted portobello with ricotta, mozzarella, marinara sauce and baked off\n\nDesserts\n\nBiscotti\n\nCannoli\n\nNonna Pina 11\" Whole Cheesecakes\n120.00 $ \nGourmet Fresh Baked 4.5 Ounce Jumbo Cookies\n\nTriple chocolate chip cookies, Reese's chunk cookies\n\nLunch Menu\n\nServed from 11:00 am to 3:00 pm. Dine-in or take-out\n\nAppetizer\n\nNY Fried Calamari\n14.00 $ \nGarlic Knotz\n9.00 $ \nCheesey Garlic Bread\n10.00 $ \nArancini\n9.00 $ \nTollis Dam Good Bar Wings\n9.00 $ \nBurrata Amalfi\n14.00 $ \nFresh Mozzarella Caprese\n13.00 $ \nLunch Chubby Chub Subs\n\nThe Medi\n\nBurrata, tomato, greens, olive tapenade, hot pepper marmalade & balsamic glaze\n15.00 $ \nPorchetta / Rabe\n\nPesto, broccoli rabe, porchetta, melted provolone & EVOO\n15.00 $ \nLil Italiano\n\nSalami, sopressata, hot pepper spread, greens, fresh mozzarella, vinaigrette\n15.00 $ \nRoyal Caprese\n\nProsciutto, fresh mozzarella, tomato, pesto, balsamic glaze, arugula, basil & EVOO\n15.00 $ \nMiggy\n\nMortadella, fresh mozzarella, hot pepper marmalade, pickled red onion\n15.00 $ \nCombo\n\nMortadella, salami, greens, tomato, vinaigrette & provolone\n15.00 $ \nTrio\n\nHam, mortadella & salami, greens, tomato, vinaigrette & provolone\n15.00 $ \nOur Muffaletta\n\nHot pepper marmalade, olive tapenade, ham, salami, mortadella, mayo & provolone\n15.00 $ \nChicken Parm\n\nChicken cutlet, marinara, Melted mozzarella, pecorino\n15.00 $ \nMeatball Parm\n\nMeatballs, marinara, melted mozzarella, pecorino\n15.00 $ \nBuffalo Chicken\n\nChicken cutlet, mayo, buffalo sauce, American cheese, pickled red onions, greens\n15.00 $ \nChicken Cutlet\n\nChicken cutlet, mayo, greens, tomato, American cheese\n15.00 $ \nNY Steak Bomb\n\nShaved steak, sautéed mushrooms, onions, in a garlic butter & hot cherry peppers, toasted with American cheese\n15.00 $ \nLunch Mains\n\nChicken Picatta\n22.00 $ \nChicken Milanese\n21.00 $ \nLunch Pastas\n\nLinguini Putanesca\n\nMarinara, Kalamata olives, anchovy, shallots, Fresno chili & garlic\n19.00 $ \nBucatini Nocciole Aglio & Olio\n\nToasted hazelnuts, garlic, chili flakes, EVOO, pasta water and fresh parsley\n\nFettucine Estate'\n\nEgg fettucine, lemon, parsley, anchovy, grape tomato, butter & toasted breadcrumb\n18.00 $ \nRigatoni Cacio e' Pepe\n\nPecorino cheese, parmigiano reggiano cheese, cracked black pepper & pasta water to cream sauce\n18.00 $ \nLinguini Sugo Al' Amatriciana\n\nGuanciale sautéed, wine, crushed tomato, pecorino Romano cheese tossed with linguini\n19.00 $ \nLunch Salads\n\nChop Salad\n12.00 $ \nArugula Panzanella\n14.00 $ \nClassic Caesar\n12.00 $ \nRoast Beet Salad\n14.00 $ \nSalad Dressing & Additions\n\nHouse Vinaigrette\n\nHouse Blue Cheese Dressing\n\nHouse Caesar\n\nBalsamic\n\nHouse Lemon Vinaigrette\n\nGrill Shrimp Add-On\n9.00 $ \nGrill Chicken Add on\n5.00 $ \nChicken Cutlet Add-On\n6.00 $ \nBurrata Add-On\n6.00 $ \nHandwich combos come with choice of one side\n\nLunch Handwich Combo\n\nCombo Cup of Soup\n\nCombo Side Arugula Salad\n\nCombo Side Fries\n\nCombo Bag of Chips\n\nHandwich Lil Italiano\n\nSalami, sopressata, hot pepper marmalade, greens, fresh mozzarella, vinaigrette\n12.50 $ \nHandwich Royal Caprese\n\nProsciutto, fresh mozzarella, tomato, pesto, balsamic glaze, arugula, basil & EVOO\n12.50 $ \nHandwich Miggy\n\nMortadella, fresh mozzarella, hot pepper marmalade, pickled red onion\n12.50 $ \nHandwich Combo\n\nMortadella, salami, greens, tomato, vinaigrette & provolon\n12.50 $ \nHandwich Trio\n\nHam, mortadella & salami, greens, tomato, vinaigrette & provolone\n12.50 $ \nHandwich Muffaletta\n\nHot pepper marmalade, olive tapenade, ham, salami, mortadella, mayo & provolone\n12.50 $ \nHandwich Chicken Parm\n\nChicken cutlet, marinara, melted mozzarella, pecorino\n12.50 $ \nHandwich Meatball Parm\n\nMeatballs, marinara, melted mozzarella, pecorino\n12.50 $ \nHandwich Buffalo Chicken\n\nChicken cutlet, mayo, buffalo sauce, American cheese, pickled red onions, greens\n12.50 $ \nHandwich Chicken Cutlet\n\nChicken cutlet, mayo, greens, tomato, American cheese\n12.50 $ Call (843)-212-7893 Order Online Through Us \nEmail Signup\nPlease, enter a valid first name First Name - Required Please, enter a valid last name Last Name - Required Please, enter a valid email Email - Required Submit Please check errors in the form above Thank you for signing up for email updates! Close This site is protected by reCAPTCHA and the Google\n and\n apply. Privacy Policy Terms of Service",
      "hash": "a4fb56bef724",
      "downloadedAt": "2026-01-19T15:38:33.227Z",
      "trimmedAt": "2026-01-19T15:42:59.818Z",
      "sizeReduction": "88.7%"
    }
  ],
  "sizeReduction": "90.1%"
}